{"name": "Alex.Mooney", "picture": "M001195.jpg", "detail": {"Early life, education, and early career": "Mooney's mother, Lala, was a Cuban refugee who escaped from political imprisonment at the age of 21, shortly after the Bay of Pigs Invasion. From a family of Irish immigrants, his father Vincent grew up in Long Island, New York. Mooney was born in 1971 in Washington D.C. and raised in Frederick, Maryland. He graduated from Frederick High School, where he was elected as president of the student government.In 1993, Mooney received his B.A. in philosophy from Dartmouth College. While attending Dartmouth, he ran for the New Hampshire House of Representatives in Grafton County's 10th District. He finished in last place with 8% of the vote. In 2007, Mooney was elected to the Executive Committee of the Dartmouth College Association of Alumni. In early 2008, Mooney traveled to New Hampshire to testify in support of a state bill that would require legislative approval for amendments that the private Board of Trustees of Dartmouth College wished to make to its charter.After college, Mooney served as staff assistant to U.S. Representative Roscoe G. Bartlett. In 1995 he became a legislative analyst for the Republican Conference of the U.S. House of Representatives.", "Maryland Senate": "Mooney represented Maryland's District 3rd, which covers parts of Washington and Frederick Counties, in the Maryland Senate, from January 1999 to January 2011. While in office, he served as the executive director of the National Journalism Center from 2005 to 2012.Elections In 1998, Mooney defeated incumbent Republican John W. Derr in the primary election and Democrat Ronald S. Bird in the general election. In 2002, Mooney was re-elected, defeating Democrat Sue Hecht, with 55% of the vote. In 2006, he won re-election with 52% of the vote against Candy Greenway. In 2010, Democrat Ronald N. Young, Mayor of Frederick, defeated him 51%–49%.Committee assignments In the Maryland State Senate, Mooney was a member of the Judicial Proceedings Committee, the Joint Committee on Investigation, and formerly a member of the Joint Committee on Federal Relations, and the Education, Health and Environmental Affairs Committee. He served on the Maryland Rural Caucus, the Taxpayers Protection Caucus, and the Maryland Veterans Caucus.", "Post-Senate career": "Chairman of the Maryland GOP On December 11, 2010, Mooney was elected as Chairman of the Maryland Republican Party. He was Chairman until early 2013.2012 congressional election The redistricting done by the Maryland legislature, based on the 2010 census, significantly redrew the boundaries of incumbent Roscoe G. Bartlett's 6th District. Heavily Republican Carroll County, as well as more Republican portions of Baltimore, Frederick and Harford counties, were shifted out of the district, replaced by a heavily Democratic spur of Montgomery County. In 2008, Barack Obama only took 40 percent of the vote in the old 6th, but would have won 56 percent in the new 6th. After creating an exploratory committee to challenge Bartlett in the Republican primary, Mooney decided not to run against him.", "US House of Representatives": "Elections 2014In March 2012, Mooney filed as a candidate in the 2014 Republican primary for Maryland's 6th congressional District. He subsequently had to withdraw his candidacy because he was still Bartlett's part-time outreach director at the time he filed papers to run. House ethics rules do not allow congressional staffers to remain employed in a congressional office while campaigning.Mooney subsequently moved to Charles Town, West Virginia, a small town on the state's eastern tip, and declared his candidacy for West Virginia's 2nd congressional district. The district includes most of the West Virginia portion of the Washington, DC, media market. Seven-term Republican incumbent Shelley Moore Capito was giving up the seat to run for the United States Senate. During his campaign, some West Virginia Democrats accused Mooney of being a \"carpetbagger\" since he had recently moved to West Virginia.Mooney received the Republican Party nomination on May 13, 2014, beating six other opponents in the Republican primary. Mooney finished first in 15 of the 17 counties in the congressional district, with an overall total of 36.02 percent of the vote.Mooney faced Democrat Nick Casey in the 2014 general election. On November 4, 2014, he defeated Casey, 49 percent to 47 percent. He won Berkeley County, in the state's Eastern Panhandle, by 5,000 votes, which was more than his overall margin of 4,900 votes. Berkeley, like Charles Town, is part of the Washington media market. Mooney was also helped by long coattails from Capito, who carried every county in the district (and the state).Mooney became the first Latino elected to West Virginia's congressional delegation in the state's history.2016Mooney ran for re-election in 2016. He defeated Marc Savitt in the May 10, 2016, Republican primary, receiving 72.9% of the vote to Savitt's 27.1%. Mooney faced Democratic state delegate Mark Hunt in the general election. Mooney defeated Hunt with 58% of the vote.Tenure Mooney was sworn in on January 3, 2015. On March 26, 2015, Congressman Mooney introduced H.R. 1644, the Supporting Transparent Regulatory and Environmental Actions in Mining Act (STREAM Act). The full House passed the bill on January 19, 2016, by a vote of 235-188.Mooney supports a return to the gold standard.Committee assignments United States House Financial Services CommitteeFreedom CaucusRepublican Study CommitteeCongressional Western Caucus", "Personal": "Mooney is a member of the Knights of Columbus.", "Electoral history": "This section needs to be updated. Please update this article to reflect recent events or newly available information. (February 2017)2010 Race for Maryland State Senate – District 3NameVotesPercentOutcomeRonald N. Young, Dem.22,71051.1%WonAlex X. Mooney, Rep.21,66648.7%LostOther Write-Ins750.2%Lost2006 Race for Maryland State Senate – District 3NameVotesPercentOutcomeAlex X. Mooney, Rep.21,84451.9%WonCandy O. Greenway, Dem.20,11147.8%LostOther Write-Ins1040.2%Lost2002 Race for Maryland State Senate – District 3NameVotesPercentOutcomeAlex X. Mooney, Rep.21,61755.0%WonC. Sue Hecht, Dem.17,65444.9%LostOther Write-Ins660.2%Lost1998 Race for Maryland State Senate – District 3NameVotesPercentOutcomeAlex X. Mooney, Rep.18,39956%WonRonald S. Bird, Dem.14,21244%Lost", "introduction": "Alexander Xavier Mooney (born June 5, 1971) is the U.S. Representative for West Virginia's 2nd congressional district since 2015. He is a member of the Republican Party. He served in the Maryland State Senate, representing District 3, from 1999 to 2011 and is a former Chairman of the Maryland Republican Party. He is the first Hispanic elected to Congress from West Virginia.\n\n", "code": "02"}, "personal": {"Born": "Alexander Xavier Mooney (1971-06-05) June 5, 1971 (age47)Washington, D.C., U.S.", "Political party": "Republican", "Spouse(s)": "Grace Mooney", "Children": "3", "Education": "Dartmouth College (BA)"}, "timeline": {"Member of the US House of Representativesfrom West Virginia's 2nd district": {"date": "Assumed office January 3, 2015", "Preceded by": "Shelley Moore Capito"}, "Chairman of the Maryland Republican Party": {"date": "In officeDecember 11, 2010– March 1, 2013", "Preceded by": "Audrey Scott", "Succeeded by": "Diana Waterman"}, "Member of the Maryland Senatefrom the 3rd district": {"date": "In officeJanuary 13, 1999– January 12, 2011", "Preceded by": "John W. Derr", "Succeeded by": "Ronald N. Young"}, "code": "02"}, "code": "M001195", "type": "4", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.58", "social": "-0.3", "leadership": "0.59"}