{"name": "Bob.Gibbs", "picture": "G000563.jpg", "detail": {"Early life, education, and agricultural career": "Gibbs was born on June 14, 1954 in Peru, Indiana. His family moved to Cleveland in the 1960s, and Gibbs graduated from Bay Village Senior High School. In 1974, he graduated from the Ohio State University Agricultural Technical Institute and moved to Lakeville, Ohio where he co-founded Hidden Hollow Farms, Ltd. Formerly a producer of swine, Hidden Hollow Farms currently produces corn and soybeans.Gibbs served as president of the Ohio Farm Bureau Federation, Ohio's largest agriculture organization which has over 210,000 members. Gibbs first joined the Ohio Farm Bureau board of trustees in 1985. Gibbs also served as a board member of the Farm Bureau Bank, the Ohio Livestock Coalition, the Ohio Cooperative Council, and the Ohio Farm Bureau Alliance. Gibbs was also president of the Loundonville Farmers Equity in Loudonville, Ohio, where he served on the board for 12 years. Gibbs has also served as president of the Holmes County (Ohio) extension advisory committee, the Holmes County Farm Bureau, and as a supervisor for the Holmes County Soil & Water Conservation Service.", "Ohio House of Representatives": "Elections Gibbs was first elected to the Ohio General Assembly in 2002, defeating Democrat Tom Mason of Ashland for a newly drawn district in the Ohio House. He was re-elected in 2004 in a rematch against Mason. During the 2006 statewide election, Gibbs was re-elected, receiving 60% over Democratic challenger James P. Riley, a former township trustee from Sullivan, Ohio. Gibbs began his third term in the Ohio House of Representatives on January 2, 2007 and decided to run for Ohio Senate in 2009 to fill the seat vacated by state senator Ron Amstutz, due to term limits.Tenure In 2006 Gibbs was appointed to serve as a member of the special task force to study eminent domain and its use and application in Ohio. The committee spent most of the year studying the issue and issued its final report in August 2006 with recommendations to the General Assembly.Committee assignments During his last term Gibbs was chairman of the House ways and means committee. He was also a member of the agriculture & natural resources committee, financial institutions, real estate and securities committee, health care access and affordability committee, and the insurance committee.[citation needed]", "Ohio Senate": "Elections Gibbs won election to the Ohio Senate in 2008, and began his first term in 2009. On August 16, 2007, Gibbs formally announced that he would be a candidate for the 22nd district senate seat being vacated by the term limited incumbent senator, Ron Amstutz, (R- Wooster). Gibbs originally expected to face a primary challenge from state representative Jim Carmichael (R-Wayne County), but Carmichael dropped out of the race on October 21, 2007 in order to run for Wayne County commissioner. Gibbs faced Democrat James E. Riley, a job/security representative for the U.A.W. international union. Gibbs won with 59% of the vote.However, due to winning election to Congress in 2010, Gibbs resigned from the senate only serving half of one term.", "US House of Representatives": "Elections 2010 Gibbs faced Democratic incumbent Zack Space and Constitution Party nominee Lindsey Sutton in the general election. He won the Republican primary in an 8-way field. Following close results and a recount, Gibbs was certified the winner on June 4, 2010, a month after the primary election.On November 2, 2010, Gibbs defeated Space in the general election by nearly 14%. Gibbs won 14 of the 16 counties in the 18th congressional district.2012 After redistricting, Gibbs decided to run in the newly redrawn Ohio's 7th congressional district.  He faced Joyce Healy-Abrams, the Democratic nominee. Gibbs went on to defeat Healy-Abrams in the November general election.2014 Gibbs won re-election to a third term unopposed.Tenure On March 4, 2013, Gibbs introduced the Reducing Regulatory Burdens Act of 2013 (H.R. 935; 113th Congress), a bill that would prohibit the Environmental Protection Agency (EPA) and states authorized to issue a permit under the National Pollutant Discharge Elimination System (NPDES) from requiring a permit for some discharges of pesticides authorized for use under the Federal Insecticide, Fungicide, and Rodenticide Act (FIFRA).  In 2018, Gibbs was supported by the Great America Committee, a political action committee registered by Vice President Mike Pence.Committee assignments This section of a biography of a living person does not include any references or sources. Please help by adding reliable sources. Contentious material about living people that is unsourced or poorly sourced must be removed immediately.Find sources: \"Bob Gibbs\" – news · newspapers · books · scholar · JSTOR (August 2015) (Learn how and when to remove this template message)Committee on AgricultureSubcommittee on Conservation, Energy, and ForestrySubcommittee on General Farm Commodities and Risk ManagementCommittee on Transportation and InfrastructureSubcommittee on Economic Development, Public Buildings and Emergency ManagementSubcommittee on Highways and TransitSubcommittee on Water Resources and Environment (chairman)Gibbs is a member of the Republican Study Committee, the Republican Main Street Partnership, the Congressional Constitution Caucus and the Congressional Western Caucus.", "Personal life": "He is married to the former Jody Cox of Wooster, Ohio. They have three grown children and are members of the Nashville United Methodist Church in Nashville, Ohio.[citation needed]", "Electoral history": "Election resultsYearOfficeElectionSubjectPartyVotes%OpponentPartyVotes%OpponentPartyVotes%2002Ohio House of RepresentativesGeneralBob GibbsRepublican18,18262.44%Thomas MasonDemocratic10,93937.56%2004Ohio House of RepresentativesGeneralBob GibbsRepublican30,09764.80%Thomas MasonDemocratic16,35235.20%2006Ohio House of RepresentativesGeneralBob GibbsRepublican21,85360.48%James E. RileyDemocratic14,28039.52%2008Ohio SenateGeneralBob GibbsRepublican90,11159.05%James E. RileyDemocratic62,50440.96%2010U.S. House of RepresentativesGeneralBob GibbsRepublican107,42653.86%Zack SpaceDemocratic80,75640.49%Lindsey SuttonConstitution11,2445.64%*2012U.S. House of RepresentativesGeneralBob GibbsRepublican178,10456.40%Joyce Healy-AbramsDemocratic137,70843.60%2014U.S. House of RepresentativesGeneralBob GibbsRepublican143,959100.00%2016U.S. House of RepresentativesGeneralBob GibbsRepublican198,22164.04%Roy RichDemocratic89,63828.96%Dan PhillipIndependent21,6947.01%*In 2010, write-in candidate Mark Pitrone received 20 votes.", "introduction": "Robert Brian Gibbs (born June 14, 1954) is the U.S. Representative for Ohio's 7th congressional district. He is a member of the Republican Party.\n\n", "code": "07"}, "personal": {"Born": "Robert Brian Gibbs (1954-06-14) June 14, 1954 (age64)Peru, Indiana, U.S.", "Political party": "Republican", "Spouse(s)": "Jody Cox", "Education": "Ohio State University Agricultural Technical Institute (AAS)"}, "timeline": {"Member of the US House of Representativesfrom Ohio's 7th district": {"date": "Assumed office January 3, 2013", "Preceded by": "Steve Austria"}, "Member of the US House of Representativesfrom Ohio's 18th district": {"date": "In officeJanuary 3, 2011– January 3, 2013", "Preceded by": "Zack Space", "Succeeded by": "Constituency abolished"}, "Member of the Ohio Senatefrom the 22nd district": {"date": "In officeJanuary 5, 2009– December 31, 2010", "Preceded by": "Ron Amstutz", "Succeeded by": "Larry Obhof"}, "Member of the Ohio House of Representativesfrom the 97th district": {"date": "In officeJanuary 3, 2003– December 31, 2008", "Preceded by": "Bryan Flannery", "Succeeded by": "Dave Hall"}, "code": "07"}, "code": "G000563", "type": "4", "party": "Republican", "description": "conservative Republican", "economic": "0.46", "social": "0.28", "leadership": "0.51"}