{"name": "Bob.Casey.Jr", "picture": "C001070.jpg", "detail": {"Early life, education, and law career": "Casey was born in Scranton, Pennsylvania, one of eight children of Ellen (née Harding) and Bob Casey, the 42nd governor of Pennsylvania. He is of Irish descent.Casey played basketball and graduated from Scranton Preparatory School in 1978. Following in his father's footsteps, he graduated from the College of the Holy Cross in 1982, and received a Juris Doctor (J.D.) degree from the Columbus School of Law at The Catholic University of America in 1988. Between college and law school, Casey served as a member of the Jesuit Volunteer Corps, and spent a year teaching 5th grade and coaching basketball at the Gesu School in inner-city Philadelphia.Casey practiced law in Scranton from 1991 until 1996.", "Early political career": "State Auditor General Casey ran for and was elected Pennsylvania State Auditor General in 1996. He was re-elected in 2000, and served for two terms, from 1997 to 2005.In a 2002 PoliticsPA feature story designating politicians with yearbook superlatives, he was named the \"Most Likely to Succeed.\"2002 gubernatorial election Casey attempted to follow in his father's footsteps by running for Pennsylvania Governor. Casey faced former Philadelphia mayor Ed Rendell in the Democratic primary election. The Pennsylvania Democratic Party threw their support behind Casey, whom they saw as a more electable candidate than Rendell. In a bitter primary, Rendell won the nomination by winning only 10 out of 67 counties: Philadelphia and its suburbs (Bucks, Chester, Montgomery, and Delaware), its Lehigh Valley exurbs (Berks, Lehigh and Northampton), and Centre County, the home of Penn State University. Rendell went on to win the general election.State Treasurer In 2004, Casey, who was term limited in his Auditor General position, ran for State Treasurer. He was elected on a platform advocating government accountability.", "US Senate": "Elections 2006In 2005, Casey received calls from U.S. Senator Chuck Schumer (D-NY), the chair of the Democratic Senatorial Campaign Committee, as well as Senator Harry Reid (D-NV), the Senate Minority Leader. Both men asked him to run for U.S. Senate in 2006 against Republican incumbent Rick Santorum. On March 5, 2005, Casey announced he would seek the Democratic nomination for the Senate race. Casey's run for the Senate was his fifth statewide campaign in nine years.After he announced that he would run, Casey was almost immediately endorsed by Governor Ed Rendell, his primary election opponent from 2002. He was endorsed by two Democrats who had been mentioned as possible U.S. Senate nominees: former Congressman Joe Hoeffel, who had run against Pennsylvania's other Senator, Arlen Specter, in 2004, and former State Treasurer Barbara Hafer, whom many in the pro-choice movement had attempted to convince to run against Casey in the Democratic primary.In the Democratic primary, Casey faced two Democrats with more liberal viewpoints: college professor Chuck Pennacchio and pension lawyer Alan Sandals. Both argued that Casey's views on abortion and other social issues were too conservative for most Pennsylvania Democrats. Casey easily defeated both challengers in the May 16 primary, however, receiving 85% of the vote.On election night, Casey won the race with 59% of the vote, compared to 41% for incumbent Senator Rick Santorum. Casey's margin of victory was the highest ever for a Democrat running for the United States Senate in Pennsylvania.Casey's 17.4-point victory margin was also the largest for a challenger to any incumbent Senator since James Abdnor unseated George McGovern by 18.8 points in 1980.2012Casey was up for re-election in 2012, and stated his intention to seek re-election in late 2010. His re-election prospects were uncertain. Observers noted that as the election approached, Casey, an early supporter of Obama, had \"started to oppose the president outright or developed more nuanced responses to events that differentiate him from Mr. Obama. Analysts say Mr. Casey wants to put some distance between himself and a president whose job approval ratings in Pennsylvania are poor.\" In October 2011, the National Journal noted that \"the Scranton area is hugely important for 2012\" for both Obama and Casey, but \"the city has among the worst unemployment in the state, and it's filled with the blue-collar Dems who weren't very enthusiastic about Obama when he first ran for president. How Casey navigates his relationship with the president will speak volumes about his re-election prospects.\"[citation needed]In December 2011, it was reported that the AFL–CIO would be spending \"over $170,000\" on pro-Casey TV ads.Casey easily defeated challenger Joseph Vodvarka in the spring Democratic primary, and faced former coal company owner and Republican nominee Tom Smith in the fall general election. He defeated Smith on November 6, 2012, 53.7% to 44.6%, to win a second term, making him the first Democrat elected to a second term in the Senate from Pennsylvania since Joe Clark's 1962 victory.[citation needed]2018Republican Lou Barletta (PA-11) is the Republican nominee to challenge Bob Casey in 2018. He declared that \"Pennsylvania deserves better than an obstructionist senator\" in his campaign announcement speech. Libertarian Dale Kerns is also running against Casey.Tenure On March 28, 2008 Casey announced his endorsement of frontrunning candidate Senator Barack Obama in the Democratic Party presidential primary. The Pennsylvania Report said that he \"struck gold\" by endorsing Obama early in the 2008 Democratic presidential primary, a move that gave him \"inside access to the halls of the White House.\" Casey campaigned across Pennsylvania in support of Obama's candidacy in the months leading up to the primary in that state; they bowled together at Pleasant Valley Lanes in Altoona.Casey has been described as an \"even-keeled moderate, not only in tone but in policy\", but since Donald J. Trump entered the White House, Casey has developed a \"new, saltier social media prowess\". Casey's outspoken opposition to many of Trump's actions has prompted one local media outlet to describe his new strategy before his 2018 re-election campaign as: \"Oppose Trump every chance he gets.\"In February 18, 2018, speaking to John Catsimatidis on New York radio station WNYM Bob Casey Jr. issued a warning to special counsel Robert Mueller not to deliver a report on his findings in the Russian interference in the 2016 United States elections investigation, too near to the 2018 midterm elections. While saying he could not \"make any assumptions about where the Mueller investigation is going\", he stated that he \"would recommend Mueller not release a report on his findings near the midterms\", because it would \"distract from elections or cause people to question the election's integrity\".Committee assignments Committee on Agriculture, Nutrition, and ForestrySubcommittee on Conservation, Forestry and Natural ResourcesSubcommittee on Jobs, Rural Economic Growth and Energy InnovationSubcommittee on Nutrition, Agricultural Research and Specialty Crops (Ranking Member)Committee on FinanceSubcommittee on International Trade, Customs, and Global Competitiveness (Ranking Member)Subcommittee on Social Security, Pensions, and Family PolicySubcommittee on Taxation and IRS OversightCommittee on Health, Education, Labor, and PensionsSubcommittee on Children and Families (Ranking Member)Subcommittee on Employment and Workplace SafetySpecial Committee on Aging (Ranking Member)Caucus memberships Afterschool Caucuses", "Political positions": "Economy and jobs Casey has criticized what he views as \"draconian cuts to Medicare and Medicaid,\" and has stated that Medicare Part D is \"fundamentally flawed\" and in need of a \"complete overhaul.\" He has also supported the Family and Medical Leave Expansion Act, which would expand the Family and Medical Leave Act, authored in the early 1990s by Connecticut Senator Chris Dodd, to companies with at least 25 employees.Casey is an opponent of privatizing Social Security. Casey criticized Santorum for voting against an increase in the minimum wage.Casey voted in January 2010 to re-confirm Federal Reserve Chairman Ben Bernanke. Casey was among 41 Senators who co-sponsored PROTECT IP Act (PIPA) anti-piracy and theft legislation, the Senate version of Stop Online Piracy Act (SOPA).In January 2014, Casey released a new report on income inequality in Pennsylvania and urged Congress to close the income gap by raising the minimum wage, extending unemployment insurance, and increasing funding for early education. Bob Casey has said that he believes that the United States has not exhausted its options to stop foreign countries from flooding the United States with steel supplies, and has stated that he wants the Trump administration to defend nuclear power in Pennsylvania.Healthcare Casey supported President Barack Obama's health reform legislation; he voted for the Patient Protection and Affordable Care Act in December 2009, and he voted for the Health Care and Education Reconciliation Act of 2010.Bob Casey won a 2012 Champion for Children Award from First Focus in honor of his commitment to improving the lives of children.On September 27, 2013, Casey introduced the Children's Hospital GME Support Reauthorization Act of 2013 (S. 1557; 113th Congress) into the Senate. This bill would reauthorize a program that provides funding to children's hospitals in the United States to help with the training of graduate medical students.On March 25, 2014, Casey introduced the Emergency Medical Services for Children Reauthorization Act of 2014 (S. 2154; 113th Congress) into the Senate. The bill that would amend the Public Health Service Act to reauthorize the Emergency Medical Services for Children Program through FY2019. The bill would authorize appropriations of about $20 million in 2015 and $101 million over the 2015-2019 period. Casey argued that \"this low-cost program has saved the lives of countless children and adolescents in the past 30 years, and I urge my colleagues to support this critically important program.\"Birth control In response to a survey, Casey expressed support for \"requiring employers or health insurance plans to cover contraceptives in their prescription drug plans.\" He also expressed support for \"a provision in the state's budget to fund contraceptive services.\" Casey's views on this issue extend to support for the federal funding of contraception. Casey also opposes laws, however, that would \"force pharmacists to fill a prescription contrary to their moral beliefs.\"Abortion Casey identifies as pro-life. He has publicly expressed support for overturning Roe v. Wade. From Casey's election until Sen. Arlen Specter switched from the Republican Party to the Democratic Party in April 2009, Pennsylvania had the distinction of being represented in the Senate by a pro-life Democrat and a pro-choice Republican.[citation needed][dubious  – discuss] According to a 2018 Politico article, \"[a]fter a decade in the Senate, Casey has become an increasingly reliable vote in support of abortion rights — scoring as high as 100 percent on NARAL Pro-Choice America's vote tally in 2016 and 2017 … although his 2018 rating is sure to be lower.\" Politico acknowledged, \"Scorecards are an imperfect calculation of a lawmaker's position. Each organization calculates them differently,\" and was informed by Casey that he has voted anti-abortion on 13 of the 15 abortion-related measures during his career.In 2005, Casey opposed the funding of embryonic stem-cell research. In 2006, Casey supported the DFLA's Pregnant Women Support Act, which sought to reduce abortion by providing support to women experiencing unplanned pregnancies. However, Casey has voted against barring HHS grants to organizations that provide abortion services, where such services may often not be central to the organization's chief purpose. Casey also supports over-the-counter sale of emergency contraception.In January 2010, during a debate on the Affordable Care Act, Casey was heckled for his handling of the abortion provisions in the health-care bill and for not taking an uncompromising pro-life stance. Casey was the primary sponsor of an amendment to prevent government funds from being used for abortion services, but when he tried to organize a compromise that appealed to both Democrats and the party's lone holdout (Sen. Ben Nelson), he angered some religious groups.  According to Politico, \"Like conservative anti-abortion groups, [Casey] opposes the Roe decision and opposes the taxpayer funding of the [abortion] procedure. But like progressive abortion rights organizations, he supports Obamacare, access to contraception through programs such as Title X and funding for Planned Parenthood.\"In 2011, Casey was categorized by NARAL Pro-Choice America as \"anti-choice\" and was not endorsed in their election guide. That year, he voted against defunding Planned Parenthood, against H.R.1 and for cloture for the nomination of Goodwin Liu, earning him a 100% rating from NARAL.In 2017, Casey voted for legislation that would have overturned the Mexico City Policy, which prohibits foreign aid for organizations that provide or promote abortion Casey's vote for overturning that policy prompted pro-life activists to question his commitment to the pro-life cause. Casey was criticized by National Right to Life for his 2017 vote against the confirmation of Neil Gorsuch to the Supreme Court of the United States.In 2015 and 2018, Casey joined two other Democrats (Joe Manchin and Joe Donnelly) by voting for bills that would ban abortion after 20 weeks of pregnancy.Immigration laws Casey supported the Secure Borders, Economic Opportunity and Immigration Reform Act of 2007 (S. 1348), a bill voted down in the 110th United States Congress, which would have provided a path to legal citizenship for undocumented persons currently residing in the United States. He also supported the Clinton amendment, the Menendez amendment, and the Alaska amendments.During the 2006 Senate race, Casey expressed support for the Comprehensive Immigration Reform Act of 2006.He took part in a Philadelphia International Airport protest against President Trump's January 2017 travel ban. Leaving a black tie event Saturday night to join the protest, he tweeted: \"I won't stand by as the promise of America is diminished.\"In May 2017, Casey, along with nine other senators and 13 members of the House of Representatives, requested in a letter to the Homeland Security Secretary, that they stop the detention of four children and their mothers at the Berks County Residential Center.  Many of the families had been detained there without legal recourse for more than a year and a half.  Casey also personally took to social media with impassioned appeals to the White House on behalf of a Honduran 5 year old and his 25-year-old mother being held at the same facility, and were now facing deportation.  They had fled violence and death threats and sought asylum in the US back in 2015, but failed their credible fear interview.  Attorneys have since been appealing their case, and the legal team was in the middle of the process of applying for Special Immigrant Juvenile Status for the child when they were awakened at 3:30AM on May 3 by Immigration and Customs Enforcement and put on a plane to Honduras.  \"This child and his mother deserved better from this Administration. They got the absolute worst\", Casey remarked.Foreign policy Bob Casey believes that Israel is America's most trusted ally.Among over 70 other Senators, Casey wrote to urge the European Union to designate Hezbollah as a terrorist organization. In 2014, he and Senator Rubio urged the Obama administration to prioritize the issue of ISIS's financial support. He introduced the Stop Terrorist Operational Resources and Money (STORM) Act of 2016, which punishes countries that accept terrorist financing by their citizens or within their borders. Casey voted for the Protect and Preserve International Cultural Property Act, which was designed to ensure that the U.S. is not a market for antiquities looted from Syria and which was signed into law by Obama.Government spending and taxes In December 2012, Casey introduced legislation that would extend the payroll tax cut for another year and provide tax credits for employers that add jobs.In December 2016, Casey joined a group of other Senate Democrats led by Joe Manchin of West Virginia who refused to back down on a demand that expiring benefits for retired coal workers be extended. Casey, described as \"unusually animated,\" said he would \"vote against a must-pass spending bill needed to keep the government running\" if the coal miners' benefits were not extended.Alongside all other Senate Democrats, Bob Casey voted against the Tax Cuts and Jobs Act, saying that it was \"a giveaway to the super rich\". Four months after it passed, Bob Casey proposed his own Tax Fairness for Workers Act to create deductions to help pay for union dues and other job expenses. Bob Casey also proposed to expand the Child and Dependent Care Tax Credit prior to the TCJA's passage, and the Tax Cuts and Jobs act incorporated a larger expansion of this credit. Bob Casey also supports expanding the Earned Income Tax Credit and supports making the Adoption Tax Credit refundable.LGBT rights Casey voted for the Don't Ask, Don't Tell Repeal Act of 2010.Casey, a longtime supporter of civil unions, announced his support for same-sex marriage on April 1, 2013.Casey supports the adoption of children by same-sex couples.Environment Casey opposes drilling for oil in the Arctic National Wildlife Refuge. Instead, he supports increased federal investment in hybrid and alternative fuel technology to help wean the United States off of foreign oil. In a debate, Casey criticized his Republican opponent Rick Santorum for not recognizing the danger of global warming. He also supports increased funding for Brownfield cleanup, as well as a reinstatement of the polluter-pays principle for the Superfund program.Judicial nominees He expressed support for the confirmation of both John Roberts and Samuel Alito for seats on the Supreme Court of the United States; these judges were believed to be in favor of overturning Roe v. Wade.Casey voted for the confirmation of both Sonia Sotomayor and Elena Kagan to the Supreme Court of the United States.In March 2017, Casey announced that he would vote against confirming Neil Gorsuch to the Supreme Court, citing \"real concerns\" with Gorsuch's \"rigid and restrictive\" judicial philosophy, and some of his past opinions on issues relating to the health and safety of workers and the rights of those with disabilities.Gun laws At the beginning of his Senate career, Casey was considered a pro-gun rights senator and a strong supporter of the Second Amendment, voting against restriction of the amendment in 2012. In 2009, Casey voted to allow firearms in checked baggage on trains, and he has also voted against bills that would restrict gun ownership; in 2013 he voted to ban high-capacity magazines carrying over 10 rounds. On April 17, 2013, Casey voted in favor of the Public Safety and Second Amendment Rights Protection Act to amend the background check process and require a background check for firearms transfers made at gun shows or on the internet. His fellow Pennsylvania Senator Pat Toomey was a cosponsor in creating the bill.On June 16, 2016, the Washington Post reported that \"'pro-gun' Bob Casey\" had become \"an evangelist for gun control laws.\" After the Sandy Hook school massacre in December 2012, he had \"completely flipped his views\" on several gun issues, largely as a result of having been \"accosted\" by his wife and daughter. \"Casey has since embraced every major proposal to counter gun violence,\" reported the Post, \"including a renewed ban on assault weapons and enhanced background checks before gun purchases.\" In the wake of the Orlando Pulse massacre, he unveiled the Hate Crimes Prevention Act, which would have prevented persons convicted of hate crimes from purchasing weapons. He said he had never really thought about the gun issue until Sandy Hook, \"coasting along with Pennsylvania's traditional pro-gun views in a state where the National Rifle Association has held sway for decades.\" After Sandy Hook, he \"found it unacceptable that the NRA opposed any new laws.\"On June 25, 2016, Philadelphia Magazine ran an article about Casey's \"profound about-face on gun control,\" noting that it had taken place within \"a matter of days\" and that Casey \"was the first to introduce gun control legislation after the massacre in Orlando.\" Casey said that his switch had been a result of \"thinking of the enormity of it, what happened to those children, which was indescribably horrific, and then having my wife and daughter say to me, 'You're going to vote on this at some point. How are you going to vote?'\" He said that \"I had to ask myself that question, because normally I would stay in my lane. There's only two lanes on this. It's the NRA lane, or the voting for commonsense gun measures lane. So I decided whether I was going to stay in the old lane, in which I had traveled a long time but really had never been challenged or had to cast a real big vote.\"Education As a candidate for State Treasurer in 2004, Casey opposed school vouchers, and supported using state funds \"to increase the availability of safe, quality and affordable early care and education for families that choose to use these programs.\"Betsy DeVos and FIRE Casey questioned Donald Trump's nomination of Betsy DeVos to be Secretary of Education on the grounds that she and her husband had donated to the Foundation for Individual Rights in Education (FIRE), which seeks to \"defend individual rights on college campuses\". \"Ms. DeVos must fully explain whether she supports the radical view that it should be more difficult for campus sexual-assault victims to receive justice,\" said Casey. In a Wall Street Journal op-ed, FIRE co-founder Harvey Silverglate noted that \"FIRE vigorously defends the free-speech and due-process rights of college students and faculty\" and that the organization \"is nonpartisan and has defended students and faculty members on the left and right,\" making \"common cause with politically diverse organizations ranging from the American Civil Liberties Union and the National Association of Criminal Defense Lawyers to the Heritage Foundation, Young Americans for Liberty and the Cato Institute.\" Casey's position was challenged in USA Today by Stuart Taylor and K.C. Johnson, who pointed out that, contrary to a letter in which Casey and Sen. Patty Murray (WA) described campus sexual assault as \"affecting millions of college students,\" 5,178 campus rapes were reported in 2014. Politico ran a prominent piece that echoed Casey's characterization of FIRE, while National Review and other publications assailed Casey and defended FIRE.", "Electoral history": "Pennsylvania Auditor General Primary Election, 1996PartyCandidateVotes%±DemocraticRobert P. Casey, Jr.252,64534.6%N/ADemocraticTom Foley242,19033.2%N/ADemocraticBill Lloyd128,50017.6%N/ADemocraticSandra Miller105,86814.5%N/AMajority10,4551.4%N/ATurnout729,203-32.2%Pennsylvania Auditor General Election, 1996PartyCandidateVotes%±DemocraticRobert P. Casey, Jr.2,367,76056.1%+10.8%RepublicanBob Nyce1,706,83540.4%-10.7%LibertarianSharon Shepps103,2342.4%-1.2%ConstitutionRobert Lord43,4871.1%N/AMajority514,20412.2%+9.8%Turnout4,221,31665.3%-1.0%Democratic gain from RepublicanSwingPennsylvania Auditor General Election, 2000PartyCandidateVotes%±DemocraticRobert P. Casey, Jr. (inc.)2,651,55156.8%+0.8%RepublicanKatie True1,862,93439.9%-0.1%GreenAnne Goeke62,6421.3%N/ALibertarianJessica Morris41,9670.9%-2.1%ConstitutionJohn Rhine23,9710.5%-0.5%ReformJames Blair21,4760.5%N/AMajority638,56113.6%+1.4%Turnout4,664,54163.1%-2.2%Democratic holdSwingPennsylvania Gubernatorial Primary Election, 2002PartyCandidateVotes%±DemocraticEd Rendell702,44256.5%N/ADemocraticRobert P. Casey, Jr.539,79443.5%N/AMajority162,64813.1%N/ATurnout1,242,23628.0%+13%Pennsylvania State Treasurer Election, 2004PartyCandidateVotes%±DemocraticRobert P. Casey, Jr.3,353,48961.3%+14.1%ConstitutionMax Lampenfeld20,4060.4%-0.5%RepublicanJean Craige Pepper1,997,95136.5%-12.8%LibertarianDarryl Perry61,2381.1%-0.4%GreenPaul Teese40,7400.7%-0.8%Majority1,233,15422.5%+24.0%Turnout5,473,82468.9%+5.8%Democratic gain from RepublicanSwingPennsylvania U.S. Senate Primary Election, 2006PartyCandidateVotes%±DemocraticRobert P. Casey, Jr.629,27184.5%N/ADemocraticChuck Pennacchio66,3648.9%N/ADemocraticAlan Sandals48,1136.5%N/ADemocraticOthers1,1140.1%N/AMajority513,68068.9%N/ATurnout744,862+1.3%Pennsylvania U.S. Senate Election, 2006PartyCandidateVotes%±DemocraticRobert P. Casey, Jr.2,392,98458.7%+15.2%RepublicanRick Santorum (inc.)1,684,77841.3%-17.4%Majority708,20617.3%+10.4%Turnout4,077,76241.8%+3.0%Democratic gain from RepublicanSwing-24.4Pennsylvania U.S. Senate Primary Election, 2012PartyCandidateVotes%±United States Senate election in Pennsylvania, 2012PartyCandidateVotes%±DemocraticRobert P. Casey, Jr.565,48880.9%N/ADemocraticJoseph Vodvarka133,68319.1%N/AMajority431,80561.8%N/ATurnout699,171-6.1%United States Senate election in Pennsylvania, 2012PartyCandidateVotes%±DemocraticRobert P. Casey, Jr. (inc.)3,021,36453.7%-4.9%RepublicanTom Smith2,509,11444.6%+3.3%LibertarianRayburn Smith96,9261.7%+1.7%Majority512,2509.1%-Turnout5,627,404Democratic holdSwing-4.9%", "Personal life": "Casey and his wife Terese were married in 1985, and they have four daughters: Elyse, Caroline, Julia and Marena.", "introduction": "Robert Patrick Casey Jr. (born April 13, 1960) is an American attorney and politician who is currently the senior United States Senator from Pennsylvania. He previously served as Pennsylvania Auditor General from 1997 to 2005 and as Pennsylvania Treasurer from 2005 to 2007.\nBorn in Scranton, Pennsylvania, Casey is the son of Bob Casey, a former Governor of Pennsylvania. After graduating from Scranton Preparatory School in 1978, he attended the College of the Holy Cross. He received his law degree from the Columbus School of Law at The Catholic University of America. Casey practiced law in Scranton, Pennsylvania, before beginning his political career as Pennsylvania's Auditor General, a post to which he was elected in 1996 and re-elected in 2000.\nIn the 2002 Pennsylvania gubernatorial election, Casey attempted to follow his father's footsteps in a run for Governor of Pennsylvania. He was defeated, however, in the Democratic primary by eventual general election victor Ed Rendell. After being term-limited out of his position as auditor general, Casey was elected state treasurer in the 2004 election.\nCasey defeated two-term Republican incumbent Rick Santorum in the 2006 election. He was re-elected in 2012 and is the first Democrat to be elected to a full term and the first to win re-election to the U.S. Senate from Pennsylvania since Joseph S. Clark Jr. in 1962.\n\n"}, "personal": {"Born": "Robert Patrick Casey Jr. (1960-04-13) April 13, 1960 (age58)Scranton, Pennsylvania, U.S.", "Political party": "Democratic", "Spouse(s)": "Terese Foppiano (m.1985)", "Children": "4", "Education": "College of the Holy Cross (BA)Catholic University of America (JD)"}, "timeline": {"United States Senatorfrom Pennsylvania": {"date": "Assumed office January 3, 2007Serving with Pat Toomey", "Preceded by": "Rick Santorum"}, "Ranking Member of the Senate Aging Committee": {"date": "Assumed office January 3, 2017", "Preceded by": "Claire McCaskill"}, "34th Treasurer of Pennsylvania": {"date": "In officeJanuary 18, 2005– January 3, 2007", "Governor": "Ed Rendell", "Preceded by": "Barbara Hafer", "Succeeded by": "Robin Wiessmann"}, "49th Auditor General of Pennsylvania": {"date": "In officeJanuary 21, 1997– January 18, 2005", "Governor": "Tom RidgeMark SchweikerEd Rendell", "Preceded by": "Barbara Hafer", "Succeeded by": "Jack Wagner"}}, "code": "C001070", "type": "3", "party": "Democrat", "description": "moderate Democratic leader", "economic": "-0.3", "social": "0.19", "leadership": "0.73"}