{"name": "Brett.Guthrie", "picture": "G000558.jpg", "detail": {"Early life, education, and career": "Guthrie was born in Florence, Alabama, the son of Carolyn P. (née Holt) and Lowell M. Guthrie. He earned his Bachelor of Science in mathematical economics from the U.S. Military Academy at West Point in 1987 and his Master's of Public and Private Management from Yale University in New Haven, Connecticut, in 1997.Guthrie is a former vice president of Trace Die Cast, Inc., an automotive parts supplier based in Bowling Green. Guthrie has previously served as a field artillery officer in the 101st Airborne Division at Fort Campbell, Kentucky.", "Kentucky Senate": "Guthrie represented the 32nd district in the Kentucky Senate from 1999 to 2008, where he served as vice chairman of the Economic Development, Tourism and Labor Committee, and was chairman of the Transportation Committee.", "US House of Representatives": "Elections 2008In the 2008 congressional general election, he defeated his Democratic opponent, State Senator David Boswell, for the right to succeed the retiring Republican U.S. Representative Ron Lewis. Lewis announced his retirement on the last day for candidates to file for the seat in 2008, in hopes of steering the Republican nomination to his chief of staff, Daniel London. Guthrie, however, filed his papers and defeated London for the party nomination.This set up the closest race in the 2nd in 14 years.  While Democrats have a large advantage in registration, the voters are very conservative on social issues.  This was a major reason Lewis had been able to hold on to the district with little trouble since winning it in a 1994 special election.  Ultimately, Guthrie prevailed by 15,500 votes, mostly on the strength of rural voters. Guthrie may have been boosted by voters being more motivated to come to the polls due to the Presidential election and the Senate election that were held at the same time. Republican candidate John McCain carried the district with 60 percent of the vote and won all but one county entirely within the district. The incumbent Republican Senator Mitch McConnell also carried the 2nd district easily.2010The 2nd reverted to form in 2010, and Guthrie defeated Democrat Ed Marksberry by a large margin.2012Guthrie won reelection in 2012 with over 64% of the vote.2018Guthrie filed for re-election on November 27, 2017. Two Democratic challengers have filed against Guthrie: Grant Short and Brian Pedigo.Tenure 2011In 2011, Guthrie voted for the National Defense Authorization Act for Fiscal Year 2012 as part of a controversial provision that allows the government and the military to indefinitely detain American citizens and others without trial. In July 2013, Guthrie voted against the move to defund the National Security Agency due to the alleged privacy violations reported by whistleblower Edward Snowden.2013Guthrie voted in favor to end the United States federal government shutdown of 2013.In September, Guthrie introduced the Missing Children's Assistance Reauthorization Act of 2013, authorizing the continued funding of the National Center for Missing and Exploited Children through fiscal year 2018 and to strengthen additional programs that prevent the abduction and sexual exploitation of children.2017Guthrie introduced, alongside Virginia Foxx, the Promoting Real Opportunity, Success and Prosperity through Education Reform (PROSPER) Act, an act that would eliminate Public Service Loan Forgiveness and would reduce federal funding made available to for-profit colleges.On December 19, Guthrie voted in favor of the Tax Cuts and Jobs Act. Prior to his vote, Guthrie said that he was \"willing to accept\" criticism about the bill making American businesses more competitive on a global scale.Committee assignments Committee on Energy and CommerceSubcommittee on Digital Commerce and Consumer ProtectionSubcommittee on Communications and TechnologySubcommittee on HealthCommittee on Education and the WorkforceSubcommittee on Health, Employment, Labor and PensionsSubcommittee on Higher Education and Workforce TrainingCaucus memberships Congressional Arts CaucusRepublican Study Committee", "Political positions": "Domestic issues Gun law Guthrie has an \"A\" rating from the National Rifle Association (\"NRA\") for his pro-gun rights voting history.Health care Guthrie supports the repeal and replacement of the Affordable Care Act (\"Obamacare\").Social issues Abortion Guthrie is pro-life. In 2008, Kentucky Right for Life endorsed him. He has a 100 percent rating from the National Right to Life Committee for his voting record on abortion-related matters.Cannabis Guthrie has a \"D\" rating from NORML for his voting history regarding cannabis-related causes. Guthrie opposes veterans having access to medical marijuana if recommended by their Veterans Health Administration doctor and if it is legal for medicinal purposes in their state of residence.", "Personal life": "With his family, Guthrie attends the Lehman Avenue Church of Christ in Bowling Green, Kentucky, as reported by the Christian Chronicle; Michael Greene, minister of the Lehman Avenue congregation, said that he has no doubt \"Guthrie's faith will play a positive role\" in representation of the 2nd district.", "introduction": "\nSteven Brett Guthrie (born February 18, 1964) is the U.S. Representative for Kentucky's 2nd congressional district. Located in central Kentucky, the district covers Fort Knox, Owensboro, Bowling Green and Danville. He has served in that role since 2009. He is a member of the Republican Party. He previously served in the Kentucky Senate.\n\n", "code": "02"}, "personal": {"Born": "Steven Brett Guthrie (1964-02-18) February 18, 1964 (age54)Florence, Alabama, U.S.", "Political party": "Republican", "Spouse(s)": "Beth Guthrie", "Education": "United States Military Academy (BS)Yale University (MBA)"}, "timeline": {"Member of the US House of Representativesfrom Kentucky's 2nd district": {"date": "Assumed office January 3, 2009", "Preceded by": "Ron Lewis"}, "Member of the Kentucky Senatefrom the 32nd district": {"date": "In office2000–2008", "Preceded by": "Frank Miller", "Succeeded by": "Mike Reynolds"}, "Military service": {"Allegiance": "United States", "Service/branch": "United States Army", "Years of service": "1987–1990", "Rank": " First Lieutenant", "Unit": "101st Airborne Division", "Awards": "Army Commendation MedalArmy Achievement MedalAir Assault Badge"}, "code": "02"}, "code": "G000558", "type": "4", "party": "Republican", "description": "moderate Republican leader", "economic": "0.41", "social": "0.24", "leadership": "0.92"}