{"name": "Chris.Van.Hollen", "picture": "V000128.jpg", "detail": {"Early life, education, and career": "Van Hollen was born in Karachi, Pakistan, the eldest of three children of American parents, Edith Eliza (née Farnsworth) and Christopher Van Hollen. His father was a Foreign Service officer who served as Deputy Assistant Secretary of State for Near Eastern Affairs (1969–1972) and U.S. Ambassador to Sri Lanka and the Maldives (1972–1976); and his mother worked in the Central Intelligence Agency and the State Department, where she served as chief of the intelligence bureau for South Asia. He spent parts of his early life in Pakistan, Turkey, India, and Sri Lanka. He returned to the United States for his junior year of high school, and attended Middlesex School in Concord, Massachusetts, where his grandfather once taught.He is an alumnus of the Kodaikanal International School in southern India. In 1982, Van Hollen graduated from Swarthmore College with a Bachelor of Arts degree in philosophy. He continued his studies at Harvard University, where he earned a Master of Public Policy degree, concentrating in national security studies, from the John F. Kennedy School of Government in 1985. He earned a Juris Doctor from the Georgetown University Law Center in 1990.", "Early political career": "Van Hollen worked as a legislative assistant for defense and foreign policy to U.S. Senator Charles Mathias, a Republican from Maryland, from 1985 to 1987. He was also a staff member of the U.S. Senate Committee on Foreign Relations (1987–1989), and a legislative advisor for federal affairs to Maryland Governor William Donald Schaefer (1989–1991). He was admitted to the Maryland bar in 1990, and joined the law firm of Arent Fox.", "Maryland State Legislature": "Van Hollen served in the Maryland General Assembly from 1991 to 2003, first in the House of Delegates (1991–95) and then in the State Senate (1995–2003). In the Senate, he served on the Budget and Taxation Committee and the Health and Human Services Subcommittee. He led successful efforts to raise the tobacco tax, prohibit oil drilling in the Chesapeake Bay, mandate trigger locks for guns, and increase funding for education and healthcare. In 2002, The Washington Post called Van Hollen \"one of the most accomplished members of the General Assembly.\"", "US House of Representatives": "Maryland's 8th district hugs the northern border of Washington, D.C., and is one of the wealthiest and most educated congressional districts in the nation. The federal government is the single largest employer in the district, and many private companies are funded by the government.In 2003, he was named Outstanding New Member of the Year by the Committee for Education Funding, the nation's largest and oldest non-partisan education coalition. The first bill Van Hollen introduces every session is the Keep Our Promise to America's Children and Teachers (Keep Our PACT) Act, which would fully fund No Child Left Behind and Individuals with Disabilities Education Act. He introduced an amendment, which passed, that repealed a 9.5 percent loophole in student loans that had allowed lenders to pocket billions of taxpayer dollars. Now, that money is available for additional student loans.Because many federal employees live in his district, Van Hollen has worked on a number of issues relating to them. He supported pay parity in pay raises for civilian employees and introduced an amendment, which passed, to block attempts to outsource federal jobs.Van Hollen has secured federal funding for a number of local-interest projects, including transportation initiatives, local homeland security efforts, education programs and community development projects. He and Adam Schiff (D-CA) often discuss issues of National Security on the floor of the House in tandem, with particular commentary on the wars in Afghanistan and Iraq.In May 2006, Van Hollen formed a congressional caucus on the Netherlands with Dutch-born Republican U.S. Representative Pete Hoekstra from Michigan. The goal of the caucus is to promote the U.S. relationship with the Netherlands and remember the Dutch role in establishing the State of New York and the United States.[citation needed]In July 2006, Van Hollen urged the Bush administration to support a ceasefire supported by a peacekeeping force that would end the 2006 Lebanon War. He was criticized by elements of the Jewish and pro-Israel community, a large part of his constituency, for criticizing U.S. and Israeli policy in the Lebanon conflict. In follow-up comments, Van Hollen indicated that his original comments were meant as a critique of Bush administration policy but did not retract his position, and other members of the local Jewish and pro-Israel community defended him.In 2006, Van Hollen opted out of the race to succeed the retiring Senator Paul Sarbanes, saying he would rather spend time with his family and help elect more Democrats to Congress. In keeping with that, Van Hollen was appointed to Chairman of the Democratic Congressional Campaign Committee.In 2009, Van Hollen introduced a bill which establishes a green bank to catalyze the financing of clean energy and energy efficiency projects. He reintroduced the same bill again in 2014.In March 2010, when Charles Rangel was forced to resign as Chairman of the Committee on Ways and Means over ethics charges, Van Hollen played a key role in having Sander Levin succeed to the Chairmanship over Pete Stark. Stark was the second-most experienced member of the committee while Levin was third, and party tradition would have made Stark chairman due to seniority. However, Van Hollen and other younger members saw Stark's past intemperate comments as a liability to the Democrats in an election year.On April 29, 2010, Van Hollen introduced the campaign finance DISCLOSE Act. He reintroduced the bill for the 113th Congress on February 9, 2012.In April 2011, Van Hollen sued the Federal Election Commission, charging it with regulatory capture and the creation of a loophole that allowed unlimited and undisclosed financing in the 2010 election reason. According to Van Hollen, had it not been for the loophole, \"much of the more than $135 million in secret contributions that funded expenditures would have been disclosed.\"[needs update]Committee assignments Committee on the Budget (Ranking Member)Joint Select Committee on Deficit ReductionParty leadership and Caucus membershipRanking Member on the House Budget CommitteeVice Chairman of the Renewable Energy and Energy Efficiency CaucusCo-Chairman of the Congressional Soccer CaucusCo-Chairman of the Chesapeake Bay Watershed Task ForceCo-Chairman of the Congressional Caucus on Global Road SafetyVice Chairman of the Democratic Task Force on Budget and Tax PolicyMember of the Congressional Asian Pacific American CaucusMember of the Sustainable Energy and Environment CoalitionInternational Conservation CaucusCongressional Chesapeake Bay Watershed CaucusChairman, Congressional Down Syndrome CaucusAfterschool Caucuses", "US Senate": "Shortly after the 2016 elections, Van Hollen was selected as the Chairman of the Democratic Senatorial Campaign Committee (DSCC) for the 2018 cycle.Committee assignments Committee on AppropriationsSubcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on Financial Services and General GovernmentSubcommittee on Interior, Environment, and Related AgenciesSubcommittee on the Legislative BranchSubcommittee on State, Foreign Operations, and Related ProgramsCommittee on Banking, Housing, and Urban AffairsSubcommittee on Housing, Transportation, and Community DevelopmentSubcommittee on Financial Institutions and Consumer ProtectionSubcommittee on Securities, Insurance, and InvestmentCommittee on the BudgetCommittee on Environment and Public WorksCaucus membershipCongressional NextGen 9-1-1 Caucus", "Political campaigns": "Prior to Van Hollen's election, incumbent Connie Morella had won eight elections in the district, despite the fact that she was a Republican in a district that had swung heavily Democratic. Morella's success was largely attributed to her political independence and relatively liberal voting record, including support for abortion rights, gay rights, gun control and increased environmental protections.After Morella's reelection in 2000, Democratic Maryland Senate President Thomas V. Miller, Jr. made no secret that he wanted to draw the 8th out from under Morella. Indeed, one redistricting plan after the 2000 U.S. Census went so far as to divide the 8th in two, giving one district to Van Hollen and forcing Morella to run against popular State Delegate Mark Kennedy Shriver in November. The final plan was far less ambitious, but made the district even more Democratic than its predecessor.  It absorbed nine heavily Democratic precincts from neighboring Prince George's County, an area that Morella had never represented. It also restored a heavily Democratic spur in eastern Montgomery County that had been cut out in the last round of redistricting.In 2002, Van Hollen entered a competitive Democratic primary against Shriver and former Clinton Administration aide Ira Shapiro. Though Shriver had the most money, Van Hollen launched a very successful grassroots effort that mobilized Democratic voters. After receiving the endorsement of The Washington Post, The Baltimore Sun, and other local papers, Van Hollen defeated Shriver 43.5 percent to 40.6 percent.During the campaign, Van Hollen emphasized that even when Morella voted with the district, her partisan affiliation kept Tom DeLay and the rest of her party's more conservative leadership in power. Van Hollen also touted his leadership in the State Senate on issues such as education funding, HMO reform, trigger locks for handguns, and protecting the Chesapeake Bay from oil drilling. Ultimately, after a tight race, Van Hollen defeated Morella 51.7 percent to 48.2 percent.  Van Hollen crushed Morella in the Prince George's County portion of the district, while narrowly winning Montgomery County.  However, Morella won most of the precincts she'd previously represented.Proving just how Democratic this district was, Van Hollen was reelected four times from this district by over 70 percent of the vote.  However, it had long been taken for granted that the Republicans would face extremely long odds of retaking the seat if Morella retired or was defeated in an election.After the 2010 census, Van Hollen's district was made slightly less Democratic.  He lost a heavily Democratic spur of Montgomery County to the neighboring 6th district, and lost his share of Prince George's County to the 4th district.  In their place, the 8th absorbed heavily Republican Carroll County and a strongly Republican spur of Frederick County.  Nonetheless, since his share of Montgomery County has more than double the population of his shares of Carroll and Frederick counties combined, Van Hollen easily won a sixth term over Republican Ken Timmerman with 63 percent of the vote.  While Van Hollen lost in Carroll and Frederick, he swamped Timmerman in Montgomery by 113,500 votes.", "Political positions": "Animal rights Van Hollen also supports animal rights groups such as The Humane Society, the Society for Animal Protective Legislation (SAPL), Big Cat Rescue (BCR), and Defenders of Wildlife Action Fund, all of whom gave him a 100% approval rating. Van Hollen also received endorsement from the Humane Society Legislative Fund (HSLF) in 2010. Although he supports animal rights groups, Van Hollen received an approval rating of 0% from the Sportsmen's and Animal Owners' Voting Alliance (SAOVA).Economy In his 2016 Senate platform, Van Hollen supported an increase in the minimum wage, paid sick leave, an expansion of the Earned Income Tax Credit, equal pay for women, an increase in the child care tax credit, and a financial transactions tax.Gun law Van Hollen has been endorsed by the Brady Campaign to Prevent Gun Violence, a group which campaigns for more government regulation of guns. Van Hollen received a 0% from the Gun Owners of America (GOA) in 2006. In September 2008, Van Hollen voted against repealing portions of the Washington, D.C. Firearm Ban.In 2015, Van Hollen introduced legislation for increased handgun licensing, specifically the requirement for permit-to-purchase licenses. This proposal was based on a similar law that exists in Maryland. On proposing the law, Van Hollen stated that \"States require licenses to drive a car or even to fish in local rivers, so requiring a license to buy a deadly handgun is a common-sense step that could save countless lives.\"In response to the 2017 Las Vegas shooting, Van Hollen co-sponsored a bill to ban bump stocks.Health Van Hollen supports Obamacare and has defended it many times.Taxes Van Hollen received a 0% rating for the Citizens Against Government Waste (CAGW), and the National Taxpayers Union (NTU), in 2010. Both these organizations advocate for lower taxes for everyone including the wealthy. In 2006, Van Hollen received a 100% rating from Citizens for Tax Justice (CTJ), a group that calls for higher taxes on the wealthy. Van Hollen opposes eliminating the federal estate tax.", "Electoral history": "YearOfficeElectionSubjectPartyVotes%OpponentPartyVotes%OpponentPartyVotes%OpponentPartyVotes%2002Congress, 8th districtGeneralChristopher Van Hollen Jr.Democratic112,78851.71Connie Morella (incumbent)Republican103,58747.492004Congress, 8th districtGeneralChristopher Van Hollen Jr.Democratic215,12974.78Chuck FloydRepublican71,98925.022006Congress, 8th districtGeneralChristopher Van Hollen Jr.Democratic168,87276.52Jeffrey SteinRepublican48,32421.90Gerald GiblinGreen3,2981.492008Congress, 8th districtGeneralChristopher Van Hollen Jr.Democratic229,66975.15Steve HudsonRepublican66,34521.71Gordon S. ClarkGreen6,8252.232010Congress, 8th districtGeneralChristopher Van Hollen Jr.Democratic138,03273.0Michael Lee PhilipsRepublican47,81225.3Mark GrannisLibertarian2,4801.32012Congress, 8th districtGeneralChristopher Van Hollen Jr.Democratic192,71162.50Ken TimmermanRepublican104,39133.90Mark GrannisLibertarian6,6242.10George GluckGreen4,4981.502014Congress, 8th districtGeneralChristopher Van Hollen Jr.Democratic127,26060.3Dave WallaceRepublican83,71139.72016MD Senator, Class 3PrimaryChristopher Van Hollen Jr.Democratic470,32053.2Donna EdwardsDemocratic343,62038.92016MD Senator, Class 3GeneralChristopher Van Hollen Jr.Democratic1,483,02560.36Kathy SzeligaRepublican898,31236.44Margaret FlowersGreen78,4863.19", "Personal life": "Van Hollen and his wife Katherine have three children: Anna, Nicholas, and Alexander. Van Hollen is of Dutch descent.", "Further reading": "Barone, Michael,  and Chuck McCutcheon. The Almanac of American Politics 2012 (2011) pp 762–5", "introduction": "Christopher Van Hollen Jr. (born January 10, 1959) is an American politician serving as the junior United States Senator from Maryland since January 3, 2017. From 2003 to 2017, he held the position of U.S. Representative for Maryland's 8th congressional district. He is a member of the Democratic Party.\nIn 2006, Van Hollen became the chair of the Democratic Congressional Campaign Committee (DCCC). In this post, he was responsible for leading efforts to defend vulnerable Democrats and get more Democrats elected to Congress in 2008, which he did. House Speaker Nancy Pelosi created a new leadership post, Assistant to the Speaker, in 2006 so that Van Hollen could be present at all leadership meetings. He was elected Ranking Member on the Budget Committee on November 17, 2010. Pelosi appointed Van Hollen to the 12-member bipartisan Committee on Deficit Reduction with a mandate for finding major budget reductions by late 2011. On October 17, 2013 Pelosi appointed Van Hollen to serve on the bicameral conference committee.\nVan Hollen ran for the United States Senate in 2016 to replace retiring Senator Barbara Mikulski and won the general election 60 to 36 percent. Van Hollen serves as Chair of the Democratic Senatorial Campaign Committee (DSCC) for the 2018 elections cycle.\n\n"}, "personal": {"Born": "Christopher Van Hollen Jr. (1959-01-10) January 10, 1959 (age59)Karachi, Pakistan", "Political party": "Democratic", "Spouse(s)": "Katherine Wilkens", "Children": "3", "Parents": "Christopher Van HollenEdith Eliza Farnsworth", "Education": "Swarthmore College (BA)Harvard University (MPP)Georgetown University (JD)", "Signature": ""}, "timeline": {"United States Senatorfrom Maryland": {"date": "Assumed office January 3, 2017Serving with Ben Cardin", "Preceded by": "Barbara Mikulski"}, "Chair of the Democratic Senatorial Campaign Committee": {"date": "Assumed office January 3, 2017", "Leader": "Chuck Schumer", "Preceded by": "Jon Tester"}, "House Democratic Assistant to the Leader": {"date": "In officeJanuary 3, 2009– January 3, 2011", "Leader": "Nancy Pelosi", "Preceded by": "Xavier Becerra", "Succeeded by": "Jim Clyburn (Assistant Democratic Leader)"}, "Chair of the Democratic Congressional Campaign Committee": {"date": "In officeJanuary 3, 2007– January 3, 2011", "Leader": "Nancy Pelosi", "Preceded by": "Rahm Emanuel", "Succeeded by": "Steve Israel"}, "Member of the US House of Representativesfrom Maryland's 8th district": {"date": "In officeJanuary 3, 2003– January 3, 2017", "Preceded by": "Connie Morella", "Succeeded by": "Jamie Raskin"}}, "code": "V000128", "type": "3", "party": "Democrat", "description": "moderate Democratic follower", "economic": "-0.39", "social": "-0.17", "leadership": "0.17"}