{"name": "Chuck.Grassley", "picture": "G000386.jpg", "detail": {"Early life and career": "Grassley was born in New Hartford, Iowa, the son of Ruth (née Corwin) and Louis Arthur Grassley, and raised on a farm.  He graduated from the town high school. At Iowa State Teachers College (now the University of Northern Iowa), he earned a B.A. in 1955 and an M.A. in  Political Science in 1956.  During his time as a student, Grassley joined the social-professional Alpha Gamma Rho Fraternity.  Also during the 1950s, Grassley farmed and worked in factories in Iowa, first as a sheet metal shearer and then as an assembly line worker.  He pursued a Ph.D. in political science at the University of Iowa, but ultimately did not complete the degree.  From 1967–1968, Grassley taught at Charles City College.Grassley represented parts of Butler County in the Iowa House of Representatives from 1959 until 1975.  He then served in the United States House of Representatives from 1975 to 1981.", "United States Senate": "Committee assignmentsCommittee on Agriculture, Nutrition, and ForestrySubcommittee on Rural Revitalization, Conservation, Forestry and CreditSubcommittee on Energy, Science and TechnologySubcommittee on Production, Income Protection and Price SupportCommittee on FinanceSubcommittee on Health CareSubcommittee on Energy, Natural Resources, and InfrastructureSubcommittee on International Trade, Customs, and Global CompetitivenessCommittee on the Judiciary (Chairman)Subcommittee on Antitrust, Competition Policy and Consumer RightsSubcommittee on Immigration and The National InterestSubcommittee on Oversight, Agency Action, Federal Rights and Federal CourtsCommittee on the BudgetCaucus on International Narcotics Control (Co-Chairman)Joint Committee on TaxationTenureIn November 1981, Grassley was one of thirty-two senators to sign a letter to President Reagan supporting Director of the Office of Management and Budget David Stockman.In August 1982, while the Reagan administration tried persuading senators to approve legislation authorizing the creation of a radio station for broadcasting to Cuba, Grassley joined fellow Iowa Senator Roger Jepsen and Edward Zorinsky in seeking an amendment to the bill so the Reagan administration would be barred from operating Radio Marti on that frequency or other commercial frequencies under the AM band.On November 1, 1984, Grassley signed a one-page citation of contempt of Congress against Attorney General William French Smith due to the latter not turning over files on an investigation into Navy shipbuilding. Assistant Attorney General Stephen S. Trott called the citation \"out of place\" since Grassley was not acting at a session of the Judiciary panel that he led.In May 1987, the Senate Appropriations Committee defeated an attempt by Grassley to hasten payments of corn and other feed grain subsidies ahead of the scheduled payment taking place after October 1. The Grassley measure was also designed to unravel an accounting device lawmakers used previously to make it appear as though they were reducing spending for the incoming fiscal year. In October, during a press briefing, Grassley accused President Reagan of being \"asleep at the switch\" and botching the handling of Robert Bork's Supreme Court nomination, adding that the Bork nomination had convinced him the Reagan administration \"has been terribly lucky for the last seven years\" in other matters including the economy and foreign policy. Later that month, Grassley likened the groups lobbying against Bork's nomination with the era of McCarthyism during the 1950s: \"The big lie is standard operating procedure for some of these groups. All you have to do is repeat the same outrageous charges, and repeat them so often that people believe they are true.\" In November, as party leaders of the Senate Judiciary Committee met on the Supreme Court nomination of Douglas H. Ginsburg, Grassley released the text of a letter he intended to send to the American Bar Association suggesting the association was dragging its feet in its review of Ginsburg's record. After Ginsburg admitted to previously smoking marijuana, Grassley said, \"You like to think people who are appointed to the Supreme Court respect the law.\" Grassley joined Jesse Helms in resisting the nomination of Anthony Kennedy, President Reagan's next choice for the Supreme Court, admitting that he would have preferred another candidate such as appeals court justices Pasco Bowman or J. Clifford Wallace. Grassley stated his distaste for \"the people who are committed to changing the judiciary\" taking \"the path of least resistance.\"In January 1989, as the Senate voted to schedule a vote within the following month on the pay increase, Grassley questioned how senators would decline federal program increases \"come March and April if the first thing out of the box is a pay raise?\" In February, Grassley was one of six senators to testify against the 50% pay increase scheduled to take effect the following week. In October, Grassley was one of nine senators to vote against legislation intended to outlaw flag burning and other forms of flag defacement and joined Bob Dole and Orrin Hatch, the other two Republicans to vote against the bill, in voicing a preference for a constitutional amendment.In July 1998, President Clinton listed Grassley among the members of Congress who had made it possible \"for me to sign into law today the Internal Revenue Service Restructuring and Reform Act.\"In May 2001, Grassley met with Democratic Senator Max Baucus over the allocation of finances in tax cuts and both reported they were making progress in reaching a bipartisan deal, Grassley adding that the bill would contain all four of the main elements proposed by the Bush administration and the Senate Finance Committee would modify the components of the Bush proposal.In August 2002, Grassley sent a letter to President and chief executive of the United Way of America Brian Gallagher requesting a detailed explanation on the overseeing of both finances and management of the organizaton's affiliates. Grassley also wrote to chief executive of the United Way of the National Capital Area Norman O. Taylor in regards to allegations of affiliates misappropriating money as well as withholding information the board needed to allow its conducting of oversight.As a senior member of the Senate Finance Committee, Grassley has spearheaded many probes into alleged misuse and lack of accountability of federal money. In July 2007, a Grassley-commissioned report was released claiming that more than US$1 billion in farm subsidies were sent to deceased individuals.  Grassley was called a \"Taxpayer Super Hero\" in 2014 by the Council for Citizens Against Government Waste, for his efforts to protect taxpayers.  He received a 100 percent rating from the group that year and has a lifetime rating of 78 percent. Grassley was ranked the 5th most bipartisan Senator of the 114th United States Congress and the 7th most bipartisan Senator in the first session of the 115th Congress by the Bipartisan Index, a metric created by The Lugar Center and Georgetown's McCourt School of Public Policy to rank members of the United States Congress by their degree of bipartisanship.In February 2004, Grassley released an internal report composed by the FBI in 2000 that examined 107 instances of either serious or criminal misconduct by its agents over a 16-year period. In a letter to the FBI, Grassley called the report \"a laundry list of horrors with examples of agents who committed rape, sexual crimes against children, other sexual deviance and misconduct, attempted murder of a spouse, and narcotics violations, among many others\" and added that the report's findings raised questions about whether the FBI handled agents \"soon enough and rigorously enough\".On June 28, 2006, Grassley proposed legislation intended to curb sex trafficking and sex slavery in the United States by means of strict enforcement of tax laws, for example by requiring a W-2 form be filed for each prostitute managed by a pimp or other employer.Since 1976, Grassley has repeatedly introduced measures that increase the level of taxation on American citizens living abroad, including retroactive tax hikes. Grassley was eventually able to attach an amendment to a piece of legislation that went into effect in 2006, which increased taxes on Americans abroad by targeting housing and living incentives paid by foreign employers and held them accountable for federal taxes, even though they did not currently reside in the United States. Critics of the amendment felt that the move hurt Americans competing for jobs abroad by putting an unnecessary tax burden on foreign employers. Others felt that the move was only to offset the revenue deficit caused by domestic tax cuts of the Bush Administration.In March 2009, amid a scandal that involved AIG executives receiving large salary bonuses from the taxpayer-funded bailout of AIG, Grassley suggested that those AIG employees receiving large bonuses should follow the so-called 'Japanese example', resign immediately or commit suicide. After some criticism, he dismissed the comments as rhetoric.In May 2009, Grassley cosponsored a resolution to amend the US Constitution to prohibit flag-burning.When President Barack Obama and the Democratic Party proposed a health reform bill featuring mandated health insurance, Grassley opposed the health insurance mandate, saying that it was a deal breaker.  In response to an audience question at an August 12, 2009, meeting in Iowa, about the end-of-life counseling provisions in the House health care bill, H.R. 3200, Grassley said people were right to fear that the government would \"pull the plug on grandma.\"  Grassley had previously supported covering end-of-life counseling, having voted for the Medicare Prescription Drug, Improvement, and Modernization Act of 2003, which stated: \"The covered services are: evaluating the beneficiary's need for pain and symptom management, including the individual's need for hospice care; counseling the beneficiary with respect to end-of-life issues and care options, and advising the beneficiary regarding advanced care planning.\"In December 2009, he voted against the Patient Protection and Affordable Care Act (commonly called ObamaCare or the Affordable Care Act).Grassley opposed the Manchin-Toomey gun control amendment, and instead proposed alternative legislation to increase prosecutions of gun violence and increase reporting of mental health data in background checks.In January 2010, Grassley was one of seven Senate Republicans to sign a letter warning the White House about their serious reservations with Director of the Transportation Security Administration nominee Erroll Southers due to conflicting accounts Southers gave the Senate about his previous tapping of  databases for information about his ex-wife's boyfriend in the late 1980s.As of December 2013, Grassley has cast 6,806 consecutive roll call votes, placing him second behind the all-time consecutive vote record holder, Senator William Proxmire (D-Wis). Grassley has not missed a roll call vote since 1993, when he was touring Iowa with President Bill Clinton to survey flood damage. He has, as of July 2012, cast almost 11,000 votes and had at that time only missed 35 votes in his Senate career.In June 2015, Grassley introduced legislation to help protect taxpayers from alleged abuses by the Internal Revenue Service. The legislation was proposed in response to recent events involving alleged inappropriate conduct by employees at the IRS but was opposed by Democrats.Since first taking office in 1981, Grassley has held public meetings in all of Iowa's 99 counties each year, even after losing honorarium payments for them in 1994. This has led to the coinage of the term \"full Grassley,\" to describe when a United States presidential candidate visits all 99 counties of Iowa before the Iowa caucuses.In July 2018, after President Trump nominated Brett Kavanaugh for Associate Justice, Grassley lauded Kavanaugh as \"one of the most qualified Supreme Court nominees to come before the Senate\", and said that critics of Kavanaugh should lessen their confidence in how he would vote given past surprises in voting by members of the Court.Political positionsAbortionGrassley has stated that he considers himself to be pro-life and has expressed concern regarding the potential for abortions to be paid for with federal funds. In December 1981, Grassley voted for a proposed constitutional amendment by Orrin Hatch that would allow both Congress and the states to ban or regulate abortion.Energy and environmentGrassley has expressed concern about the impact of regulations by the Environmental Protection Agency on farming.In September 2015, Grassley received the Dr. Harold D. Prior \"Friend of Iowa Wind Energy\" award from the Iowa Wind Energy Association for his commitment to supporting wind energy development in Iowa. Also in 1992, Grassley authored the federal wind energy tax credit. Grassley supports federal ethanol subsidies.Estate taxes“I think not having the estate tax recognizes the people that are investing, as opposed to those that are just spending every darn penny they have, whether it’s on booze or women or movies.”— Chuck Grassley, The HillGrassley is in favor of repealing the estate tax, which is a tax on inherited assets above $5.5 million for individuals and $11 million for couples. Grassley has argued that the estate is potentially ruinous for farmers and small business owners. According to the Des Moines Register, Grassley's argument does not \"match the reality found in federal tax data – particularly for Iowa. The estate tax applies to around 5,000 taxpayers across the entire country each year, and very few of them come from Iowa. Of the Iowans subject to the tax, only a fraction are actually farmers, and a vanishingly small number of them face a tax bill requiring them to sell off farmland or other assets... The number of small businesses impacted by the estate tax is similarly small... about 94 estates annually that hold half or more of their assets in a small business that heirs will continue to operate after the owners die. And fewer than half of these don’t have the cash on hand to pay the tax.\"Gun lawGrassley has an \"A\" rating from the National Rifle Association (NRA) for his consistent support of NRA-supported gun-related laws and ongoing sponsoring and authoring of legislature.Grassley is a staunch believer that gun laws will not prevent gun deaths or gun-related violence without improved mental health care.In 2016, one month after the Orlando nightclub shooting, Grassley proposed legislation to expand state-to-state access to background check data and to make it illegal for government officials to sell criminals guns as part of sting operations. Both proposals were rejected by the Senate. Additionally, he voted against the Democrat's Feinstein Amendment, which would make it illegal to sell guns to individuals on the terror watchlist and a Republican-sponsored bill that expanded funding for background checks.In early 2017, Grassley sponsored legislation that expanded access to mentally disabled individuals, claiming that the previous ban against mentally ill individuals purchasing guns \"mistreats disabled Americans.\"In response to the 2017 Las Vegas shooting, Grassley stated that it was unlikely that gun laws would change in the wake of the shooting due to Congress being Republican dominated.A day after the Douglas High School shooting in Parkland, Florida, Grassley claimed the government had not done enough to prevent individuals with a mental illness from obtaining firearms.Health careGrassley has been critical of the Affordable Care Act but does not believe the law can be completely repealed. He believes some degree of bipartisanship will be necessary to make changes to the law. He believes a solution will likely involve removing unpopular aspects of the law, like the individual mandate, while keeping popular aspects of it that deal with pre-existing conditions and the ability for children to remain on their parents' plans longer. Grassley believes that the Senate's version of the AHCA (the repeal of the ACA passed by the House), will provide health insurers certainty. Asked if not passing legislation would also provide certainty, he replied that it would, but at higher premiums. He said that with the proposed legislation premiums \"maybe wouldn't go up or would go up a heck of a lot less than they would without a bill.\"In July 2017, Grassley stated that Senate Republicans should be ashamed for not having passed their healthcare bill and this could translate to a loss of their majority in the 2018 elections.In August 2018, Grassley was one of ten Republican senators to cosponsor legislation intended to protect ObamaCare provisions for people with pre-existing conditions. Health experts said that the bill did not prevent insurers from excluding coverage for individuals with preexisting conditions.MarijuanaIn 2015, Grassley voiced his opposition to a bipartisan senate bill, The Compassionate Access, Research Expansion, and Respect States Act, that would move cannabis from Schedule I to Schedule II. This bill would allow states with medical cannabis laws to legally prescribe it and allow for much easier research into its medical efficacy.Russian interference in 2016 electionsIn February 2017, Grassley said that while Russian interference in U.S. elections was \"bothersome\", the United States did not have clean hands and had, for instance, interfered with the 1948 Italian election. In May 2017 after Trump fired FBI Director James Comey, Grassley advised people suspicious of the Trump administration to \"Suck it up and move on.\"On October 31, 2017, while a group of Republicans were facing questions from reporters concerning recent indictments, Grassley ignored the questions and left the room.In January 2018, and in the first known congressional criminal referral in the investigation into Russian interference in the 2016 election, Grassley, along with Lindsey Graham, recommended charges against Christopher Steele, one of the people who sought to expose Russian interference. Grassley and Graham said that they had reason to believe that Steele had lied to federal authorities. According to The New York Times, \"It was not clear why, if a crime is apparent in the F.B.I. reports that were reviewed by the Judiciary Committee, the Justice Department had not moved to charge Mr. Steele already. The circumstances under which Mr. Steele is alleged to have lied were unclear, as much of the referral was classified.\"In January 2018, when Grassley and Judiciary Committee Republicans were refusing to release the full transcript of an August 2017 ten-hour interview that the Judiciary Committee had conducted with Glenn Simpson, Senator Dianne Feinstein, the top Democrat on the Senate Judiciary Committee, released the full transcript unilaterally. Simpson is the co-founder of the political opposition research firm Fusion GPS, which produced the so-called Steele Dossier on alleged connections between Trump and Russia. Grassley condemned Feinstein, saying that her decision was \"confounding\" and that it deterred future witnesses in the Russia 2016 investigation. Simpson himself had requested that the full transcript of his interview be released, saying that Republicans had selectively leaked portions of the testimony to conservative media outlets in order to portray Simpson in a negative light and discredit the Steele dossier.WhistleblowersThe author of the Whistleblower Protection Act of 1989, Grassley has campaigned to increase protection and provide support for \"whistleblowers\". He has supported a number of FBI whistleblowers, including Coleen Rowley, Sibel Edmonds, and Jane Turner, although not supporting Department of Defense whistleblower Noel Koch.Grassley received a lifetime achievement award on May 17, 2007 from the National Whistleblower Center.In April 2014, Grassley announced plans to create a caucus in the Senate dedicated to strengthening whistleblower protections.WomenIn 2018, Grassley suggested that no women served on the Senate Judiciary Committee because the workload is heavy. The following week, Grassley added that he would \"'welcome more women'\" to serve on the Committee \"'because women as a whole are smarter than most male senators. And they work real hard, too.'\"", "Investigations": "Religious organizationsOn November 5, 2007, Grassley announced an investigation into the tax-exempt status of six ministries under the leadership of Benny Hinn, Paula White, Eddie L. Long, Joyce Meyer, Creflo Dollar, and Kenneth Copeland by the United States Senate Committee on Finance. In letters to each ministry, Grassley asked for the ministries to divulge specific financial information to the committee to determine whether or not funds collected by each organization were inappropriately utilized by ministry heads. By the December 6, 2007 deadline, only three of the ministries had shown compliance with the Finance Committee's request. On March 11, 2008, Grassley and Finance Chairman Max Baucus sent follow-up letters to Kenneth Copeland, Creflo Dollar and Eddie Long, explaining that the Senate reserved the right to investigate the finances of their organizations under federal tax laws.Medical researchGrassley also began an investigation about unreported payments to physicians by pharmaceutical companies.  Grassley led a 2008 Congressional Investigation which found that well-known university psychiatrists, who had promoted psychoactive drugs, had violated federal and university regulations by secretly receiving large sums of money from the pharmaceutical companies which made the drugs. The New York Times reported that Dr. Joseph Biederman of Harvard University had failed to report over a million dollars of income that he had received from pharmaceutical companies. Weeks later, Business Week reported that Grassley alleged that Alan Schatzberg, chair of psychiatry at Stanford University, had underreported his investments in Corcept Therapeutics, a company he founded. Schatzberg had reported only $100,000 investments in Corcept, but Grassley stated that his investments actually totalled over $6 million. Dr. Schatzberg later stepped down from his grant which is funded by the National Institutes of Health (NIH).Similarly, Dr. Charles Nemeroff resigned as chair of the psychiatry department at Emory University after failing to report a third of the $2.8 million in consulting fees he received from GlaxoSmithKline. At the time he received these fees, Nemeroff had been principal investigator of a $3.9 million NIH grant evaluating five medications for depression manufactured by GlaxoSmithKline.In 2008, for the first time, Grassley asked the American Psychiatric Association to disclose how much of its annual budget came from drug industry funds. The APA said that industry contributed 28% of its budget ($14 million at that time), mainly through paid advertising in APA journals and funds for continuing medical education.", "Political campaigns": "Grassley was elected to his Senate seat in 1980, defeating the Democratic incumbent, John Culver. He was reelected in 1986, 1992, 1998, 2004, 2010 and 2016; he is the longest-serving senator in Iowa history. In 1992 he won a third term with 69 percent of the vote even as Bill Clinton carried the state in the presidential election.2010Grassley sought a sixth term in the 2010 election.  He was challenged by Democrat Roxanne Conlin, a former United States Attorney, and Libertarian John Heiderscheit, an attorney.Grassley was unopposed in the Republican primary, although some conservatives said he has drifted \"too far to the left\". Among those is conservative activist Bill Salier, who said \"Grassley was the dominant force and had an enormous amount of loyalty. That has so eroded out from underneath him\" during an interview on WHO-AM radio.Grassley was reelected with 64.5% of the vote, Roxanne Conlin getting 33.2% of the vote.  He carried every county in the state except Johnson County, which hosts the University of Iowa.   He is only the second Iowan to serve six terms in the Senate; the other being Iowa's longest-serving senator, William B. Allison.2016Grassley sought a seventh term in the 2016 election.  Distinct from 2010, he was expected to face a strong challenge from former Democratic lieutenant governor Patty Judge, but he won his seventh term with over 60% of the vote as the Republican presidential candidate Donald Trump won the state with over 51% of the vote.FundraisingAccording to the nonpartisan Center for Responsive Politics in 2010, the industries that have been the largest contributors to Grassley during his political career are health professionals ($1 million in contributions),  insurance industry ($997,674), lawyers/law firms ($625,543) and pharmaceuticals/health products ($538,680).  His largest corporate donors have been Blue Cross Blue Shield insurance, Amgen biotech company and Wells Fargo bank.", "Electoral history": "United States Senate election in Iowa, 2016PartyCandidateVotes%±RepublicanChuck Grassley (inc.) 926,007 60.09% -4.26% DemocraticPatty Judge549,46035.66%+2.36%LibertarianJohn Heiderscheit41,7942.71%+0.44%IndependentJim Hennager17,6491.15%N/AIndependentMichael Luick-Thrams4,4410.29%N/AWrite-ins1,6860.11%+0.03%Majority376,54724.43%-6.62%Turnout1,541,037Republican holdSwingUnited States Senate election in Iowa, 2010PartyCandidateVotes%±RepublicanChuck Grassley (inc.) 718,215 64.35% -5.83% DemocraticRoxanne Conlin371,68633.30%+5.43%LibertarianJohn Heiderscheit25,2902.27%+1.24%Write-ins8720.08%+0.05%Majority346,52931.05%-11.26%Turnout1,116,063Republican holdSwingUnited States Senate election in Iowa, 2004PartyCandidateVotes%±RepublicanChuck Grassley (inc.) 1,038,175 70.18% +1.77% DemocraticArt Small412,36527.88%-2.62%LibertarianChristy Ann Welty15,2181.03%N/AGreenDaryl A. Northrop11,1210.75%N/ASocialist WorkersEdwin Fruit1,8740.13%-0.14%Write-ins4750.03%0%Majority625,81042.31%+4.39%Turnout1,479,228Republican holdSwingUnited States Senate election in Iowa, 1998PartyCandidateVotes%±RepublicanChuck Grassley (inc.) 648,480 68.41% -1.20% DemocraticDavid Osterberg289,04930.49%+3.29%Natural LawSusan Marcus7,5610.80%-0.47%Socialist WorkersMargaret Trowe2,5420.27%+0.16%Write-ins2750.03%+0.01%Majority359,43137.92%-4.50%Turnout947,907Republican holdSwingUnited States Senate election in Iowa, 1992PartyCandidateVotes%±RepublicanChuck Grassley (inc.) 899,761 69.61% +3.58% DemocraticJean Hall Lloyd-Jones351,56127.20%-6.37%Natural LawStuart Zimmerman16,4031.27%N/AIndependentSue Atkinson6,2770.49%N/AIndependentMel Boring5,5080.43%N/AIndependentRosanne Freeburg4,9990.39%N/AGrassrootsCarl Eric Olsen3,4040.26%N/AIndependentRichard O'Dell Hughes2,9180.23%N/ASocialist WorkersCleve Andrew Pulley1,3700.11%N/AWrite-ins2930.02%+0.01%Majority548,20042.41%+9.95%Turnout1,292,494Republican holdSwingUnited States Senate election in Iowa, 1986PartyCandidateVotes%±RepublicanChuck Grassley (inc.) 588,880 66.04% +12.55% DemocraticJohn P. Roehrick299,40633.57%-11.97%IndependentJohn Masters3,3700.38%N/AWrite-ins1060.01%+0.01%Majority289,47432.46%+24.51%Turnout891,762Republican holdSwingUnited States Senate election in Iowa, 1980PartyCandidateVotes%±RepublicanChuck Grassley 683,014 53.49% +4.21% DemocraticJohn Culver (inc.)581,54545.54%-4.48%IndependentGarry De Young5,8580.46%N/ALibertarianRobert V. Hengerer4,2330.33%N/AIndependentJohn Ingram Henderson2,3360.18%N/AWrite-ins480.00%+0%Majority101,4697.95%+7.20%Turnout1,772,983Republican gain from DemocraticSwingUnited States Senate Republican Primary election in Iowa, 1980PartyCandidateVotes%+%RepublicanChuck Grassley170,12065.54%RepublicanTom Stoner89,40934.45%1978 Iowa 3rd District United States Congressional ElectionChuck Grassley (R) (inc.) 74.8%John Knudson (D) 25.2%1976 Iowa 3rd District United States Congressional ElectionChuck Grassley (R) (inc.) 56%Stephen Rapp 44%1974 Iowa 3rd District United States Congressional ElectionChuck Grassley (R) 50.8%Stephen Rapp (D) 49.2%1974 Iowa 3rd District United States Congressional Republican  Primary ElectionChuck Grassley (R) 42%Robert Case (R) 28.2%Charlene Conklin (R) 18.8%Bart Schwieger (R) 6.6%John Williams (R) 4.4%1972 Iowa House of Representatives 37th District ElectionChuck Grassley (R) (inc.) 86.3%Tim Youngblood (D) 13.7%1970 Iowa House of Representatives 10th District ElectionChuck Grassley (R) (inc.) 62.7%Rollin Howell (D) 36.2%Colene Eliason (AI) 1.1%1966 Iowa House of Representatives Butler District ElectionChuck Grassley (R) (inc.) 69.2%Floyd Ramker (D) 30.8%1964 Iowa House of Representatives Butler District ElectionChuck Grassley (R) (inc.) 60.9%Beverly Moffitt (D) 39.1%1962 Iowa House of Representatives Butler District ElectionChuck Grassley (R) (inc.) 64.3%Vernon Garner (D) 35.7%1960 Iowa House of Representatives Butler District ElectionChuck Grassley (R) (inc.) 69.1%Vernon Garner (D) 30.9%1958 Iowa House of Representatives Butler District ElectionChuck Grassley (R) 64.1%Travis Moffitt (D) 35.9%", "Personal life": "Grassley married Barbara Ann Speicher on August 23, 1954; the couple have five children: Lee, Wendy, Robin, Michele, and Jay. Grassley is a member of The Family, the organization that organizes the National Prayer Breakfast. His grandson Pat Grassley is a member of the Iowa House of Representatives. Grassley is also known for his widely reported and long-running \"feud\" with The History Channel over its perceived lack of actual history programming.AwardsIn 2009, Grassley received the \"Health Policy Hero\" award from the National Research Center for Women & Families for his 2004 oversight of legislative reforms and accountability of the United States Food and Drug Administration (FDA). Grassley was also named the hardest working member of Congress by The Hill newspaper in June 2010, tied with Max Baucus.", "Further reading": "Eve Fairbanks, Earnest Goes to Washington, The New Republic, September 10, 2007", "introduction": "Charles Ernest Grassley (born September 17, 1933) is an American politician serving as the senior United States Senator from Iowa, a seat he was first elected to in 1980. A member of the Republican Party, he previously was a member of the Iowa House of Representatives (1959–1975) and of the United States House of Representatives (1975–1981). He chaired the Senate Finance Committee from January to June 2001, as well as from January 2003 to December 2006, and is now the current Chairman of the Judiciary Committee of the 115th Congress. \n\n"}, "personal": {"Born": "Charles Ernest Grassley (1933-09-17) September 17, 1933 (age85)New Hartford, Iowa, U.S.", "Political party": "Republican", "Spouse(s)": "Barbara Speicher (m.1954)", "Children": "5", "Education": "University of Northern Iowa (BA, MA)University of Iowa"}, "timeline": {"United States Senatorfrom Iowa": {"date": "Assumed office January 3, 1981Serving with Joni Ernst", "Preceded by": "John Culver"}, "Chair of the Senate Judiciary Committee": {"date": "Assumed office January 3, 2015", "Preceded by": "Patrick Leahy"}, "Chair of the Senate Narcotics Caucus": {"date": "Assumed office January 3, 2015", "Preceded by": "Dianne Feinstein"}, "Chair of the Senate Finance Committee": {"date": "In officeJanuary 20, 2001– June 6, 2001", "Preceded by": "Max Baucus", "Succeeded by": "Max Baucus"}, "Chair of the Senate Aging Committee": {"date": "In officeJanuary 3, 1997– January 3, 2001", "Preceded by": "William Cohen", "Succeeded by": "John Breaux"}, "Member of the US House of Representativesfrom Iowa's 3rd district": {"date": "In officeJanuary 3, 1975– January 3, 1981", "Preceded by": "H. R. Gross", "Succeeded by": "Cooper Evans"}, "Member of the Iowa House of Representativesfrom the 37th district": {"date": "In officeJanuary 8, 1973– January 3, 1975", "Preceded by": "Bill Hansen", "Succeeded by": "Raymond Lageschulte"}, "Member of the Iowa House of Representativesfrom the 10th district": {"date": "In officeJanuary 11, 1971– January 8, 1973", "Preceded by": "William Harbor", "Succeeded by": "Richard Welden"}, "Member of the Iowa House of Representativesfrom the 73rd district": {"date": "In officeJanuary 12, 1959– January 11, 1971", "Preceded by": "Wayne Ballhagen", "Succeeded by": "John Camp"}}, "code": "G000386", "type": "3", "party": "Republican", "description": "moderate Republican leader", "economic": "0.34", "social": "-0.07", "leadership": "0.95"}