{"name": "Dennis.Heck", "picture": "H001064.jpg", "detail": {"Early life, education, and business career": "Heck was born in Vancouver, Washington in 1952, and raised in the Lake Shore area of Clark County where he graduated from Columbia River High School. He graduated from The Evergreen State College in Olympia in 1973.Heck was the co-founder and from 1999 to 2012 was board director of Intrepid Learning Solutions, a company specializing in business oriented education and training programs. He helped found Digital Efficiency which specializes in aiding businesses and medical facilities in transferring toward an all digital format. Heck helped found TVW, the public affairs network for the state. TVW provides coverage of the Washington State Legislature and sessions of the Washington Supreme Court.Heck is the author of Challenges and Opportunities:  The Transformation of Washington's Schools, published in 1987.", "Washington House of Representatives": "Starting in 1976, Heck was elected to five terms in the Washington House of Representatives, representing the 17th Legislative District in Clark, Skamania, and Klickitat Counties. During that time he was elected Majority Leader, the second-ranking position in the House. He also co-chaired the Education Committee and wrote the state’s historic Basic Education Act.Heck served as Chief of Staff for Governor Booth Gardner during his second term (1989–93).", "US House of Representatives": "Elections 2010Heck announced his candidacy to replace the retiring Democratic incumbent Brian Baird. He won the primary with 31% of the vote and faced runner-up Republican Jaime Herrera, who won 28% of the vote.Heck was endorsed by the Seattle Post-Intelligencer on October 12, 2010. Herrera defeated Heck in the general election, 53% to 47%.2012Heck indicated in the spring of 2011 that he would run for Congress again in 2012.  Soon after the state's redistricting commission announced tentative maps, Heck announced that he was running for the newly created 10th District, based in Olympia. In the general election on November 6, 2012, Heck defeated Republican challenger Dick Muri to become the district's first congressman.Committee assignments House Permanent Select Committee on Intelligence Committee on Financial ServicesSubcommittee on Financial Institutions and Consumer CreditSubcommittee on Oversight and InvestigationsMarijuana Business Access to Banking Act of 2015 Heck introduced H.R. 2076, the Marijuana Business Access to Banking Act of 2015, into the U.S. House of Representatives on April 28, 2015. The bill's goal is to create protections for depository institutions that provide financial services to marijuana-related businesses. It is co-sponsored by Ed Perlmutter and 16 other Republican and Democratic representatives.Caucus memberships New Democrat CoalitionCongressional Arts Caucus", "Electoral history": "District #17 Representative #1 Election Results (1976-1984)YearDemocratVotesPct.RepublicanVotesPct.1984Dennis L. Heck21,13066.50%Steve Moore10,64533.50%1982Dennis L. Heck15,08064.48%Suzanne Taylor-Moore8,30835.52%1980Dennis L. Heck28,30271.64%Elizabeth G. Spires11,20228.36%1978Dennis L. Heck16,48669.37%David H. Miller7,27830.63%1976Dennis L. Heck17,99859.15%Eddie McAninch12,42840.85%", "Personal life": "Heck and his wife Paula Fruci, married since 1976, have two sons.Heck wrote and self-published a mystery novel entitled The Enemy You Know. In 2008, he wrote and performed a one-man play, Our Times to several sold out audiences.[citation needed] He and his wife, Paula, who directed the play, donated all proceeds to local charities.Heck has supported numerous organizations within Washington, both actively and as a past contributor. He currently serves on the Board of Trustees for Evergreen State College. He serves on the Board for the Washington State History Museum. He is a member of the Steering Committee for the Washington Learns Commission; a long-term strategy to improve the education system of Washington.", "Works": "Dennis L. Heck, Challenges and Opportunities: The Transformation of Washington's Schools, Advance Washington (1987)", "introduction": "Dennis Lynn \"Denny\" Heck (born July 29, 1952) is an American politician who has been the United States Representative for Washington's 10th congressional district since 2013. The district is based in the state capital of Olympia, and also includes much of eastern Tacoma.\nHeck was previously the Democratic nominee for U.S. Representative for the 3rd district in 2010, but was defeated by Jaime Herrera Beutler, a Republican. In 2012 Heck ran and won in the newly created 10th district, defeating Republican Dick Muri.\nHeck served as Chief of Staff to Washington Governor Booth Gardner from 1990 to 1993.  Previously, he was Majority Leader of the Washington State House of Representatives and Chief Clerk of the House.  He founded and served as CEO of TVW, the state equivalent of C-SPAN.  From 1999 to 2012, he served on the board of directors of Intrepid Learning Solutions, which he co-founded with Christopher Hedrick.\n\n", "code": "10"}, "personal": {"Born": " (1952-07-29) July 29, 1952 (age66)Vancouver, Washington, U.S.", "Political party": "Democratic", "Spouse(s)": "Paula Fruci", "Children": "2", "Education": "Evergreen State College (BA)Portland State University"}, "timeline": {"Member of the US House of Representativesfrom Washington's 10th district": {"date": "Assumed office January 3, 2013", "Preceded by": "Constituency established"}, "Member of the Washington House of Representativesfrom the 17th district": {"date": "In officeJanuary 10, 1977– January 11, 1985", "Preceded by": "Eugene Laughlin", "Succeeded by": "Kim Peery"}, "code": "10"}, "code": "H001064", "type": "4", "party": "Democrat", "description": "rank-and-file Democrat", "economic": "-0.31", "social": "-0.12", "leadership": "0.44"}