{"name": "Dianne.Feinstein", "picture": "F000062.jpg", "detail": {"Early life and education": "Feinstein was born Dianne Emiel Goldman in San Francisco, to Betty (née Rosenburg), a former model, and Leon Goldman, a surgeon. Feinstein's paternal grandparents were Jewish immigrants from Poland. Her maternal grandparents, the Rosenburg family, were from Saint Petersburg, Russia. While they were of German-Jewish ancestry, they practiced the Russian Orthodox faith, as was required for Jews residing in Saint Petersburg.Feinstein graduated from Convent of the Sacred Heart High School, San Francisco in 1951 and from Stanford University in 1955 with a Bachelor of Arts in History.", "Early political career": "Prior to elected service, Feinstein was appointed by then-California Governor Pat Brown to serve as a member of the California Women's Parole Board. Feinstein also served as a fellow at the Coro Foundation in San Francisco.President of the San Francisco Board of SupervisorsIn 1969, Feinstein was elected to the San Francisco Board of Supervisors. She remained on the Board for nine years.During her tenure on the Board of Supervisors, she unsuccessfully ran for mayor of San Francisco twice, in 1971 against mayor Joseph Alioto, and in 1975, when she lost the contest for a runoff slot (against George Moscone) by one percentage point, to supervisor John Barbagelata.Because of her position, Feinstein became a target of the New World Liberation Front, an anti-capitalist and terrorist group which carried out bombings in California in the 1970s.  The NWLF placed a bomb on the windowsill of the Feinstein home, which failed to explode. They later shot out the windows of a beach house she owned.She was elected president of the San Francisco Board of Supervisors in 1978 with initial opposition from Quentin Kopp.On November 27, 1978, Moscone and supervisor Harvey Milk were assassinated by a rival politician, Dan White, who had resigned from the Board of Supervisors two weeks earlier. Feinstein was in City Hall at the time of the shootings and discovered Milk's body after hearing the shots. Later that day Feinstein announced the assassinations to the public.As President of the Board of Supervisors upon the death of Moscone, Feinstein succeeded to the mayoralty on December 4, 1978.Mayor of San FranciscoFeinstein served out the remainder of Moscone's term and was elected in her own right in 1979. She was re-elected in 1983 and served a full second term.One of Feinstein's first challenges as mayor was the state of the San Francisco cable car system, which had been shut down for emergency repairs in 1979; an engineering study concluded that it needed comprehensive rebuilding at a cost of $60 million. Feinstein helped win federal funding for the bulk of the work. The system closed for rebuilding in 1982 and the work was completed just in time for the 1984 Democratic National Convention. Feinstein also oversaw planning policies to increase the number of high-rise buildings in San Francisco.Feinstein was seen as a relatively moderate Democrat in one of the country's most liberal cities. As a supervisor, she was considered part of the centrist bloc that included Dan White and was generally opposed to Moscone. As mayor, Feinstein angered the city's large gay community by refusing to march in a gay rights parade and by vetoing domestic partner legislation in 1982. In the 1980 presidential election, while a majority of Bay Area Democrats continued to support Senator Ted Kennedy's primary challenge to President Jimmy Carter even after it was clear Kennedy could not win, Feinstein was a strong supporter of the Carter–Mondale ticket. She was given a high-profile speaking role on the opening night of the August Democratic National Convention, urging delegates to reject the Kennedy delegates' proposal to \"open\" the convention, thereby allowing delegates to ignore their states' popular vote, a proposal that was soundly defeated.In the run-up to the 1984 Democratic National Convention, there was considerable media and public speculation that Mondale might pick Feinstein as his running mate. However, he chose Geraldine Ferraro instead. Also in 1984, Feinstein proposed banning handguns in San Francisco, and became subject to a recall attempt organized by the White Panther Party. She won the recall election and finished her second term as mayor on January 8, 1988.In 1985, at a press conference, Feinstein revealed details about the hunt for serial killer Richard Ramírez, and in so doing angered detectives by giving away details of his crimes.In 1987, City and State magazine named Feinstein the nation's \"Most Effective Mayor\". Feinstein served on the Trilateral Commission during the 1980s while mayor of San Francisco.Gubernatorial electionIn 1990, Feinstein made an unsuccessful bid for Governor of California. Although she won the Democratic Party's nomination for the office, she lost in the general election to Republican Senator Pete Wilson, who vacated his seat in the Senate to assume the governorship. In 1992, she was fined $190,000 for failure to properly report campaign contributions and expenditures associated with that campaign.", "US Senate career": "ElectionsOn November 3, 1992, Feinstein won a special election to fill the Senate seat vacated a year earlier when Senator Pete Wilson resigned to become governor. The election was held at the same time as the general election for U.S. President and other offices. Barbara Boxer was elected at the same time for the Senate seat to be vacated by Alan Cranston. Because Feinstein was elected to an unexpired term, she became a senator as soon as the election was certified in November while Boxer would not take office until the expiration of Cranston's term in January; thus Feinstein became California's senior senator, even though she was elected at the same time as Boxer and Boxer had previous congressional service. Feinstein also became the first female Jewish senator in the United States, though Boxer was also Jewish. Feinstein and Boxer were also the first female pair of U.S. Senators representing any state at the same time. Feinstein was re-elected in 1994, 2000, 2006, and 2012. In 2012, Feinstein claimed the record for the most popular votes in any U.S. Senate election in history, having received 7.75 million votes. The record was previously held by her California colleague Barbara Boxer, who received 6.96 million votes in her 2004 re-election.Approval ratingsSourceDateApproveDisapproveUndecidedSurvey USAJanuary 17, 201143%48%10%Public Policy Polling at the Wayback Machine (archived May 15, 2011)February 2, 201150%39%11%The Field PollFebruary 2, 201148%33%19%The Field PollJune 21, 201146%31%23%The Field PollSeptember 16, 201141%39%20%Public Policy PollingNovember 16, 201151%38%11%CommitteesCommittee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related AgenciesSubcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on DefenseSubcommittee on Energy and Water Development (Ranking Member)Subcommittee on Interior, Environment, and Related AgenciesSubcommittee on Transportation, Housing and Urban Development, and Related AgenciesCommittee on the Judiciary (Ranking Member, 115th Congress)Subcommittee on Crime and TerrorismSubcommittee on Immigration, Border Security, and RefugeesSubcommittee on Privacy, Technology and the LawCommittee on Rules and AdministrationSelect Committee on IntelligenceCaucus membershipsAfterschool CaucusesCongressional NextGen 9-1-1 CaucusPolitical positionsAccording to the Los Angeles Times, Feinstein emphasized her centrism when she first ran for statewide offices in the 1990s, at a time when California was more conservative. Over time, she has moved further to the left, at the same time as California became one of the most Democratic states.MilitaryOn June 13, 1994, while delivering the commencement address at Stanford Stadium, Feinstein said,.mw-parser-output .templatequote{overflow:hidden;margin:1em 0;padding:0 40px}.mw-parser-output .templatequote .templatequotecite{line-height:1.5em;text-align:left;padding-left:1.6em;margin-top:0}It is time for a rational plan for defense conversion instead of the random closing of bases and the piecemeal cancellation of defense contracts. Otherwise, we risk losing, for both state and nation, the greatest resources of scientific, technical and human capital ever gathered together in human history.In 2017, Feinstein criticized the banning of transgender enlistments in the military under the Trump administration.National securityIn 2012, Feinstein voted for the extension of the Patriot Act and the FISA provisions.Health careFeinstein has supported the Affordable Care Act, repeatedly voting to defeat initiatives aimed against it.She has voted for regulating tobacco as a drug; expanding the Children's Health Insurance Program; overriding the president's veto on adding 2 to 4 million children to SCHIP eligibility; increasing Medicaid rebate for producing generic drugs; negotiating bulk purchases for Medicare prescription drugs; allowing re-importation of Rx drugs from Canada; allowing patients to sue HMOs & collect punitive damages; including prescription drugs under Medicare; Medicare means-testing; etc. She has voted against the Paul Ryan Budget's Medicare choice, tax & spending cuts; allowing tribal Indians to opt out of federal healthcare; etc. Feinstein's Congress voting record was assessed as \"88%\" by the American Public Health Association (APHA), the figure ostensibly reflecting the percentage of time the representative voted the organization's preferred position.In an April 2017 town hall meeting in San Francisco, Feinstein stated thatIf single-payer health care is going to mean the complete takeover by the government of all health care, I am not there.In July 2017, during a news conference at the University of California, San Diego, Feinstein estimated that Democratic opposition would prove sufficient to defeat Republican attempts to repeal the Affordable Care Act.In August 2017, Feinstein wrote in an op-ed that President Trump could secure health care reform if he was willing to compromise with Democrats: \"We now know that such a closed process on a major issue like health care doesn't work. The only path forward is a transparent process that allows every senator to bring their ideas to the table.\"Capital punishmentWhen Feinstein in 1990 first ran for statewide office, she favored capital punishment. By 2018, she opposed capital punishment.Clean-fuel subsidiesFeinstein co-sponsored (along with Tom Coburn, an Oklahoman Republican) an amendment through the Senate to the Economic Development Revitalization Act of 2011 that eliminated the Volumetric Ethanol Excise Tax Credit. The Senate passed the amendment on June 16, 2011. Introduced in 2004, the subsidy provided a 45-cent-per-gallon credit on pure ethanol, and a 54-cent-per-gallon tariff on imported ethanol. These subsidies had resulted in an annual expenditure of $6 billion.Supreme Court nominationsIn September 2005, Feinstein was one of five Democratic senators to vote against Supreme Court nominee John Roberts on the Senate Judiciary Committee, saying she still was not aware of Roberts' stances on certain issues such as abortion and the right to death.In January 2006, Feinstein confirmed she would vote against Supreme Court nominee Samuel Alito, though disagreed with filibustering the choice: \"When it comes to filibustering a Supreme Court appointment, you really have to have something out there, whether it's gross moral turpitude or something that comes to the surface. This is a man I might disagree with, (but) that doesn't mean he shouldn't be on the court.\"On July 12, 2009, Feinstein stated her belief that Sonia Sotomayor was assured for confirmation by the U.S. Senate and praised her for her experience and overcoming \"adversity and disadvantage\".After President Obama nominated Merrick Garland for the Supreme Court in March 2016, Feinstein met with Garland on April 6, and subsequently called on Republicans to do \"this institution the credit of sitting down, and meeting with him\".In February 2017, Feinstein requested Supreme Court nominee Neil Gorsuch provide information on cases in which he had assisted with decision making regarding either litigation or craft strategy. In mid-March, Feinstein sent a letter to Gorsuch stating her request had not been followed up on. Feinstein formally announced her opposition to his nomination on April 3, citing Gorsuch's \"record at the Department of Justice, his tenure on the bench, his appearance before the Senate and his written questions for the record\".Weapons salesIn September 2016, Feinstein backed the Obama administration's plan to sell more than $1.15 billion worth of weapons to Saudi Arabia.Mass surveillance; citizens' privacyOn May 12, 2011, Feinstein co-sponsored PIPA. In January 2012, Feinstein met with representatives of technology companies, including Google and Facebook. According to a spokesperson, Feinstein \"is doing all she can to ensure that the bill is balanced and protects the intellectual property concerns of the content community without unfairly burdening legitimate businesses such as Internet search engines\".Following her 2012 vote to extend the Patriot Act and the FISA provisions, and after the 2013 mass surveillance disclosures involving the National Security Agency (NSA), Feinstein promoted and supported measures to continue the information collection programs. Foreign Policy wrote that she had a \"reputation as a staunch defender of NSA practices and [of] the White House's refusal to stand by collection activities targeting foreign leaders\".In October 2013, she criticized the NSA for monitoring telephone calls of foreign leaders friendly to the US. In November 2013, she promoted the FISA Improvements Act bill which included a \"backdoor search provision\" that allows intelligence agencies to continue certain warrantless searches as long as they are logged and \"available for review\" to various agencies.In June 2013, Feinstein labeled Edward Snowden a \"traitor\" after his leaks went public. In October of the same year, she stated that she stood by those comments.While praising the NSA, Feinstein had accused the CIA of snooping and removing files through Congress members' computers, stating, \"The CIA did not ask the committee or its staff if the committee had access to the internal review or how we obtained it. Instead, the CIA just went and searched the committee's computer.\"  She claimed the \"CIA's search may well have violated the separation of powers principles embodied in the United States Constitution\".After the 2016 FBI–Apple encryption dispute, Feinstein, along with Richard Burr, sponsored a bill that would be likely to criminalize all forms of strong encryption in electronic communication between citizens. The bill would require technology companies to design their encryption so that they can provide law enforcement with user data in an \"intelligible format\" when required to do so by court order.Assault weapons banFeinstein introduced the Federal Assault Weapons Ban, which became law in 1994 and expired in 2004. In January 2013, about one month after the Sandy Hook Elementary School shooting, Feinstein, along with Representative Carolyn McCarthy from New York, proposed a bill that would \"ban the sale, transfer, manufacturing or importation of 150 specific firearms including semiautomatic rifles or pistols that can be used with a detachable or fixed ammunition magazines that hold more than 10 rounds and have specific military-style features, including pistol grips, grenade launchers or rocket launchers\". The bill would have exempted 900 models of guns used for sport and hunting. Feinstein commented on the bill, saying, \"The common thread in each of these shootings is the gunman used a semi-automatic assault weapon or large capacity ammunition magazines. Military assault weapons only have one purpose, and in my opinion, it's for the military.\" The bill failed on a Senate vote of 60 to 40.Medical marijuanaFeinstein voted in support of legislation to override a Department of Veterans Affairs' prohibition on allowing doctors to recommend cannabis to veterans in states that sanction its use as a medicine. The legislation was approved by the Senate Appropriations Committee on May 21, 2015. However, she was the only Democrat who joined a minority of Republicans in voting against a measure designed to prevent federal interference with states' medical marijuana laws. However, that legislation passed with a 21-9 vote on June 18, 2015.ImmigrationIn September 2017, after Attorney General Jeff Sessions announced the rescinding of the Deferred Action for Childhood Arrivals program, Feinstein admitted the legality of the program was questionable while citing this as a reason for why a law should be passed. In January 2018, in her opening remarks to a Senate Judiciary Committee hearing, Feinstein said she was concerned there might be racial motivation in the choice by the Trump administration to terminate the temporary protected status, based on comments he made denigrating African countries as well as Haiti and El Salvador.IranIn July 2015, Feinstein announced her support for the Iran nuclear deal framework, tweeting that the deal would usher in \"unprecedented & intrusive inspections to verify cooperation\" on the part of Iran.On June 7, 2017, Feinstein and Senator Bernie Sanders issued dual statements urging the Senate to forgo a vote for sanctions on Iran in response to the Tehran attacks that occurred earlier in the day.North KoreaIn July 2017, during an appearance on Face the Nation after North Korea conducted a second test of an intercontinental ballistic missile, Feinstein said the country had proven itself to be a danger to the US and stated her disappointment with the lack of response from China.On August 8, 2017, in response to reports that North Korea had achieved successful miniaturization of nuclear warheads, Feinstein issued a statement insisting isolation of North Korea had proven ineffective and President Trump's rhetoric was not aiding in the resolve of potential conflict, additionally calling for the US to \"quickly engage North Korea in a high-level dialogue without any preconditions\".In September 2017, following President Trump delivering his first speech to the United Nations General Assembly in which he threatened North Korea, Feinstein released a statement disagreeing with his remarks: \"Trump's bombastic threat to destroy North Korea and his refusal to present any positive pathways forward on the many global challenges we face are severe disappointments.\"ChinaFeinstein supports a conciliatory approach between China and Taiwan and fostered increased dialogue between high-level Chinese representatives and U.S. senators during her first term as senator. When asked about her relation with Beijing, Feinstein said, I sometimes say that in my last life maybe I was Chinese.Feinstein has criticized Beijing's missile tests near Taiwan and has called for dismantlement of missiles pointed at the island. She promoted stronger business ties between China and Taiwan over confrontation, and suggested that the U.S. patiently \"use two-way trade across Taiwan Strait as a platform for more political dialogue and closer ties.\"She believes that deeper cross-strait economic integration \"will one day lead to political integration and will ultimately provide the solution\" to the Taiwan issue.On July 27, 2018, reports surfaced that a Chinese staff member who worked as Feinstein's personal driver, gofer and liaison to the Asian-American community for 20 years, was caught reporting to China's Ministry of State Security. According to the reports, Feinstein was contacted by the FBI five years ago warning her about the suspected employee. The employee was later interviewed by authorities and forced to retire by Feinstein. No criminal charges were filed against the individual.TortureFeinstein has served on the Senate's Select Committee on Intelligence since before 9/11 and her time on the committee has coincided with the Senate Report on Pre-war Intelligence on Iraq and the debates on the torture/\"enhanced interrogation\" of terrorists and alleged terrorists.Speaking on the Senate floor on December 9, 2014, the day parts of the Senate Intelligence Committee report on CIA torture were released to the public, Feinstein called the government's detention and interrogation program a \"stain on our values and on our history\", following the release of 600 pages declassified out of a 6000-page report about CIA methods.Wikisource has original text related to this article:Senate Judiciary Committee Interview of Glenn SimpsonFusion GPS interview transcript releaseOn January 9, 2018, Feinstein caused a stir when she, as ranking member of the Senate Judiciary Committee, released a transcript of the committee's August 2017 interview with Fusion GPS co-founder Glenn Simpson about the dossier regarding connections between the president's campaign and the Russian government. She did this unilaterally after the committee's chairman, Chuck Grassley, refused to release the transcript of Simpson's testimony.Presidential politicsAs a superdelegate in the 2008 Democratic presidential primaries, Feinstein had declared that she would support Hillary Clinton for the Democratic presidential nomination. However, once Barack Obama became the presumptive nominee for the party, she fully backed his candidacy. Days after Obama amassed enough delegates to win the Democratic Party nomination, Feinstein lent her Washington, D. C., home to both Clinton and Obama to have a private one-on-one meeting.Feinstein did not attend the 2008 Democratic National Convention in Denver because she had fallen and broken her ankle earlier in the month.She chaired the United States Congress Joint Committee on Inaugural Ceremonies, and acted as mistress of ceremonies, introducing each participant at the 2009 presidential inauguration.Heading into the 2016 Presidential Election, Senator Feinstein was one of sixteen Democratic female senators to sign a letter, on October 20, 2013, endorsing Hillary Clinton to be the Democratic nominee.", "Awards and honors": "On 4 June 1977, Dianne Feinstein was awarded the Honorary degree of Doctor of Laws from Golden Gate University in San Francisco.She was awarded the Legion of Honour by France in 1984.Feinstein was presented with the Woodrow Wilson Award for public service by the Woodrow Wilson Center of the Smithsonian Institution on November 3, 2001, in Los Angeles.In 2002, Feinstein won the American Medical Association's Nathan Davis Award for \"the Betterment of the Public Health\".In 2015, she was named as one of The Forward 50.", "Offices held": "Public officesOfficeTypeLocationElectedTerm beganTerm endedMayorExecutiveSan FranciscoN/ADecember 4, 1978January 8, 1980MayorExecutiveSan Francisco1979January 8, 1980January 8, 1984MayorExecutiveSan Francisco1983January 8, 1984January 8, 1988SenatorLegislatureWashington, D.C.1992November 4, 1992January 3, 1995SenatorLegislatureWashington, D.C.1994January 3, 1995January 3, 2001SenatorLegislatureWashington, D.C.2000January 3, 2001January 3, 2007SenatorLegislatureWashington, D.C.2006January 3, 2007January 3, 2013SenatorLegislatureWashington, D.C.2012January 3, 2013OngoingUnited States Senate serviceDatesCongressChamberMajorityPresidentCommitteesClass1993–1995103rdU.S. SenateDemocraticBill ClintonAppropriations, Judiciary, Rules11995–1997104thU.S. SenateRepublicanBill ClintonForeign Relations, Judiciary, Rules11997–1999105thU.S. SenateRepublicanBill ClintonAppropriations, Judiciary, Rules11999–2001106thU.S. SenateRepublicanBill ClintonAppropriations, Judiciary, Rules12001–2003107thU.S. SenateDemocraticGeorge W. BushAppropriations, Judiciary, Energy, Rules, Intelligence12003–2005108thU.S. SenateRepublicanGeorge W. BushAppropriations, Judiciary, Energy, Rules, Intelligence12005–2007109thU.S. SenateRepublicanGeorge W. BushAppropriations, Judiciary, Energy, Rules, Intelligence12007–2009110thU.S. SenateDemocraticGeorge W. BushAppropriations, Judiciary, Rules (chair), Intelligence12009–2011111thU.S. SenateDemocraticBarack ObamaAppropriations, Judiciary, Rules, Intelligence (chairwoman)12011–2013112thU.S. SenateDemocraticBarack ObamaAppropriations, Judiciary, Rules, Intelligence (chairwoman)12013–2015113thU.S. SenateDemocraticBarack ObamaAppropriations, Judiciary, Rules, Intelligence (chairwoman)12015–2017114thU.S. SenateRepublicanBarack ObamaAppropriations, Judiciary, Rules, Intelligence (vice-chair)12017–2019115thU.S. SenateRepublicanDonald TrumpAppropriations, Judiciary (Ranking Member), Rules, Intelligence1", "Personal life": "Feinstein has been married three times. In 1956, Feinstein married Jack Berman (d. 2002), who was then working in the San Francisco District Attorney's Office. She and Berman divorced three years later. Their daughter, Katherine Feinstein Mariano (b. 1957), was the presiding judge of the San Francisco Superior Court for twelve years, through 2012. In 1962, shortly after beginning her career in politics, Feinstein married her second husband, neurosurgeon Bertram Feinstein, who died of colon cancer in 1978. In 1980, Feinstein married Richard C. Blum, an investment banker. In 2003, Feinstein was ranked the fifth-wealthiest senator, with an estimated net worth of US$26 million. By 2005, her net worth had increased to between US$43 million and US$99 million. Her 347-page financial-disclosure statement – characterized by the San Francisco Chronicle as \"nearly the size of a phone book\" – draws clear lines between her assets and those of her husband, with many of her assets in blind trusts.In January 2017, Feinstein had an artificial cardiac pacemaker inserted at George Washington University Hospital.", "Additional sources": "Roberts, Jerry (1994). Dianne Feinstein: Never Let Them See You Cry, Harpercollins. ISBN 0-06-258508-8Talbot, David (2012). Season of the Witch: Enchantment, Terror and Deliverance in the City of Love, New York: Simon and Schuster. 480 p. ISBN 978-1-4391-0821-5.Weiss, Mike (2010). Double Play: The Hidden Passions Behind the Double Assassination of George Moscone and Harvey Milk, Vince Emery Productions. ISBN 978-0-9825650-5-6", "introduction": "Dianne Goldman Berman Feinstein (/ˈfaɪnstaɪn/; born Dianne Emiel Goldman, June 22, 1933) is an American politician serving as the senior United States Senator from California, a seat she has held since 1992. A member of the Democratic Party, she previously was Mayor of San Francisco from 1978 to 1988.\nBorn in San Francisco, Feinstein graduated from Stanford University in 1955 with a Bachelor of Arts in history. In the 1960s, she worked in city government, and in 1969, she was elected to the San Francisco Board of Supervisors. She served as the board's first female president in 1978, during which time the assassinations of Mayor George Moscone and City Supervisor Harvey Milk drew national attention. Feinstein succeeded Moscone as Mayor of San Francisco and became the first woman to assume the position. During her tenure, she led renovation of the city's cable car system, and oversaw the 1984 Democratic National Convention.\nAfter a failed gubernatorial campaign in 1990, she won a 1992 special election to the U.S. Senate. Feinstein was first elected on the same ballot as her peer Barbara Boxer, and the two became California's first female U.S. Senators. Feinstein has been re-elected four times since then and in the 2012 election, she claimed the record for the most popular votes in any U.S. Senate election in history, having received 7.75 million votes.\nFeinstein was the author of the 1994 Federal Assault Weapons Ban which expired in 2004. In 2013, she introduced a new assault weapons bill, which failed to pass. Feinstein is the first and only woman to have chaired the Senate Rules Committee (2007–2009) and the Select Committee on Intelligence from 2009 to 2015, when the Democrats lost control of the Senate. She is the only woman to have presided over a U.S. presidential inauguration. At the age of 85, Feinstein is the oldest currently serving United States Senator. With the retirement of Barbara Mikulski, Feinstein is the longest current-serving female U.S. Senator. In October 2017, Feinstein officially declared her intention to run for re-election in 2018, though she subsequently lost the endorsement of the California Democratic Party for the 2018 general election, in favor of State Senator Kevin de León.\n\n"}, "personal": {"date": "BornDianne Emiel Goldman (1933-06-22) June 22, 1933 (age 85)San Francisco, California, U.S.", "Political party": "Democratic", "Spouse(s)": "Jack Berman(m.1956; div.1959)Bertram Feinstein(m.1962; d.1978)Richard C. Blum (m.1980)", "Children": "Katherine Feinstein", "Education": "Stanford University (BA)"}, "timeline": {"United States Senatorfrom California": {"date": "Assumed office November 4, 1992Serving with Kamala Harris", "Preceded by": "John Seymour"}, "Ranking Member of the Senate Judiciary Committee": {"date": "Assumed office January 3, 2017", "Preceded by": "Patrick Leahy"}, "Vice Chair of the Senate Intelligence Committee": {"date": "In officeJanuary 3, 2015– January 3, 2017", "Preceded by": "Saxby Chambliss", "Succeeded by": "Mark Warner"}, "Chair of the Senate Intelligence Committee": {"date": "In officeJanuary 3, 2009– January 3, 2015", "Preceded by": "Jay Rockefeller", "Succeeded by": "Richard Burr"}, "Chair of the Senate Narcotics Caucus": {"date": "In officeJanuary 3, 2009– January 3, 2015", "Preceded by": "Joe Biden", "Succeeded by": "Chuck Grassley"}, "Chair of the Senate Rules Committee": {"date": "In officeJanuary 3, 2007– January 3, 2009", "Preceded by": "Trent Lott", "Succeeded by": "Chuck Schumer"}, "38th Mayor of San Francisco": {"date": "In officeDecember 4, 1978– January 8, 1988", "Preceded by": "George Moscone", "Succeeded by": "Art Agnos"}, "Member of the San Francisco Board of Supervisors": {"date": "In officeJanuary 8, 1970– December 4, 1978", "Preceded by": "William Blake", "Succeeded by": "Louise Renne", "Constituency": "At-large district (1970–1978)2nd district (1978)"}}, "code": "F000062", "type": "3", "party": "Democrat", "description": "moderate Democratic leader", "economic": "-0.27", "social": "-0.21", "leadership": "0.76"}