{"name": "Frank.Lucas", "picture": "L000491.jpg", "detail": {"United States House of Representatives": "Committee assignments Committee on AgricultureCommittee on Financial ServicesSubcommittee on Capital Markets and Government Sponsored EnterprisesSubcommittee on Domestic Monetary Policy and TechnologyCommittee on Science, Space and TechnologySubcommittee on Space and AeronauticsSubcommittee on Energy and EnvironmentCaucus memberships Congressional Western CaucusLegislation On April 7, 2014, Lucas introduced the Customer Protection and End User Relief Act (H.R. 4413; 113th Congress) into the House. The bill would reauthorize the Commodity Futures Trading Commission through 2018 and amend some provisions of the Dodd–Frank Wall Street Reform and Consumer Protection Act.", "Political campaigns": "This section of a biography of a living person does not include any references or sources. Please help by adding reliable sources. Contentious material about living people that is unsourced or poorly sourced must be removed immediately.Find sources: \"Frank Lucas\" Oklahoma politician – news · newspapers · books · scholar · JSTOR (March 2012) (Learn how and when to remove this template message)Oklahoma House of Representatives He first ran for the Oklahoma House of Representatives in 1984 as a Republican against the incumbent Democrat, narrowly losing. A second attempt in 1986 also fell short, but he won in 1988.  He lost in 1990 after the legislature made his district somewhat friendlier to Democrats.  However, he returned in 1992.U. S. House of Representatives In 1994, 6th district Congressman Glenn English stepped down to become a lobbyist for rural electric cooperatives. Lucas won the Republican nomination for the special election on May 10. He faced Dan Webber, press secretary to former Governor and U.S. Senator David L. Boren, former president of the University of Oklahoma. The 6th was already by far the largest in the state, stretching from the Panhandle to the town of Spencer, in the far northeastern Oklahoma City metropolitan area. However, the state legislature had redrawn it so that it included many poor Oklahoma City neighborhoods that had never voted Republican. Lucas scored a major upset; he won by eight percentage points, carrying 18 of the district's 24 counties. His victory has been seen by some pundits as an early sign of the wave six months later that saw the Republicans take control of the House for the first time in 40 years. Lucas himself won a full term in that wave with 70 percent of the vote. He has been re-elected seven times, never dropping below 59 percent of the vote, and even ran unopposed in 2002 and 2004.Lucas' district was renumbered as the 3rd after Oklahoma lost a district in the 2000 Census. His already vast district was made even larger. He lost most of his share of Oklahoma City, which was home to 60 percent of the district's population. He once represented much of the downtown area, including the site of the Alfred P. Murrah Federal Building. He still represents that portion of the city located in Canadian County.  To make up for this large population loss, the 3rd was pushed further to the east, picking up the western portion of the Tulsa metro area (including a small portion of Tulsa itself) and some rural areas. As a result, his district now includes 48.5 percent of the state's landmass, and is nearly as large as the state's other four districts combined.2014 Republican primary In the 2014 Republican primary, Lucas won 83% of the vote. 12% went to Robert Hubbard; and 5% went to Timothy Ray Murray.", "Electoral history": "Oklahoma's 6th congressional district: Results 1992–2000YearDemocratVotesPctRepublicanVotesPct3rd PartyPartyVotesPct1992Glenn English *134,73468%Bob Anthony64,06832%1994Jeffrey S. Tollett45,39930%Frank D. Lucas106,96170%1996Paul M. Barby64,17336%Frank D. Lucas113,49964%1998Paul M. Barby43,55533%Frank D. Lucas85,26165%Ralph B. Finkle, Jr.Independent2,4552%2000Randy Beutler63,10639%Frank D. Lucas95,63559%Joseph V. CristianoLibertarian2,4352%* English resigned mid-term, and Lucas won the special election to succeed him against Democratic opponent Dan Webber.Oklahoma's 3rd congressional district: Results 2002–2010YearDemocratVotesPctRepublicanVotesPct3rd PartyPartyVotesPct2002(no candidate)Frank D. Lucas148,20676%Robert T. MurphyIndependent47,88424%2004(no candidate)Frank D. Lucas215,51082%Gregory M. WilsonIndependent46,62118%2006Sue Barton61,74933%Frank D. Lucas128,04267%2008Frankie Robbins62,29724%Frank D. Lucas184,30670%Forrest MichaelIndependent17,7567%2010Frankie Robbins45,68422%Frank D. Lucas161,91578%", "Personal life": "Lucas is a fifth-generation Oklahoman; his family has farmed in western Oklahoma for over 100 years.  He lives in Cheyenne with his wife, Lynda.  They have three children and one grandchild.", "introduction": "Frank Dean Lucas (born January 6, 1960) is an American politician. Lucas is the U.S. Representative for Oklahoma's 3rd congressional district, serving since 2003, having previously represented the 6th district, from 1994 to 2003. He is a member of the Republican Party and chairs the House Committee on Agriculture. His district, numbered as the 6th district from 1994 to 2003, is the largest congressional district in the state and one of the largest in the nation that does not cover an entire state. It covers 34,088.49 square miles and stretches from the Panhandle to the fringes of the Tulsa suburbs—almost half of the state's land mass.\n\n", "code": "03"}, "personal": {"Born": "Frank Dean Lucas (1960-01-06) January 6, 1960 (age58)Cheyenne, Oklahoma, U.S.", "Political party": "Republican", "Spouse(s)": "Lynda Lucas", "Education": "Oklahoma State University–Stillwater (BS)"}, "timeline": {"Chair of the House Agriculture Committee": {"date": "In officeJanuary 3, 2011– January 3, 2015", "Preceded by": "Collin Peterson", "Succeeded by": "Mike Conaway"}, "Member of the US House of Representativesfrom Oklahoma's 3rd district": {"date": "Assumed office January 3, 2003", "Preceded by": "Wes Watkins"}, "Member of the US House of Representativesfrom Oklahoma's 6th district": {"date": "In officeMay 10, 1994– January 3, 2003", "Preceded by": "Glenn English", "Succeeded by": "Constituency abolished"}, "code": "03"}, "code": "L000491", "type": "4", "party": "Republican", "description": "moderate Republican follower", "economic": "0.36", "social": "0.41", "leadership": "0.24"}