{"name": "Jacky.Rosen", "picture": "R000608.jpg", "detail": {"Early life and career": "Rosen was born on August 2, 1957 in Chicago, the daughter of Carol, a homemaker, and Leonard Spektor, a car dealership owner who had served in the U.S. Army during the Korean War. She attended the University of Minnesota and graduated with a bachelor's degree in psychology in 1979. While she attended college, her parents moved to Las Vegas, where she also moved after graduating. She took a job with Summa Corporation, and worked as a waitress at Caesars Palace. In the 1980s, she began to work for Southwest Gas, and then opened her own consulting business. While working for Summa, she attended Clark County Community College (now the College of Southern Nevada) and received an associate's degree in computing and information technology in 1985.A former computer programmer with no prior political experience, she was asked in 2016 by then-Senate Majority Leader Harry Reid to run for the U.S. House seat vacated by Republican Joe Heck. She has served as the president of Ner Tamid, a Reform Jewish synagogue in Las Vegas, and cited tikkun olam as a key part of her decision to enter politics.", "Political career": "U.S. House of Representatives 2016 election Rosen declared her candidacy for the United States House of Representatives seat in Nevada's 3rd congressional district in the 2016 elections. Rosen won 60% of the vote in the Democratic Party primary election, and narrowly defeated Republican nominee Danny Tarkanian in the general election. Rosen was sworn into office on January 3, 2017.Committee assignments Committee on Armed ServicesSubcommittee on Military PersonnelSubcommittee on Tactical Air and Land ForcesCommittee on Science, Space, and TechnologySubcommittee on EnergySubcommittee on Research and TechnologyCaucus memberships Congressional Arts CaucusCongressional Asian Pacific American CaucusCongressional Caucus for Women's Issues2018 Senate campaign Rosen is running for the U.S. Senate in the 2018 election. In June 2018, Rosen won the Democratic primary for the U.S. Senate race in Nevada. The seat is currently occupied by Dean Heller. Her candidacy has been endorsed by former President Barack Obama and former Vice President Joe Biden. During the campaign, Rosen emphasized her support for the Affordable Care Act (Obamacare) and criticized Heller's vote to repeal it in 2017. At the time, Rosen voted against Republicans' attempts to repeal the Affordable Care Act.", "Personal life": "Rosen resides in Henderson, Nevada with her husband Larry, a radiologist. The couple have one daughter, Miranda, who is currently a college student. Before entering politics, Rosen served as the president of the Congregation Ner Tamid synagogue, a Reform Jewish synagogue located in Henderson.", "introduction": "Jacklyn Sheryl Rosen (née Spektor; born August 2, 1957) is an American politician who has been the U.S. Representative from Nevada's 3rd congressional district since 2017. Rosen is the Democratic nominee for the U.S. Senate in the 2018 election.\n\n", "code": "03"}, "personal": {"Born": "Jacklyn Sheryl Spektor (1957-08-02) August 2, 1957 (age61)Chicago, Illinois, U.S.", "Political party": "Democratic", "Spouse(s)": "Larry Rosen", "Children": "1 daughter", "Education": "University of Minnesota (BA)Clark County Community College (AAS)"}, "timeline": {"Member of the US House of Representativesfrom Nevada's 3rd district": {"date": "Assumed office January 3, 2017", "Preceded by": "Joe Heck"}, "code": "03"}, "code": "R000608", "type": "4", "party": "Democrat", "description": "centrist Democrat", "economic": "-0.24", "social": "0.21", "leadership": "0.35"}