{"name": "James.Lankford", "picture": "L000575.jpg", "detail": {"Early life and education": "Lankford was born March 4, 1968, in Dallas, Texas, the son of Linda Joyce (née House) and James Wesley Lankford. His mother was an elementary school librarian. His maternal grandparents owned a small dry-cleaning business, his father and paternal grandparents a dairy farm. His stepfather was a career employee of AC Delco, the parts division of General Motors.His parents divorced when he was four; his mother and older brother and he lived for a time in his grandparents' garage apartment. He became a Christian at eight. His mother remarried when he was twelve, and the family moved to Garland with his stepfather. Lankford attended Lakeview Centennial High School in Garland. While at Lakeview Lankford participated in the Close Up Washington civic education program. He earned a Bachelor of Science degree in Secondary Education (specializing in Speech and History) at University of Texas at Austin in 1990, and a master's degree in Divinity at Southwestern Baptist Theological Seminary in 1994.", "Camp program director": "After graduating, he moved to Edmond, a suburb of Oklahoma City, where he still lives today.  He served with the Baptist General Convention of Oklahoma. He became the program director of Falls Creek, the largest Christian camp in the U.S.", "US House of Representatives": "Elections 2010 election After two-term incumbent Republican Mary Fallin announced she was giving up her seat to run for governor of Oklahoma, Lankford entered the race to succeed her. He finished first in a seven-way Republican primary—the real contest in this heavily Republican district—and defeated former State Representative Kevin Calvey in the runoff.[citation needed] He then defeated Democrat Billy Coyle in the general election with 62.53% of the vote.2012 election Lankford defeated Democrat Tom Guild with 59% of the vote. Following the election, he was named chairman of the House Republican Policy Committee, the fifth-ranking position in the House Republican caucus. This is a senior position for a second-term House member.Political positions Taxes Lankford supports budget austerity through lowering taxes and reducing government spending. He took the taxpayer protection pledge promising to support no new taxes. He supports the repeal of the income and estate taxes and supports a sales tax to tax consumption and not savings or earnings.Budget Lankford supports prioritizing spending cuts if the debt limit is reached and the Cut-Cap-and-Balance Pledge. He also supports a balanced budget amendment and voted to terminate the Home Affordable mortgage Program.Jobs He supports compensatory time off for overtime workers and received a 100% rating from the CEI, indicating a pro-workplace choice stance.Gun rights In 2014 Lankford was endorsed by the National Rifle Association and had an \"A\" rating for his consistent support of pro-gun legislation. Lankford supports loosening restrictions on interstate gun purchases. He opposes firearm microstamping, a controversial method of imprinting casings with a unique marking to match it with a specific firearm, and would allow veterans to register unlicensed firearms.After the 2018 Stoneman Douglas High School shooting in which the perpetrator used a Smith & Wesson M&P15 AR-15 style rifle to kill 17 and wound 17 others, Lankford said on NBC News' Meet the Press he was open to requiring more comprehensive background checks for firearm purchases, saying, \"The problem is not owning an AR-15, it’s the person who owns it.”Defense Lankford supports extending the Patriot Act and expanding roving wiretaps occurring in the US. He supports the prioritization of security, starting with military bases.Energy He supports expanding exploration of gas and oil both domestically and on the outer continental shelf. He opposes the EPA regulating emission standards as he believes it hinders economic growth.Environment In addition to barring the EPA from regulating emission standards, Lankford believes manure and other fertilizers should not be classified as pollutants or hazardous.Healthcare Lankford has stated his belief that federally funded health insurance is unconstitutional and has made a statement that he will oppose any and all moves for a federal healthcare system.  He supported an initiative to allow Medicare choice and also institute budget cuts.Abortion Lankford opposes abortion. He believes Congress should recognize life at the moment of fertilization. He opposes any federally funded programs that allow for abortion, as well as Planned Parenthood and other similar groups.LGBT issues Lankford believes marriage is a union between a man and woman. He has also said that being gay is a choice and that gay people should not be protected from workplace discrimination.Legislation As a Representative, Lankford sponsored 20 bills, including:Committee assignments United States House Committee on the BudgetUnited States House Committee on Oversight and Government ReformUnited States House Oversight Subcommittee on Energy Policy, Health Care and Entitlements (Chairman)United States House of Representatives Republican Policy Committee (Chair)", "US Senate": "2014 election In January 2014, Lankford announced he would run in the 2014 Senate special election to succeed retiring Republican Senator Tom Coburn. Lankford won the June 2014 Republican primary, defeating former state House speaker T.W. Shannon and former state senator Randy Brogdon. Lankford won the election for the final two years of Coburn's second term, defeating retiring state senator Constance N. Johnson by a margin of 557,002, 67.9%, to Johnson's 237,923, 29.0%, with independent candidate Mark Beard collecting 25,965 votes, 3.2% of the total.2016 election Lankford was elected to a full six-year term in the Senate at the 2016 Oklahoma United States Senate election, defeating Democratic consultant Mike Workman with 67.7 percent of the vote. As in 2014, he won in a landslide, carrying every county in the state.Tenure Lankford was sworn into office on January 6, 2015, by Vice President Joe Biden.Committee assignments Committee on AppropriationsSubcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on Energy and Water DevelopmentSubcommittee on Financial Services and General GovernmentSubcommittee on Labor, Health and Human Services, Education, and Related AgenciesSubcommittee on State, Foreign Operations, and Related ProgramsCommittee on Homeland Security and Governmental AffairsSubcommittee on Regulatory Affairs and Federal Management (Chairman)Committee on Indian AffairsSelect Committee on Intelligence", "Personal life": "Lankford has been married to his wife, Cindy, for 25 years. They have two daughters, Hannah and Jordan. He attends Quail Springs Baptist Church, a Southern Baptist church in Oklahoma City.", "Electoral history": "Oklahoma's 5th congressional district election, 2010 Republican primaryPartyCandidateVotes%RepublicanJames Lankford18,76033.58RepublicanKevin Calvey18,14732.48RepublicanMike Thompson10,00817.91RepublicanShane Jett5,95610.66RepublicanJohnny Roy1,5482.77RepublicanRick Flanigan7621.36RepublicanHarry Johnson6861.23Total55,867100Republican primary runoffPartyCandidateVotes%RepublicanJames Lankford29,81765.22RepublicanKevin Calvey15,90234.78Total45,719100General electionPartyCandidateVotes%RepublicanJames Lankford123,23662.52DemocraticBilly Coyle68,07434.54IndependentClark Duffe3,0671.56IndependentDave White2,7281.38Total197,105100Republican holdOklahoma's 5th congressional district election, 2012 General electionPartyCandidateVotes%RepublicanJames Lankford (inc.)153,60358.70DemocraticTom Guild97,50437.30IndependentPat Martin5,3942.10IndependentRobert Murphy5,1762.00Total261,677100Republican holdU.S. Senate special election in Oklahoma, 2014 Republican primaryPartyCandidateVotes%RepublicanJames Lankford152,74957.20RepublicanT. W. Shannon91,85434.40RepublicanRandy Brogdon12,9344.80RepublicanKevin Crow2,8281.10RepublicanAndy Craig2,4270.90RepublicanEric McCray2,2720.90RepublicanJason Weger1,7940.70Total266,858100General electionPartyCandidateVotes%RepublicanJames Lankford557,00267.90DemocraticConnie Johnson237,92329.00IndependentMark T. Beard25,9653.20Total820,890100Republican holdU.S. Senate election in Oklahoma, 2016 General electionPartyCandidateVotes%RepublicanJames Lankford (inc.)980,89267.7DemocraticMike Workman355,91124.58LibertarianRobert Murphy43,4213.00IndependentSean Braddy40,4052.79IndependentMark T. Beard27,4181.89Total1,448,047100.00Republican hold", "introduction": "James Paul Lankford (born March 4, 1968) is an American politician serving as the junior United States Senator from Oklahoma since 2015. A member of the Republican Party, he served as the U.S. Representative for Oklahoma's 5th congressional district from 2011 to 2015.\nFrom 1996 to 2009, Lankford was the student ministries and evangelism specialist for the Baptist General Convention of Oklahoma, and he was director of the Falls Creek youth programming at the Falls Creek Baptist Conference Center in Davis, Oklahoma. He stepped down on September 1, 2009, to run for Congress.\nIn January 2014, Lankford announced he would run in the 2014 Senate special election to succeed fellow Republican Tom Coburn. He won the June 2014 primary with 57% of the vote, becoming the Republican nominee. He won the special election with nearly 68% of the vote, and was elected to the balance of Coburn's term. He was reelected in 2016.\n\n"}, "personal": {"Born": "James Paul Lankford (1968-03-04) March 4, 1968 (age50)Dallas, Texas, U.S.", "Political party": "Republican", "Spouse(s)": "Cindy Lankford", "Children": "2", "date": "EducationUniversity of Texas at Austin (BS)Southwestern Baptist Theological Seminary (MDiv)", "Occupation": "Christian camp director"}, "timeline": {"United States Senatorfrom Oklahoma": {"date": "Assumed office January 3, 2015Serving with Jim Inhofe", "Preceded by": "Tom Coburn"}, "Member of the US House of Representativesfrom Oklahoma's 5th district": {"date": "In officeJanuary 3, 2011– January 3, 2015", "Preceded by": "Mary Fallin", "Succeeded by": "Steve Russell"}}, "code": "L000575", "type": "3", "party": "Republican", "description": "conservative Republican", "economic": "0.57", "social": "0.16", "leadership": "0.27"}