{"name": "Jason.T.Smith", "picture": "", "detail": {"Early life, education, and business career": "This biography of a living person needs additional citations for verification. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced must be removed immediately, especially if potentially libelous or harmful. (August 2016) (Learn how and when to remove this template message)Jason Smith was born in St. Louis to Bill, a minister and auto mechanic, and Mary, a puppy mill owner.At age 20, Smith earned two degrees from the University of Missouri; a Bachelor of Science in Agriculture Economics and a Bachelor of Science in Business Administration. While attending law school, Smith served as the Senator representing the law school in the Student Senate, the Vice President of the entire law school, and class secretary. Also while in law school, Smith purchased his family farm to keep it in the family, became a licensed real estate agent, and formed his own small business specializing in property investment and development. He earned his Juris Doctorate in 2004 and returned to Missouri to take the bar exam. Smith is one of the only members of Congress that is still paying off student loans from college.After passing the Missouri Bar in 2004, he returned home to Salem to practice law at a local law firm in Cuba, Missouri, continue to run his small business and manage his family farm. The farm, located just outside Salem, Missouri, has been in Smith's family for four generations.Smith is a lifetime member of the National Rifle Association and an avid hunter. He attends Grace Community Church in Salem, an Assemblies of God Church. He used to be a board member of the Missouri Community Betterment Association, Court Appointed Special Advocates (CASA), and president of the Salem FFA Association.", "Missouri House of Representatives": "Elections Following the resignation of the incumbent Democratic State Representative Frank Barnitz, Smith ran for Missouri's 150th Legislative District, which covered portions of Dent, Phelps, Crawford, and Reynolds counties. Smith defeated Democratic challenger Bobby Simpson 54%–44%. At the age of 25, Smith just barely made the constitutional requirements to be a state representative and became the youngest member of the Missouri House of Representatives. During his first year in office, Smith served as Majority Assistant Deputy Whip and served on the Agriculture Policy Committee, Appropriations—Education Committee, and the Judiciary Committee.One year after being elected to the Missouri House of Representatives in a special election, Smith defeated Democrat Jim O'Donnell 64%–32%.  In his first full term, Smith served as the Vice-Chairman of the Special Committee on Job Creation and Economic Development.In his third election in just three years, Smith received 70% of the vote, defeating Democrat James D. Ellis in 2008 to secure his second full term in the Missouri House of Representatives.In November 2010, Smith was unopposed in his reelection campaign to his fourth full term to the Missouri House of Representatives. Following his election, Smith was elected by his peers to serve as one of the youngest Majority Whips to serve in the Missouri House of Representatives.Following his 2010 election, Smith was again unopposed in his final election to the Missouri House of Representatives in 2012. Upon the start of the 97th General Assembly in 2013, Smith was elected by his peers to serve as Speaker Pro-Tem of the Missouri State House of Representatives.", "US House of Representatives": "2013 Special Election Smith ran for the vacant 8th congressional district of Missouri seat after incumbent Republican U.S. Representative Jo Ann Emerson resigned to accept a CEO position with the National Rural Electric Cooperative Association.Per Missouri statute, Smith was selected by the 8th District Republican Central Committee to be the party's nominee in the June special election. The selection process—which began with 27 candidates and narrowed to 13 on nomination day—lasted six total rounds before Smith was the last one standing as the Republican nominee on February 9, 2013. Some of the other candidates included State Representative Todd Richardson of Poplar Bluff, former State Treasurer of Missouri and U.S. Representative Wendell Bailey, former State Senator Jason Crowell of Cape Girardeau, Lieutenant Governor Peter Kinder, former State Treasurer of Missouri Sarah Steelman, State Representative Clint Tracy of Cape Girardeau, and State Senator Wayne Wallingford of Cape Girardeau.In the June special election, Smith was challenged by Democratic State Representative Steve Hodges of East Prairie, businessman Doug Enyart of the Constitution Party, and Libertarian Bill Slantz. He was declared the winner of the special election on June 4, 2013. The election marked the 47th consecutive U.S. House race in Missouri in which Democrats failed to pick up a Republican-held seat dating back to 1994 – the second longest Democratic pick-up drought in the nation.2013 Special Election for U.S. Representative of Missouri's 8th Congressional DistrictPartyCandidateVotes%RepublicanJason T. Smith42,14167.14DemocraticSteve Hodges17,20727.42ConstitutionDoug Enyart2,2653.61LibertarianBill Slantz9681.54Write-inOthers1850.292014 After an unopposed primary election on August 5, 2014 and 17 months following the special election, Smith was up for his first reelection on November 4, 2014. Smith won a five-way race with two-thirds of the vote and carried all 30 counties in the congressional2017 On March 8, 2017, Smith made a controversial statement in a committee meeting. During debate about a tanning salon tax under the Affordable Care Act, he wondered aloud why there was no tax on the Sun since it was the leading cause of skin cancer. He argued the tanning tax was unfair to women since women go to tanning salons more than men.As a member of the House Ways and Means Committee, Smith had a key role in writing and passing the Tax Cuts and Jobs Act, the first major rewrite of the U.S. tax code in 31 years.Committee assignments United States House Committee on Ways and MeansSubcommittee on Human ResourcesSubcommittee on OversightRepublican Study CommitteeCaucus memberships Congressional Western Caucus", "introduction": "Jason Thomas Smith (born June 16, 1980)  is an American businessman, politician, and the U.S. Representative for Missouri's 8th congressional district after winning a special election on June 4, 2013. The district comprises 30 counties, covering just under 20,000 square miles of southeastern and southern Missouri. He is the third-youngest Republican member of the U.S. House of Representatives, behind only Elise Stefanik of New York and Michael Gallagher of Wisconsin.\nPrior to being elected to Congress, Smith served four terms representing the 150th Legislative District in the Missouri House of Representatives and one term serving the 120th Legislative District following redistricting in 2012. Smith served as the Majority Whip during the 96th Missouri General Assembly and then as the Speaker Pro Tem during the 97th Missouri General Assembly.\n\n"}, "personal": {"Born": " (1980-06-16) June 16, 1980 (age38)Salem, Missouri, U.S.", "Political party": "Republican", "Education": "University of Missouri (BS)Oklahoma City University (JD)"}, "timeline": {"Secretary of the House Republican Conference": {"date": "Assumed office January 3, 2017", "Leader": "Paul Ryan", "Preceded by": "Virginia Foxx"}, "Member of the US House of Representativesfrom Missouri's 8th district": {"date": "Assumed office June 4, 2013", "Preceded by": "Jo Ann Emerson"}, "Member of the Missouri House of Representativesfrom the 120th district": {"date": "In officeJanuary 9, 2013– June 4, 2013", "Preceded by": "Scott Largent", "Succeeded by": "Shawn Sisco"}, "Member of the Missouri House of Representativesfrom the 150th district": {"date": "In officeNovember 14, 2005– January 9, 2013", "Preceded by": "Frank Barnitz", "Succeeded by": "Kent Hampton"}}, "code": "", "type": "", "party": "", "description": "", "economic": "0", "social": "0", "leadership": "0"}