{"name": "Jerry.McNerney", "picture": "M001166.jpg", "detail": {"Early life, education, and business career": "McNerney was born in Albuquerque, New Mexico, the son of Rosemary (née Tischhauser) and Col. John E. McNerney. He is of Swiss and Irish descent. He attended St. Joseph's Military Academy in Hays, Kansas, and, for two years, the United States Military Academy at West Point. After leaving West Point in 1971 in protest of U.S. involvement in the Vietnam War, he enrolled at the University of New Mexico in Albuquerque, where he received bachelor's and master's degrees and, in 1981, a Ph.D. in Mathematics, with a doctoral dissertation in differential geometry focusing on a generalization of the Laplace–Beltrami operator.McNerney served several years as a contractor to Sandia National Laboratories at Kirtland Air Force Base on national security programs. In 1985, he accepted a senior engineering position with U.S. Windpower (Kenetech). In 1994, he began working as an energy consultant for PG&E, FloWind, The Electric Power Research Institute, and other utility companies. Before being elected to Congress, Jerry served as the CEO of a 2004 start-up company manufacturing wind turbines, named HAWT Power (Horizontal Axis Wind Turbine Power). A 1992 article that he co-authored in an IEEE journal is a good example of his writings during this period.", "US House of Representatives": "Elections 2004McNerney first ran for Congress against Richard Pombo in California's 11th congressional district in the 2004 House elections. He entered the race two weeks before the primary election as a write-in candidate. He qualified to be a write-in candidate for the March 2004 primary by one signature. Having no primary opponent, he won the primary and qualified for the November general election ballot as the Democratic nominee. He lost the general election, 61%-39%.[citation needed]2006McNerney launched his 2006 campaign early in the fall of 2005. In June 2006 he won the Democratic primary with 52.8% of the vote, defeating Steve Filson, who had been endorsed by the DCCC, and Stevan Thomas.[citation needed]In late July, Republicans Pete McCloskey and Tom Benigno (both of whom ran in the Republican primary against Pombo) endorsed McNerney. In September, analysis of the campaign was changed from \"Republican safe\" to \"Republican favored\" due to the emergence of McNerney's campaign. The report noted \"a [GOP] party spokesman says it's because they want to win decisively but others speculate that internal polling has delivered bad news for the incumbent.\" On October 3, 2006, a poll commissioned by Defenders of Wildlife Action Fund was released with McNerney leading Pombo 48 percent to 46 percent. Based on these events, in early October, CQPolitics.com changed their rating of this race from Republican Favored to Leans RepublicanOn November 7, 2006, McNerney defeated Pombo 53–47%.[citation needed]2008McNerney won re-election 55% to 45% over Republican nominee Dean Andal.2010McNerney won re-election 48–47%, defeating Republican nominee David Harmer.2012For his first three terms, McNerney represented a district that encompassed eastern Alameda County, most of San Joaquin County and a small portion of Santa Clara County.  After redistricting, his district was renumbered as the 9th District.  It lost its portion of Alameda County, including McNerney's home in Pleasanton, while picking up part of Sacramento County.  After the new map was announced, McNerney announced he would move to San Joaquin County in the new 9th. Although the new district is somewhat more Democratic than its predecessor, it is influenced by the Central Valley. He eventually bought a home in Stockton. He won re-election 56–44%, defeating Republican nominee Ricky Gill.Tenure VeteransIn 2010, President Obama signed into law a bill written by McNerney which improves care of returning service members with traumatic brain injuries (TBI) by establishing an evaluation panel to assess the Veteran's Administration treatments for TBI and recommend improvements. He also wrote a bill in 2013 that allowed veterans to keep receiving their benefits during the government shutdown.McNerney was one of the first lawmakers to call for the resignation of VA Secretary Eric Shinseki following revelations in the news media about delays in care at VA health care facilities.EnergyMcNerney is a proponent of renewable energy. He voted to reduce carbon emissions. He has voted for tax incentives for renewable energy and for allowing states to impose stricter emissions standards. He opposes drilling in the Outer Continental Shelf.McNerney co-sponsored the bill To require the Secretary of Energy to prepare a report on the impact of thermal insulation on both energy and water use for potable hot water (H.R. 4801; 113th Congress), would require the United States Secretary of Energy to prepare a report on the effects that thermal insulation has on both energy consumption and systems for providing potable water in federal buildings. McNerney said that \"it is important for us to look for ways to save taxpayer money and ensure the federal government is doing its part to preserve our natural resources.\" McNerney argued it would be a good way to collect data so that \"we can use the findings from this study and make sure we are doing everything we can in both federal and private buildings to maximize energy and water efficiency.\"Drug legislationIn 2007, McNerney voted against legislation that would have prevented the DEA from enforcing prohibition in the twelve states (including California) which allow the use of marijuana for medical purposes.In 2013, McNerney introduced the Methamphetamine Education, Treatment and Hope (METH) Act to modernize and expand programs that combat methamphetamine abuse by expanding treatment for addicts, particularly mothers or pregnant women, and provide grants to provide substance abuse and mental health services in rural areas.Other issuesMcNerney voted in favor of legislation allowing employees to form unions by signing cards authorizing union representation. In 2009, McNerney voted for the Patient Protection and Affordable Care Act. He has opposed free trade agreements, voting against CAFTA, GATT, and the U.S.-Peru free trade agreement.In April 2018, McNerney, together with Jared Huffman, Jamie Raskin, and Dan Kildee, launched the Congressional Freethought Caucus. Its stated goals include \"pushing public policy formed on the basis of reason, science, and moral values\", promoting the \"separation of church and state,\" opposing discrimination against \"atheists, agnostics, humanists, seekers, religious and nonreligious persons\", among others. Huffman and Raskin will act as co-chairs.Committee assignments Committee on Energy and CommerceSubcommittee on Energy and PowerSubcommittee on Commerce, Manufacturing and TradeSubcommittee on Environment and EconomyCaucus memberships Congressional Arthritis CaucusUnited States Congressional International Conservation CaucusGrid Innovation CaucusCongressional Freethought CaucusCongressional Asian Pacific American Caucus", "Electoral history": "California's 11th Congressional District Democratic Primary Election, 2006PartyCandidateVotes%DemocraticJerry McNerney23,59852.8DemocraticSteve Filson12,74428.5DemocraticSteve Thomas8,39018.7Total votes44,732100United States House of Representatives elections, 2006PartyCandidateVotes%DemocraticJerry McNerney109,86853.3RepublicanRichard Pombo (incumbent)96,39646.7Total votes206,264100Turnout Democratic gain from RepublicanUnited States House of Representatives elections, 2008PartyCandidateVotes%DemocraticJerry McNerney (incumbent)164,50055.3RepublicanDean Andal133,10444.7American IndependentDavid Christensen (write-in)120.0Total votes297,616100Turnout Democratic holdUnited States House of Representatives elections, 2010PartyCandidateVotes%DemocraticJerry McNerney (incumbent)113,96948.0RepublicanDavid Harmer111,49446.9American IndependentDavid Christensen12,3455.1Total votes237,808100Turnout Democratic holdCalifornia's 9th Congressional District Primary Election, 2012PartyCandidateVotes%DemocraticJerry McNerney (incumbent)45,69647.8RepublicanRicky Gill38,48840.2RepublicanJohn McDonald11,45812.0Total votes95,642100United States House of Representatives elections, 2012PartyCandidateVotes%DemocraticJerry McNerney (incumbent)118,37355.6RepublicanRicky Gill94,70444.4Total votes213,077100Turnout Democratic holdCalifornia's 9th Congressional District Primary Election, 2014PartyCandidateVotes%DemocraticJerry McNerney (incumbent)38,29549.4RepublicanAntonio \"Tony\" Amador20,42426.3RepublicanSteve Anthony Colangelo14,19518.3RepublicanKaren \"Mathews\" Davis4,6376.0Total votes77,551100United States House of Representatives elections, 2014PartyCandidateVotes%DemocraticJerry McNerney (incumbent)63,47552.4RepublicanAntonio C. Amador57,72947.6Total votes78,812100.0Democratic holdCalifornia's 9th Congressional District Primary Election, 2016PartyCandidateVotes%DemocraticJerry McNerney (incumbent)71,63455.3RepublicanAntonio \"Tony\" Amador28,16121.7RepublicanKathryn Nance24,78319.1LibertarianAlex Appleby5,0293.9Total votes129,607100", "Personal life": "McNerney resides in Stockton, California. He and his wife, Mary, have three children.[citation needed]", "introduction": "Gerald Mark McNerney /məkˈnɜːrni/ (born June 18, 1951) is an American businessman, politician, and the U.S. Representative for California's 9th congressional district, serving in Congress since 2007. He is a member of the Democratic Party. The district, numbered as the 11th District until 2013, is based in Stockton and includes parts of San Joaquin County, East Contra Costa County, and southern Sacramento County. McNerney holds a Ph.D in mathematics.\n\n", "code": "09"}, "personal": {"Born": "Gerald Mark McNerney (1951-06-18) June 18, 1951 (age67)Albuquerque, New Mexico, U.S.", "Political party": "Democratic", "Spouse(s)": "Mary McNerney", "Children": "3", "Education": "United States Military AcademyUniversity of New Mexico (BS, MS, PhD)"}, "timeline": {"Member of theUS House of Representativesfrom California": {"date": "Assumed office January 3, 2007", "Preceded by": "Richard Pombo", "Constituency": "11th district (2007–2013)9th district (2013–present)"}, "code": "09"}, "code": "M001166", "type": "4", "party": "Democrat", "description": "moderate Democratic follower", "economic": "-0.26", "social": "-0.14", "leadership": "0.31"}