{"name": "John.Kennedy", "picture": "K000393.jpg", "detail": {"Education and early career": "Born in Centreville, Mississippi, Kennedy was raised in Zachary in East Baton Rouge Parish. He graduated in 1969 from Zachary High School. He finished magna cum laude in 1973 from Vanderbilt University in Nashville, Tennessee, with a degree in Political Science, Philosophy, and Economics.At Vanderbilt, he was elected president of his senior class and named to Phi Beta Kappa. After Vanderbilt, Kennedy received a J.D. degree in 1977 from the University of Virginia School of Law in Charlottesville, Virginia. At the University of Virginia School of Law, he was an executive editor of the Virginia Law Review and was elected to the Order of the Coif. In 1979, he earned a Bachelor of Civil Law degree with first class honours from Magdalen College, Oxford in England.He has also served as an adjunct professor at Louisiana State University's Paul M. Hebert Law Center in Baton Rouge.", "Political career": "In 1988, Kennedy became special counsel to then-Democratic Governor Roemer. In 1991, he was appointed cabinet secretary and served in that post until 1992. In 1991, he was an unsuccessful Democratic candidate for state Attorney General of Louisiana to succeed the retiring William J. Guste.Following his first stint in state government, Kennedy returned to the private practice of law until 1996. That same year, he was appointed Secretary of the state Department of Revenue in the cabinet of Republican Governor Mike Foster.Treasurer of Louisiana Kennedy left the Foster administration when he was elected State Treasurer in 1999, having unseated incumbent Democrat Kenneth \"Ken\" Duncan, 621,796 (55.6 percent) to 497,319 (44.4 percent). Kennedy was re-elected Treasurer without opposition in 2003.After being courted by the Republican Party for months, Kennedy announced in a letter to his constituents that he was leaving the Democratic Party and joining the Republicans, effective August 27, 2007. In his letter, he announced that he would run again for State Treasurer.During the State Treasurer's term to which he was elected in 2007, Kennedy devised a twenty-four-point plan by which the state could save money. Governor Bobby Jindal said Kennedy could \"streamline\" his own department. Many of Kennedy's ideas were derived from the Louisiana Commission for Streamlining Government, of which the Treasurer was a member.U.S. Senate Elections In 2004, Kennedy campaigned for the United States Senate seat held by John Breaux, who retired from elected office. Kennedy ran as a Democrat in the state's jungle primary, losing to Republican David Vitter and Democrat Chris John. Vitter defeated John to win the seat in the general election.Kennedy ran for the U.S. Senate again in 2008. This time, Kennedy ran as a Republican. He was defeated, 52.1 to 45.7 percent, by incumbent Democratic Senator Mary Landrieu; the same year, Republican presidential nominee John McCain defeated Barack Obama in Louisiana, but Obama was elected nationwide.On January 26, 2016, Kennedy announced that he would run for the U.S. Senate for a third time. In seeking to succeed the retiring David Vitter, he faced more than twenty opponents. Vitter announced his retirement from the Senate in 2015 after losing a bid for governor to the Democrat John Bel Edwards.Kennedy's senatorial campaign was endorsed by the U.S. Chamber of Commerce, the National Federation of Independent Business, the National Rifle Association, the National Right to Life Committee, the American Conservative Union, Vice President Mike Pence and President Donald Trump. Kennedy, who had supported Vitter for governor the previous year, won the jungle primary and faced Democrat Foster Campbell in a December 10 runoff election. President-elect Donald Trump—who had received Kennedy's support in the 2016 presidential election—campaigned for Kennedy the day before the runoff election. Kennedy defeated Campbell, 536,204 (61 percent) to 347,813 (39 percent), in the runoff election. Kennedy lost the largest populated parishes of Orleans and East Baton Rouge, in which he had been reared, but he was a runaway winner in Campbell's home parish of Bossier.Tenure Kennedy was sworn in as Louisiana's junior U.S. Senator on January 3, 2017.In June 2017, Kennedy grilled Education Secretary Betsy DeVos in a hearing before the Appropriations subcommittee on Labor, Health and Human Service, Education and Related Agencies. In the exchange, he contrasted the lack of school choice available for younger pupils in many rural areas of the country to the widespread brands of mayonnaise available on the grocery store shelf: \"Now I can go down to my overpriced Capitol Hill grocery this afternoon and choose among about six different types of mayonnaise. How come I can't do that for my kid,\" Kennedy said. The remark attracted national attention. DeVos replied that the Trump administration budget proposal would give parents and students more power and opportunity so that American education could again become \"the envy of the world.\"Kennedy has attracted comment for his manner in the Senate. The Huffington Post reported: \"Since being elected to the Senate a year ago, Kennedy[...] has made a name for himself on Capitol Hill with his wit, humor and penchant for folksy expressions ― a notable feat in a place where jargon and arcane procedure tend to reign supreme. At a time when many of his colleagues are using modern forms of media to communicate with their constituents ― e.g., Twitter ― Kennedy has managed to command viral headlines with little more than Southern wisdom and a Pelican State drawl, distilling events of the day into blunt terms regular people can understand.\"Committee assignments Committee on AppropriationsSubcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on Energy and Water DevelopmentSubcommittee on Homeland SecuritySubcommittee on Labor, Health and Human Services, Education, and Related AgenciesSubcommittee on the Legislative BranchCommittee on Banking, Housing, and Urban AffairsSubcommittee on Economic PolicySubcommittee on Housing, Transportation, and Community DevelopmentSubcommittee on Financial Institutions and Consumer ProtectionCommittee on the BudgetCommittee on the JudiciarySubcommittee on Crime and TerrorismSubcommittee on Border Security and ImmigrationSubcommittee on Oversight, Agency Action, Federal Rights and Federal CourtsSubcommittee on Privacy, Technology and the LawCommittee on Small Business and EntrepreneurshipPolitical positions In 2018, Senator John Kennedy maintained a F 56% Liberty Score by Conservative Review.Animal rights Senator Kennedy stated he would be filing a bill to \"prohibit airlines from putting animals in overhead bins\" following the death of a dog in an overhead bin while flying United Airlines during March 2018.  He said, \"officials would face significant fines\" if noncompliant.Abortion Kennedy is \"strongly opposed\" to abortion.Gun law Kennedy has an \"A\" rating from the National Rifle Association (NRA), which endorsed him during his 2016 Senate run. He is very close to former NRA president Wayne Lapierre.Judicial nominees Kennedy bucked party lines to block the appointment of three U.S. District Court judicial appointees by U.S. President Donald Trump of individuals whom Kennedy believed were not qualified for the position. These included Matthew Spencer Petersen, Brett Talley, and Jeff Mateer. All three nominations were withdrawn by the White House.Net neutrality John Kennedy introduced a bill on March 7, 2018, that would \"prohibit companies like Comcast and Verizon from blocking or throttling web content.\". Kennedy was one of three Republican senators, alongside Susan Collins and Lisa Murkowski, that voted with the entirety of the Democratic caucus on May 16, 2018, to overturn the FCC's repeal of net neutrality.", "Personal life": "Kennedy resides in Madisonville in St. Tammany Parish outside New Orleans with his wife, Becky, and son, Preston. He attends North Cross United Methodist Church in Madisonville. He is not related to the Kennedy family of Massachusetts.", "Electoral history": "Louisiana Attorney General primary election, 1991PartyCandidateVotes%DemocraticRichard Ieyoub447,42331RepublicanBen Bagert312,96822DemocraticJohn Kennedy288,10420DemocraticWinston Riddick224,20016RepublicanJames McPherson124,3419RepublicanKai David Midboe24,1182Louisiana Treasurer primary election, 1999PartyCandidateVotes%DemocraticJohn Kennedy621,79656DemocraticKen Duncan (inc.)497,31944Louisiana Treasurer primary election, 2003PartyCandidateVotes%DemocraticJohn Kennedy (inc.)n/a100Louisiana U.S. Senate primary election, 2004PartyCandidateVotes%RepublicanDavid Vitter943,01451DemocraticChris John542,15029DemocraticJohn Kennedy275,82115DemocraticArthur Morrell47,2223LibertarianRichard Fontanesi15,0971Independent\"Skip\" Galan12,4631DemocraticSam Houston Melton, Jr.12,2891Louisiana Treasurer primary election, 2007PartyCandidateVotes%RepublicanJohn Kennedy (inc.)n/a100Louisiana U.S. Senate primary election, 2008PartyCandidateVotes%DemocraticMary Landrieu (inc.)988,29852RepublicanJohn Kennedy867,17746LibertarianRichard Fontanesi18,5901Independent\"Jay\" Patel13,7291IndependentRobert Stewart8,7800Louisiana Treasurer primary election, 2011PartyCandidateVotes%RepublicanJohn Kennedy (inc.)n/a100Louisiana Treasurer primary election, 2015PartyCandidateVotes%RepublicanJohn Kennedy (inc.)787,67780RepublicanJennifer Treadaway195,79120Louisiana U.S. Senate primary election, 2016PartyCandidateVotes%RepublicanJohn Kennedy482,59125DemocraticFoster Campbell337,83317RepublicanCharles Boustany298,00815DemocraticCaroline Fayard240,91712RepublicanJohn C. Fleming204,02611RepublicanRob Maness90,8565RepublicanDavid Duke58,6063DemocraticDerrick Edwards51,7742DemocraticGary Landrieu45,5871Republican\"Crawdaddy\" Crawford25,5231RepublicanJoseph Cao21,0191IndependentBeryl Billiot19,3521LibertarianThomas Clements11,370111 additional candidates46,1732United States Senate election in Louisiana, 2016PartyCandidateVotes%RepublicanJohn Kennedy536,19160DemocraticFoster Campbell347,81639", "introduction": "John Neely Kennedy (born November 21, 1951) is an American attorney and politician who is the junior United States Senator from Louisiana, serving since 2017.  A member of the Republican Party, he previously served as Treasurer of Louisiana from 2000 to 2017.\nBorn in Centreville, Mississippi, Kennedy graduated from Vanderbilt University and University of Virginia School of Law before attending Magdalen College in Oxford, England.  Kennedy was on the staff of Governor Buddy Roemer before unsuccessfully running for Attorney General of Louisiana in 1991.  In 1999, he was elected Louisiana Treasurer.  He was an unsuccessful candidate for U.S. Senate in 2004 and 2008.  In 2007 while serving as treasurer, Kennedy switched parties from Democrat to Republican.\nIn 2016, Kennedy was once again a candidate for U.S. Senate.  He came in first place in the November jungle primary and subsequently went on to defeat Democrat Foster Campbell in a December runoff before being sworn in on January 3, 2017.\n\n"}, "personal": {"Born": "John Neely Kennedy (1951-11-21) November 21, 1951 (age66)Centreville, Mississippi, U.S.", "Political party": "Republican (2007–present)", "Other politicalaffiliations": "Democratic (before 2007)", "Spouse(s)": "Rebecca Stulb", "Children": "1 son", "Education": "Vanderbilt University (BA)University of Virginia (JD)Magdalen College, Oxford (BCL)"}, "timeline": {"United States Senatorfrom Louisiana": {"date": "Assumed office January 3, 2017Serving with Bill Cassidy", "Preceded by": "David Vitter"}, "Treasurer of Louisiana": {"date": "In officeJanuary 10, 2000– January 3, 2017", "Governor": "Mike FosterKathleen BlancoBobby JindalJohn Bel Edwards", "Preceded by": "Ken Duncan", "Succeeded by": "John Schroder"}}, "code": "K000393", "type": "3", "party": "Republican", "description": "centrist Republican follower ", "economic": "0.46", "social": "0.47", "leadership": "0.19"}