{"name": "Johnny.Isakson", "picture": "I000055.jpg", "detail": {"Early life, education, and real estate career": "Isakson was born on December 28, 1944, in Atlanta, Georgia, the son of Julia (née Baker) and Edwin Andrew Isakson, a Greyhound bus driver, who later established an Atlanta real estate firm. His paternal grandparents were of Swedish descent, and his paternal grandfather was born in Östersund.  His mother is of mostly British ancestry, and her family has been in the American South since the colonial era. He received an honorary degree in Doctor of Laws  from Oglethorpe University in 2009.He currently lives in the nearby suburb of Marietta. He served in the Georgia Air National Guard from 1966 to 1972, leaving service as a staff sergeant. Isakson enrolled at the University of Georgia, where he became a member of the Sigma Alpha Epsilon social fraternity.    Shortly after graduating from UGA, he opened the first Cobb County office of Northside Realty, a prominent Atlanta-area real estate firm that his father, Ed, helped to establish. Isakson became company president in 1979, a post he held for 22 years, during which Northside became the biggest independent real estate company in the Southeast and one of the largest in America.", "Early political career (1974–1998)": "Georgia House of Representatives In 1974, Isakson first ran for the Georgia House of Representatives in an eastern Cobb County district and lost. He ran again in 1976 and won. He served seven terms in the House. He won re-election unopposed in 1984 and 1988. In the last four terms (1983–1990) he was the Republican Minority leader. In 1988, he was Co-Chair for U.S. Senator Bob Dole's presidential primary campaign.1990 gubernatorial election He was the Republican candidate for Governor of Georgia in 1990. He won the Republican primary with 74% of the vote in a four candidate field. In the general election, he was defeated by Democratic Lieutenant Governor Zell Miller 53%–45%. His campaign was managed by Jay Morgan while Miller's campaign was managed by James Carville. Miller ran on a pledge to start a state lottery and use the revenue for public schools. Isakson proposed a ballot referendum on the lottery.Georgia Senate In 1992, he was elected to the Georgia Senate. In 1996, he decided not to run for re-election to a second term and instead ran for the United States Senate.1996 U.S. Senate election In 1996, he ran in the Republican primary for the U.S. Senate seat being vacated by retiring Democratic U.S. Senator Sam Nunn.  Isakson finished second in the primary election with 35% of the vote, but the winner Guy Millner, a millionaire businessman, failed to get a majority of the vote getting 42%. Therefore, per Georgia law he was forced into a primary runoff election. Millner defeated Isakson in the runoff 53%–47%. Millner lost to Democrat Max Cleland.In December 1996, Isakson was appointed head of the State Board of Education by Miller.", "US House of Representatives (1999–2005)": "Elections 1999In November 1998, 6th District U.S. Congressman and Speaker of the House Newt Gingrich faced a revolt in his caucus after the Republicans lost four seats in the midterm elections. Amid the turmoil, Gingrich announced on Friday after the Tuesday elections not only that he would not run for a third term as Speaker, but he would also not take his seat for an eleventh term beginning in January 1999. Isakson ran for the seat in a special election in February.  He won the election with 65% of the vote, up forty points ahead of the second-place finisher Christina Fawcett Jeffrey.2000He won re-election to his first full term with 75% of the vote.2002He won re-election to his second full term with 80% of the vote.War in IraqIn October 2002, Isakson voted in favor of the authorization of force against the country of Iraq.Legislation During his tenure in the House of Representatives, Isakson served on the Committee on Education and the Workforce, aiding President Bush in passing the No Child Left Behind Act. As a Representative, Isakson sponsored 27 bills.Committee assignments He was a member of the U.S. House Education Committee.", "US Senate (2005–present)": "Elections 2004In early 2003, conservative Democratic U.S. Senator Zell Miller—who had been appointed to fill out the term of the late Republican Senator Paul Coverdell and elected to the post in his own right in 2000—declared his intention not to run for a full term in the Senate in 2004. Isakson immediately entered the race. He faced 8th District U.S. Congressman Mac Collins and businessman Herman Cain in the primary.It was initially thought Isakson would face a difficult primary since many socially conservative Republicans still felt chagrin at Isakson's declared support for abortion rights in 1990.  However, he won the Republican primary with 53%, with Cain a distant second and Collins third. In the general election, he easily defeated the Democratic candidate, 4th District Congresswoman Denise Majette, by 18 points. Isakson's election marked the first time in Georgia's history that both of the state's U.S. Senate seats had been held by Republicans, as Saxby Chambliss had won the other seat by defeating Nunn's successor, Max Cleland, two years earlier.2010In 2010, he was unopposed in the primary. Isakson won re-election with 58% of the vote in 2010, defeating State Commissioner of Labor Mike Thurmond. In 2010, Isakson apologized for referring to voters as \"the unwashed\" in off-hand comments, saying he \"didn't mean anything derogatory by it.\"Legislation As a Senator, Isakson has sponsored over 130 bills.Current committee assignments Committee on FinanceSubcommittee on International Trade, Customs and Global CompetitivenessSubcommittee on Social Security, Pensions and Family PolicySubcommittee on Taxation and IRS OversightCommittee on Health, Education, Labor, and PensionsSubcommittee on Employment and Workplace Safety (Chairman)Committee on Veterans' Affairs (Chairman)Select Committee on Ethics (Chairman)Committee on Foreign RelationsSubcommittee on African AffairsSubcommittee on East Asian and Pacific Affairs[citation needed]", "Political positions": "When compared to his Republican peers in the Senate, Isakson is rated as being close to the average level of conservativeness. As of 2014, Isakson had a lifetime rating of 84.25 by the American Conservative Union. He received a \"Hero of the Taxpayer\" award by Citizens Against Government Waste in 2011. In the first session of the 115th United States Congress, Isakson was ranked the 12th most bipartisan Senator by the Bipartisan Index, a metric created by The Lugar Center and Georgetown's McCourt School of Public Policy to assess congressional bipartisanship. Abortion Isakson is pro-life, except in cases of rape or incest or when the life of the mother is in danger.Environment In 2011, Isakson voted to limit the EPA's ability to regulate greenhouse gas emissions. In 2013, he voted for a concurrent resolution creating a point of order which would make it harder for Congress to put a price on carbon. In a series of roll call votes attached to debate about the Keystone Pipeline on January 21, 2015, he voted against Amendment 87 by Senator John Hoeven that climate change is real and human activity contributes to climate change, and against Amendment 58 by Senator Brian Schatz, that human activity \"significantly\" contributes to climate change. In 2015, he voted against the Obama administration's Clean Power Plan.Gun law Isakson had an \"A\" rating by the National Rifle Association in 2013In 2017, Isakson stated that while he does support concealed carry nationwide, he does not support campus carry, stating that it is \"not the appropriate thing to do.\"In February 2018, in response to the Stoneman Douglas High School shooting, Isakson stated that \"We have to do everything we can within our powers to make sure it never happens again,\" while declining to support any additional gun control measures such as an assault weapons ban or stricter background checks.Healthcare Isakson voted against the Patient Protection and Affordable Care Act, and has since voted over 60 times in favor of ending it.Immigration Isakson favors tougher border security to address the immigration issue. He is credited for developing the \"Isakson Principle,\" which denies the legalization of status to any illegal immigrant or the creation of a temporary worker program unless the Secretary of Homeland Security certifies (\"triggers\") to the president and Congress that measurable border security provisions are in place.", "Personal life": "Isakson and his wife Dianne have three children: John, Kevin and Julie. He has grandchildren as well. Kevin married Katherine James and has three kids (oldest to youngest) Elizabeth, Sarah Katherine, and William. In June, 2015, he disclosed that he had been diagnosed with Parkinson's disease, and that the diagnosis would not affect his 2016 re-election plans.", "Electoral history": "U.S. Senate Republican primary election in Georgia, 1996PartyCandidateVotes%+%RepublicanGuy Millner187,17742%RepublicanJohnny Isakson155,14135%RepublicanClint Day83,61019%RepublicanPaul Broun11,9793%RepublicanBruce Hatfield6,1171%RepublicanDean Parkison2,6311%U.S. Senate Republican primary runoff election in Georgia, 1996PartyCandidateVotes%+%RepublicanGuy Millner169,24053%RepublicanJohnny Isakson151,56047%Georgia's 6th congressional district: results 1998–2002YearRepublicanVotesPctDemocraticVotesPct1999 special electionJohnny Isakson*51,54865.1%Other candidates27,66534.9%2000Johnny Isakson (inc.)256,59575%Brett DeHart86,66625%2002Johnny Isakson (inc.)163,52580%Jeff Weisberger41,20420%* Newt Gingrich resigned his term on January 3, 1999, and Isakson won the special election to succeed him. Candidates from all parties appeared on the same ballot; their party affiliations were not listed. Georgia Senator (Class III) results: 2004–2016YearDemocraticVotesPctRepublicanVotesPct3rd partyPartyVotesPct2004Denise L. Majette1,287,69040%Johnny Isakson1,864,20258%Allen BuckleyLibertarian69,0512%*2010Mike Thurmond996,51639%Johnny Isakson1,489,90458%Chuck DonovanLibertarian68,7503%2016Jim F. Barksdale1,599,72641%Johnny Isakson2,135,80655%Allen BuckleyLibertarian162,2604%*Write-in and minor candidate notes: In 2004, write-ins received 31 votes and Matthew Jamison received 7 votes.U.S. Senate Republican primary election in Georgia, 2004PartyCandidateVotes%+%RepublicanJohnny Isakson346,76553%RepublicanHerman Cain170,46426%RepublicanMac Collins134,05321%U.S. Senate Republican primary election in Georgia, 2016PartyCandidateVotes%+%RepublicanJohnny Isakson (inc.)447,66178%RepublicanDerrick Grayson69,10112%RepublicanMary Kay Bacallao60,89811%", "introduction": "\n Isakson greeting President Ronald Reagan in 1986\n Isakson with President George H. W. Bush in 1990\nJohn Hardy Isakson (born December 28, 1944) is an American politician serving as the senior United States Senator from Georgia, in office since 2005, and a member of the Republican Party. Previously, he represented Georgia's 6th Congressional district in the United States House of Representatives from 1999 to 2005.\nBorn in Atlanta, Georgia, Isakson served in the Georgia Air National Guard (1966–1972) and graduated from the University of Georgia. He opened a real estate branch for Northside Realty and later served 22 years as the company's president. After a failed bid for the Georgia House of Representatives in 1974, he was elected in 1976. He served seven terms, including four as minority leader. Isakson was the Republican candidate for governor of Georgia in 1990, but lost. Two years later, he was elected to the Georgia Senate and served one term. He unsuccessfully ran in the Republican primary in the 1996 U.S. Senate elections.\nAfter 6th District Congressman and Speaker of the House Newt Gingrich resigned, Isakson ran in the February 1999 special election to succeed him, winning by a 40-point margin. He ran for the U.S. Senate in November 2004 after conservative Democratic incumbent Zell Miller opted not to run for re-election. With the backing of much of Georgia's Republican establishment, he won both the primary and general elections by large margins. He is serving his third term after re-election to the Senate in 2016. He became the senior Senator when Saxby Chambliss retired in 2015.\n\n"}, "personal": {"date": "BornJohn Hardy Isakson (1944-12-28) December 28, 1944 (age73)Atlanta, Georgia, U.S.", "Political party": "Republican", "Spouse(s)": "Dianne Davison", "Children": "3", "Education": "University of Georgia (BA)", "Signature": ""}, "timeline": {"United States Senatorfrom Georgia": {"date": "Assumed office January 3, 2005Serving with David Perdue", "Preceded by": "Zell Miller"}, "Chairman of the Senate Veterans Affairs Committee": {"date": "Assumed office January 3, 2015", "Preceded by": "Bernie Sanders"}, "Chairman of the Senate Ethics Committee": {"date": "Assumed office January 3, 2015", "Preceded by": "Barbara Boxer"}, "Member of the US House of Representativesfrom Georgia's 6th district": {"date": "In officeFebruary 23, 1999– January 3, 2005", "Preceded by": "Newt Gingrich", "Succeeded by": "Tom Price"}, "Chairman of the Georgia Board of Education": {"date": "In officeJanuary 6, 1997– February 26, 1999"}, "Member of the Georgia Senatefrom the 21st district": {"date": "In officeJanuary 11, 1993– January 6, 1997"}, "Member of the Georgia House of Representatives": {"date": "In officeJanuary 10, 1977– January 14, 1991"}, "Military service": {"Allegiance": "United States", "Service/branch": "United States Air Force", "Years of service": "1966–1972", "Unit": "Georgia Air National Guard"}}, "code": "I000055", "type": "3", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.4", "social": "-0.01", "leadership": "0.64"}