{"name": "Jon.Kyl", "picture": "K000352.jpg", "detail": {"Early life, education and career": "Kyl was born in Oakland, Nebraska, the son of Arlene Pearl (née Griffith) and John Henry Kyl, a teacher at Nebraska State Teachers College. His father served as a Congressman from Iowa after moving his family to Bloomfield, Iowa. After graduating from high school in 1960, Kyl attended the University of Arizona, where he earned a bachelor's degree in 1964, graduating with honors. Kyl is a member of the Pi Kappa Alpha fraternity, as is Governor Doug Ducey of Arizona. He then earned a law degree in 1966 at the University of Arizona's James E. Rogers College of Law, and served as editor-in-chief of the Arizona Law Review. Before entering politics, he was a lawyer and lobbyist with Jennings, Strouss & Salmon in Phoenix, Arizona. He also worked as an attorney at Mountain States Legal Foundation in Denver, Colorado, prior to running for office.Kyl is married to Caryll Collins, with whom he has had two children. They also have four grandchildren.", "US House of Representatives": "Kyl served in the House of Representatives from 1987 to 1995. He was first elected in 1986 against Democrat Philip R. Davis, 65% to 35%. He was re-elected in 1988 against Gary Sprunk of the Libertarian party, 87% to 13%; in 1990 against Democrat Mark Ivey, Jr., 61% to 39%; and in 1992 against Democrat Walter R. Mybeck, II, 59% to 27%.", "US Senate (1995–2013)": "Committee assignments Committee on the JudiciaryUnited States Senate Judiciary Subcommittee on Crime and Terrorism (Ranking Member)United States Senate Judiciary Subcommittee on the Constitution, Civil Rights and Human RightsUnited States Senate Judiciary Subcommittee on Immigration, Refugees and Border SecurityCommittee on FinanceUnited States Senate Finance Subcommittee on Taxation and IRS Oversight (Ranking Member)United States Senate Finance Subcommittee on Health CareUnited States Senate Finance Subcommittee on Social Security, Pensions, and Family PolicyJoint Select Committee on Deficit ReductionLeadership Kyl was elected by his fellow Senate Republicans to a succession of leadership posts: Policy Committee chairman (2003–2007), Conference chairman (2007), and most recently (in December 2007), Senate Minority Whip. Kyl's ascension to Minority Whip makes him the first Arizonan to hold such an influential Senate leadership post since Democrat Ernest W. McFarland served as Senate Majority Leader from 1951 to 1953. Kyl is the only Arizona Republican to hold such a powerful leadership position.", "US Senate (2018–present)": "Appointment On September 4, 2018, it was announced that Kyl had been appointed by Arizona governor Doug Ducey to take the late senator John McCain's Senate seat until a special election in 2020, after the latter had died of cancer.Committee assignments Committee on Armed ServicesSubcommittee on AirlandSubcommittee on SeapowerSubcommittee on Strategic ForcesCommittee on Homeland Security and Governmental AffairsCommittee on Indian Affairs", "Political positions": "Kyl is considered to be a conservative and was ranked by National Journal as the fourth-most conservative United States Senator in their March 2007 conservative/liberal rankings. In addition, in April 2006, Kyl was selected by Time Magazine as one of \"America's 10 Best Senators\"; the magazine cited his successful behind-the-scene efforts as head of the Senate Republican Policy Committee.Kyl is a signer of Americans for Tax Reform's Taxpayer Protection Pledge.Crime victims' rights Kyl was one of the original sponsors, along with Democratic Senator Dianne Feinstein, of an effort to amend the United States Constitution to protect crime victims' rights in the criminal justice system. When in 2004 it appeared that the constitutional amendment would not receive the requisite 2/3 support to pass the Senate, Kyl and Feinstein authored the Crime Victims' Rights Act, which listed a victims' bill of rights and provided mandamus relief in appellate court for any victim denied those rights. The act also offered sanctions against government officials who wantonly and willfully refused to comply with the Crime Victims' Rights Act.Arms control In November 2010, Kyl announced that he would oppose the New START arms control treaty's ratification in the lame duck session. He was unsuccessful in this regard, as the treaty passed 71-26, clearing the constitutionally mandated two-thirds threshold by the narrowest margin of any nuclear arms control treaty ever ratified by the United States.Internet gambling Jon Kyl and Bob Goodlatte were among the first in the United States to draft legislation on online gambling. In the late 1990s they introduced bills to the Senate that would curb online gambling activities except for those that involved horse and dog races and state lotteries. The bill by Jon Kyl, known as the Kyl bill, was not passed in the end due to certain loopholes. Attorney Jorge Van, at the time principal investigator of the National Gambling Impact Study Commission on Internet Gambling, pointed out that under the Kyl bill \"state lotteries would be able to offer a variety of games under the guise of a lottery, including slot machines\", which ultimately would allow \"interactive wagering at home on the internet which the law aimed to prevent in the first place\".In September 2006, working with then-Congressman Jim Leach, Jon Kyl was a major Senate supporter of Unlawful Internet Gambling Enforcement Act of 2006. The Act was passed at midnight the day Congress adjourned before the 2006 elections. Prior to it being added to the bill, the gambling provisions had not been debated by any Congressional committee, although the general issue had been debated in multiple times in the past. When publication of the associated regulations was delayed until June 2010, Kyl responded by denying unanimous consent to confirm the appointment of 6 nominees to the US Treasury Department, none of whom specialized on gambling issues. Healthcare Kyl voted against the Patient Protection and Affordable Care Act in December 2009, and he voted against the Health Care and Education Reconciliation Act of 2010.Other In February 2006, Kyl joined Senator Lindsey Graham in an amicus brief in the Hamdan v. Rumsfeld case. The brief presented to the Supreme Court of the United States an \"extensive colloquy\" added to the Congressional Record. It was not, however, included in the December 21 debate as evidence that \"Congress was aware\" that the Detainee Treatment Act of 2005 would strip the Court of jurisdiction to hear \"pending cases, including this case\" brought by the Guantanamo detainees.In the spring of 2009, Kyl invited Geert Wilders to show his film Fitna to the United States Congress, which led to American Muslim protests.In 2011, Kyl said that the GOP had abandoned opposition to defense cuts.In 2012, Kyl voted against ratification of the UN Treaty Convention on the Rights of Persons with Disabilities.", "Activism": "Zadroga Act In 2010, Democratic Senate Leader Harry Reid wanted the Senate to return to work on the week between Christmas and New Year's in order to pass time-critical legislation including the James Zadroga 9/11 Health and Compensation Act, which would ensure health coverage for 9/11 first responders. Kyl made a public comment that this would disrespect \"one of the two holiest of holidays for Christians and the families of all of the Senate.\" First responder Kenny Specht appeared on The Daily Show and replied, \"You won't find a single New York firefighter who considers it a sign of disrespect to work in a New York City firehouse on New Year's Eve or New Year's Day.\" The Zadroga Act passed on December 22.Planned Parenthood On April 8, 2011, Kyl spoke on the Senate floor and claimed that performing abortions is \"well over 90 percent of what Planned Parenthood does.\" Planned Parenthood responded that 90 percent of its services are to provide contraception, STD and cancer testing and treatment, and only 3 percent are abortion-related. A spokesperson for Kyl later claimed the senator's remark \"was not intended to be a factual statement but rather to illustrate that Planned Parenthood, an organization that receives millions in taxpayer dollars, does subsidize abortions.\" Politifact noted that Planned Parenthood's numbers (from their most recent Annual Report, year ending June 30, 2009) are the result of self-reporting and that there is no national audit on such claims, but stated their belief that Kyl \"vastly overstated\" the number. A political science professor writing at National Review Online suggested that perhaps Kyl's comments were based on the pregnancy-related services provided to pregnant women, citing Planned Parenthood's 2009 annual report figures and claiming that 98% of those services were for abortion. The phrase \"not intended to be a factual statement\" was mocked by political comedians such as Stephen Colbert, who joked, \"You can't call him out for being wrong when he never intended to be right.\"", "Political campaigns": "Kyl was first elected to the Senate in 1994, defeating Samuel G. Coppersmith (D), then a member of the House of Representatives, 54% to 40%. Libertarian Party candidate Scott Grainger got 6% of the votes.Kyl was re-elected in 2000 without major-party opposition, with 79% of the vote. Independent William Toel got 8%; Green Party candidate Vance Hansen also got 8%; and Barry Hess of the Libertarian Party got 5%.On November 7, 2006, Kyl defeated real estate developer and former Arizona Democratic Party chairman Jim Pederson to win his third term in the Senate. Kyl won with 53% of the vote; Pederson received 44%; and Libertarian Party candidate Richard Mack received 3%. The race was one of the most expensive in Arizona history, with Kyl raising more than $15 million and Pederson raising just shy of that amount.A major issue in the campaign was illegal immigration. While in the Senate, Kyl cosponsored legislation that would give illegal immigrants up to five years to leave the country. Once there, they could apply for permanent residence or be guest workers. Since fellow Arizona Senator John McCain opposed this legislation, Pederson tried to use the issue as a way of allying with McCain and dividing Republicans in Arizona. Controversy also arose when each candidate accused the other of supporting the amnesty provisions in a 1986 immigration bill, although both candidates deny ever supporting those provisions.", "introduction": "Jon Llewellyn Kyl (/ˈkaɪl/; born April 25, 1942) is an American politician serving as the junior United States Senator from Arizona since September 5, 2018, succeeding the late John McCain. A member of the Republican Party, he previously held Arizona's other seat in the U.S. Senate from January 1995 to January 2013, serving alongside McCain. Kyl was Senate Minority Whip from 2007 until 2013.\nThe son of U.S. Representative John Henry Kyl and Arlene (nee Griffith) Kyl, Kyl was born and raised in Nebraska and lived for some time in Iowa. He received his bachelor's degree and law degree from the University of Arizona. He worked in Phoenix, Arizona as an attorney and lobbyist before winning election to the United States House of Representatives, where he served from 1987 to 1995. He was elected to the U.S. Senate in 1994 and continued to be re-elected by comfortable margins until his retirement in January 2013. In 2006, he was recognized by Time magazine as one of America's Ten Best Senators. Kyl was ranked by National Journal in 2007 as the fourth-most conservative U.S. Senator. He has been a fixture of Republican policy leadership posts, chairing the Republican Policy Committee (2003–2007) and the Republican Conference (2007). In December 2007, he became Senate Minority Whip. He was named one of the 100 most influential people in the world in 2010 for his persuasive role in the Senate.\nKyl announced in February 2011 that he would not seek re-election to the Senate in 2012 and would retire at the end of his third term. He expressly ruled out running for further office except, if offered, the Vice Presidency. After leaving the Senate in 2013, he worked as an attorney in private practice and then worked to shepherd the Supreme Court nomination of Brett Kavanaugh.\nIn September 2018, Kyl was appointed by Governor Doug Ducey to serve in the Senate seat left vacant by the death of John McCain. At a press conference accepting the appointment, Kyl announced that he may only serve until the end of the 115th United States Congress, which ends on January 3, 2019, but that he would definitely not run for the remainder of the term following the 2020 special election.\n\n"}, "personal": {"Born": "Jon Llewellyn Kyl (1942-04-25) April 25, 1942 (age76)Oakland, Nebraska, U.S.", "Political party": "Republican", "Spouse(s)": "Caryll Collins", "Children": "2", "Parents": "John Henry KylArlene Griffith", "Education": "University of Arizona (BA, LLB)"}, "timeline": {"United States Senatorfrom Arizona": {"date": "In officeJanuary 3, 1995– January 3, 2013", "Appointed by": "Doug Ducey", "Preceded by": "Dennis DeConcini", "Succeeded by": "Jeff Flake"}, "Senate Minority Whip": {"date": "In officeDecember 19, 2007– January 3, 2013", "Leader": "Mitch McConnell", "Preceded by": "Trent Lott", "Succeeded by": "John Cornyn"}, "Member of the US House of Representativesfrom Arizona's 4th district": {"date": "In officeJanuary 3, 1987– January 3, 1995", "Preceded by": "Eldon Rudd", "Succeeded by": "John Shadegg"}}, "code": "K000352", "type": "3", "party": "Republican", "description": "centrist Republican follower ", "economic": "0.55", "social": "-0.41", "leadership": "0.0"}