{"name": "Joni.Ernst", "picture": "E000295.jpg", "detail": {"Early life and career": "Ernst was born Joni Kay Culver in Montgomery County, Iowa, the daughter of Marilyn and Richard Culver. She was valedictorian of her class at Stanton High School.Ernst earned a  bachelor's degree in psychology from Iowa State University, and a Master of Public Administration degree from Columbus State University. While in college, Ernst took part in an agricultural exchange to the Soviet Union.Military career Ernst served as a logistics officer and attained the rank of lieutenant colonel in the Iowa National Guard.  Near the end of her career, she served as the commanding officer of the 185th Combat Sustainment Support Battalion at Camp Dodge, the largest battalion in the Iowa Army National Guard. Upon her retirement from the military in 2015, Ernst had served 23 years between the Army Reserve and the Army National Guard.She spent 12 months in Kuwait in 2003–04 as the company commander of the 1168th Transportation Company during the Iraq War.Iowa State Senate Ernst was elected the Montgomery County Auditor in 2004 and re-elected in 2008.Ernst was elected to the Iowa State Senate in a special election in 2011 and re-elected in 2012. She represented District 12, which serves the southwest part of the state. Ernst was a member of the Education, Appropriations, Veterans Affairs, Rules and Administration and Health and Human Services committees of the Iowa State Senate.Following her election to the U.S. Senate, she resigned from the Iowa State Senate effective November 28, 2014.", "US Senate": "2014 U.S. Senate election In July 2013, Ernst announced that she would seek the Senate seat held by retiring Democratic Senator Tom Harkin.Ernst received the endorsement of Iowa Lieutenant Governor Kim Reynolds in October 2013. She was also endorsed by 23 current and former state legislators. In March the Ernst campaign was endorsed by former Massachusetts Governor Mitt Romney and former Alaska Governor Sarah Palin. In May 2014, she was endorsed by the U.S. Chamber of Commerce.Ernst received widespread attention for a campaign advertisement she released in March 2014 where she employed a tongue-in-cheek comparison between her experience castrating pigs and her ability to cut \"pork\" in Congress. Many found the ad to be humorous and it was spoofed by late-night comedians including Jimmy Fallon and Stephen Colbert, Before the ad aired, Ernst had struggled in fundraising, and two polls of the Republican primary taken in February 2014 had shown her in second place, several points behind opponent Mark Jacobs. After it aired, a Suffolk University poll in early April showed her with a narrow lead and a Loras College poll showed her essentially tied with Jacobs. By May, she was being described by the media as the \"strong front-runner\".In an interview with the Des Moines Register on May 9, 2014, Ernst said she was \"extremely offended\" by comments made by Republican opponent Mark Jacobs in which she was characterized as AWOL due to missing over 100 votes in the legislative session ending April 7, 2014. Ernst stated: \"If [Mark Jacobs] had any sort of service like I have, he would've understood what AWOL means. I have not been AWOL, I will never be AWOL.\" Previously, in an article in The Gazette, Ernst cited her National Guard duty to rebuff criticism about her missing votes, but The Gazette found that only 12 of the 117 missed votes came on days when she was on duty. The other 105 missed votes represented 57 percent of the Iowa Senate votes that session. Ernst's spokesman said that she has had a better than 90 percent voting record during her career in the Senate and that she never claimed guard service was the only reason she's missed votes this session.In endorsing her for the Republican Primary nomination, the Des Moines Register stated: \"Ernst is a smart, well-prepared candidate who can wrestle with the details of public policy from a conservative perspective without seeming inflexible.\" On October 23, Ernst cancelled a scheduled meeting with the Des Moines Register's editorial board, citing as a reason the newspaper's negative editorials about her. The newspaper's editorial board endorsed Ernst's opponent,  Democrat Bruce Braley.On June 16, 2014, in an event organized by Americans for Prosperity, at a panel titled \"The Senate: A Window of Policy Opportunity for Principled Leaders\", Ernst thanked the group for its fundraising. In July 2014, Ernst's campaigning was temporarily paused while she participated in two weeks of National Guard duty. In that same month, Ernst delivered the Republican Party's weekly address, where she criticized the health care scandal at the Department of Veterans Affairs and pushed for a balanced federal budget and entitlement reform.On August 29, Ernst and Braley announced their agreement to hold three televised debates in Davenport, Des Moines, and Sioux City. They were held on September 28, October 11 and 16, respectively.Ernst won the 2014 Senate race 52.2% to 43.7%. She is the first woman elected to represent Iowa in either House of Congress.Committee assignments Committee on Agriculture, Nutrition and ForestrySubcommittee on Jobs, Rural Economic Growth and Energy Innovation (Chair)Subcommittee on Livestock, Dairy, Poultry, Marketing and Agriculture SecuritySubcommittee on Nutrition, Specialty Crops, Food and Agricultural ResearchCommittee on Armed ServicesSubcommittee on AirlandSubcommittee on Emerging Threats and CapabilitiesSubcommittee on Readiness and Management SupportCommittee on Homeland Security and Governmental AffairsSubcommittee on Federal Spending Oversight and Emergency ManagementSubcommittee on Regulatory Affairs and Federal ManagementCommittee on Small Business and Entrepreneurship", "US Senate career": "114th Congress (2015–2017) Ernst was sworn into the United States Senate on January 3, 2015. She delivered the official Republican response to the State of the Union a week later on January 20.While not a political candidate for the 2016 U.S. presidential election, on June 6, 2015, Ernst sponsored \"Joni's 1st Annual Roast and Ride,\" an event which featured a motorcycle parade in which she rode a motorcycle. Ernst invited Republican presidential candidates to attend the event. According to coverage by the Des Moines Register, \"Speaking to the media, Ernst indicated that it is critical for presidential candidates to engage in the type of retail politicking this and other Iowa events provide.\" Ernst said that \"Iowans want to see their candidates. They want to reach out and shake their hands. They want to ask that question face to face. Grass roots is important. Family is important. Neighbors are important in Iowa. And they want someone that fits that mold and is able to connect with voters. Every candidate is going to have their reasons whether they participate or not, but they will get a better response if they do come to the Iowa Straw Poll.\"  The event was attended by Republican presidential candidates Carly Fiorina, Lindsey Graham, Mike Huckabee, Rick Perry, Marco Rubio, and Scott Walker.On November 18, 2015, Ernst said the US should halt the immigration of Syrian refugees, calling for a \"thorough vetting process\", and commenting that President Obama did not have \"a clearly communicated and comprehensive strategy\".In early January 2016, Ernst stated President Obama's recent executive order in favor of gun laws was \"overreaching and unilateral\" and advocated Congress as the proper method for such laws to be imposed as \"the American people should have a voice in this process instead of the President's top-down approach that sidesteps Congress and the people we were elected to represent.\" On January 8, in response to President Obama vetoing legislation passed by both chambers of Congress to repeal provisions of the Affordable Care Act, Ernst charged President Obama with choosing \"to ignore families and small businesses who have been hurt by the painful effects of ObamaCare\" as part of his promotion of what she called a \"failed agenda\". On January 13, the day after the 2016 State of the Union Address, Ernst said the president \"really missed an opportunity last night to spell out a clear and concise strategy for defeating ISIS, but he seemed to just push it away and dismiss it in a manner that I didn't appreciate as a veteran.In February 2016, Ernst criticized the Obama administration's ISIS strategy as ineffective and said she was trying to address the policy by collaborating with fellow members of the Senate Armed Forces Committee for the draft of a bill that would ultimately allow American troops to combat ISIS wherever the group is discovered.In May 2016, Ernst was placed on the Washington Post's short list as a possible vice presidential running mate for Donald Trump's 2016 campaign to become the 45th President of the United States. Other media outlets included her as a possible benefit to Trump's campaign as well. In 2015, when she was asked if she would become a nominee for Vice President, she demurred but did not decline. \"Well, I think that's—that's nice,\" she said. \"Did my mother pay you to say that?\" On June 16, Ernst said she believed Trump was interested in someone else as no one had \"reached out\" to her and that she was content with this. The following month, on July 4, she and Trump met privately. Governor Mike Pence of Indiana was later chosen for the job on July 15, 2016.On September 4, while attending a fundraiser, Ernst appeared alongside Kris Paronto, who she said had been an eyewitness to \"the lack of leadership from Hillary Clinton first-hand.\"After the release of the Donald Trump and Billy Bush recording, Ernst denounced Trump's comments but confirmed she would still vote for him.In a November 1 statement approving President Obama's declaring federal disasters in 19 of Iowa's counties, Ernst warned \"it is imperative that the Army Corps of Engineers complete flood mitigation projects in Eastern Iowa to help prevent damage from these storms in the future and to avoid the continued need for emergency assistance.\" On November 14, Ernst sent President Obama a letter where she stated Latin America was experiencing a growth in the membership of ISIS and said she wanted the president to talk with officials in Latin America about combatting the growing group. On November 22, in response to the Departement of Veteran Affairs' issuing a statement following the investigation into the suicide of veteran Brandon Ketchum, Ernst disavowed the claims by the department and stated her intent to \"remain vigilant in continuing to press the VA for specific answers over Mr. Ketchum's death, as well as how they plan to fix their policies moving forward to prevent these horrific tragedies from happening.\"On December 9, after voting for a short term spending bill, Ernst said, \"While this is not the process through which our government should be funded, it is a temporary bridge to the spring when we can put common-sense legislation on our new president's desk that otherwise would have been vetoed by this current administration.\" On December 12, after President-elect Trump announced his choice of John Kelly for United States Secretary of Homeland Security, Ernst said that Trump in choosing Kelly was selecting \"someone with such a deep level of experience to lead the Department of Homeland Security and address\" ISIS's rise in Latin America and border security. On December 21, Ernst announced her roles in the upcoming session of congress.115th Congress (2017–present) On January 12, 2017, Ernst questioned United States Secretary of Defense nominee James Mattis on whether he would pledge to prioritizing cutting wasteful spending, stopping sexual assault and retaliation in the military, and enhance national security missions by leveraging the different abilities of \"our guard and reserve forces\"; Mattis committed to each.Later that month, Ernst announced her intent to introduce legislation that would redirect funding for Planned Parenthood to other women's health care providers and that she already had a bill meant to overturn a policy of the Obama administration securing grants from Planned Parenthood to Title X family planning, furthering this would be accomplishable with a \"pro-life president in the White House and pro-life majorities in the House and Senate\". President Trump signed the latter bill into law on April 13, 2017.In early February, Ernst predicted that United States Secretary of Education Betsy DeVos would be confirmed and charged the Democrats in the Senate with trying to obstruct her confirmation due to bitterness over the election results two months prior.  After DeVos was confirmed, Ernst stated she had vetted DeVos, who she found to believe those physically closest to students knew what was best for them, and would hold her accountable during her tenure. On February 16, Ernst condemned the behavior of Russia as \"totally unacceptable\" and said President Trump would be needed in leading the US to \"show strength against Vladimir Putin\" during a call with reporters.In early March, Ernst joined Senator Dan Sullivan in sending a letter to Defense Secretary Mattis supporting Asia-Pacific Stability Initiative being created: \"\"We remain concerned with the eroding military balance resulting from a resource-constrained U.S. defense budget, the People's Republic of China's (PRC) two-decade military modernization, a resurgent Russia expanding fighter and bomber aviation into the Pacific, and a belligerent North Korea wherein Kim Jong-un has detonated more nuclear weapons and tested more missiles than both his father and grandfather, combined.\" On March 8, Ernst and fellow Senator Ron Johnson re-introduced the Dr. Chris Kirkpatrick Whistleblower Protection Act, Ernst saying attempts at repairing the Veterans Affairs \"must be protected, not punished, as we work to improve access to timely and quality care for our nation's veterans.\" On March 14, after the release of photographs of nude female soldiers on a Facebook page, Ernst stressed this \"type of activity creates a culture that leads to sexual assault.\"  During a press conference on March 28, Ernst made the request of Congress for the passage to require individuals to immediately report suspected sexual assault at government facilities.On April 7, Ernst showed support for President Trump's Shayrat missile strike, calling it a one time attack in response to the Khan Shaykhun chemical attack and a good \"assessment\" and \"call\" on the part of President Trump. The same day, after Neil Gorsuch was confirmed to the Supreme Court by the Senate, Ernst said Gorsuch was \"eminently qualified to serve on our nation's highest court\". On April 26, after the tax reform proposal by the Trump administration was made public, Ernst said that it was \"long-overdue that we take a hard look and find ways to simplify it and ensure our country has a globally competitive system that promotes business growth and helps hardworking families.\"In early May, Ernst voiced disapproval for a potential government shutdown in the fall after President Trump suggested one for September: \"I think we should be working really hard to avoid that.\" On May 25, Ernst and Democratic Senator Joe Manchin sent a joint letter to Senate Committee on Energy and Natural Resources members Lisa Murkowski and Maria Cantwell proposing a bipartisan legislation hearing for the passage of the Global War on Terrorism Memorial Foundation.After President Trump's selection of Christopher A. Wray for Director of the Federal Bureau of Investigation on June 7, a spokeswoman for Ernst's intention to vet and ensure Wray as \"a good choice for the position of FBI Director.\" On June 15, during a conference call after the Senate voted 98-2 for bestowing financial sanctions on Russia, Ernst said the choice came as a result of the US being disenfranchised with Russia for having attempted to interfere with the last presidential election, the country's support for the Syrian regime, Ukraine military intrusion, and their cyber activity and that the US was \"trying to show some strength and send a clear message to Iran and Russia that they cannot do these types of actions.\" Later in the month, Ernst was one of ten Republican senators to urge Senate Majority Leader Mitch McConnell to cancel the state work period of the Senate scheduled in August if \"fixing health care, funding the government, dealing with the debt ceiling, passing a budget resolution, and improving our tax code\" had not had \"meaningful progress\" made in a joint letter.On July 5, in response to the release of the 2018 and 2019 proposed renewable volume obligations by the Environmental Protection Agency, Ernst praised the 2018 proposal for having congressionally-approved conventional ethanol while saying she was \"disappointed that the 2019 biodiesel number was held constant, and would like to see it more accurately reflect current domestic usage and production capacity.\" On July 19, Ernst submitted a written testimony in support of the Global War on Terrorism War Memorial Act to the Energy and Natural Resources Subcommittee, stressing the importance of hastening its passage: \"The longer we wait, the greater the chance that our first veterans of the Global War on Terror will not be witnesses to a National Memorial dedicated to their service and sacrifice.\"In a September 5 statement, in response to President Trump rescinding the Deferred Action for Childhood Arrivals program, Ernst said \"we must identify and pursue a measured approach that addresses their unique situation, but also respects the importance of our immigration laws and discourages future illegal immigration.\" On September 12, Ernst reintroduced the Presidential Allowance Modernization Act of 2017, implementing limits on taxpayer support received by former presidents. On September 19, Ernst was one of four senators to introduce bipartisan legislation implementing Department of Agriculture export promotion programs increases.On October 26, Trump signed the Dr. Chris Kirkpatrick Whistleblower Protection Act of 2017 into law. On October 31, Ernst introduced the Stop Questionable, Unnecessary, and Excessive Allowances for Legislators Act, eliminating the tax code provision allowing congressional members for a deduction over income tax purposes \"up to $3,000 annually in living expenses\" within the Washington, D.C. area.Affordable Care Act repeal On May 7, 2017, days after the House voted to repeal the Affordable Care Act, Ernst said she could not guarantee the Senate healthcare bill would confirm coverage for individuals with pre-existing conditions during an appearance in Hampton, Iowa. During a May 30 joint appearance with Grassley, Ernst told reporters Obamacare could not be repealed \"in its entirety\". On June 13, after a White House meeting on health care reform, Ernst expressed her distaste for the current law: \"The reality in Iowa is that continuing the status quo simply isn't an option because ObamaCare is unsustainable.\" During a June 23 news conference, a day after the release of the Republican Senate health care bill, Ernst said she was still reviewing the bill and that she did not believe lower-income Iowans were losing Medicaid insurance. On July 25, after the Senate voted to begin debating the Affordable Care Act, Ernst called the vote \"the long-overdue opportunity we've been waiting for to roll back this disastrous law and replace it with affordable, patient-centered solutions for Iowans.\" Toward the end of July, after the Affordable Care Act came under consideration by the Senate, Ernst criticized the law as being unsustainable in Iowa and said she was \"disappointed that the Senate was unable to advance important changes to this flawed law.\"", "Political positions": "Constitutional and federal issues Ernst has proposed eliminating the Internal Revenue Service, the Department of Education, and the Environmental Protection Agency as a means of cutting federal spending. She has advocated eliminating the Department of Education \"not just because it would save taxpayer dollars, but because I do believe our children are better educated when it's coming from the state.\"Ernst has expressed her support for allowing law-abiding citizens to \"freely carry\" weapons but abide by rules against carrying in public buildings like schools. In February 2013, Ernst co-sponsored a resolution addressing \"the Iowa General Assembly's refusal to recognize or support any statutes, presidential directives, or other regulations and proclamations which conflict with the Second Amendment of the Constitution of the United States and which are expressly preempted by the rulings of the United States Supreme Court\". She has also received an \"A\" rating from the National Rifle Association for her support of gun-rights issues.As an Iowa state senator, Ernst co-sponsored resolutions concerning state nullification of federal law. One such bill asserted that Iowa could ignore any federal laws which \"are directly in violation of the Tenth Amendment,\" while another \"urg[ed] the nullification\" of certain EPA regulations related to coal-fired electricity plants. In a September 2013 forum held by the Iowa Faith & Freedom Coalition, Ernst said Congress shouldn't bother to pass laws \"that the states would consider nullifying\", referring to what she describes as \"200-plus years of federal legislators going against the Tenth Amendment's states' rights.\" Courts have consistently ruled that nullification is unconstitutional. During the 2014 Senatorial general election, Ernst's supporters argued that she did not support nullification, and that \"her comments on it were about encouraging Iowans to send her to Washington to pass good laws.\"When asked at a Montgomery County, Iowa candidate forum in January 2014, about the Supreme Court case about the constitutionality of President Barack Obama's recess appointments, she said that Obama had \"become a dictator\", and that if he acted unconstitutionally, he should face the proper repercussions as determined by Congress, \"whether that's removal from office, whether that's impeachment.\" When the tape of that event was published in August 2014 by Yahoo News, her spokeswoman said that \"If any president oversteps their bounds, there are procedures in place for Congress and the American people to hold him or her accountable. Impeachment is a strong word and should not be thrown around lightly.\"In 2016, along with U.S. Senators Deb Fischer, Charles Grassley, and Ben Sasse,  Joni Ernst introduced \"Sarah's Law,\" a legislation in honor of Sarah Root, a 21-year-old female student in Omaha, who was killed in a street racing crash in January 2016.Donald Trump In January 2018, after President Donald Trump reportedly called Haiti, El Salvador and African countries \"shithole countries\" and voiced his opposition to immigrants from those countries, Ernst said \"Deep inside, no, I don't think he's a racist. I think he's brash and he says things that are on his mind, but I don't truly believe that he's a racist.\"Economic issues Ernst opposes the federal minimum wage, and instead argues that states should have sole authority to set their own minimum wages. In an August 2014 interview with the Mason City Globe-Gazette, Ernst stated: \"For the federal government to set the minimum wage for all 50 states is ridiculous.\" She has pointed to differences in the cost of living in various states, and has said: \"I think $7.25 is appropriate for Iowa, but that's up for our state legislators to decide, and I'm willing to have those discussions at the state level.\" In response to a report by the Congressional Budget Office report which projected that increasing the minimum wage to $10.10 per hour would cost 500,000 jobs, but would lift 900,000 people out of poverty, Ernst stated that \"government and government-mandated wage increases are not the solution—especially when doing so comes at the expense of the jobs of hard working Americans.\"During the 2013 legislative session, Ernst worked on legislation which reduced property taxes in Iowa. She supports a \"fairer, flatter, and simpler\" federal tax code.In a May 2014 interview with The Des Moines Register, Ernst expressed her support for a constitutional amendment requiring a balanced federal budget, as well as a reduction in spending on entitlement programs and discretionary spending. She has also expressed support for a partial privatization of Social Security accounts for young workers while protecting Social Security for seniors and those nearing retirement.Environmental issues On the subject of global warming, Ernst has stated: \"I don't know the science behind climate change, I can't say one way or another what is the direct impact from whether it's manmade or not\", and believes that any regulatory role by the government to address it needs to be \"very small.\" Ernst has proposed eliminating the Environmental Protection Agency and criticized its interpretation of the Clean Water Act as applied to farms. In a Republican primary debate in May 2014, Ernst said she would have voted against the 2014 U.S. Farm Bill and stated her view that the Clean Water Act is damaging for business. Ernst has expressed her opposition to cap-and-trade.At a January 2014 GOP forum in Montgomery County, Iowa, Ernst warned that Agenda 21, a 1992 United Nations voluntary action plan for sustainable development, could force Iowa farmers off their land, dictate what cities Iowans must live in, and control how Iowa citizens travel from place to place. During the general-election campaign, Ernst moderated her tone, saying: \"I don't think that the U.N. Agenda 21 is a threat to Iowa farmers... I think there are a lot of people that follow that issue in Iowa. It may be something that is very important to them, but I think Iowans are very smart and that we have a great legislature here, we have a very intelligent governor, and I think that we will protect Iowans.\"Foreign policy Regarding the Iraq War and weapons of mass destruction, Ernst stated: \"We don't know that there were weapons on the ground when we went in, however, I do have reason to believe there were weapons of mass destruction in Iraq. That was the intelligence that was operated on. I have reason to believe there was weapons of mass destruction. My husband served in Saudi Arabia as an Army Central Command sergeant major for a year and that's a hot-button topic in that area.\" After criticism from Iowa Democrats and some commentators, Ernst then issued a clarifying statement in which she stated that she did not mean to suggest that Iraq had WMD at the time of invasion, but rather that Iraq had had WMDs in their past which they used, and that her point was that \"we don't know exactly what happened to those weapons.\"When asked whether she supports the limited airstrikes conducted in Iraq in August 2014, Ernst said: \"What I can say is what I would have supported is leaving additional troops in Iraq longer and perhaps we wouldn't have this situation today.\"In an interview with Time Magazine, Ernst said that she was sexually harassed in the military, stating that \"I had comments, passes, things like that\" which she was able to stop, and said she will support removing sexual assault cases from the chain of command.Gun control I do believe in the right to carry, and I believe in the right to defend myself and my family — whether it's from an intruder, or whether it's from the government, should they decide that my rights are no longer important.Ernst is a gun owner. She has an \"A\" rating from the National Rifle Association (NRA). The NRA endorsed her during the 2014 election stating \"In contrast to anti-gun Bruce Braley, Joni Ernst is committed to protecting the Second Amendment and will continue to oppose all attempts to ban lawfully-owned firearms and magazines. She will stand strong against President Obama and former New York City Mayor Michael Bloomberg's gun control agenda.\" Since 2014, Ernst has received $3,124,273 in financial support from the NRA.In response to the 2017 Las Vegas shooting, Ernst offered thoughts and prayers to the victims and described the shooting as \"senseless violence.\"Following the Stoneman Douglas High School shooting, Ernst stated that mental illness was the \"root cause\" for many mass shootings.Healthcare issues Ernst indirectly endorsed Paul Ryan's partially privatized Medicare model in a 2011 Iowa Senate vote. According to an August 2014 article in The Gazette, she has not laid out a detailed plan for Medicare reform.Ernst supports replacing the Patient Protection and Affordable Care Act saying that it is \"an additional tax of $1.2 trillion on the American people over the next decade and I believe we need to eliminate Obamacare but replace it with free market alternatives.\"In answering a survey for the Campaign for Liberty in 2012, Ernst answered \"Yes\" when asked if she would support legislation that would \"nullify ObamaCare and authorize state and local law enforcement to arrest federal officials attempting to implement [it].\"Social issues Ernst has said she believes marriage is a \"state issue.\" She co-sponsored a failed bill to amend the Iowa constitution to have marriage legally defined as between one man and one woman. She opposes same-sex marriage.Ernst is pro-life, believing that life begins at conception. She voted for a fetal personhood amendment in the Iowa Senate in 2013 and has said that she would support a federal personhood bill.In 2013, Ernst voted against bringing Senate File 79 up for a vote in the Iowa Senate, a bill that would legalize medical marijuana. Ernst expressed concerns that the drug \"would ultimately end up in the hands of minors.\"", "Personal life": "In 1992, Joni Ernst married Gail Ernst, a divorcee who is 17 years her senior. Gail Ernst has two daughters from his previous marriage to Ingrid Nesbit, which ended in divorce. He is a retired Command Sergeant Major in the United States Army Rangers and currently an airport manager. Ernst resides in Red Oak, Iowa with her husband and their daughter, Libby.Ernst is a lifetime member of the Montgomery County Republican Women, Veterans of Foreign Wars Post 2265, Montgomery County Court of Honor, Altrusa, PEO Chapter HB, a lifetime member of the National Rifle Association,[citation needed] and member of the Montgomery County Farm Bureau. She is a member of the Mamrelund Lutheran Church (ELCA) of Stanton, Iowa.On August 27, 2018, Ernst announced that she was in the process of a divorce.", "Electoral history": "Iowa State Senate 12th district election, 2012PartyCandidateVotes%+%RepublicanJoni Ernst22,20599.06%Write-insWrite-ins2100.93%U.S. Senate Republican primary election in Iowa, 2014PartyCandidateVotes%+%RepublicanJoni Ernst88,53556.12%RepublicanSam Clovis28,41818.01%RepublicanMark Jacobs26,52316.81%RepublicanMatt Whitaker11,8847.53%RepublicanScott Schaben2,2331.42%RepublicanWrite-ins1550.10%U.S. Senate election in Iowa, 2014PartyCandidateVotes%+%RepublicanJoni Ernst588,57552.10%DemocraticBruce Braley494,37043.76%IndependentRick Stewart26,8152.37%LibertarianDouglas Butzier8,2320.73%Term LimitsBob Quast5,8730.52%IndependentRuth Smith4,7240.42%Write-insWrite-ins1,1110.10%", "introduction": "Joni Kay Ernst (/ˈdʒoʊni ˈɜːrnst/; née Culver, July 1, 1970) is an American politician serving as the junior United States Senator for Iowa since 2015. A Republican, she served in the Iowa Senate from 2011 to 2014. She served in the Iowa Army National Guard from 1993 to 2015, retiring as a lieutenant colonel. Ernst is the first woman to represent Iowa in the United States Congress and the first female combat veteran elected to the United States Senate from any state.\n\n"}, "personal": {"Born": "Joni Kay Culver (1970-07-01) July 1, 1970 (age48)Red Oak, Iowa, U.S.", "Political party": "Republican", "Children": "3 (2 stepsons) ", "Education": "Iowa State University (BA)Columbus State University (MPA)"}, "timeline": {"United States Senatorfrom Iowa": {"date": "Assumed office January 3, 2015Serving with Chuck Grassley", "Preceded by": "Tom Harkin"}, "Member of the Iowa Senatefrom the 12th district": {"date": "In officeJanuary 5, 2011– November 28, 2014", "Preceded by": "Kim Reynolds", "Succeeded by": "Mark Costello"}, "Military service": {"Allegiance": "United States", "Service/branch": "United States Army Iowa Army National Guard", "Years of service": "1993–2015", "Rank": " Lieutenant Colonel", "Unit": "185th Combat Sustainment Support Battalion", "Battles/wars": "Iraq War"}}, "code": "E000295", "type": "3", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.52", "social": "0.01", "leadership": "0.4"}