{"name": "José.Serrano", "picture": "", "detail": {"Early life, education, and military service": "Serrano was born in Mayagüez, Puerto Rico. At the age of seven, Serrano was taken by his family to The Bronx, where he was raised in the Millbrook Houses. Serrano went to Grace Dodge Vocational High School in the Bronx and then attended Lehman College. He served in the United States Army medical corps from 1964 to 1966.", "New York Assembly": "He was a member of the New York State Assembly from 1975 to 1990, sitting in the 181st, 182nd, 183rd, 184th, 185th, 186th, 187th and 188th New York State Legislatures. His district was numbered the 75th until 1982, and the 73rd from 1983 on. He was Chairman of the Committee on Consumer Affairs, and of the Committee on Education.", "US House of Representatives": "Elections In 1990, Serrano won a special election for the seat vacated by resigning U.S. Congressman Robert García with 92% of the vote. He has never won re-election with less than 92% of the vote, in what is considered one of the safest seats in Congress.In 2004, Congressman Serrano faced an electoral challenge from Jose Serrano, an unemployed former loading dockworker with the same name who eventually dropped out of the race in July.Tenure A member of the Progressive Caucus, he is widely regarded as one of the most progressive members of Congress. He has been questioned about his pork barrel spending by some fiscal conservative members of Congress. Arizona Congressman Jeff Flake once said of Serrano's $150,000 earmark to repair the roof at the city-owned Arthur Avenue Market (a historic indoor produce and prepared food market in the Bronx's \"Little Italy\"), \"I would argue this is one cannoli the taxpayer doesn't want to take a bite of.\" Serrano replied to Flake, \"The more you get up on these, sir, the more I realize that you do not know what you are talking about. I make no excuses about the fact that I earmark dollars to go in the poorest congressional district in the nation, which is situated in the richest city on earth.\"On November 18, 2005, he was one of three votes in favor of immediate withdrawal of American troops from Iraq. The other two votes were from Cynthia McKinney of Georgia and Robert Wexler of Florida.In 1997 [HJR 19], 1999 [HJR 17], 2001 [HJR 4], 2003 [HJR 11], 2005 [HJR 9], 2007 [HJR 8], 2009 [HJR 5], 2011 [HJR 17], and 2013 [HJR 15], Serrano introduced a joint resolution proposing an amendment to the Constitution of the United States to repeal the 22nd Amendment, thereby removing the limitation on the number of terms an individual may be elected to as president. Each resolution died without ever getting past the committee. Serrano's January 2013 proposal was met with heavily negative backlash in social media, including a flood of so-called \"hateful\" comments on his Facebook page.[citation needed]Serrano has paid attention to local environmental issues in New York, with a particular focus on constructing greenways, acquiring parklands, and cleaning up the Bronx River, which runs through his district.  Recently a beaver was discovered swimming in the river for the first time in 200 years, something seen as a testament to his efforts.  In 2007, he engineered the purchase of the last privately owned island in New York harbor—South Brother Island—for preservation in perpetuity by the City of New York as a wildlife refuge for rare shorebirds.Serrano is one of three New York-area congressmen on the House Appropriations Committee, the others being Nita Lowey of the 18th district and Grace Meng of 6th district. He is currently the ranking member of the Appropriations Subcommittee on Financial Services, having previously served as the chair.  As chairman, he successfully engineered the inclusion of language in the 2007 omnibus spending bill that guarantees the extension of the 50 State Quarters program to include the minting of 6 additional quarters to honor the District of Columbia and the 5 United States territories, including Serrano's native Puerto Rico.Serrano has also been an advocate for Puerto Ricans under FBI prosecution. In May 2000, he brokered an agreement with then-FBI Director Louis Freeh, then Puerto Rican Independence Party Electoral Commissioner Manuel Rodríguez Orellana and then Puerto Rico Senate Federal Affairs Committee chairman (and future Puerto Rico Senate President and Secretary of State) Kenneth McClintock, that has resulted in the release of nearly 100,000 pages of previously secret FBI files on Puerto Rican political activists.Serrano was a critic of the Bush administration's approach to handling President Hugo Chávez of Venezuela. In 2005, while the Venezuelan President was in New York City speaking before the United Nations, the congressman invited him to his district to speak to his constituency.[citation needed]  After Chávez' death, Serrano published condolences via Twitter describing him as a leader who \"understood the needs of the poor. He was committed to empowering the powerless. R.I.P. Mr. President.\" His statements prompted a response from the Republican National Committee that described Serrano's tweet as \"simply insulting that a Democrat Congressman would praise the authoritarian ruler Hugo Chávez.\"[citation needed]Committee assignments Committee on AppropriationsSubcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on Financial Services and General Government (Ranking Member)Subcommittee on Interior, Environment, and Related AgenciesCaucus memberships Congressional Hispanic CaucusCongressional Progressive Caucus.International Conservation CaucusCongressional Arts CaucusAfterschool CaucusesUnited States Congressional International Conservation CaucusParty leadership Senior Whip", "Personal life": "Serrano's son, José M. Serrano, is a member of the New York State Senate. In addition to José Marco, Serrano has four other children.", "introduction": "José Enrique Serrano (born October 24, 1943) is an American politician who has been a member of the United States House of Representatives since 1990. Serrano, a Democrat from New York, represents a district that is one of the smallest in the country geographically, consisting of a few square miles of the heavily populated South Bronx in New York City. His district is also one of the most densely populated and one of the few majority Hispanic districts in the country. The district was numbered the 18th from 1990 to 1993 and the 16th from 1993 to 2013; it has been the 15th district since 2013.\n\n"}, "personal": {"date": "BornJosé Enrique Serrano (1943-10-24) October 24, 1943 (age74)Mayagüez, Puerto Rico", "Political party": "Democratic", "Children": "5, including José M. Serrano", "Education": "Lehman College"}, "timeline": {"Member of the US House of Representativesfrom New York": {"date": "Assumed office March 21, 1990", "Preceded by": "Robert García", "Constituency": "18th district (1990–93)16th district (1993–2013)15th district (2013–present)"}, "Member of the New York State Assembly": {"date": "In officeJanuary 1, 1975– March 21, 1990", "Preceded by": "Eugenio Alvarez", "Succeeded by": "David Rosado", "Constituency": "75th district (1975–82)73rd district (1983–90)"}, "Military service": {"Allegiance": "United States", "Service/branch": "United States Army", "Years of service": "1964–1966", "Unit": "172nd Support Battalion"}}, "code": "", "type": "", "party": "", "description": "", "economic": "0", "social": "0", "leadership": "0"}