{"name": "Lamar.Alexander", "picture": "A000360.jpg", "detail": {"Early life and education": "Alexander was born and raised in Maryville, Tennessee, the son of Genevra Floreine (née Rankin), a preschool teacher, and Andrew Lamar Alexander Sr., a high school principal.  His family is of Scotch-Irish descent. He attended Maryville High School, where he was class president, and was elected Governor of Tennessee Boys State. He is an Eagle Scout, and received the Distinguished Eagle Scout Award.In 1962, Alexander graduated Phi Beta Kappa from Vanderbilt University with a Bachelor of Arts degree in Latin American studies. He was a member of Sigma Chi. Alexander was the editor of The Vanderbilt Hustler, the primary student newspaper on campus, and he advocated for the open admission of African Americans. At Vanderbilt, he was a member of the track and field team.  In 1965, he obtained his Juris Doctor from the New York University School of Law.", "Career": "Early political career After graduating from law school, Alexander clerked for United States Court of Appeals for the Fifth Circuit Judge John Minor Wisdom in New Orleans, Louisiana, from 1965 to 1966.In 1967, Alexander worked as a Legislative Assistant for Senator Howard Baker. While a staffer, he was briefly roommates with future U.S. Senator Trent Lott, and met his future wife at a staffer softball game. In 1969, he worked for Bryce Harlow, President Richard Nixon's executive assistant. In 1970, he moved back to Tennessee, serving as campaign manager for Memphis dentist Winfield Dunn's successful gubernatorial bid. Dunn was the first Republican in 50 years to win the governorship. After this campaign, Alexander co-founded and worked as a partner in the Nashville law firm of Dearborn and Ewing. Meanwhile, Alexander rented a garage apartment to Thomas W. Beasley, a student at the Vanderbilt Law School who later co-founded Corrections Corporation of America.The Tennessee State Constitution at the time prevented governors from serving consecutive terms, so with Dunn unable to run, Alexander sought the party's nomination for governor in 1974. He defeated his two chief opponents, Commissioner of Mental Health Nat T. Winston, Jr., and Southwestern Company president Dortch Oldham, 120,773 votes to 90,980 and 35,683, respectively. He faced the Democratic nominee, Ray Blanton, a former Congressman and unsuccessful 1972 senate candidate, in the general election. Blanton attacked Alexander for his service under Nixon, who had resigned in disgrace several months earlier as a result of the Watergate scandal, and defeated Alexander on election day, 576,833 votes to 455,467.After the 1974 campaign, Alexander returned to the practice of law. In 1974, TIME Magazine named Alexander one of the 200 Faces of the Future.  In 1977, Alexander once again worked in Baker's Washington office following Baker's election as Senate Minority Leader.Governor of Tennessee Although the Tennessee State Constitution had been amended in early 1978 to allow a governor to succeed himself, Blanton chose not to seek re-election, due to a number of scandals. Alexander once again ran for governor, and made a name for himself by walking from Mountain City in the far northeast of the state to Memphis in the far southwest, a distance of 1,022 miles (1,645 km), wearing a red and black flannel shirt that would become something of a trademark for him. Investigative news reports disclosed late during the 1978 Tennessee gubernatorial campaign revealed that Alexander once transferred the non-profit charter of a Christian church to his Ruby Tuesday restaurant in order to sell liquor-by-the-drink in the once \"dry town\" of Gatlinburg, Tennessee.After winning the Republican nomination with nearly 86% of the vote, he defeated Knoxville banker Jake Butcher in the November 1978 election, 665,847 votes to 523,013.In early 1979, a furor ensued over pardons made by Governor Blanton, whose administration was already under investigation in a cash-for-clemency scandal. Since the state constitution is somewhat vague on when a governor must be sworn in, several political leaders from both parties, including Lieutenant Governor John S. Wilder and State House Speaker Ned McWherter, arranged for Alexander to be sworn in on January 17, 1979, three days earlier than the traditional inauguration day, to prevent Blanton from signing more pardons. Wilder later called the move \"impeachment Tennessee-style.\"In February 1979, shortly after his inauguration, Alexander created an Office of Ombudsman, which was charged with cutting government red tape.  He also gave state employees a 7% raise, and replaced state prisoners working at the Governor's Mansion with a paid staff.  One of Alexander's biggest accomplishments as governor was the relationship he cultivated with the Japanese corporate community, which resulted in the construction of a $500 million Nissan plant in Smyrna in 1982, the largest single investment in the state's history up to the time.In 1982 Alexander took advantage of the 1978 constitutional amendment allowing governors to serve a second consecutive four-year term. He ran again and defeated Knoxville mayor Randy Tyree, 737,963 votes to 500,937. During his second term, he served as chairman of the National Governors Association from 1985 to 1986, and was chair of the President's Commission on American Outdoors, 1985 to 1986.  He also oversaw the \"Tennessee Homecoming\" in 1986, in which local communities launched numerous projects that focused on state and local heritage.In 1983, Alexander implemented his \"Better Schools\" program, which standardized basic skills for all students, and increased math, science and computer education.  A portion of this plan, known as \"Master Teachers,\" or \"Career Ladder,\" called for income supplements for the state's top teachers. Due to staunch opposition from the Tennessee Education Association, which derided the plan's method of teacher evaluations, the bill initially died in the state legislature. Later that year, Alexander convinced House Speaker Ned McWherter to support an amended version of the bill, which passed.After opting out of the 1984 US Senate contest for the open seat of retiring Majority Leader Howard Baker, Alexander was constitutionally ineligible for a third term and stepped down from the governorship on January 17, 1987.President of the University of Tennessee Alexander along with his family moved to Australia for a time. While there he wrote a book titled Six Months Off. Upon returning to Tennessee, he served as president of the University of Tennessee from 1988 to 1991.United States Secretary of Education Alexander served as the United States Secretary of Education from 1991 to 1993. As Education Secretary, he sparked controversy after he approved Transnational Association of Christian Colleges and Schools (TRACS) to accredit schools despite an advisory panel that repeatedly recommended against it in 1991 and 1987.In 1993, Steve Levicoff published a book-length critical discussion of TRACS and Alexander's decision in When The TRACS Stop Short.Former Department of Education employee and writer Lisa Schiffren has stated that, \"His fortune is founded on sweetheart deals not available to the general public, and a series of cozy sinecures provided by local businessmen. Such deals are not illegal...\"  Schiffren further notes that, in 1987, Alexander helped found Corporate Child Care Management, Inc. (now known as Bright Horizons Family Solutions Inc.), a company that – via a merger – is now the nation's largest provider of worksite day care. While businessman Jack C. Massey spent $2 million on this enterprise, Alexander co-founded the company with only $5,000 of stock which increased in value to $800,000, a 15,900 percent return within four years. Also in 1987, he wrote a never-cashed investment check for $10,000 to Christopher Whittle for shares in Whittle Communications that increased in value to $330,000. In 1991, Alexander's house just purchased for $570,000 was sold to Whittle for $977,500. Alexander's wife obtained an $133,000 profit from her $8,900 investment in a company created to privatize prisons. Alexander frequently shifted assets to his wife's name, yet such transfers are not legal under federal ethics and security laws.  In his 2005 US Senate financial disclosure report, he listed personal ownership of BFAM (Bright Horizons Family Solutions) stock valued (at that time) between $1 million and $5 million. He taught about the American character as a faculty member at Harvard University's Kennedy School of Government.United States presidential bids Alexander made two unsuccessful runs for President of the United States in 1996 and in 2000. In 1996, he finished 3rd in the Iowa Caucus and New Hampshire Primary, and dropped out before the Super Tuesday primaries. After dropping out of the race, Alexander took on an advisory role in the Dole/Kemp campaign. In 2000, during his second candidacy, he traveled around the US in a Ford Explorer, eschewing a campaign bus or plane, and that journey lasted less than six months, having been announced March 9, 1999, and was withdrawn on August 16, 1999, after a poor showing in the Ames Straw Poll, both times in Nashville, Tennessee.U.S. Senate career Despite vowing not to return to elective office, Alexander was nevertheless persuaded by the White House to run for the open seat of retiring Senator Fred Thompson in 2002. Seen as a moderate Republican by Tennessee standards, his candidacy was vigorously opposed by conservatives, who instead supported US Representative – and a House manager during the 1998 impeachment of Bill Clinton, Ed Bryant.Alexander was better-funded and armed with more prominent endorsements, however, and edged Bryant in the primary, 295,052 votes to 233,678. Democrats had high hopes of retaking the seat that they lost in 1994 with their candidate, US Representative Bob Clement, a member of a prominent political family. However, Clement's campaign never really caught on, and Alexander defeated him in the general election with 54 percent of the vote. With his election to the US Senate, he became the first Tennessean to be popularly elected both governor and senator. At the age of 62, Alexander also became the oldest elected freshman US senator from Tennessee since Democrat Lawrence D. Tyson in 1924.In 2006, a newly discovered species of springtail found in Great Smoky Mountains National Park was named Cosberella lamaralexanderi in Alexander's honor, because of his support of scientific research funding in the park and because the springtails' patterning is reminiscent of the plaid shirts Alexander typically wears while campaigning.Iraq Before the Iraq War began, Alexander supported sending troops to Iraq and expressed his agreement with President Bush that Iraq must be dealt with immediately. A year after the war began, Alexander stated that the Iraq War had provided \"lessons\" to the nation, but went on to say that American troops should not be withdrawn, saying \"It would be even worse if we left before the job was done.\" In 2007, Alexander touted implementing the Iraq Study Group recommendations, noting that he believes Bush will be viewed as a Truman-esque figure if he implements the Group's recommendations.Health care reform On July 15, 2009, Alexander voted against President Obama's health care reform bill in the Senate Health, Education, Labor and Pensions Committee. Alexander stated that he opposed the bill because he says it will result in higher state taxes, an increased federal debt, government-run health care, and Medicare cuts, and instead supports a different approach to reform.  Alexander voted against the Patient Protection and Affordable Care Act in December 2009, and he voted against the Health Care and Education Reconciliation Act of 2010. Alexander is part of the group of 13 Senators drafting the Senate version of the AHCA behind closed doors.Bipartisanship According to the 2009 annual vote studies by Congressional Quarterly, Alexander is one of the most bipartisan Republican members of the Senate. According to National Journal’s 2009 Vote Ratings, he was ranked as the 32nd most conservative member in the Senate.Alexander broke ranks with conservative Senate Republicans when he announced his support for the nomination of Supreme Court nominee Sonia Sotomayor.Gun laws In April 2013, Alexander was one of forty-six senators to vote against the passing of a bill which would have expanded background checks for all gun buyers. Alexander voted with 40 Republicans and 5 Democrats to stop the bill.National security Alexander critiqued President Donald Trump's 2017 executive order to temporarily curtail immigration from 7 Muslim-majority countries with increased terrorism risk until better screening methods were devised. He stated that the executive order was \"inconsistent with our American character.\"Committee assignments Committee on AppropriationsSubcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on DefenseSubcommittee on Energy and Water Development (Chairman)Subcommittee on Interior, Environment, and Related AgenciesSubcommittee on Labor, Health and Human Services, Education, and Related AgenciesSubcommittee on Transportation, Housing and Urban Development, and Related AgenciesCommittee on Energy and Natural ResourcesSubcommittee on EnergySubcommittee on National ParksSubcommittee on Public Lands, Forests and MiningCommittee on Health, Education, Labor, and Pensions (Chairman)Subcommittee on Children and Families (Ex Officio)Subcommittee on Employment and Workplace Safety (Ex Officio)Subcommittee on Primary Health and Aging (Ex Officio)Committee on Rules and AdministrationCaucus memberships International Conservation CaucusSportsmen's CaucusTennessee Valley Authority Caucus (Co-Chair)Legislation sponsored The following is an incomplete list of legislation that Alexander introduced in the Senate.PREEMIE Reauthorization Act (S. 252; 113th Congress) – a bill that would reauthorize research programs on preterm births that are run by the Centers for Disease Control and Prevention.   It would also authorize grants and demonstration programs to be run by the Health Resources and Services Administration that will try to decrease preterm births. It passed the Senate on September 25, 2013.Exchange Information Disclosure Act – a bill that would require the government to report on the number of visitors and enrollees on the federal government's healthcare exchanges, as well as what level of insurance coverage people buy on the exchanges. The bill would apply only to the federally-run healthcare exchanges, which cover 36 states, not the state-run exchanges, according to Ripon Advance. On January 16, 2014, the U.S. House passed the bill. Its companion bill Exchange Information Disclosure Act (H.R. 3362; 113th Congress) was introduced in the House by Rep. Lee Terry (R, NE-2).Republican leadership In late 2006, Alexander announced that he had secured the requisite number of votes to become the Republican Party's Minority Whip in the Senate during the 110th Congress. Even though he was seen as the preferred choice of Minority Leader Mitch McConnell and the Bush Administration, he lost the election to former Senate Majority Leader Trent Lott by one vote (25–24).Alexander would get a second shot at entering his party's leadership a year later when Lott announced his intent to resign from the Senate by the end of 2007. Sen. Jon Kyl of Arizona, then Chairman of the Senate Republican Conference, ran for Whip and was elected without opposition. With the Conference Chair vacant, Alexander announced that he would seek the position. He would go on to defeat Sen. Richard Burr of North Carolina by a margin of 31–16.Alexander stepped down as Conference Chairman in January 2012, citing his desire to foster consensus. He said, \"I want to do more to make the Senate a more effective institution so that it can deal better with serious issues.\" He added, \"For these same reasons, I do not plan to seek a leadership position in the next Congress\", ending speculation that he would run for the position of Republican Whip after Jon Kyl retired in 2013.2008 re-election campaign In April 2007, Alexander announced he would run for re-election to the Senate in 2008.Alexander was favored throughout the entire campaign, due to his long history in Tennessee politics and a disorganized Democratic opposition. His rivals were former state Democratic Party Chairman Bob Tuke, who won a heated primary, and Libertarian candidate Daniel T. Lewis.Alexander won reelection, taking 65 percent of the vote to Tuke's 32 percent. Alexander also carried all but one of Tennessee's 95 counties; he lost only in Haywood County in western Tennessee, which was secured by Tuke. He won the normally Democratic strongholds of Davidson and Shelby counties—home to Nashville and Memphis, respectively. Alexander also benefited from riding the coattails of John McCain, who won the state with a solid majority.2013 presidential inauguration role As co-chairman of the Joint Congressional Inaugural Committee, Alexander was one of the speakers at the Second inauguration of Barack Obama on January 21, 2013, alongside the committee's chair, Senator Charles Schumer.2014 senatorial re-election campaign In December 2012, Alexander announced he would be seeking re-election to a third Senate term in 2014. Alexander's campaign had a war chest of $3.1 million in cash going into his 2014 re-election bid.In an August 2013 letter to Alexander signed by over 20 Tennessee tea-party groups, the groups called on Alexander to retire from the Senate in 2014, or face a primary challenge. The letter stated: \"During your tenure in the Senate we have no doubt that you voted in a way which you felt was appropriate. Unfortunately, our great nation can no longer afford compromise and bipartisanship, two traits for which you have become famous. America faces serious challenges and needs policymakers who will defend conservative values, not work with those who are actively undermining those values.\"Although Alexander was initially thought to be vulnerable to a primary challenge from the right, he worked to avoid this and ultimately did not face a high-profile challenger. He declared his intention to run early, quickly won the endorsement of Governor Bill Haslam, every living former Tennessee Republican Party chair persons and the state's entire Republican congressional delegation (except scandal-hit Scott DesJarlais). He also raised a large amount of money and worked to avoid the mistakes of ousted Senators Bob Bennett and Richard Lugar by trying to stay in touch with his constituents, especially in East Tennessee. Moreover, out-of-state conservative organizations such as the Senate Conservatives Fund made little effort to defeat Alexander.Alexander won the Republican primary, defeating State Representative and Tea Party challenger Joe Carr.  However, Alexander recorded the lowest winning percentage (49.7%) and lowest margin of victory (9.2 points) ever in a primary for a Republican U.S. Senator from Tennessee. Carr won a larger percentage of the vote (40.5%) than the previous 11 challengers to sitting Republican U.S. Senators in Tennessee history combined (40.3%).Alexander won the general election with 62% of the vote.", "Personal life": "In 1969, Alexander married Leslee \"Honey\" Buhler, who grew up in Victoria, Texas, and graduated from Smith College in Massachusetts. They had met during a softball game for Senate staff members. Together they have four children: Drew, Leslee, Kathryn, and Will. After a six-month trip to Australia with his family in the late 1980s, Alexander wrote about their adventure in a book entitled, Six Months Off.Alexander is a classical and country pianist. He began taking lessons at age three, and won several competitions as a child. In April 2007, he played piano on singer Patti Page's re-recording of her 1950 hit Tennessee Waltz. He appeared on the record at the invitation of record executive Mike Curb. Alexander and Page performed the song live at an April 4 fundraiser for his senatorial re-election campaign in Nashville's Schermerhorn Symphony Center.Alexander is a member of Sons of the Revolution.", "Electoral history": "Tennessee US Senate election, 2014PartyCandidateVotes%±RepublicanLamar Alexander849,74861.9DemocraticGordon Ball437,17531.8Tennessee US Senate Republican primary election, 2014PartyCandidateVotes%RepublicanLamar Alexander331,70549.7RepublicanJoe Carr271,32440.6RepublicanGeorge Shea Flinn34,6685.2RepublicanChristian Agnew11,3201.7RepublicanBrenda Lenard7,9081.2RepublicanJohn King7,7481.2RepublicanErin Kent Magee3,3660.5Tennessee US Senate election, 2008PartyCandidateVotes%±RepublicanLamar Alexander1,571,63767.3+13.0DemocraticBob Tuke762,77932.6Tennessee US Senate election, 2002PartyCandidateVotes%±RepublicanLamar Alexander888,22354.3DemocraticBob Clement726,51044.2Tennessee US Senate Republican primary election, 2002PartyCandidateVotes%RepublicanLamar Alexander295,05253.8RepublicanEd Bryant233,67842.6RepublicanMary Taylor-Shelby5,5891.0RepublicanJune Griffin4,9300.9RepublicanMichael Brent Todd4,0020.7RepublicanJames DuBose3,5720.7RepublicanChristopher Fenner1,5520.3RepublicanWrite-ins1020.0Tennessee gubernatorial election, 1982PartyCandidateVotes%±RepublicanLamar Alexander737,69359.56+3.72DemocraticRandy Tyree500,93740.44Tennessee gubernatorial election, 1978PartyCandidateVotes%±RepublicanLamar Alexander661,95955.84DemocraticJake Butcher523,49544.16Tennessee gubernatorial election, 1974PartyCandidateVotes%±DemocraticRay Blanton576,83355.88RepublicanLamar Alexander455,46744.12United States presidential election, 1996 (Republican primaries):Bob Dole – 9,024,742 (58.82%)Pat Buchanan – 3,184,943 (20.76%)Steve Forbes – 1,751,187 (11.41%)Lamar Alexander – 495,590 (3.23%)Alan Keyes – 471,716 (3.08%)Richard Lugar – 127,111 (0.83%)Unpledged delegates – 123,278 (0.80%)Phil Gramm – 71,456 (0.47%)Bob Dornan – 42,140 (0.28%)Morry Taylor – 21,180 (0.14%)Republican Senate Minority WhipTrent Lott (MS) – 25 (51.02%)Lamar Alexander (TN) – 24 (48.98%)Senate Republican Conference ChairmanLamar Alexander (TN) – 31 (65.96%)Richard Burr (NC) – 16 (34.04%)", "Further reading": "Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of Congress", "introduction": "Andrew Lamar Alexander Jr. (born July 3, 1940) is an American politician serving as the senior United States Senator from Tennessee, a seat he has held since 2003. A member of the  Republican Party, he also was the 45th governor of Tennessee from 1979 to 1987 and the 5th United States Secretary of Education from 1991 to 1993.\nBorn in Maryville, Tennessee, Alexander graduated from Vanderbilt University and the New York University School of Law. After establishing a legal career in Nashville, Tennessee, Alexander ran for Governor of Tennessee in 1974, but was defeated by Democrat Ray Blanton. Alexander ran for governor again in 1978, and this time defeated his Democratic opponent. He won re-election in 1982 and served as chairman of the National Governors Association from 1985 to 1986.\nAlexander served as the president of the University of Tennessee from 1988 until 1991, when he accepted appointment as Secretary of Education under President George H. W. Bush. Alexander sought the presidential nomination in the 1996 Republican primaries, but withdrew before the Super Tuesday primaries. He sought the nomination again in the 2000 Republican primaries, but dropped out after a poor showing in the Iowa Straw Poll.\nIn 2002, Alexander won election to succeed retiring Senator Fred Thompson. Alexander defeated Congressman Ed Bryant in the Republican primary and Congressman Bob Clement in the general election. He served as Chairman of the Senate Republican Conference from 2007 to 2012. Alexander has served as chairman of the Senate Health, Education, Labor and Pensions Committee since 2015. He introduced the Every Student Succeeds Act, which supplanted the No Child Left Behind Act in 2015.\n\n"}, "personal": {"date": "BornAndrew Lamar Alexander Jr. (1940-07-03) July 3, 1940 (age 78)Maryville, Tennessee, U.S.", "Political party": "Republican", "Spouse(s)": "Honey Buhler (m.1969)", "Education": "Vanderbilt University (BA)New York University (JD)"}, "timeline": {"United States Senatorfrom Tennessee": {"date": "Assumed office January 3, 2003Serving with Bob Corker", "Preceded by": "Fred Thompson"}, "Chairman of the Senate Health, Education, Labor and Pensions Committee": {"date": "Assumed office January 3, 2015", "Preceded by": "Tom Harkin"}, "Chairman of the Senate Republican Conference": {"date": "In officeDecember 19, 2007– January 26, 2012", "Leader": "Mitch McConnell", "Preceded by": "Jon Kyl", "Succeeded by": "John Thune"}, "5th United States Secretary of Education": {"date": "In officeMarch 22, 1991– January 20, 1993", "President": "George H. W. Bush", "Preceded by": "Lauro Cavazos", "Succeeded by": "Richard Riley"}, "Chairman of the National Governors Association": {"date": "In officeAugust 6, 1985– August 26, 1986", "Preceded by": "John W. Carlin", "Succeeded by": "Bill Clinton"}, "45th Governor of Tennessee": {"date": "In officeJanuary 20, 1979– January 17, 1987", "Lieutenant": "John Wilder", "Preceded by": "Ray Blanton", "Succeeded by": "Ned McWherter"}}, "code": "A000360", "type": "3", "party": "Republican", "description": "centrist Republican leader", "economic": "0.32", "social": "-0.18", "leadership": "0.69"}