{"name": "Maggie.Hassan", "picture": "H001076.jpg", "detail": {"Early life and education": "Hassan was born Margaret Wood in Boston, Massachusetts, the daughter of Margaret (Byers) and Robert Coldwell Wood, a political scientist who served as United States Secretary of Housing and Urban Development in the Lyndon Johnson administration. She has two siblings, including Tony award-winning actor Frank Wood.Wood grew up in Lincoln, Massachusetts. As a child she sang in school choirs and at church. Her parents were politically active, and young Maggie collated mailers for the League of Women Voters. Wood attended Lincoln-Sudbury Regional High School, Sudbury, Massachusetts, and graduated with the Class of 1976. Wood earned her B.A. degree from Brown University in 1980. While at Brown, Wood met her future husband, Thomas Hassan, who was also a student at the university. She received a J.D. degree from the Northeastern University School of Law in 1985.", "Early career": "From 1985 to 1999, Hassan worked as an attorney. From 1985 to 1992,[citation needed] Hassan worked at the Boston law firm, Palmer and Dodge. From 1993 to 1996, Hassan was Associate General Counsel for Brigham and Women's Hospital/Partners Healthcare of Boston.In 1996, Hassan began working as an attorney for Sullivan, Weinstein and McQuay, a Boston corporate defense and business law firm. In 1999, Hassan was appointed by then-Governor Jeanne Shaheen as a citizen advisor to the Advisory Committee to the Adequacy in Education and Finance Commission.", "New Hampshire Senate": "Elections Hassan first ran for the New Hampshire Senate in 2002 after Democratic Party leaders suggested she run. She lost to incumbent Senator Russell Prescott 54% to 46%. In 2004, she ran against Prescott again and won 52% to 48%. In 2006, she won re-election against Natalie Healy 60% to 40%. In 2008, she defeated Lee Quandt 57% to 43%. She served as the assistant Democratic whip, president pro tempore, and majority leader of the State Senate during her six years in office. She represented New Hampshire's 23rd district, which includes the towns of East Kingston, Exeter, Kensington, Kingston, Newfields, Newmarket, Newton, Seabrook, South Hampton and Stratham.In November 2010, Hassan was defeated by Prescott in a second rematch, 53% to 47%, as Republicans regained control of both the state House and state Senate.Tenure Hassan served on the Capital Budget Committee and the Budget Conference Committee. Hassan helped pass the FY2008-FY2009 budget.In 2008, Senate President Sylvia Larsen chose Hassan to serve as Senate Majority Leader, the number two position in the New Hampshire Senate. Larsen chose Hassan for the position because she wanted someone who would fight to get the democratic caucus to support the same agenda, at times creating friction between Hassan and her Republican colleagues.During her tenure as majority leader, Hassan had a major role in legalizing same-sex marriage in New Hampshire. Hassan presented three versions of a same-sex marriage bill, one of which narrowly gained enough support to pass both chambers.Hassan helped pass the FY2010-FY2011 budget. This budget increased spending by over a billion dollars and contained thirty-three tax and fee increases, including taxing campsites like hotel rooms, a so-called \"income tax\" on New Hampshire business, and raising vehicle registration fees.Committee assignments Capital Budget CommitteeCommerce, Labor and Consumer ProtectionFinancePublic and Municipal Affairs (Chair)Energy, Environment, and Economic Development (Vice Chair)Internal Affairs CommitteeExecutive Department and Administration Committee", "Governor of New Hampshire": "Elections 2012 In October 2011, Hassan announced her candidacy for governor of New Hampshire. She won the Democratic primary with 53%, defeating former state senator Jacalyn Cilley, who received 39%.Hassan was also endorsed by former U.S. President Bill Clinton Campaign themes included implementing the Affordable Care Act.In the general election, Hassan defeated Republican nominee Ovide M. Lamontagne by 55% to 43%, carrying every county in the state. Her campaign was managed by Matt Burgess and senior consultants included media consultant Joe Slade White.Independent expenditure groups spent more than $11 million on Hassan's behalf. Major financial support for Hassan's election came from the Washington, D.C.-based Democratic Governor's Association, the Service Employees International Union, the American Federation of State, County and Municipal Employees, and the National Education Association.2014 In June 2014, Hassan filed to run for re-election. She defeated Ian Freeman in the Democratic primary election on September 9, 2014, going on to defeat Republican Walt Havenstein in the general election by a margin of 52% to 48%. Hassan carried 7 of 10 counties.Return of campaign donations In August 2014, New Hampshire Attorney General Joseph Foster, a Hassan appointee, ordered her to return $24,000 in campaign contributions that violated New Hampshire campaign finance laws. In October 2014, Hassan was ordered to return another $25,000 in funds a union donated to her gubernatorial campaign because the union had not properly registered with the state a  political committee.Tenure Hassan was sworn in as Governor for a two-year term on January 3, 2013. In December 2013, she was elected as vice chair of the Democratic Governors Association.In 2013, Hassan signed a bill creating a state sea level rise commission.During a conflict between two sides of the Demoulas family, which owns the Market Basket grocery chain, Hassan urged the family to resolve the dispute, which threatened 9,000 jobs in New Hampshire.In July 2015, Hassan vetoed a bill that would have removed the licensing requirement for carrying concealed firearms in New Hampshire.In response to New Hampshire's opioid crisis, Hassan appointed Jack Wozmak as the state's \"drug czar\" in early 2015. He resigned one year later in response to complaints about his job performance.Hassan also worked to preserve funding for Planned Parenthood clinics throughout the state.She resigned as governor at the end of January 2, 2017 to prepare for her swearing into the U.S. Senate. Senate president Chuck Morse assumed the gubernatorial powers and duties as acting governor.", "US Senate": "Elections 2016 On October 5, 2015, Hassan announced her candidacy for the U.S. Senate in 2016. She challenged incumbent Republican U.S. Senator Kelly Ayotte. The race was considered one of the most competitive U.S. Senate races of the year.Hassan was endorsed by the pro-choice Democratic political action committee EMILY's List, which also backed her two gubernatorial runs. Hassan endorsed Hillary Clinton during the 2016 Democratic presidential primary. Hassan has said climate change and reproductive rights would be her top priorities if she were elected to the Senate.On November 9, 2016, the afternoon following election day, Hassan was declared the winner by only about 1,000 votes. Ayotte conceded later that evening, choosing not to pursue a recount. Hassan is the first Democrat to hold this seat since John A. Durkin resigned in 1980 after losing re-election.Committee assignments Committee on Commerce, Science and TransportationSubcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Consumer Protection, Product Safety, Insurance and Data SecuritySubcommittee on Space, Science and CompetitivenessSubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on Health, Education, Labor and PensionsSubcommittee on Children and FamiliesSubcommittee on Primary Health and Retirement SecurityCommittee on Homeland Security and Governmental AffairsSubcommittee on Federal Spending Oversight and Emergency ManagementSubcommittee on Regulatory Affairs and Federal ManagementJoint Economic CommitteeSource:Intern swearing incident On the evening of June 19th 2018, a congressional intern was caught on video yelling,  “Mr. President, Fuck You”, as President Trump walked through the United States Capitol for a meeting with Republican congressman  .On June 25th,  Maggie Hassan's office confirmed that an intern, named Caitlin Marriott, was the person caught on video swearing at President Trump. A spokesman for a Senator Hassan confirmed that the intern has been suspended from her position for one week and has to turn in her Congressional intern ID badge.   Hassan refused demands for termination of the internship.", "Political positions": "Gun law Hassan has a \"D\" rating from the National Rifle Association (NRA) due to her rare support for pro-gun legislation. She was supported by Gabrielle Giffords and Michael R. Bloomberg in the 2016 election.", "Personal life": "Hassan's husband, Thomas, was Principal of Phillips Exeter Academy from 2008 to 2015, and as of 2016 is the president of School Year Abroad. When Hassan's husband was Principal of Phillips Exeter Academy, the Hassans did not live in the Governor's Mansion, instead living in a colonial mansion on the Phillips Exeter campus provided to them as part of her husband's employment. After Thomas Hassan left his position at Phillips Exeter Academy, the Hassans bought and moved into a home in Newfields, New Hampshire.[a] Hassan has two adult children, the older of whom, Ben, has cerebral palsy.She is a member of the United Church of Christ.Hassan has received honorary doctorates from the University of New Hampshire (2013), Northeastern University (2013), Southern New Hampshire University (2014), New Hampshire Institute of Art (2015), New England College (2016), and UNH School of Law (2017).", "Electoral history": "This section of a biography of a living person does not include any references or sources. Please help by adding reliable sources. Contentious material about living people that is unsourced or poorly sourced must be removed immediately.Find sources: \"Maggie Hassan\" – news · newspapers · books · scholar · JSTOR (July 2017) (Learn how and when to remove this template message)New Hampshire State Senate election in the 23rd district, 2002PartyCandidateVotes%RepublicanRussell Prescott (inc.)10,65954.04DemocraticMaggie Hassan9,06745.96Total votes19,726100.00New Hampshire State Senate election in the 23rd district, 2004PartyCandidateVotes%DemocraticMaggie Hassan15,20151.96RepublicanRussell Prescott (inc.)14,05448.04Total votes29,255100.00New Hampshire State Senate election in the 23rd district, 2006PartyCandidateVotes%DemocraticMaggie Hassan10,56660.12RepublicanNatalie Healy7,00839.88Total votes17,574100.00New Hampshire State Senate election in the 23rd district, 2008PartyCandidateVotes%DemocraticMaggie Hassan17,21257.20RepublicanLee Quandt12,87742.80Total votes30,089100.00New Hampshire State Senate election in the 23rd district, 2010PartyCandidateVotes%RepublicanRussell Prescott11,00153.38DemocraticMaggie Hassan (inc.)9,60646.62Total votes20,607100.00New Hampshire gubernatorial primary, 2012PartyCandidateVotes%DemocraticMaggie Hassan45,12053.64DemocraticJackie Cilley33,06639.31DemocraticBill Pearce Kennedy5,9367.06Total votes84,122100.00New Hampshire gubernatorial election, 2012PartyCandidateVotes%DemocraticMaggie Hassan378,93454.66RepublicanOvide Lamontagne295,02642.56LibertarianJohn Babiarz19,2512.78Total votes693,211100.00New Hampshire gubernatorial primary, 2014PartyCandidateVotes%DemocraticMaggie Hassan (inc.)39,18594.18DemocraticIan Freeman1,7194.13DemocraticClecia Terrio7041.69Total votes41,608100.00New Hampshire gubernatorial election, 2014PartyCandidateVotes%DemocraticMaggie Hassan (inc.)254,66652.48RepublicanWalt Havenstein230,61047.52Total votes485,276100.00United States Senate election in New Hampshire, 2016PartyCandidateVotes%DemocraticMaggie Hassan354,26847.97RepublicanKelly Ayotte (inc.)353,52547.87IndependentAaron Day17,7022.39LibertarianBrian Chabot12,9881.75Total votes738,483100.00", "introduction": "Margaret Hassan (/ˈhæsən/; née Wood; born February 27, 1958) is an American politician who is the junior United States Senator from New Hampshire. A Democrat, Hassan was elected to the Senate in the 2016 election. She was the 81st Governor of New Hampshire, from 2013 to 2017.\nBorn in Boston, Massachusetts, Hassan is a graduate of Brown University and earned a J.D. from the Northeastern University School of Law. After graduating from law school in 1985, Hassan was a healthcare executive in Boston.\nHassan first ran for the New Hampshire Senate in 2002 after Democratic Party leaders recruited her. She lost to incumbent Senator Russell Prescott, but ran against Prescott again in 2004 and won. Hassan was elected to a total of three two-year terms, representing New Hampshire's 23rd district, from January 2005 to December 2010. Hassan became the Majority Leader in the State Senate in 2008 before losing re-election in 2010.\nHassan declared her candidacy for governor in October 2011. Hassan defeated former State Senator Jacalyn Cilley in the Democratic primary, and faced attorney and Republican nominee Ovide M. Lamontagne in the general election. Hassan won with 55% of the vote, becoming the state's second female governor. Hassan won re-election in 2014. Since becoming Governor of New Hampshire, Hassan was elected Vice Chair of the Democratic Governors Association and served as a superdelegate at the Democratic National Convention.\nIn 2016, she ran for the U.S. Senate and narrowly defeated Kelly Ayotte, the Republican incumbent, by approximately a thousand votes (about 0.1% of the vote). She is serving with Jeanne Shaheen, another former governor; New Hampshire's Senate delegation shares this distinction with that of Virginia (composed of former governors Mark Warner and Tim Kaine).\n\n"}, "personal": {"Born": "Margaret Wood (1958-02-27) February 27, 1958 (age60)Boston, Massachusetts, U.S.", "Political party": "Democratic", "Spouse(s)": "Thomas Hassan", "Children": "2", "Parents": "Robert Coldwell WoodMargaret Byers", "Relatives": "Frank Wood (brother)", "Education": "Brown University (BA)Northeastern University (JD)"}, "timeline": {"United States Senatorfrom New Hampshire": {"date": "Assumed office January 3, 2017Serving with Jeanne Shaheen", "Preceded by": "Kelly Ayotte"}, "81st Governor of New Hampshire": {"date": "In officeJanuary 3, 2013– January 2, 2017", "Preceded by": "John Lynch", "Succeeded by": "Chuck Morse (acting)"}, "Majority Leader of the New Hampshire Senate": {"date": "In officeJanuary 3, 2005– December 1, 2010", "Preceded by": "Joseph Foster", "Succeeded by": "Jeb Bradley"}, "Member of the New Hampshire Senatefrom the 23rd district": {"date": "In officeDecember 1, 2004– December 1, 2010", "Preceded by": "Russell Prescott", "Succeeded by": "Russell Prescott"}}, "code": "H001076", "type": "3", "party": "Democrat", "description": "moderate Democratic follower", "economic": "-0.26", "social": "-0.08", "leadership": "0.06"}