{"name": "Maria.Cantwell", "picture": "C000127.jpg", "detail": {"Early life, education, and early political career": "Cantwell was born in Indianapolis, Indiana. She was raised in a predominantly Irish-American neighborhood on the south side of Indianapolis. Her father, Paul Cantwell, served as county commissioner, city councilman, state legislator, and chief of staff for U.S. Representative Andrew Jacobs Jr. Her mother, Rose, was an administrative assistant. Her ancestry includes Irish and German.Cantwell attended Emmerich Manual High School and was inducted into the Indianapolis Public Schools Hall of Fame in 2006. After high school, Cantwell attended Miami University in Oxford, Ohio, where she earned her bachelor of arts degree in public administration.She moved to Seattle, Washington, in 1983 to campaign for U.S. Senator Alan Cranston (D-CA) in his unsuccessful bid for the 1984 Democratic presidential nomination. She then moved to the Seattle suburb of Mountlake Terrace because it reminded her of Indianapolis, and led a successful campaign in 1986 to build a new library there. As of 2000, Cantwell lived in Edmonds, Washington with her mother.", "Washington House of Representatives (1987–1993)": "Elections In 1986, Cantwell was elected to the Washington State House of Representatives at the age of 28. In her campaign, she embarked on an extensive door-knocking effort in her district.  She defeated George Dahlquist 54%–46%. In 1988, she won re-election to a second term with 66% of the vote. In 1990, she won re-election to a third term with 61% of the vote.Tenure As a state representative, she helped write Washington's Growth Management Act of 1990, which required cities to develop comprehensive growth plans, and she negotiated its passage. She also worked on legislation regulating nursing homes.Committee assignments Growth Strategies Commission", "US House of Representatives (1993–1995)": "Elections 1992In the November election, Cantwell defeated Republican State Senator Gary Nelson 55%–42%. She became the first Democrat elected to the United States House of Representatives from Washington's first congressional district in 40 years.1994Republican Rick White defeated Cantwell 52%–48% in the Republican landslide of 1994.Tenure She was called a \"savvy, pro-business Democrat.\" She supported President Clinton's 1993 budget, which raised taxes and passed despite receiving 'No' votes from many of her Democratic colleagues. During her only term, she helped persuade the Clinton administration to terminate its support of the Clipper chip. She wrote a letter to Vice President Al Gore and staunchly opposed it because Microsoft Inc. was in her district. She voted in support of the North American Free Trade Agreement (NAFTA).Committee assignments Public WorksForeign AffairsMerchant Marine and Fisheries", "Private sector employment (1995–1999)": "After her defeat, Cantwell vowed to leave politics. Political ally Rob Glaser offered her a job as vice president of marketing for RealNetworks. Among her accomplishments was the live Internet streaming broadcast of a Mariners-Yankees baseball game in 1995, which marked the start of Internet broadcasts of Major League Baseball games.In 1998, the company was criticized by privacy groups who alleged that the RealJukebox software program incorporated spyware to track unsuspecting users' listening patterns and download history. In response, RealNetworks amended its privacy policy to fully disclose its privacy practices regarding user listening patterns. Subsequently, RealNetworks submitted to independent outside audits of its privacy practices. Several lawsuits regarding the alleged privacy violations were settled out of court. This incident has in part formed her views on privacy and thus her opposition to the Bush administration's post-9/11 policies.", "US Senate (2001–present)": "Elections 2000At the urging of party activists and officials, Cantwell formed an exploratory committee in October 1999 to consider a run for United States Senate against Democrat Deborah Senn and incumbent Republican Slade Gorton. She committed to run for the position on January 19, 2000. Cantwell entered the campaign a year after Senn; she quickly lost the endorsements by the Washington State Labor Council and NARAL to Senn. Early on, privacy became an issue. Senn cited her record protecting medical privacy as insurance commissioner. Cantwell promoted internet privacy and cited her opposition to the Clipper chip. In her television advertisement late in the campaign, Senn accused Cantwell of avoiding debates. Cantwell had agreed to two debates; Senn preferred more. They ended up having three debates, during which the candidates harshly attacked each other. Senn attacked RealNetworks and Cantwell's role in the company. Cantwell accused Senn of wanting to run against RealNetworks and said that Senn was uninformed on internet issues. Cantwell secured the endorsements of the Seattle Times, the Seattle Post-Intelligencer, the Spokesman-Review, and the News Tribune. She easily won her party's nomination, defeating Senn 3–1 in the primary. Although he won renomination, Slade Gorton got fewer votes than Cantwell and Senn's combined total. Cantwell cited this result as evidence that Washington was ready for a change.Social security, prescription drugs, dams, and campaign finance reform were among the most important issues in Cantwell's race against Gorton. Cantwell also adopted the slogan, \"your voice for a change,\" a veiled reference to Gorton's campaign theme in 1980, challenging incumbent Warren Magnuson's age. She claimed Gorton supported \"19th century solutions to 21st century problems.\" Cantwell won the endorsements of The Seattle Times and the Seattle Post-Intelligencer, the state's two biggest newspapers. Gorton won the endorsements of the smaller Tri-City Herald and the News Tribune. At times the campaign was accused of pettiness. After a Cantwell campaign worker deep-linked to a humorous photo on the Gorton website, Gorton accused Cantwell's campaign of hacking his website, and Senn accused Cantwell of hypocrisy. \"Fiddling with people's websites and calling it good fun ... adds a very childish and unworthy character to the race,\" said Senn's campaign spokeswoman Barbara Stenson. Cantwell spent over $10 million of her own money on her campaign, pledging not to accept money from PACs. When RealNetworks stock declined at the end of 2000, she spent time raising funds for debt retirement, although she kept her pledge not to accept PAC money, as documented by the nonpartisan Center for Responsive Politics. In the waning weeks of the 2000 campaign, the Federal Election Commission ruled that Cantwell violated federal campaign finance law by securing $3.8 million in bank loans for her campaign and failing to properly disclose the loans until January 30, 2001. The complaint alleged that Cantwell had received a $600,000 line of credit without sufficient collateral and another $1,000,000, all at a preferential interest rate. After review, the Federal Election Commission sent a letter of admonishment, saying that the loans were \"made on a basis that assures repayment and that each loan bore the usual and customary interest rate.\"The election results were extremely close. Early on, Cantwell enjoyed a lead, and TV networks projected a Cantwell victory. As absentee ballots streamed in, Gorton overtook Cantwell and achieved a lead of 15,000 votes. When the heavily Democratic Puget Sound region finished counting ballots and the county totals were certified on November 23, Cantwell had regained the lead by 1,953 votes out of 2.5 million cast, about 0.08%. A mandatory recount increased her lead to 2,229 votes, or 0.09%. Cantwell and Debbie Stabenow of Michigan became the third and fourth women to defeat incumbent senators, following Kay Bailey Hutchison's 1993 and Dianne Feinstein's 1992 special-election victories.2006The close 2004 gubernatorial race between Democrat Christine Gregoire and Republican Dino Rossi suggested to many that the 2006 contest might go either way. Both Cantwell and her opponent Republican Mike McGavick dominated their primaries; initial speculation favored a Republican victory. \"At one point,\" wrote analyst Larry Sabato, \"all the talk in this race concerned Cantwell's cool relations with anti-war Democratic elements and McGavick's relatively united base. But Democrats appear to have closed ranks behind their junior senator.\" Cantwell ended up winning re-election by a 16-point margin, even winning several traditionally Republican counties in Eastern Washington including Spokane County.During the 2006 campaign, Cantwell received heavy criticism for declining most of the invitations she received to debate McGavick in public forums. Media outlets across the state, including The Olympian and the Yakima Herald-Republic, rebuked Cantwell, claiming she was afraid to confront McGavick, calling it \"unacceptable\" and \"simply not fair.\" Cantwell agreed to a total of two debates with her opponent in Seattle and Spokane, lasting 60 and 30 minutes, respectively. However, when Cantwell ran for Senate in 2000 as a challenger against the incumbent Slade Gorton, Gorton also agreed to only two debates of a similar format. Similarly, when Washington's senior senator, Patty Murray, ran for reelection in 2004, she agreed to only two debates with George Nethercutt, although each debate lasted one hour.2012Cantwell was reelected to a third term, defeating Republican State Senator Michael Baumgartner.Tenure Cantwell was a proponent of the McCain-Feingold campaign finance reform bill of 2002 and cosponsored the Clean Money, Clean Elections Act of 2001.In 2005, she wrote a letter in support of the Perkins Loan program, and told the Seattle Times in July 2006 that she is opposed to Social Security privatization. Cantwell cosponsored the \"Pension Fairness and Full Disclosure Act of 2005.\"In the summer of 2005, Cantwell voted for the Central America Free Trade Agreement (CAFTA), which angered many who opposed free trade agreements. Others argued that due to the state's unique economy, any senator from Washington almost had to vote for free trade pacts.Citing his potential views on abortion and the environment, Cantwell was one of 22 senators to vote against United States Supreme Court nominee John Roberts. In January 2006, after publicly announcing her opposition to Supreme Court nominee Samuel Alito, Cantwell, along with 18 other Democrats and all 53 present Republicans, voted for the cloture motion. The success of this motion ended an unlikely attempt to filibuster the confirmation of Judge Alito that was being led by Senator John Kerry and Senator Ted Kennedy. Alito was confirmed the next day by a vote of 58–42, with most Democrats, including Cantwell, voting against the confirmation.Cantwell voted in September 2010 to invoke cloture to begin debate on the don't ask, don't tell policy in the military.Iraq War On the issue of the Iraq war, on October 11, 2002 Cantwell voted in favor of the Joint Resolution to Authorize the Use of United States Armed Forces Against Iraq. Her October 10, 2002, press release, however, quotes her as stating on the floor of the U.S. Senate, \"... Mr. President, my vote for this resolution does not mean that I am convinced of the Administration has answered all the questions. I believe the following issues must be addressed before the U.N. or the U.S. move forward with military action.\" Cantwell detailed six specific areas in which her questions and concerns had yet to be satisfactorily addressed at the time of her vote to authorize war: \"First: Continued Multilateral Approach ... Second: Successful Military Strategy ... Third: A Postwar Commitment Strategy ... Fourth: Fighting the Broader War on Terrorism ... Fifth: Maintaining Middle East Stability ... Sixth: Protecting Iraqi Civilians.\"In 2006 Cantwell voted against the Kerry-Feingold Amendment to S.2766, which would have set a timetable for withdrawal, but she voted in favor of the Levin-Reed Amendment, which would encourage beginning a phased withdrawal by the end of the year, with no timetable for completion.Immigration In May 2006, Cantwell, along with 38 of 44 Senate Democrats, voted in favor of the Comprehensive Immigration Reform Act of 2006 (S. 2611). This controversial legislation includes provisions to improve border security, increases fines and other punishments for employers of illegal immigrants, creation of a guest worker program (which includes an almost doubling of the number of H1-B visas), and creates a path to citizenship for illegal immigrants already in the country. The bill, with support from Republican Party leadership, passed 62–36.Debate would have also commenced on the DREAM Act, though this was halted due to a Republican filibuster.Health care reform Cantwell supports health care reform in the United States and was a co-sponsor of Senator Ron Wyden's (D-OR) Healthy Americans Act. In her role as a member of the Finance Committee, she had an influential role in crafting health care reform legislation. On September 29, 2009, when the Finance Committee considered health care reform legislation, Cantwell supported amendments to establish a public health care option that would compete with private insurers.In 2009, The Stranger ran an article on Cantwell's opposition to the inclusion of a public option in the health-care reform plan. They reported that: \"Seattle congressman Jim McDermott supports it. Washington senator Patty Murray wants it. So does President Barack Obama. So does the often conservative Seattle Times editorial page. So do 72 percent of Americans, according to a recent poll. So what's going on with Washington's junior senator, Maria Cantwell? Why doesn't she want Congress to include a public option—a new government-run health-care plan that will be available to everyone and will compete with private insurance companies to bring down costs—in its health-care-reform package?\" Cantwell cited her concerns with getting the bill through the United States Senate as the reason for her opposition.Environment/energy In addition to her opposition to drilling in the Alaskan National Wildlife Refuge, Cantwell has been one of the most vocal critics of the increase of oil and gasoline prices during 2008. Advocating increased regulation of futures markets and windfall profits taxes on oil profits, Cantwell has drawn scathing criticism from the Wall Street Journal. In December 2005, Cantwell scored what many perceived as one of the strongest victories of her first term when she blocked Alaska senator Ted Stevens' efforts to allow drilling in the Arctic National Wildlife Refuge. Stevens attached the measure to a bill that provided money for defense spending and Hurricane Katrina recovery efforts. Cantwell managed to round up the votes of 41 Democrats and 2 Republicans, enough to block a final vote. Stevens removed the ANWR drilling measure from the larger bill, but promised to bring the matter up at a later date.In 2004 Cantwell received the highest rating possible from the League of Conservation Voters for her environmental voting record. As of 2017, she has a lifetime score of 91% on the League's National Environmental Scorecard.  She is known for supporting alternative energy research and for protecting Washington's forests from logging and the construction of paved roads and has earned endorsement from various prominent environmental advocacy groups and other environmental groups. She has opposed drilling in Alaska's Arctic National Wildlife Refuge on multiple occasions, has voted to reduce oil usage by 40% by 2025, and has opposed legislation to relax or terminate CAFE standards. The Seattle Times has described Cantwell's environmental record as \"pristine\", and the Wilderness Society has described Cantwell as an \"environmental champion\".In 2009 Cantwell introduced the Carbon Limits and Energy for America's Renewal (CLEAR) Act (S. 2877), also called the Cantwell-Collins bill, a \"cap and dividend\" emissions trading proposal. Senator Susan Collins, Republican from Maine, joined as co-sponsor. The bill died in the Senate Finance Committee without debate or votes.Cantwell is the chair of the Senate Democrats 20/20 Energy Independence campaign and is a co-chair of the Apollo Alliance. One of Cantwell's main accomplishments was the passage of an amendment \"To prevent energy market manipulation,\" which passed 57–40 in the Senate; a previous effort was defeated by a vote of 50–48.The Humane Society of the United States has praised Cantwell's no-tolerance policy and effective removal of the practice of shark finning, which is estimated to kill 73 million sharks per year.Reproductive rights Cantwell has expressed support for making Plan B contraceptives available to girls 16 and under. In 2007, she cosponsored the Prevention First Act, a bill that sought to increase national access to family planning and preventative methods as a means to reduce unwanted pregnancies. It included providing women with access to Plan B as well as expanding family planning to be covered under Medicaid. As an advocate of increasing access to family planning and sexual health education, Cantwell argues that these venues for increased education are necessary to reduce the number of unwanted pregnancies. She received criticism from her Republican challenger, State Senator Michael Baumgartner, who suggested that Cantwell was too extreme and too far to the left of most Washington voters on this issue, and expressed concern about 11-year-olds getting these drugs without a prescription.Cantwell calls herself \"100% pro-choice\", and consistently supports the pro-choice movement's positions. She was one of 34 senators to vote against the Partial-Birth Abortion Ban Act of 2003, which was signed into law by George W. Bush on November 5, 2003. She also voted against the Unborn Victims of Violence Act, which made it an additional crime to kill or harm a fetus during a criminal assault upon the mother. That bill passed the Senate by a vote of 61–38 and was signed into law by President George W. Bush on April 1, 2004.Support for fellow Democrats Cantwell is a major supporter of fellow Democratic candidates for public office. In 2006, facing her own challenging race, Cantwell used ActBlue to raise $100,000 for Darcy Burner, Peter Goldmark, and Richard Wright, all of whom were facing rough House races in Washington state. In the 2008 cycle, Cantwell was particularly committed to supporting the reelection of Senator Mary Landrieu of Louisiana.On December 31, 2007, Cantwell became the 10th senator to endorse Hillary Clinton for President of the United States. Cantwell supported Clinton throughout the primary season, but vowed to vote for the winner of the pledged delegates. After Clinton's concession on June 7, Cantwell endorsed Obama. At the Washington State Democratic Convention on June 15, Cantwell added: \"I do want to see a strong Democratic woman in the White House ... That's why I'm so glad Michelle Obama will be the next first lady.\"On October 20, 2013, Cantwell was one of 16 female Democratic senators to sign a letter endorsing Hillary Clinton as the Democratic nominee in the 2016 Presidential Election.Criticism of Amanda Knox guilty verdict On December 4, 2009, the day that 22-year-old Washingtonian Amanda Knox was found guilty by an Italian court of the murder of Meredith Kercher, Cantwell released a statement expressing her dismay at the verdict, saying that she had \"serious questions about the Italian justice system and whether anti-Americanism tainted [the] trial.\" She stated that the evidence against Knox was insufficient, that Knox had been subjected to \"harsh treatment\" following her arrest, and that there had been \"negligence\" in the handling of evidence. She also complained that jurors had not been sequestered, allowing them to view \"negative news coverage\" about Knox, and that one of the prosecutors had a misconduct case pending in relation to another trial. Cantwell said she would seek assistance from Secretary of State Hillary Clinton. A spokesman for the State Department said in December 2009 that the Department had followed the case closely and would continue to do so. He added: \"It is still in the early days but ... we haven't received any indications necessarily that Italian law was not followed.\"Committee assignments Sen. Cantwell currently serves on these Committees and Subcommittees in the 115th United States Congress:Committee on Commerce, Science and TransportationSubcommittee on Aviation Operations, Safety, and Security (Ranking Member)Subcommittee on Communications, Technology, and the InternetSubcommittee on Oceans, Atmosphere, Fisheries, and Coast GuardSubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on Energy and Natural Resources (Ranking Member)Subcommittee on Energy (Ex Officio)Subcommittee on National Parks (Ex Officio)Subcommittee on Public Lands, Forests and Mining (Ex Officio)Subcommittee on Water and Power (Ex Officio)Committee on FinanceSubcommittee on Energy, Natural Resources, and InfrastructureSubcommittee on Health CareSubcommittee on Taxation and IRS OversightCommittee on Indian AffairsCommittee on Small Business and EntrepreneurshipCaucus memberships Congressional Caucus for Women's IssuesCongressional Hazards CaucusCongressional Internet CaucusCongressional Wine CaucusSenate National Guard CaucusSenate New Democrat CaucusSenate Steel Caucus", "Electoral history": "Washington's 44th legislative district position 1 Democratic primary election, 1986PartyCandidateVotes%±DemocraticMaria Cantwell5,14182.2DemocraticPaul Roberts1,11417.8Washington's 44th legislative district position 1 election, 1986PartyCandidateVotes%±DemocraticMaria Cantwell14,93654.2RepublicanGeorge Dahlquist12,60045.8Washington's 44th legislative district position 1 election, 1988PartyCandidateVotes%±DemocraticMaria Cantwell (Incumbent)28,38165.6RepublicanRobert Grupe14,90834.4Washington's 44th legislative district position 1 election, 1990PartyCandidateVotes%±DemocraticMaria Cantwell (Incumbent)18,74561.1RepublicanJoyce Meyerson11,91738.9Washington's 1st congressional district election, 1992PartyCandidateVotes%±DemocraticMaria Cantwell148,84454.9RepublicanGary Nelson113,89742.0IndependentPatrick L. Ruckert4,3221.6Natural Law PartyAnne Fleming4,2111.6Washington's 1st congressional district Democratic primary election, 1994PartyCandidateVotes%±DemocraticMaria Cantwell (Incumbent)45,30892.0DemocraticPatrick Ruckert3,9238.0Washington's 1st congressional district election, 1994PartyCandidateVotes%±RepublicanRick White100,55451.7DemocraticMaria Cantwell (Incumbent)94,11048.3-6.6Washington United States Senate Democratic primary election, 2000PartyCandidateVotes%±DemocraticMaria Cantwell472,60970.55DemocraticDeborah Senn168,11025.10DemocraticBarbara Lampert15,1502.26DemocraticRobert TIlden Medley14,0092.09Washington United States Senate election, 2000PartyCandidateVotes%±DemocraticMaria Cantwell1,199,43748.73n/aRepublicanSlade Gorton (Incumbent)1,197,20848.64-7.1LibertarianJeff Jared64,7342.63Washington United States Senate Democratic primary election, 2006PartyCandidateVotes%±DemocraticMaria Cantwell (Incumbent)570,67790.8DemocraticHong Tran33,1245.3DemocraticMike the Mover11,2741.8DemocraticMichael Goodspaceguy Nelson9,4541.5DemocraticMohammad Said4,2220.7Washington United States Senate election, 2006PartyCandidateVotes%±DemocraticMaria Cantwell (Incumbent)1,184,65956.9+7.8RepublicanMike McGavick832,10639.9Washington United States Senate blanket primary election, 2012PartyCandidateVotes%±DemocraticMaria Cantwell (Incumbent)772,05855.66RepublicanMichael Baumgartner417,14130.07RepublicanArt Coday79,7275.75DemocraticTimmy \"Doc\" Wilson31,8172.29RepublicanChuck Jackson25,9831.87RepublicanGlen \"Stocky\" Stockwell25,7931.86RepublicanMike the Mover19,5351.41ReformWill Baker15,0051.08United States Senate election in Washington, 2012PartyCandidateVotes%±DemocraticMaria Cantwell (Incumbent)1,657,95260.11+3.2RepublicanMichael Baumgartner1,100,16139.89In 2016, a faithless elector from Washington cast a vote for her for Vice President.", "Personal life": "In 2006, it emerged that court files concerning a loan made by Cantwell in 2001 to her former boyfriend, boss, and campaign manager, lobbyist Ron Dotzauer, which was to help Dotzauer through his divorce litigation, had been sealed. The reporter for Sound Politics had the file unsealed and discovered that Cantwell was identified in the divorce records \"as the 'other woman.'\"Owing to a sharp decrease in the value of her stock in RealNetworks, Cantwell's personal fortune has declined significantly in the past few years.", "Further reading": "Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of Congress", "introduction": "Maria Elaine Cantwell /ˈkæntˌwɛl/ (born October 13, 1958) is the junior United States Senator from Washington, first elected in 2000. A Democrat, she previously served in the Washington House of Representatives from 1987 to 1993 and the United States House of Representatives from Washington's 1st congressional district from 1993 to 1995, after which she worked as an executive for RealNetworks. She is Washington's second female senator, after Patty Murray.\nCantwell is the ranking member on the United States Senate Committee on Energy and Natural Resources. While Democrats were in the majority, she was Chair of the Committee on Small Business and Entrepreneurship from 2014 to 2015 and of the Committee on Indian Affairs from 2013 to 2014.\nUpon the February 2017 resignation of Jeff Sessions to become United States Attorney General, Cantwell became the most senior junior Senator.\n\n"}, "personal": {"Born": "Maria Elaine Cantwell (1958-10-13) October 13, 1958 (age60)Indianapolis, Indiana, U.S.", "Political party": "Democratic", "Education": "Miami University (BA)", "Signature": ""}, "timeline": {"United States Senatorfrom Washington": {"date": "Assumed office January 3, 2001Serving with Patty Murray", "Preceded by": "Slade Gorton"}, "Ranking Member of the Senate Energy Committee": {"date": "Assumed office January 3, 2015", "Preceded by": "Lisa Murkowski"}, "Chair of the Senate Small Business Committee": {"date": "In officeFebruary 12, 2014– January 3, 2015", "Preceded by": "Mary Landrieu", "Succeeded by": "David Vitter"}, "Chair of the Senate Indian Affairs Committee": {"date": "In officeJanuary 3, 2013– February 12, 2014", "Preceded by": "Daniel Akaka", "Succeeded by": "Jon Tester"}, "Member of the US House of Representativesfrom Washington's 1st district": {"date": "In officeJanuary 3, 1993– January 3, 1995", "Preceded by": "John Miller", "Succeeded by": "Rick White"}, "Member of the Washington House of Representativesfrom the Position 1, 44th legislative district": {"date": "In officeJanuary 12, 1987– January 11, 1993", "Preceded by": "Jeanine Long", "Succeeded by": "Jeanine Long"}}, "code": "C000127", "type": "3", "party": "Democrat", "description": "rank-and-file Democrat", "economic": "-0.29", "social": "-0.4", "leadership": "0.52"}