{"name": "Martin.Heinrich", "picture": "H001046.jpg", "detail": {"Early life, education, and business career": "Martin Trevor Heinrich was born in Fallon, near Carson City, Nevada. Heinrich is the son of Shirley A. (née Bybee), a seamstress, and Peter C. Heinrich, a utility company lineman. Raised as a Lutheran, he is of part German ancestry. Heinrich grew up in the town of Cole Camp, Missouri, located near Missouri's fifth largest city, Columbia. Heinrich was educated and went to local public schools in Cole Camp, then moved to Columbia in 1989 to attend the University of Missouri. He graduated in 1995 with a bachelor's degree in mechanical engineering, and later left Missouri, settling in Albuquerque, New Mexico to take graduate courses at the University of New Mexico. After a brief stint doing mechanical drawings, Heinrich worked as an AmeriCorps fellow in New Mexico.From 1996 to 2001, he served as executive director of the Cottonwood Gulch Foundation, a New Mexico non-profit organization dedicated to educating young people on natural science and the environment. In 2002, Heinrich founded his own public affairs consulting firm.", "Early political career": "Heinrich served on the Albuquerque City Council from 2003 to 2007, which included one term as city council president in 2006. As a city councilman, he stated that his goals were to reduce crime, raise the minimum wage and create new jobs. He also advocated the use of wind and solar power.In February 2006, he was appointed by Governor Bill Richardson to be the state's Natural Resources Trustee.", "US House of Representatives": "Elections 2008In 2008, Heinrich filed papers to run in New Mexico's 1st congressional district, based in Albuquerque. He originally planned to challenge five-term Republican incumbent Heather Wilson, but Wilson retired to run for the U.S. Senate seat vacated by retiring Republican Pete Domenici. Heinrich won the Democratic primary on June 4, 2008, defeating New Mexico Secretary of State Rebecca Vigil-Giron, State Health Secretary Michelle Lujan Grisham, and U.S. Army veteran Robert Pidcock 44%-25%-24%-8%.In the general election, Heinrich faced Bernalillo County Sheriff Darren White, whom Heinrich's campaign focused on linking to President George W. Bush. Heinrich also called for energy independence and an end to the war in Iraq. He defeated White, 56%-44%, carrying three of the district's five counties: Bernalillo (56%), Sandoval (56%), and Valencia (53%). White won Santa Fe (64%) and Torrance (57%) counties.  Upon his swearing in on January 3, 2009, he became the first Democrat to represent the district. The district had been in Republican hands since New Mexico was split into districts in 1969, but has become increasingly friendly to Democrats in recent years; it has not supported a Republican for president since 1988.[citation needed]2010Heinrich was challenged by Republican Jon Barela, who told Politico he did not believe Heinrich reflected the district, saying he was too far left on budget and spending issues. During the 2010 campaign, Roll Call reported that the Democratic Congressional Campaign Committee assigned a lobbyist to aid in the reelection campaigns of possibly vulnerable house members to help in fundraising, messaging and campaign strategy. Heinrich was elected to a second term, defeating Barela 52%-48%, and carrying two of the district's counties: Bernalillo (53%) and Sandoval (51%). Barela won Santa Fe (67%), Torrance (61%), and Valencia (53%) counties.Tenure On January 14, 2009, Heinrich was elected by the House Democratic freshmen to a six-month term as their freshmen class president. He co-sponsored the Stop the Congressional Pay Raise Act, which would cancel an automatic $4,700 salary raise for members of Congress.Health care On March 21, 2010, Heinrich voted for the Patient Protection and Affordable Care Act (commonly called Obamacare or the Affordable Care Act). In 2017, Heinrich co-sponsored Medicare-For-All.Abortion NARAL Pro-Choice America PAC endorsed Heinrich in 2010.Heinrich received a 100% score from NARAL in 2009.Environment Heinrich has identified himself as an environmentalist throughout his career. He served as executive director of the Cottonwood Gulch Foundation, a New Mexico non-profit organization dedicated to educating young people on natural science and the environment, and founded his own public affairs consulting firm.Later, as a member of the Albuquerque City Council, he advocated for the use of wind and solar power. In February 2006, he was appointed by Governor Bill Richardson to be the state's Natural Resources Trustee. He also served on the executive committee of the Sierra Club's Rio Grande Chapter. In August 2011, he received the Sierra Club's first endorsement of the 2012 election cycle. He opposes construction of the Keystone Pipeline. He supports cap-and-trade legislation.Same-sex marriage In 2008, Heinrich stated, \"I am not supportive of gay marriage, but I do believe that everybody in the United States has the same civil rights in front of the government. So I think it's important that civil rights that are available to heterosexual couples should be available to every single gay couple who also wants to make the same sort of commitments.\"After his 2012 Senate primary opponent, Hector Balderas, announced his support for same-sex marriage, Heinrich's staff released a statement to the New Mexico Independent newspaper stating, \"Martin has supported gay marriage for some time. I just don't think he was asked about it. Thanks for asking!\" He was an original cosponsor of Congressman Jerry Nadler's 2009 legislation to repeal the Defense of Marriage Act.Gun law The National Rifle Association (NRA) endorsed Heinrich during the 2010 congressional election. At that time, he received a grade of \"A\" from the NRA on his stance with regards to Second Amendment rights. He is a former member of the NRA.Heinrich opposed legislation that would have reinstated the Federal Assault Weapons Ban. He also supported bills to create a national standard for the concealed carrying of firearms across state lines, and co-sponsored legislation that would ease the restrictions on the sales of firearms across state lines.Ojito Wilderness In 2008, Heinrich was criticized by the New Mexico Republican Party for his work on the creation of the Ojito National Wilderness, which they said amounted to unregistered lobbying. Heinrich responded that the work was advocacy that did not require lobbying disclosure.Armed forces Heinrich was a member of the House Armed Services Committee.During his time in Congress, Heinrich has maintained strong opposition to the war in Iraq, and supports a swift end of combat operations in Afghanistan.In 2011, he voted against the National Defense Authorization Act conference report because he objected to language requiring that suspected foreign terrorists be taken into custody by the military instead of civilian law enforcement authorities.Committee assignments Committee on Armed ServicesSubcommittee on Tactical Air and Land ForcesSubcommittee on Strategic ForcesCommittee on Natural ResourcesSubcommittee on Energy and Mineral ResourcesSubcommittee on National Parks, Forests and Public Lands", "US Senate": "Elections 2012Heinrich announced that he would leave the House to run for the United States Senate seat held by Jeff Bingaman, who retired at the end of his term. In March, Politico reported that Al Gore had signed a fundraising letter for Heinrich. Heinrich defeated State Auditor Hector Balderas in the Democratic primary. Heinrich faced Republican Heather Wilson, his predecessor in Congress, in the general election on November 6, 2012. He defeated Wilson, 51% to 45%.[citation needed]2018Heinrich is running for a second term in 2018 against Republican Mick Rich and Libertarian Gary Johnson.Tenure Gun laws On April 17, 2013, Heinrich voted to expand background checks for gun purchases.On April 17, 2013, Heinrich voted against regulating assault weapons.Every life lost to gun violence is a tragedy. Our country is weary from violence and grief and the American people deserve meaningful action from Congress. It's long past due for a legislative response to keep guns out of the hands of those that would turn them against our communities.In response to the 2017 Las Vegas shooting, Heinrich stated that Congress needed to pass legislative changes to combat gun violence.Health care On September 27, 2013, Heinrich voted to restore funding for the Patient Protection and Affordable Care Act as part of an amendment to legislation funding government operations for 45 days, and which also omitted House-passed language prioritizing debt payments if Congress fails to increase the nation's borrowing limits.Committee assignments Committee on Armed ServicesSubcommittee on Emerging Threats and Capabilities (Ranking Member, 115th Congress)Subcommittee on Strategic ForcesCommittee on Energy and Natural ResourcesSubcommittee on EnergySubcommittee on National ParksSubcommittee on Public Lands, Forests and MiningSelect Committee on IntelligenceJoint Economic Committee (Ranking Member, 115th Congress)Bipartisan survival trip In 2014, Heinrich and Republican Senator Jeff Flake of Arizona traveled to a small island called Eru in the Marshall Islands. The Discovery Channel sent a film crew to document their trip and plan to air the film for a show called Rival Survival. Heinrich and Flake had to survive for six days with few resources, including no natural sources of drinkable water. After the trip, Heinrich told reporters that he and Flake decided to go on the trip to demonstrate that politicians from different political parties can work together, and in their case, to survive.", "Electoral history": "New Mexico's 1st congressional district Democratic primary election, 2008PartyCandidateVotes%+%DemocraticMartin Heinrich22,34143.51%DemocraticRebecca Vigil-Giron12,66024.66%DemocraticMichelle Lujan Grisham12,07423.51%DemocraticRobert Pidcock4,2738.32%New Mexico's 1st congressional district election, 2008PartyCandidateVotes%+%DemocraticMartin Heinrich166,27155.65%RepublicanDarren White132,48544.35%New Mexico's 1st congressional district election, 2010PartyCandidateVotes%+%DemocraticMartin Heinrich (incumbent)112,70751.88%RepublicanJonathan Barela104,54348.12%U.S. Senate Democratic primary election in New Mexico, 2012PartyCandidateVotes%+%DemocraticMartin Heinrich83,43258.94%DemocraticHector Balderas58,12841.06%U.S. Senate election in New Mexico, 2012PartyCandidateVotes%+%DemocraticMartin Heinrich395,71751.01%RepublicanHeather Wilson351,25945.28%Independent AmericanJon Ross Barrie28,1993.63%Write-inRobert Anderson6170.08%", "Further reading": "Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of Congress", "introduction": "Martin Trevor Heinrich (/ˈhaɪnrɪk/; born October 17, 1971) is an American politician and businessman serving as the junior United States Senator from New Mexico since 2013.\nA native of Fallon, Nevada, Heinrich lived much of his adulthood in New Mexico, specifically Albuquerque, the state's largest city. As a member of the Democratic Party, he was the U.S. Representative for New Mexico's 1st congressional district from 2009 to 2013. He then won the Senate seat vacated by retiring Senator Jeff Bingaman in 2012. Heinrich was mentioned as a possible nominee for Vice President of the United States in 2016 under Democratic presidential nominee Hillary Clinton.  However, Senator Tim Kaine from Virginia was later selected for the ticket.\n\n"}, "personal": {"Born": "Martin Trevor Heinrich (1971-10-17) October 17, 1971 (age46)Fallon, Nevada, U.S.", "Political party": "Democratic", "Spouse(s)": "Julie Heinrich", "Children": "2", "Education": "University of Missouri (BS)University of New Mexico"}, "timeline": {"United States Senatorfrom New Mexico": {"date": "Assumed office January 3, 2013Serving with Tom Udall", "Preceded by": "Jeff Bingaman"}, "Member of the US House of Representativesfrom New Mexico's 1st district": {"date": "In officeJanuary 3, 2009– January 3, 2013", "Preceded by": "Heather Wilson", "Succeeded by": "Michelle Lujan Grisham"}}, "code": "H001046", "type": "3", "party": "Democrat", "description": "moderate Democratic follower", "economic": "-0.3", "social": "-0.02", "leadership": "0.22"}