{"name": "Mazie.Hirono", "picture": "H001042.jpg", "detail": {"Early life and education": "Mazie Hirono was born on November 3, 1947, in Fukushima Prefecture, Japan. Although born in Japan, she was born to a mother who was an American citizen. At the age of 16, her maternal grandfather, Satō Hiroshi, immigrated to Hawaii to work on sugarcane plantations; Hirono's grandmother, Tari Shinoki, was a picture bride. After finding plantation work difficult, they opened a bathhouse on River Street in Honolulu in 1928 and saved their money. The couple had a daughter, Sato Laura Chie, in 1924 and a son, Akira. In 1939, Tari returned to Japan with their son and daughter; Hiroshi remained behind to run the bathhouse for two more years before rejoining his family in 1941. Though Laura felt out of place in Japan, in 1946, aged 22, she married a veterinarian, Hirono Matabe, and moved with her husband to southern Fukushima. The couple had three children, Roy, Mazie and Wayne; Mazie was the middle child and only surviving daughter.Hirono's father was a compulsive gambler and alcoholic who would pawn his wife's possessions for gambling money. Treated \"like a slave,\" by her in-laws, Hirono said, in 1951 Laura left her abusive marriage. The deciding moment for her had come after her brother Akira, who had returned to Hawaii after the war, had sent some money for a school uniform for Laura's youngest son Wayne, but her husband had taken it to buy an overcoat. As Laura later recounted, \"My brother sent money to buy a school uniform for my son. My husband took the money, went to town and never came back home. It was getting closer to the start of school, so I went to look for him. I found out he had ordered an overcoat for himself with the money. He didn't need an overcoat in the spring. That's when I made up my mind to leave.\" After telling her in-laws she would be taking her elder son and Hirono to school in her hometown, Laura left the house, never to return. Selling her clothes for the rail fare, she returned to her parents' house. Laura said, \"My husband never came around once; my parents were supportive and took all of us in. My mother gave us money. I guess it all boils down to love.\"Hirono's grandparents decided to return to Hawaii, but as Japanese citizens without professional backgrounds, they could only immigrate under a quota system; as Laura had citizenship, she decided to return first. As Wayne was only three, Laura left him with her parents and with Mazie and Roy returned to Hawaii in March 1955, sending for Wayne and her parents in 1957.\"She determined that she had to get away, and it wasn't enough to even be living in the same country — she wanted to put thousands of miles between them,\" Hirono said. \"That took a lot of courage. I always tell my mom there is nothing I can do, (hard as it is to be in politics, to be in public life, that I think is) harder than what she did.\"After first living with her uncle Akira, Mazie, Roy and her mother moved into a rooming house on Kewalo Street in Honolulu. \"The first place had one room, one table, three chairs and one bed,\" Laura said. \"Mazie and Roy slept on the bed. I slept on the floor with a futon. The landlady was so nice. The rent was $35, but she charged us less because I didn't have a job.\"Laura found work for Hawaii Hochi as a typesetter and also worked three nights a week for a catering company.  Hirono herself worked in the school cafeteria and had a paper route.Though money was tight and the family was forced to move often, Laura kept them together. Mazie Hirono recalled that she and her brother used to get a dime once or twice a week from their mother. \"We both had baseball piggy banks. My older brother spent all his dimes but I saved mine. But one day I came home and the dimes were gone. My mother had to use it to buy food.\"Hirono never saw her father again, and he has since died. Laura became a newspaper proofreader in 1961 and retired from the Hawaii Newspaper Agency in 1986; Roy became a Hawaiian Electric supervisor. Wayne drowned in 1978, aged 26. Her grandfather, Hiroshi, died in 1989, and her grandmother Tari died in 2000 at age 99.Raised in Honolulu, Hawaii, Hirono became a naturalized U.S. citizen in 1959, the year that Hawaii became a state.  Hirono attended Kaʻahumanu Elementary and Koko Head Elementary Schools. She later graduated from Kaimuki High School, which at the time of her attendance had a predominantly Japanese American student body. Upon graduating from high school, Hirono enrolled at the University of Hawaii at Mānoa where, in 1970, she graduated Phi Beta Kappa and received a B.A. degree in psychology. She left Hawaii to attend Georgetown University Law Center, where she obtained her J.D. degree in 1978. Hirono returned to Honolulu where she practiced law.", "Hawaii House of Representatives (1981–1994)": "Elections In 1980, she was elected to Hawaii's 12th House District in a multi-member district with Democrat State Representative David Hagino. Hawaii eliminated MMDs and after redistricting, she ran for Hawaii's 20th House District and won. After redistricting again in 1984, she ran for the newly redrawn Hawaii's 32nd House District and won. In 1992, after redistricting, she ran in the newly redrawn Hawaii's 22nd House District. She was challenged in the Democratic primary and won the three candidate field with 91% of the vote. She won the general election and served only one term in the 22nd district before retiring in 1994 to run for statewide office.Tenure From 1980 to 1994, Hirono served in the Hawaii House of Representatives, passing more than 120 laws. She was honored by a coalition of leaseholders as Legislator of the Year in 1984.Committee assignments From 1987 to 1992, she was the Chairman of the Consumer Protection and Commerce Committee.", "Lieutenant Governor (1994–2002)": "Elections 1994She ran for Lieutenant Governor of Hawaii and won the Democratic primary defeating fellow State Representative Jackie Young 65%–26%. In the general election, she defeated three other candidates: Danny Kaniela Kaleikini (Best Party), State Representative Fred Hemmings (Republican Party), and Jack Morse (Green Party) 37%–31%–29%–4%.1998She ran for re-election in 1998. She was challenged in the primary by Nancy L. Cook and defeated her 89%–11%. In the general election, Hirono defeated Republican State Senator Stan Koki 50%–49%, a difference of 5,254 votes.Tenure In 1994, she joined the ticket of incumbent Lieutenant Governor Benjamin J. Cayetano and was consequently elected to a historic administration led by the first Filipino American governor and first Japanese immigrant lieutenant governor. During her tenure as lieutenant governor, Hirono was also president of the National Commission on Teaching, America's Future, as well as the Hawaii Policy Group. She also spearheaded the first-in-the-nation comprehensive Pre-Plus program, a precursor to universal pre-school education in the United States.", "2002 gubernatorial election": "Hirono originally wanted to run for Mayor of Honolulu in a potential 2002 special election created by the vacancy of incumbent Mayor Jeremy Harris, who was planning to resign in order to run for Governor of Hawaii. However, due to internal controversies, Harris dropped out of the gubernatorial election and remained mayor for another two years. Hirono switched races.Hirono maneuvered to gain the support of potential Harris voters in her challenge against former State House Majority Leader Ed Case. Through the entire primary campaign season, Hirono and Case polled almost equally. Hirono defeated Case in the September 21 Democratic primary, 41%–40%, a difference of 2,613 votes.Only a few weeks later, Republican nominee and Mayor of Maui Linda Lingle defeated Hirono 52%–47%. She became Hawaii's first female governor.", "US House of Representatives (2007–2013)": "Elections 2006On September 23, Hirono ran for Hawaii's 2nd congressional district, being vacated by incumbent U.S. Congressman Ed Case. The Democratic primary was very competitive. There were ten candidates, seven of whom served in the Hawaii Legislature. Hirono's advantage was the fact that she was the only candidate who had held statewide office and as a result had the most name recognition. She also raised more money than any other candidate in the race, mostly because of the endorsement of EMILY's List. Hirono also loaned her campaign $100,000. She won with a plurality of just 22% of the vote. State Senator Colleen Hanabusa ranked second with 21%, and was only 845 votes short of Hirono.In the general election, she defeated Republican State Senator Bob Hogue 61%–39%.2008Hirono won re-election to a second term with 76% of the vote. She outperformed presidential candidate Barack Obama, a native of Honolulu, by three points.2010Hirono won re-election to a third term with 72% of the vote.Tenure In 2008, Hirono was named the national preschool advocacy organization Pre-K Now's \"Pre-K Champion\" for her efforts on behalf of pre-kindergarten legislation.Stance on abortionHirono's voting history on abortion policies in the US House of Representatives is congruent with her reputation as a liberal.Hirono co-sponsored and signed the Prevention First Act of 2007. This act was aimed towards increasing public access to contraception, as well as increasing government funding to support the use of contraception. The act takes a pro-active stance on birth control, with an emphasis on informing and protecting women from unintended pregnancy.On May 4, 2011, Hirono voted against the No Taxpayer Funding for Abortion Act, which would have prohibited federal health care program from covering abortion costs, with exceptions being given to life-threatening cases. The NTFA Act was highly controversial and pertinent to the future of American health care, as its outcome would create policies that conflicted with the coverage of the President's proposed Patient Protection and Affordable Care Act.In July 2011, Hirono continued to show her support for contraceptives by signing the Access to Birth Control Act, which mandates that pharmacies provide birth control to customers without undue delay. The ABP Act also ensures that customers seeking birth control can obtain without being submitted to unwanted harassment or breaches in patient confidentiality.Emily's List, a Democratic pro-choice action committee, pledged support to Hirono for her history of supporting contraceptive and abortion policies during her term. The endorsement of Emily's List helped Hirono in her 2012 senatorial race, contributing $129,714 to her campaign.Committee assignments Committee on Armed ServicesSubcommittee on PersonnelSubcommittee on Readiness and Management SupportSubcommittee on Seapower (Ranking Member)Committee on the JudiciarySubcommittee on the Constitution, Civil Rights and Human RightsSubcommittee on Immigration, Refugees and Border SecuritySubcommittee on Oversight, Agency Action, Federal Rights and Federal CourtsSubcommittee on Privacy, Technology and the LawCommittee on Veterans' AffairsCommittee on Energy and Natural ResourcesCaucus memberships Congressional Asian Pacific American CaucusCongressional Wildlife Refuge CaucusInternational Conservation Caucus", "US Senate": "2012 election On May 19, 2011, Mazie Hirono announced her candidacy for the U.S. Senate seat left open by Senator Daniel Akaka, who was retiring at the end of his term in 2012. She won the Democratic primary election on August 11, 2012. Hirono was endorsed as one of Democracy for America's Dean Dozen. She faced former Governor of Hawaii, Republican Linda Lingle, in the general election on November 6, 2012, and won. She is the first female senator from Hawaii, as well as the first Asian-born immigrant to be elected to the U.S. Senate. She was a part of the first completely non-Christian Congressional delegation from the state, which continued until the election of Mark Takai (an Episcopalian) in 2014 as Representative of Hawaii's 1st Congressional District.In the 2012 campaign, Hirono was able to raise $5.2 million, with approximately 52% of that amount coming from large corporations, whereas Lingle raised $5.5 million, with 74% of the funding coming from large corporations. Hirono ended up spending $5 million, to come up with a 63% win over her opponent, while Lingle spent $4.8 million.On December 12, 2012, the Senate Democratic Steering Committee announced that Hirono would serve on the Senate Judiciary Committee, giving her influence on matters ranging from approving nominations of federal judges to setting criminal-justice policy.2018 election During a July 10, 2018 radio interview with NPR, she stated she would vote to confirm Supreme Court nominee Judge Brett Kavanaugh only if he \"turns miraculously into a Sotomayor.\" In September 2018, Senator Hirono said in relation to Kavanaugh's nomination, associated accusations, and the Senate Judiciary Committee, \"Guess who's perpetuating all of these kind of actions? It's the men in this country,\" she told reporters. \"And I just want to say to the men in this country: Just shut up and step up.\"Committee assignments (115th Congress) Committee on Armed ServicesSubcommittee on Readiness and Management SupportSubcommittee on SeaPower (Ranking Member)Committee on Energy and Natural ResourcesSubcommittee on National ParksSubcommittee on Public Lands, Forests, and MiningCommittee on Small Business and EntrepreneurshipCommittee on the JudiciarySubcommittee on Border Security and ImmigrationSubcommittee on Oversight, Agency Action, Federal Rights and Federal CourtsSubcommittee on Privacy, Technology and the LawSubcommittee on the Constitution (Ranking Member)Committee on Veterans' AffairsJoint Select Committee on Budget and Appropriations Process ReformCaucus memberships Congressional NextGen 9-1-1 Caucus", "Political positions": "Gun law As of 2010, Hirono had a \"F\" rating from the National Rifle Association due to her consistent voting record in support of gun control.In 2016, she participated in the Chris Murphy gun control filibuster. Hirono expressed disappointment when the Democrat-proposed Feinstein Amendment (banning the sale of firearms to individuals on the terrorist watchlist) and the Republican-backed background check expansion and alert system (regarding guns being sold to terrorist watchlist suspects) both failed to pass the Senate. In response to these failures, she stated:Health care On July 28, 2017, two months after undergoing surgery for stage-four kidney cancer, Senator Hirono spoke on the Senate floor and voted against the so-called \"skinny repeal\" of the Affordable Care Act. Reporter Kyle Griffin of MSNBC filmed Senator Hirono's speech and posted it on Twitter.", "Electoral history": "Results certified by the Office of Elections, State of Hawaii:", "Personal life": "Hirono announced in May 2017 that she had been diagnosed with stage 4 kidney cancer, which had spread to her seventh rib. The cancer was discovered following a chest x-ray in April before some minor eye surgery. Her right kidney was removed surgically on May 17, 2017, with a Cyberknife procedure to treat the rib lesion. Hirono returned to the Senate on May 22, 2017, and is running for re-election in 2018.", "Further reading": "\"The Immigrant Congresswoman\" Dan Boylan, March 21, 2007, MidWeek cover story", "introduction": "Mazie Keiko Hirono (/ˈmeɪzi hiˈroʊnoʊ/; Japanese name: 広野 慶子, Hirono Keiko; born November 3, 1947) is an American politician serving as the junior United States senator from Hawaii since 2013. She is a member of the Democratic Party.  She previously served as a member of the Hawaii House of Representatives from 1985 to 1995 and as the Lieutenant Governor of Hawaii from 1994 to 2002 under Governor Ben Cayetano. She was the Democratic nominee for Governor of Hawaii in 2002 but was defeated by Republican Linda Lingle. She was a member of the United States House of Representatives for Hawaii's 2nd congressional district from 2007 to 2013.\nShe is the first elected female senator from Hawaii, the first Asian-American woman elected to the Senate, the first U.S. senator born in Japan, and the nation's first Buddhist senator. She considers herself a non-practicing Buddhist and is often cited with Hank Johnson as the first Buddhist to serve in the United States Congress. She is the third woman to be elected to Congress from the state of Hawaii (after Patsy Mink and Pat Saiki). In 2012, Hirono was the Democratic nominee for the U.S. Senate seat being vacated by the retirement of Daniel Akaka. Hirono won the election, defeating Linda Lingle in a re-match landslide victory by 63% to 37%. Hirono was sworn in on January 3, 2013, by the Vice President of the United States and President of the Senate, Joe Biden. Hirono was the only person of Asian ancestry serving in the U.S. Senate from 2013 until 2017 when senators Tammy Duckworth and Kamala Harris were sworn in representing the states of Illinois and California respectively. Although Brian Schatz joined the Senate a week before she did, making him Hawaii's senior senator, her six years in the House of Representatives makes her the dean, or longest-serving member overall, of Hawaii's Congressional Delegation.\n\n"}, "personal": {"Born": "Mazie Keiko Hirono (1947-11-03) November 3, 1947 (age70)Koori, Fukushima Prefecture, Japan", "Political party": "Democratic", "Spouse(s)": "Leighton Kim Oshima", "Education": "University of Hawaii at Manoa (BA)Georgetown University (JD)", "Signature": ""}, "timeline": {"United States Senatorfrom Hawaii": {"date": "Assumed office January 3, 2013Serving with Brian Schatz", "Preceded by": "Daniel Akaka"}, "Member of the US House of Representativesfrom Hawaii's 2nd district": {"date": "In officeJanuary 3, 2007– January 3, 2013", "Preceded by": "Ed Case", "Succeeded by": "Tulsi Gabbard"}, "9th Lieutenant Governor of Hawaii": {"date": "In officeDecember 2, 1994– December 2, 2002", "Governor": "Ben Cayetano", "Preceded by": "Ben Cayetano", "Succeeded by": "Duke Aiona"}, "Member of the Hawaii House of Representativesfrom the 22nd district": {"date": "In officeJanuary 3, 1993– December 2, 1994", "Preceded by": "Gene Ward", "Succeeded by": "Terry Yoshinaga"}, "Member of the Hawaii House of Representativesfrom the 32nd district": {"date": "In officeJanuary 3, 1985– January 3, 1993", "Preceded by": "Clarice Hashimoto", "Succeeded by": "Len Pepper"}, "Member of the Hawaii House of Representativesfrom the 20th district": {"date": "In officeJanuary 3, 1983– January 3, 1985", "Preceded by": "Mitsuo ShitoDaniel J. Kihano", "Succeeded by": "Cam Cavasso"}, "Member of the Hawaii House of Representativesfrom the 12th district": {"date": "In officeJanuary 3, 1981– January 3, 1983", "Preceded by": "Clifford UwaineDavid Hagino", "Succeeded by": "Barbara Marumoto"}}, "code": "H001042", "type": "3", "party": "Democrat", "description": "rank-and-file Democrat", "economic": "-0.48", "social": "-0.09", "leadership": "0.53"}