{"name": "Mitch.McConnell", "picture": "", "detail": {"Early life and education": "McConnell is of Scots-Irish and English descent, the son of Addison Mitchell McConnell, and his wife, Julia (née Shockley). McConnell was born on February 20, 1942, in Sheffield, Alabama, and raised as a young child in nearby Athens. His original ancestor had emigrated from County Down, Northern Ireland to North Carolina.As a youth, McConnell overcame polio, which he was struck with at age 2. He received treatment at the Warm Springs Institute in Georgia, which potentially saved him from being disabled for the rest of his life. In 1990, McConnell said that his family \"almost went broke\" because of costs related to his illness.When he was eight, McConnell's family moved to Georgia. When he was a teenager, his family moved to Louisville, where he attended duPont Manual High School. He graduated with honors from the University of Louisville with a B.A. in political science in 1964. McConnell was president of the Student Council of the College of Arts and Sciences and a member of the Phi Kappa Tau fraternity. He has maintained strong ties to his alma mater and \"remains a rabid fan of its sports teams.\" In 1967, McConnell graduated from the University of Kentucky College of Law, where he was president of the Student Bar Association.In March 1967, shortly before graduating from law school, McConnell enlisted in the U.S. Army Reserve at Louisville, Kentucky. In August 1967, after five weeks of military training at Fort Knox, he received an honorable discharge for medical reasons (optic neuritis).", "Early career": "McConnell began interning for Senator John Sherman Cooper (R-KY) in 1964, and his time with Cooper inspired him to run for the Senate eventually himself. Later, McConnell was an assistant to Senator Marlow Cook (R-KY) and was a Deputy Assistant Attorney General under President Gerald R. Ford, where he worked alongside future Justice Antonin Scalia. In 1977, McConnell was elected the Jefferson County Judge/Executive, the former top political office in Jefferson County, Kentucky. He was re-elected in 1981.", "US Senate": "Elections1984In 1984, McConnell ran for the U.S. Senate against two-term Democratic incumbent Walter Dee Huddleston. The election race was not decided until the last returns came in, and McConnell won by a thin margin—only 3,437 votes out of more than 1.2 million votes cast, just over 0.4%. McConnell was the only Republican Senate challenger to win that year, despite Ronald Reagan's landslide victory in the presidential election. Part of McConnell's success came from a series of television campaign spots called \"Where's Dee\", which featured a group of bloodhounds trying to find Huddleston, implying that Huddleston's attendance record in the Senate was less than stellar. His campaign bumper stickers and television ads asked voters to \"Switch to Mitch\".1990In 1990, McConnell faced a tough re-election contest against former Louisville Mayor Harvey I. Sloane, winning by 4.4%.1996In 1996, he defeated Steve Beshear by 12.6%, even as Bill Clinton narrowly carried the state. In keeping with a tradition of humorous and effective television ads in his campaigns, McConnell's campaign ran television ads that warned voters to not \"Get BeSheared\" and included images of sheep being sheared.2002In 2002, he was re-elected against Lois Combs Weinberg by 29.4%, the largest majority by a statewide Republican candidate in Kentucky history.2008In 2008, McConnell faced his closest contest since 1990. He defeated Bruce Lunsford by 6%.2014In 2014, McConnell faced Louisville businessman Matt Bevin in the Republican primary. The 60.2% won by McConnell was the lowest voter support for a Kentucky U.S. Senator in a primary by either party since 1938. He faced Democratic Secretary of State Alison Lundergan Grimes in the general election. Although polls showed the race was very close, ultimately McConnell defeated Grimes by 56.2%–40.7%, resulting in a margin of victory of 15.5 percentage points – one of his largest margins of victory, second only to his 2002 margin.LeadershipDuring the 1998 and 2000 election cycles, McConnell was chairman of the National Republican Senatorial Committee. Republicans maintained control of the Senate after both elections. He was first elected as Majority Whip in the 108th Congress and unanimously re-elected on November 17, 2004. Senator Bill Frist, the Majority Leader, did not seek re-election in the 2006 elections. In November 2006, after Republicans lost control of the Senate, they elected McConnell to replace Frist as Minority Leader. After Republicans took control of the Senate following the 2014 Senate elections, McConnell became the Senate Majority Leader. In June 2018, McConnell became the longest-serving Senate Republican leader in the history of the United States.  McConnell is the second Kentuckian to lead his party in the Senate and is the longest-serving U.S. Senator from Kentucky in history.Tenure2016 presidential election and Donald TrumpMcConnell initially endorsed fellow Kentucky Senator Rand Paul during the 2016 presidential campaign. Following Paul's withdrawal from the race in February 2016, McConnell did not endorse another candidate until May 4, 2016 when he endorsed then-presumptive nominee Donald Trump. \"I have committed to supporting the nominee chosen by Republican voters, and Donald Trump, the presumptive nominee, is now on the verge of clinching the nomination.\" However, McConnell disagreed with Trump on multiple subsequent occasions. In May 2016, after Trump suggested that federal judge Gonzalo P. Curiel was biased against Trump because of his Mexican heritage, McConnell responded, \"I don't agree with what he (Trump) had to say. This is a man who was born in Indiana. All of us came here from somewhere else.\" In July 2016, after Trump had criticized the parents of Capt. Humayun Khan, a Muslim soldier who was killed in Iraq, McConnell stated, \"Captain Khan was an American hero, and like all Americans, I'm grateful for the sacrifices that selfless young men like Captain Khan and their families have made in the war on terror. All Americans should value the patriotic service of the patriots who volunteer to selflessly defend us in the armed services.\" On October 7, 2016, following the Donald Trump Access Hollywood controversy, McConnell stated: \"As the father of three daughters, I strongly believe that Trump needs to apologize directly to women and girls everywhere, and take full responsibility for the utter lack of respect for women shown in his comments on that tape.\"With regard to the US response to intelligence findings that Russia was responsible for cyberattacks undertaken to influence the American election, after Trump won the election, Senator McConnell expressed \"support for investigating American intelligence findings that Moscow intervened.\" Prior to the election, however, when FBI Director James Comey, Secretary of Homeland Security Jeh Johnson and other officials met with the leadership of both parties to make the case for a bipartisan statement warning Russia that such actions would not be tolerated, \"McConnell raised doubts about the underlying intelligence and made clear to the administration that he would consider any effort by the White House to challenge the Russians publicly an act of partisan politics,\" The Washington Post reported, citing accounts of several unnamed officials.In April 2017, McConnell denied knowing anything about potential wiretapping of Trump by the Obama administration, saying there was an ongoing investigation.In November 2017, McConnell was opposed to passing legislation to protect Special Counsel Robert Mueller's investigation into Russian interference in the 2016 election. In April 2018, less than 24 hours after an FBI raid on Michael Cohen's (President Trump's personal attorney) office, and after Trump had said that \"many people\" had asked him to fire Mueller, McConnell reiterated that he opposed any legislation to protect Mueller's investigation. Later that month, McConnell thwarted a bipartisan legislative effort to protect Mueller's investigation.In January 2018, Senators Marco Rubio and Chris Van Hollen introduced a bipartisan bill that would impose new sanctions on Russia in the event the country attempted interfering in another American election. In July, McConnell mentioned the bill as one option on the table for the Senate to respond to President Trump's posture toward the government of Vladimir Putin and asked the Banking and Foreign Relations panels to hold new hearings on the implementation of the bipartisan Russia sanctions bill from the previous year in addition to suggesting potential further steps lawmakers could pursue as part of efforts to counter Russian malfeasance ahead of that year's midterm elections.In June 2018, McConnell said regarding the Mueller investigation: \"they ought to wrap it up. It’s gone on seemingly forever and I don’t know how much more they think they can find out.\" By that time, the Mueller investigation had been open for just over a year while the average length of 16 special/independent counsel investigations from 1973-2003 was over three years.In July 2018, McConnell's chief strategist said that Trump's attacks on the intelligence community would benefit Republicans in the upcoming 2018 midterm election, both by energizing the Republican base and by drowning out Democrats' messaging on policy.Campaign financeMcConnell led opposition to stricter campaign finance regulations, with the Lexington Herald Leader describing it as McConnell's \"pet issue.\" argued that campaign finance regulations reduce participation in political campaigns and protect incumbents from competition. He spearheaded the movement against the Bipartisan Campaign Reform Act (known since 1995 as the \"McCain–Feingold bill\" and from 1989 to 1994 as the \"Boren–Mitchell bill\"), calling it \"neither fair, nor balanced, nor constitutional.\" His opposition to the bill culminated in the 2003 Supreme Court case McConnell v. Federal Election Commission and the 2009 Citizens United v. Federal Election Commission. McConnell has been an advocate for free speech at least as far back as the early 1970s when he was teaching night courses at the University of Louisville. \"No issue has shaped his career more than the intersection of campaign financing and free speech,\" political reporter Robert Costa wrote in 2012. In a recording of a 2014 fundraiser McConnell expressed his disapproval of the McCain-Feingold law, saying, \"The worst day of my political life was when President George W. Bush signed McCain-Feingold into law in the early part of his first Administration.\"On January 2, 2013, the Public Campaign Action Fund, a liberal nonprofit group that backs stronger campaign finance regulation, released a report highlighting eight instances from McConnell's political career in which a vote or a blocked vote (filibuster), coincided with an influx of campaign contributions to McConnell's campaign.EconomyIn 2010, McConnell requested earmarks for the defense contractor BAE Systems while the company was under investigation by the Department of Justice for alleged bribery of foreign officials.[unreliable source?]In June 2011, McConnell introduced a Constitutional Balanced Budget Amendment. The amendment would require two-thirds votes in Congress to increase taxes or for federal spending to exceed the current year's tax receipts or 18% of the prior year's GDP. The amendment specifies situations when these requirements would be waived.During the Great Recession, as Congress and the Obama administration negotiated reforms of the banking system, McConnell played an important role in preventing the addition of a provision requiring banks to prefund a reserve intended to be used to rescue insolvent banks in the future. When there appeared to be bipartisan and majority support for such a bank-funded reserve, McConnell criticized the provision, referred to it as a \"bailout fund\" and turned \"opposition to it a litmus test for Senate Republicans\", according to one study. According to the study, \"McConnell’s attack, along with his insistence that opposition would be a matter of party principle, undermined the fragile coalition supporting the prefunded reserve, and the White House—fearing that advocating a bank levy as part of the president’s broader reform would enable opponents tokill the whole bill—shelved the idea.\"After two intercessions to get federal grants for Alltech, whose president T. Pearse Lyons made subsequent campaign contributions to McConnell, to build a plant in Kentucky for producing ethanol from algae, corncobs, and switchgrass, McConnell criticized President Obama in 2012 for twice mentioning biofuel production from algae in a speech touting his \"all-of-the-above\" energy policy.In 2014, McConnell voted to help break Ted Cruz's filibuster attempt against a debt limit increase and then against the bill itself. In 2014, McConnell opposed the Paycheck Fairness Act (a bill that \"punishes employers for retaliating against workers who share wage information, puts the justification burden on employers as to why someone is paid less and allows workers to sue for punitive damages of wage discrimination\") because it would \"line the pockets of trial lawyers\", not help women.In July 2014, McConnell expressed opposition to a U.S. Senate bill that would limit the practice of corporate inversion by U.S. corporations seeking to limit U.S. tax liability.EnvironmentMcConnell expressed skepticism that climate change is a problem, telling the Cincinnati Enquirer editorial board in 2014, \"I'm not a scientist, I am interested in protecting Kentucky's economy, I'm interested in having low cost electricity.\" McConnell was the sponsor of the Gas Price Reduction Act of 2008, which would have allowed states to engage in increased offshore and domestic oil exploration. In 2015, McConnell encouraged state governors not to comply with the Obama administration's Clean Power Plan, which was aimed at tackling climate change.McConnell was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement. According to the Center for Responsive Politics, McConnell has received over $1.5 million from the oil and gas industry since 2012.Flag Desecration AmendmentMcConnell opposed the Flag Desecration Amendment to the Constitution in 2000. McConnell offered an amendment to the measure that would have made flag desecration illegal as a statutory crime, not by amending the Constitution.Foreign policyIn 1985, McConnell backed anti-apartheid legislation with Chris Dodd. McConnell went on to engineer new IMF funding to \"faithfully protect aid to Egypt and Israel,\" and \"promote free elections and better treatment of Muslim refugees\" in Myanmar, Cambodia and Macedonia. According to a March 2014 article in Politico, \"McConnell was a 'go-to guy' for presidents of both parties seeking foreign aid,\" but he has lost some of his idealism and has evolved to be more wary of foreign assistance.In August 2007, McConnell introduced the Protect America Act of 2007, which allowed the National Security Agency to monitor telephone and electronic communications of suspected terrorists outside the United States without obtaining a warrant.McConnell was the only party leader in Congress to oppose the resolution that would authorize military strikes against Syria in September 2013, citing a lack of national security risk.On March 27, 2014, McConnell introduced the United States International Programming to Ukraine and Neighboring Regions bill, which would provide additional funding and instructions to Radio Free Europe/Radio Liberty in response to the 2014 Crimea crisis.In September 2016, the Senate voted 71 to 27 against the Chris Murphy–Rand Paul resolution to block the $1.15 billion arms deal with Saudi Arabia. The Saudi Arabian-led coalition in Yemen has been accused of war crimes. Following the vote, McConnell said: \"I think it's important to the United States to maintain as good a relationship with Saudi Arabia as possible.\"Also in September 2016, both the Senate and the House of Representatives overrode President Obama's veto to pass the Justice Against Sponsors of Terrorism Act (JASTA) into law. Despite McConnell voting to override the President, McConnell would criticize JASTA within a day of the bill's passing, saying that it might have \"unintended ramifications\". McConnell appeared to blame the White House regarding this as he quoted that there was \"failure to communicate early about the potential consequences\" of JASTA, and said he told Obama that JASTA \"was an example of an issue that we should have talked about much earlier\". In vetoing the bill, Obama had provided three reasons for objecting to JASTA: that the courts would be less effective than \"national security and foreign policy professionals\" in responding to a foreign government supporting terrorism, that it would upset \"longstanding international principles regarding sovereign immunity\", and that it would complicate international relations.FundraisingFrom 2003 to 2008, the list of McConnell's top 20 donors included five financial/investment firms: UBS, FMR Corporation (Fidelity Investments), Citigroup, Bank of New York, and Merrill Lynch.In April 2010, while Congress was considering financial reform legislation, a reporter asked McConnell if he was \"doing the bidding of the large banks.\" McConnell has received more money in donations from the \"Finance, Insurance and Real Estate\" sector than any other sector according to the Center for Responsive Politics. McConnell responded \"I'd say that that's inaccurate. You could talk to the community bankers in Kentucky.\" The Democratic Party's plan for financial reform is actually a way to institute \"endless taxpayer funded bailouts for big Wall Street banks\", said McConnell. He expressed concern that the proposed $50 billion, bank-funded fund that would be used to liquidate financial firms that could collapse \"would of course immediately signal to everyone that the government is ready to bail out large banks\". In McConnell's home state of Kentucky, the Lexington Herald-Leader ran an editorial saying: \"We have read that the Republicans have a plan for financial reform, but McConnell isn't talking up any solutions, just trashing the other side's ideas with no respect for the truth.\" According to one tally, McConnell's largest donor from the period from January 1, 2009, to September 30, 2015, was Bob McNair, contributing $1,502,500.GunsOn the weekend of January 19–21, 2013, the McConnell for Senate campaign emailed and robo-called gun-rights supporters telling them that \"President Obama and his team are doing everything in their power to restrict your constitutional right to keep and bear arms.\" McConnell also said, \"I'm doing everything in my power to protect your 2nd Amendment rights.\" On April 17, 2013, McConnell voted against expanding background checks for gun purchases.In June 2016, after the Orlando nightclub shooting occurred, then the deadliest mass shooting by a lone gunman in American history, four partisan gun measures came up for vote in the Senate and were all rejected. McConnell opined that Democrats were using the shooting as a political talking point while Republicans John Cornyn and Chuck Grassley were \"pursuing real solutions that can help keep Americans safer from the threat of terrorism.\"In October 2017, following the Las Vegas shooting, McConnell told reporters that the investigation into the incident \"has not even been completed, and I think it's premature to be discussing legislative solutions if there are any.\" He stated that he believed it \"particularly inappropriate to politicize an event like this\" and the issue of tax reform should remain the priority while the investigation was ongoing.Health policyMcConnell led efforts against President Barack Obama's health care reform, ensuring that no Republican Senator supported Obama's 2009-2010 health care reform legislation. McConnell explained the reasoning behind withholding Republican support as, \"It was absolutely critical that everybody be together because if the proponents of the bill were able to say it was bipartisan, it tended to convey to the public that this is O.K., they must have figured it out.\" McConnell voted against the Patient Protection and Affordable Care Act (commonly called ObamaCare or the Affordable Care Act) in December 2009, and he voted against the Health Care and Education Reconciliation Act of 2010.  In 2014, McConnell repeated his call for the full repeal of Obamacare and said that Kentucky should be allowed to keep the state's health insurance exchange website, Kynect, or set up a similar system. McConnell is part of the group of 13 Senators drafting the Senate version of the AHCA behind closed doors. The Senator refused over 15 patient advocacy organization's requests to meet with his congressional staff to discuss the legislation. This included groups like the American Heart Association, March of Dimes, American Lung Association. and the American Diabetes Association.McConnell received the Kentucky Life Science Champion Awards for his work in promoting innovation in the life science sector.In 2015, both houses of Congress passed a bill to repeal the Affordable Care Act. It was vetoed by President Obama in January 2016.After President Trump took office in January 2017, Senate Republicans, under McConnell's leadership, began to work on a plan to repeal and replace the Affordable Care Act. They faced opposition from both Democrats and moderate Republicans, who claimed that the bill would leave too many people uninsured, and more conservative Republicans, who protested that the bill kept too many of the ACA's regulation and spending increases, and was thus not a full repeal. Numerous attempts at repeal failed. On June 27, after a meeting with President Trump at the White House, McConnell signaled improvements for the repeal and replacement: \"We're not quite there. But I think we've got a really good chance of getting there. It'll just take us a little bit longer.\" During a Rotary Club lunch on July 6, McConnell said, \"If my side is unable to agree on an adequate replacement, then some kind of action with regard to the private health insurance market must occur.\"ImmigrationIn 2013, a bipartisan group of senators known as the Gang of Eight worked on immigration reform, introducing legislation that would establish a 13-year pathway to citizenship for millions of undocumented immigrants, with several security benchmarks that have to be met before they can obtain a green card, and require a mandatory workplace verification system for employers. McConnell opposed the bill on the grounds of it not including sufficient border-security measures that would future illegal immigration.In February 2018, McConnell stated his support for an immigration proposal that aligned with President Trump's framework, reasoning the bill which he said had \"the best chance\" of being signed into law. By this point, he considered the issue to have run its course over three days of floor debate.In 2015, McConnell rebuked then-candidate Donald Trump's proposal to ban Muslim immigration to the United States. In June 2018, minutes after the Supreme Court upheld the Trump administration's travel ban targeting several Muslim-majority countries in a 5-4 decision along ideological lines, McConnell tweeted a gloating picture of him shaking hands with Neil Gorsuch. Gorsuch was nominated to fill a vacant Supreme Court by President Trump after McConnell and Senate Republicans refused to hold hearings on Merrick Garland, President Obama's nomination to the court, for almost a year.IranIn August 2015, McConnell charged President Obama with treating his rallying for support of the Iran nuclear deal \"like a political campaign\" and stated his preference for senators spending time in their seats while debating the deal: \"Demonize your opponents, gin up the base, get Democrats all angry and, you know, rally around the president. To me, it's a different kind of issue.\" In a September interview, McConnell stated that the battle over the Iran nuclear deal possibly would have to wait until after the Obama administration was over while vowing to tee another vote on the matter to show bipartisan opposition to the matter. He said the Iran nuclear deal would be a defining issue in the following presidential election in the event that the Republicans still did not have enough votes to overcome a filibuster from Democrats and called the deal \"an agreement between Barack Obama and the Iranian regime.\"In January 2016, as the Senate Foreign Relations Committee weighed consideration of sanctions on North Korea after its test of a nuclear device, McConnell called Iran \"an obvious rogue regime with which we have this outrageous deal that they don’t intend to comply with\" and confirmed the intent of the Senate to look into Iran.In May 2018, after President Trump announced the United States was withdrawing from the Iran nuclear deal, McConnell said the deal was \"a flawed deal and we can do better\" and stated congressional optimism to seeing what Trump would propose in its place.IraqIn October 2002, McConnell voted for the Iraq Resolution, which authorized military action against Iraq. McConnell supported the Iraq War troop surge of 2007. In 2010, McConnell \"accused the White House of being more concerned about a messaging strategy than prosecuting a war against terrorism.\"In 2006, McConnell publicly criticized Senate Democrats for urging that troops be brought back from Iraq. According to Bush's Decision Points memoir, however, McConnell was privately urging the then President to \"bring some troops home from Iraq\" to lessen the political risks. McConnell's hometown paper, the Louisville Courier-Journal, in an editorial titled \"McConnell's True Colors\", criticized McConnell for his actions and asked him to \"explain why the fortunes of the Republican Party are of greater importance than the safety of the United States.\"Regarding the failure of the Iraqi government to make reforms, McConnell said the following on Late Edition with Wolf Blitzer: \"The Iraqi government is a huge disappointment. Republicans overwhelmingly feel disappointed about the Iraqi government. I read just this week that a significant number of the Iraqi parliament want to vote to ask us to leave. I want to assure you, Wolf, if they vote to ask us to leave, we'll be glad to comply with their request.\"On April 21, 2009, McConnell delivered a speech to the Senate criticizing President Obama's plans to close the Guantanamo Bay detention camp in Cuba, and questioned the additional 81 million dollar White House request for funds to transfer prisoners to the United States.In July 2011, following the acquittal of Casey Anthony in the murder of her daughter Caylee, McConnell stated the trial showed \"how difficult is to get a conviction in a U.S. court\" and advocated for foreign-born terrorists to be sent to Guantanamo Bay.Judicial nomineesAccording to the New York Times, \"From the moment Obama entered the White House, McConnell led Senate Republicans in a disciplined, sustained, at times underhanded campaign to deny the Democratic president the opportunity to appoint federal judges.\"On February 13, 2016, Supreme Court Justice Antonin Scalia died. Later that day, McConnell issued a statement indicating that the U.S. Senate would not consider any Supreme Court nominee put forth by President Barack Obama to fill Justice Scalia’s vacated seat. “‘The American people should have a voice in the selection of their next Supreme Court Justice. Therefore, this vacancy should not be filled until we have a new president,’” McConnell said. On March 16, 2016, President Obama nominated Merrick Garland, a Judge of the D.C. Circuit Court of Appeals, to the Supreme Court. Under McConnell’s leadership, Senate Republicans refused to take any action on the Garland nomination. Garland's nomination expired on January 3, 2017, with the end of the 114th Congress. In January 2017, Republican President Donald Trump nominated Neil Gorsuch to fill the Court vacancy; Gorsuch's nomination was confirmed on April 7, 2017.In an August 2016 speech in Kentucky, McConnell made reference to the Garland nomination; he said, \"One of my proudest moments was when I looked Barack Obama in the eye and I said, 'Mr. President, you will not fill the Supreme Court vacancy.'\" In April 2018, McConnell said the decision not to act upon the Garland nomination was \"the most consequential decision I've made in my entire public career\". Later that year, McConnell said that if a Supreme Court vacancy would happen during Trump's 2020 re-election year, he would not follow the precedent that he set in 2016 and let the winner of the presidential election nominate a justice.On July 18, 2018, with Andy Oldham's Senate confirmation, Senate Republicans broke a record for largest number of appeals court judiciary confirmations \"during a president's first two years\". Oldham became the 23rd judge to be confirmed in said period. Addressing the issue, McConnell stated that considering \"the things that we've been able to do with this Republican government the last year and a half\", the most \"long lasting, positive impact\" they would have on the country would be the judiciary. The number of circuit court judges \"confirmed during a president's first year\" was broken in 2017, while the previous two-year record took place under President George H.W. Bush, and included 22 nominations.Reputation and transformationThis section has multiple issues. Please help improve it or discuss these issues on the talk page. (Learn how and when to remove these template messages)This section's representation of one or more viewpoints about a controversial issue may be unbalanced or inaccurate. Please improve the article or discuss the issue on the talk page. (October 2018)This article contains weasel words: vague phrasing that often accompanies biased or unverifiable information. Such statements should be clarified or removed. (October 2018)The neutrality of this section is disputed. Relevant discussion may be found on the talk page. Please do not remove this message until conditions to do so are met. (October 2018) (Learn how and when to remove this template message) (Learn how and when to remove this template message)In his early years as a politician in Kentucky McConnell was known as a pragmatist and a moderate Republican. Over time, he veered sharply to the right. According to ProPublica reporter Alex MacGillis's biography of McConnell, McConnell transformed \"from a moderate Republican who supported abortion rights and public employee unions to the embodiment of partisan obstructionism and conservative orthodoxy on Capitol Hill.\" MacGillis argues that McConnell's transformation was \"driven less by a shift in ideological conviction than by a desire to win elections and stay in power at all costs.\"McConnell has been widely described as having engaged in obstructionism during Obama's presidency.[excessive citations] In October 2010, McConnell said that \"the single most important thing we want to achieve is for President Obama to be a one-term president.\" Asked whether this meant \"endless, or at least frequent, confrontation with the president,\" McConnell clarified that \"if [Obama is] willing to meet us halfway on some of the biggest issues, it's not inappropriate for us to do business with him.\" During Obama's presidency, minority obstruction reached all-time highs, as McConnell insisted that any bill passing through the Senate needed a supermajority (60 votes rather than 50). McConnell justified the obstructionism by falsely claiming that the 60-vote threshold was the historical norm in the Senate. Yale University political scientist Jacob Hacker and University of California, Berkeley political scientist Paul Pierson describe McConnell as the major figure (along with Newt Gingrich) in transforming the Republican Party into a \"party geared increasingly not to governing but to making governance impossible\". They write, \"Facing off against Obama, he worked to deny even minimal Republican support for major presidential initiatives—initiatives that were, as a rule, in keeping with the moderate model of decades past, and often with moderate Republican stances of a few years past.\" Republicans threatened repeatedly to force the United States to default on its debt, with McConnell saying that he learned from the 2011 debt-ceiling crisis that \"it’s a hostage that’s worth ransoming.\"Political scientists have referred to McConnell's use of the filibuster as \"constitutional hardball\", referring to the misuse of procedural tools in a way that undermines democracy. By 2013, when Senate Majority Leader Harry Reid eliminated the filibuster for all presidential nominations except the Supreme Court, nearly half of all invocations to cloture (to end a filibuster) in the history of the Senate had occurred during Obama's presidency. McConnell delayed and obstructed health care reform and banking reform, which were the two landmark pieces of legislation that Democrats sought to get passed early in Obama's tenure. By delaying Democratic priority legislation, McConnell stymied the output of Congress. Political scientists Eric Schickler and Gregory J. Wawro write, \"by slowing action even on measures supported by many Republicans, McConnell capitalized on the scarcity of floor time, forcing Democratic leaders into difficult trade-offs concerning which measures were worth pursuing. That is, given that Democrats had just two years with sizeable majorities to enact as much of their agenda as possible, slowing the Senate’s ability to process even routine measures limited the sheer volume of liberal bills that could be adopted.\"The New York Times noted early during Obama's administration that \"on the major issues — not just health care, but financial regulation and the economic stimulus package, among others — Mr. McConnell has held Republican defections to somewhere between minimal and nonexistent, allowing him to slow the Democratic agenda if not defeat aspects of it.\" McConnell's refusal to allow Obama to seat a Supreme Court justice was described by political scientists and legal scholars as \"unprecedented\", a \"culmination of this confrontational style,\" a \"blatant abuse of constitutional norms,\" and a \"classic example of constitutional hardball.\" As part of his obstruction strategy and as the leading Republican Senator, McConnell confronted and pressured other Republican Senators who cared about policy substance and were willing to negotiate with Democrats and the Obama administration. According to Purdue University political scientist Bert A. Rockman, \"pure party line voting has been evident now for some time... but rarely has the tactic of “oppositionism” been so boldly stated as McConnell did.\" In 2012, McConnell proposed a measure allowing President Obama to raise the debt ceiling, hoping that some Democratic Senators would oppose the measure, thus demonstrating disunity among Democrats. However, all Democratic Senators supported the proposal, which led McConnell to filibuster his own proposal. Democrats chided McConnell for this, saying it demonstrated an extreme degree of obstructionism.The 2016 book Health Care Reform and American Politics by political scientists Lawrence Jacobs and Theda Skocpol describe McConnell's rationale as follows, \"any compromises would undermine the Republican Party’s effort to make big gains in 2010 and 2012.\" According to University of Texas legal scholar Sanford Levinson, McConnell learned that obstruction and Republican unity was the optimal way to ensure Republican gains in upcoming elections after he observed how Democratic cooperation with the Bush administration on No Child Left Behind and Medicare Part D helped Bush's 2004 re-election. Levinson noted, \"McConnell altogether rationally... concluded that Republicans have nothing to gain, as a political party, from collaborating in anything that the president could then claim as an achievement.\" Hacker and Pierson describe the rationale behind McConnell's filibusters as follows,Filibusters left no fingerprints. When voters heard that legislation had been “defeated,” journalists rarely highlighted that this defeat meant a minority had blocked a majority. Not only did this strategy produce an atmosphere of gridlock and dysfunction; it also chewed up the Senate calendar, restricting the range of issues on which Democrats could progress. McConnell knew proposals lost support the longer they were out there, subject to attack. He knew constant delay would drive down the approval ratings of Democrats... Like Gingrich, McConnell had found a serious flaw in the code of American democracy: Our distinctive political system gives an antigovernment party with a willingness to cripple governance an enormous edge. With the strategic guidance of these two congressional leaders, Republicans launched a self-reinforcing antistatist cycle. First they made government less functional. Then they highlighted that dysfunction to build political support.However, according to University of California, Los Angeles political scientist Barbara Sinclair, McConnell had manage a balancing act where he \"need[ed] to protect his party's reputation so he [did] not want to chance its being seen as responsible for a complete breakdown.\"A number of political scientists and historians have characterized McConnell's obstructionism and constitutional hardball as contributors to democratic erosion in the United States. University of North Carolina historian Christopher R. Browning wrote,If the US has someone whom historians will look back on as the gravedigger of American democracy, it is Mitch McConnell. He stoked the hyperpolarization of American politics to make the Obama presidency as dysfunctional and paralyzed as he possibly could. As with parliamentary gridlock in Weimar, congressional gridlock in the US has diminished respect for democratic norms, allowing McConnell to trample them even more. Nowhere is this vicious circle clearer than in the obliteration of traditional precedents concerning judicial appointments. Systematic obstruction of nominations in Obama’s first term provoked Democrats to scrap the filibuster for all but Supreme Court nominations. Then McConnell’s unprecedented blocking of the Merrick Garland nomination required him in turn to scrap the filibuster for Supreme Court nominations in order to complete the “steal” of Antonin Scalia’s seat and confirm Neil Gorsuch.Dartmouth political scientist Russell Muirhead characterized McConnell's obstructionism as a corrosive form of partisanship,When the number one goal is electoral victory (or, in this case, another candidate’s defeat), base power seeking obscures the larger purposes that make seeking power something respectable. It was not necessarily wrong or unreasonable of McConnell to hope that a Republican would defeat Obama. It was wrong to cast this as the number one goal of the party, prior to everything else— debt reduction, tax policy, foreign relations, and the other issues that make the party something ordinary citizens might have a reason to care about. When low partisanship displaces anything higher... causes, principles, convictions lose their force and their allure, and become just the veil that makes power-seeking behavior presentable.McConnell has gained a reputation as a skilled political strategist and tactician. However, this reputation dimmed after Republicans failed to repeal the Affordable Care Act (Obamacare) in 2017 during consolidated Republican control of government.In 2015, Time listed McConnell as one of the 100 most influential people in the world.With a 49% disapproval rate in 2016, McConnell had the highest disapproval rating of all senators. McConnell has repeatedly been found to have the lowest home state approval rating of any sitting senator.Committee assignmentsCommittee on Agriculture, Nutrition, and ForestrySubcommittee on Rural Revitalization, Conservation, Forestry, and CreditSubcommittee on Domestic and Foreign Marketing, Inspection, and Plant and Animal HealthSubcommittee on Hunger, Nutrition and Family FarmsCommittee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related AgenciesSubcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on DefenseSubcommittee on Energy and Water DevelopmentSubcommittee on Military Construction and Veterans' Affairs, and Related AgenciesSubcommittee on State, Foreign Operations, and Related ProgramsCommittee on Rules and AdministrationSelect Committee on Intelligence (Ex officio)", "Electoral history": "Elections are shown with a map depicting county-by-county information. McConnell is shown in red and Democratic opponents shown in blue.Year% McConnellOpponent(s)Party affiliation% of voteCounty-by-county map198449.9%Walter Huddleston (incumbent)Dave WeltersDemocraticSocialist Workers49.5%199052.2%Harvey I. SloaneDemocratic47.8%199655.5%Steve BeshearDennis LacyPatricia Jo MettenMac ElroyDemocraticLibertarianNatural LawU.S. Taxpayers42.8%200264.7%Lois Combs WeinbergDemocratic35.3%200853.0%Bruce LunsfordDemocratic47.0%201456.2%Alison Lundergan GrimesDavid PattersonDemocraticLibertarian40.7%U.S. Senate Republican primary election in Kentucky, 1984PartyCandidateVotes%+%RepublicanMitch McConnell39,46579.2%RepublicanRoger Harker3,7987.6%RepublicanTommy Klein3,3526.7%RepublicanThurman Jerome Hamlin3,2026.4%U.S. Senate Republican primary election in Kentucky, 1990PartyCandidateVotes%+%RepublicanMitch McConnell (inc.)64,06388.5%RepublicanTommy Klein8,31011.5%U.S. Senate Republican primary election in Kentucky, 1996PartyCandidateVotes%+%RepublicanMitch McConnell (inc.)88,62088.6%RepublicanTommy Klein11,41011.4%U.S. Senate Republican primary election in Kentucky, 2008PartyCandidateVotes%+%RepublicanMitch McConnell (inc.)168,12786.1%RepublicanDaniel Essek27,17013.9%U.S. Senate Republican primary election in Kentucky, 2014PartyCandidateVotes%+%RepublicanMitch McConnell (inc.)213,75360.2%RepublicanMatt Bevin125,78735.4%RepublicanShawna Sterling7,2142.0%RepublicanChris Payne5,3381.5%RepublicanBrad Copas3,0240.9%", "Personal life": "McConnell is a Southern Baptist. He was married to his first wife, Sherrill Redmon, from 1968 to 1980, and had three children. Following their divorce, she became a feminist scholar at Smith College and director of the Sophia Smith Collection. His second wife, whom he married in 1993, is Elaine Chao, the former Secretary of Labor under George W. Bush. On November 29, 2016, incoming President Donald Trump nominated Chao to serve as the Secretary of Transportation. She was confirmed by the Senate on January 31, 2017, in a 93–6 vote. McConnell himself voted \"present\" during the confirmation roll call.McConnell is on the Board of Selectors of Jefferson Awards for Public Service.In 1997, he founded the James Madison Center for Free Speech, a Washington, D.C.–based legal defense organization. McConnell was inducted as a member of the Sons of the American Revolution on March 1, 2013.In 2010, the OpenSecrets website ranked McConnell one of the wealthiest members of the U.S. Senate, based on net household worth. His personal wealth was increased after receiving a 2008 personal gift to him and his wife, given by his father-in-law James S. C. Chao after the death of McConnell's mother-in-law, that ranged between $5 and $25 million.", "In popular culture": "McConnell appears in the title sequence, and as an off-screen character, in season 1 of Alpha House.Former Daily Show host Jon Stewart repeatedly mocked McConnell for his apparent resemblance to a turtle or tortoise and often imitated him with the voice of the turtle from Tortoise Wins by a Hare.", "Further reading": ".Green, Joshua (January 5, 2011). \"Recommended Reading on Mitch McConnell\". The Atlantic.MacGillis, Alec (December 21, 2014). The Cynic: The Political Education of Mitch McConnell. Simon & Schuster. ISBN 9781501112034.Milbank, Dana (April 7, 2017). \"Mitch McConnell, the man who broke America\". Washington Post.", "introduction": "Addison Mitchell McConnell Jr. (born February 20, 1942) is an American politician serving as the senior United States Senator from Kentucky and as Senate Majority Leader. McConnell is the second Kentuckian to lead his party in the Senate and is the longest-serving U.S. Senator from Kentucky in history.\nA member of the Republican Party, McConnell was first elected to the Senate in 1984 and has been re-elected five times since then. During the 1998 and 2000 election cycles, McConnell was chairman of the National Republican Senatorial Committee. McConnell was first elected as Majority Whip in the 108th Congress and was re-elected to the post in 2004. In November 2006, McConnell was elected Senate Minority Leader; he held that post until 2015, when Republicans took control of the Senate and he became Senate Majority Leader. Time named McConnell one of the 100 most influential people in the world in 2015. In June 2018, McConnell became the longest-serving Republican U.S. Senate leader in the history of the United States.\nMcConnell was known as a pragmatist and moderate Republican early in his political career but veered sharply to the right over time. During his time in the Senate, McConnell gained a reputation as a skilled political strategist and tactician. McConnell led opposition to stricter campaign finance laws, culminating in the Supreme Court ruling that partially overturned the Bipartisan Campaign Reform Act (McCain-Feingold).\nDuring the Obama presidency, McConnell engaged in obstruction, working to withhold Republican support for any major presidential initiatives. In October 2010, McConnell said that \"the single most important thing we want to achieve is for President Obama to be a one-term president.\" During Obama's presidency, Senate Republicans made frequent use of the filibuster, which meant that any bill passing through the Senate needed a supermajority (60 votes rather than 50). Senate Republicans also blocked an unprecedented number of Obama's judicial nominations, including Supreme Court justice nominee Merrick Garland whom McConnell refused to hold a hearing on. A number of political scientists and historians have characterized McConnell's obstructionism and \"constitutional hardball\" as contributors to democratic erosion in the United States.\nMcConnell endorsed Rand Paul in the 2016 Republican primaries before ultimately supporting then-presumptive nominee Donald Trump. During the 2016 election, after being approached by U.S. intelligence community officials, McConnell refused to give a bipartisan statement with President Obama warning Russia not to interfere in the 2016 election. During the Trump presidency, Senate Republicans broke records on the number of judicial nominees confirmed. Trump nominee Neil Gorsuch was confirmed to fill the Supreme Court vacancy that Garland was slated for; McConnell later described his actions on the Garland nomination as \"the most consequential decision I've made in my entire public career\".\n\n"}, "personal": {"date": "BornAddison Mitchell McConnell Jr. (1942-02-20) February 20, 1942 (age76)Sheffield, Alabama, U.S.", "Political party": "Republican", "Children": "3", "Education": "University of Louisville (BA)University of Kentucky (JD)", "Net worth": "$22.5 million (estimate)", "Signature": ""}, "timeline": {"Senate Majority Leader": {"date": "Assumed office January 3, 2015", "Deputy": "John Cornyn", "Preceded by": "Harry Reid"}, "United States Senatorfrom Kentucky": {"date": "Assumed office January 3, 1985Serving with Rand Paul", "Preceded by": "Walter Dee Huddleston"}, "Senate Minority Leader": {"date": "In officeJanuary 3, 2007– January 3, 2015", "Deputy": "Trent LottJon KylJohn Cornyn", "Preceded by": "Harry Reid", "Succeeded by": "Harry Reid"}, "Senate Majority Whip": {"date": "In officeJanuary 3, 2003– January 3, 2007", "Leader": "Bill Frist", "Preceded by": "Harry Reid", "Succeeded by": "Dick Durbin"}, "Chair of the Senate Rules Committee": {"date": "In officeJanuary 3, 1999– January 3, 2001", "Preceded by": "John Warner", "Succeeded by": "Chris Dodd"}, "Judge/Executive of Jefferson County": {"date": "In office1977–1984", "Preceded by": "Todd Hollenbach III", "Succeeded by": "Bremer Ehrler"}, "Acting United States Assistant Attorney General for the Office of Legislative Affairs": {"date": "In office1975", "President": "Gerald Ford", "Preceded by": "Vincent Rakestraw", "Succeeded by": "Michael Uhlmann"}, "Military service": {"Allegiance": "United States", "Service/branch": "United States Army", "Years of service": "1967", "Unit": "United States Army Reserve"}}, "code": "", "type": "", "party": "", "description": "", "economic": "0", "social": "0", "leadership": "0"}