{"name": "Paul.Cook", "picture": "C001094.jpg", "detail": {"Early life, education, and military career": "Cook was born in Meriden, Connecticut in 1943. He was raised in Meriden and did not permanently move to California until the end of his military career. In 1966, he graduated from Southern Connecticut State University, earning a B.S. in teaching. Later that year, he joined the United States Marine Corps. As an infantry officer, Cook served in the Vietnam War. His actions in combat earned him many honors, including the Bronze Star and two Purple Hearts. He served in the Marine Corps for 26 years.After he retired from the Marine Corps in 1992 as a colonel, he earned an MPA from California State University, San Bernardino in 1996 and a master's in political science from University of California Riverside in 2000.", "Academic career": "From 1993 to 1994, he was Director of Yucca Valley Chamber of Commerce. From 1998 to 2002, he was a professor at Copper Mountain College. Cook taught courses on political violence and terrorism at University of California Riverside since 2002.", "California Assembly": "Elections In 2006, Cook ran for California's 65th Assembly District. Cook won a five candidate Republican primary field with 29% of the vote. In the general election, Cook defeated Democrat Rita Ramirez-Dean 60%–37%. In 2008, he won re-election to a second term, defeating Democrat Carl Wood 53%–47%. In 2010, he won re-election to a third term, defeating Wood again 58%–42%.Tenure The 65th district included the cities of Banning, Beaumont, Big Bear Lake, Calimesa, Cherry Valley, Hemet, Moreno Valley, Perris, San Jacinto, Sun City, Twentynine Palms, Yucaipa, Yucca Valley and other smaller communities and unincorporated areas in Riverside County and San Bernardino County.The California Chamber of Commerce and the California Taxpayers Association gave Cook a perfect 100% rating, 2007–2011. In 2010, Democratic Speaker of the Assembly John Pérez appointed Cook to chair the Veterans Affairs Committee, the first time a Democratic speaker had appointed a Republican to chair a committee since 2002.Committee assignments Accountability and Administrative Review CommitteeBudget CommitteeEmergency Management CommitteeGovernmental Organization CommitteeHigher Education CommitteeInland Empire Transportation Issues CommitteeMaster Plan for Higher EducationPreservation of California's Entertainment Industry CommitteeSunset Review CommitteeVeterans Affairs Committee (Chair)", "US House of Representatives": "2012 campaign In January 2012, 34-year incumbent Jerry Lewis announced he would not seek re-election in November. Cook entered the primary for the district, which had been renumbered from the 41st to the 8th in redistricting. He finished second in the 13-candidate all-party open primary. He earned 15% of the vote. Fellow Republican and conservative activist Gregg Imus ranked first with 16% of the vote. Cook was endorsed by the California Off-Road Vehicle Association (CORVA) past presidents, the San Bernardino Sun, National Vietnam and Gulf War Veterans Coalition, the County Farm Bureau, state Assemblyman Steve Knight, state Senator Sharon Runner, and U.S. Congressman Ed Royce. In the November election, Cook defeated Imus 58%–42%.Tenure In 2013, Cook co-signed a letter to then president Barack Obama, urging him to finalize the Keystone XL pipeline, stating that it was about \"jobs, jobs jobs.\" He also expressed fear that China \"is ready to take advantage of America's missteps with the Keystone pipeline.\"Early in 2017, Cook voted in favor of repealing the Affordable Care Act. His reason for voting for the repeal was to ensure that \"every American has access to quality care to fit their budget.\" In August 2017, he voted in favor of outlawing late term abortions, unless the woman was a victim of rape or incest or that her life was threatened.Cook voted in favor of the Tax Cuts and Jobs Act of 2017. By voting for the bill, Cook says that the bill will \"deliver crucial tax relief for middle-class and low-income Americans.\" He voted for this bill because more than 90 percent of taxpaying constituents will receive a tax break. He also supports it because it simplifies the tax code.Committee assignments Committee on Armed ServicesSubcommittee on Tactical Air and Land ForcesSubcommittee on Seapower and Projection ForcesCommittee on Foreign AffairsSubcommittee on Europe and EurasiaSubcommittee on Terrorism, Nonproliferation, and TradeCommittee on Veterans' AffairsSubcommittee on Disability Assistance and Memorial AffairsSubcommittee on Economic OpportunityCaucus Memberships Congressional Cement CaucusHouse Baltic CaucusRepublican Main Street PartnershipCongressional Western Caucus", "Political positions": "In the first session of the 115th United States Congress, Cook was ranked the 33rd most bipartisan member of the House by the Bipartisan Index, a metric published by The Lugar Center and Georgetown's McCourt School of Public Policy to assess congressional bipartisanship.Abortion Cook is pro-life.Education Cook opposes Common Core State Standards.Health care Cook supports repealing the Affordable Care Act (\"Obamacare\"). He supports legislation that \"decreases premiums, makes it easier for employers to offer affordable healthcare options for their employees, and allows greater freedom for people to purchase a plan of their choice.\"Immigration Cook believes that the Deferred Action for Childhood Arrivals (DACA) is unconstitutional.", "Personal life": "Cook resides in Yucca Valley with his wife, Jeanne.", "Electoral history": "California State Assembly 65th District Republican Primary Election, 2006PartyCandidateVotes%RepublicanPaul Cook10,19328.8RepublicanBrenda Salas8,06222.8RepublicanJim Ayres7,87022.1RepublicanRobin Lowe7,64821.5RepublicanKen Smith1,7114.8California State Assembly 65th District Election, 2006PartyCandidateVotes%RepublicanPaul Cook67,66960.0DemocraticRita Ramirez-Dean41,90637.1Peace and FreedomJohn Taleb3,3582.California State Assembly 65th District Election, 2008PartyCandidateVotes%RepublicanPaul Cook (inc.)93,56653.3DemocraticCarl Wood82,30546.7California State Assembly 65th District Election, 2010PartyCandidateVotes%RepublicanPaul Cook (inc.)78,47557.9DemocraticCarl Wood57,21242.1California's 8th Congressional District Primary Election, 2012PartyCandidateVotes%RepublicanGregg Imus12,75415.6RepublicanPaul Cook12,51715.3RepublicanPhil Liberatore12,27715.0DemocraticJackie Conaway11,67414.3RepublicanBrad Mitzelfelt8,80110.8DemocraticJohn Pinkerton7,9419.1RepublicanAngela Valles4,9246.0RepublicanRyan McEachron3,1813.9IndependentAnthony Adams2,7503.4RepublicanBill Jensen1,8502.3RepublicanGeorge Craig1,3761.7RepublicanJoseph Napolitano1,0501.3RepublicanDennis Albertsen7610.9California's 8th Congressional District Election, 2012PartyCandidateVotes%RepublicanPaul Cook103,09357.4RepublicanGregg Imus76,55142.6California's 8th Congressional District Primary Election, 2014PartyCandidateVotes%RepublicanPaul Cook (inc.)40,00758.1DemocraticBob Conaway12,88518.7RepublicanPaul Hannosh9,03713.1DemocraticOdessia Lee6,93010.1California's 8th Congressional District Election, 2014PartyCandidateVotes%RepublicanPaul Cook (inc.)77,48067.6DemocraticBob Conaway37,05632.4California's 8th Congressional District Primary Election, 2016PartyCandidateVotes%RepublicanPaul Cook (inc.)50,42542.0DemocraticRita Ramirez26,32521.9RepublicanTim Donnelly24,88620.7DemocraticJohn Pinkerton11,7809.8DemocraticRoger La Plante6,6615.5", "introduction": "Paul Joseph Cook (born March 3, 1943) is an American politician who has been the U.S. Representative for California's 8th congressional district since 2013. Previously, he served as a member of California State Assembly from 2006 to 2012 and on the Yucca Valley town council from 1998 until 2006. He is a Republican.\n\n", "code": "08"}, "personal": {"Born": "Paul Joseph Cook (1943-03-03) March 3, 1943 (age75)Meriden, Connecticut, U.S.", "Political party": "Republican", "Spouse(s)": "Jeanne Cook", "Education": "Southern Connecticut State University (BS)California State University, San Bernardino (MPA)University of California, Riverside (MA)"}, "timeline": {"Member of the US House of Representativesfrom California's 8th district": {"date": "Assumed office January 3, 2013", "Preceded by": "Nancy Pelosi"}, "Member of the California State Assemblyfrom the 65th district": {"date": "In officeDecember 4, 2006– November 30, 2012", "Preceded by": "Russ Bogh", "Succeeded by": "Sharon Quirk-Silva"}, "Military service": {"Allegiance": "United States", "Service/branch": "United States Marine Corps", "Rank": " Colonel", "Battles/wars": "Vietnam War", "Awards": " Bronze Star Purple Heart (2)"}, "code": "08"}, "code": "C001094", "type": "4", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.39", "social": "0.17", "leadership": "0.47"}