{"name": "Pete.Visclosky", "picture": "R000515.jpg", "detail": {"Early life, education, and pre-congressional career": "Visclosky was born in Gary, Indiana, the son of John and the late Helen (née Kauzlaric) Visclosky. He is of Croatian-Slovak descent. He was educated at Andrean High School in Merrillville, Indiana. He earned a Bachelor of Science in Accounting at Indiana University Northwest in Gary, Indiana and went on to earn his juris doctor from Notre Dame Law School. At Georgetown University in Washington, D.C., Visclosky earned a Master of Laws in International and Comparative Law. He worked as a lawyer and staff member of United States Representative Adam Benjamin before entering the House.", "US House of Representatives": "Elections In 1984, Visclosky ran for Congress in Indiana's 1st congressional district. In the Democratic primary, he defeated incumbent U.S. Congresswoman Katie Hall, Jack Crawford, and Sandra Smith 34%-33%-31%-1%. In the general election, he defeated Republican Joseph Grenchik 71%-29%. He has been reelected 15 times from a district that has been in Democratic hands without interruption since 1931.In 1986, he won the Democratic primary again with 57%, defeating Hall and three other candidates. He won the general election with 73% of the vote. In 1988, he won the Democratic primary 84%-16% against Sandra Smith. He went on to win the general election with 77% of the vote.In 1990, Hall challenged Visclosky for the third time and was defeated 51%-30%. He won the general election with 66% of the vote. In 1992, he won the Democratic primary with 72% and the general election with 69%. In 1994, he won the Democratic primary with 77% of the vote. In the general election, he defeated Republican John Larson 56%-44%.For the rest of his career, he has never won a primary with less than 71% and he has only once won a general election with less than 60% of the vote - in 2010, when Republicans re-took control of the House of Representatives.Tenure Visclosky is pro-union and anti-free trade.  Reinstating the steel tariff, fighting against illegal actions known as \"Steel Dumping\", in which countries undercut American steel prices by subsidizing steel production, and/or producing steel through nationalized steel companies, which artificially manipulates the market price of steel produced in this manner, a violation of trade agreements, free markets, and certain international laws, and fighting to save American manufacturing jobs have long been priorities of Visclosky.  He served as Chair of the Congressional Steel Caucus when the Democrats had control of the House, and currently serves as the Vice Chair.  He is also a former Chair of the Energy and Water Development Subcommittee and the current Ranking Member.  Congressman Visclosky also opposed actions that would have certain components of advanced U.S. Military weapons and hardware made in foreign countries, most notably in China, which caused the closing of U.S.-based manufacturing centers, such as \"Magnequench\" in Valparaiso, Indiana, which was covered heavily in the media, most notably in printed media from his district, namely \"The Times\"  and \"The Post Tribune\", both servicing Northwest Indiana.  In this particular case, the component was a sophisticated, high-tech magnet, made of rare earth metals, that is an integral part of U.S. smart-bombs and guided missile systems, including the \"Joint Direct Attack Munition\" or \"JDAM\". The information involving these incidents can still be found by searching the archives and articles on the referenced websites of the previously named media outlets.Visclosky is one of the 126 Democrats who voted against the Iraq War Resolution. He also is a supporter of high tech solutions as a way to revive the American blue collar work force, and as a way to decrease crime.Staffing Congressman Pete Visclosky's Head of Staff  is Mr. Mark Lopez, assisting the Congressman in both Washington, D.C. and in his home district, through his office in Merrillville, Indiana.The Congressman's Offices The Congressman's office in his district is in Merrillville, Indiana.  The address is 7895 Broadway, Suite A, Merrillville, IN 46410. The phone number is (219)795-1844 and the fax number is (219)795-1850.  His office in Washington, D.C. has the address of 2328 Rayburn Building, Washington, DC 20515.  The phone number is (202)225-2461 and the fax number is (202)225-2493.Congressman Pete Visclosky's Website The Congressman's website is https://visclosky.house.gov/ and using this website, one can contact the Congressman, schedule appointments with him, sign up for his \"E-Newsletter\", and even request a flag that has been flown over the U.S. Capitol Building.  One does have to pay for the actual cost of the flag, however, which is based on the Flag's size and composition material.PMA Group investigationThe Washington Times reported in March 2009 that Visclosky had received, over ten years, $1.36 million in campaign donations from clients of the PMA Group.  In 2007 and 2008, the United States House Committee on Appropriations, of which Visclosky is a member, directed $137 million in government purchasing to PMA's clients. In May 2009, Visclosky received subpoenas in the grand jury investigation into PMA Group, the first member of Congress to be subpoenaed in the investigation. The Congressman was later cleared of all charges by the House Ethics Committee, who detailed in a 305-page report that \"Simply because a member sponsors an earmark for an entity that also happens to be a campaign contributor does not, on these two facts alone, support a claim that a member's actions are being influenced by campaign contributions\".In 2011, the House Ethics Committee ended its investigation, clearing Visclosky and Republican former Representative Todd Tiarht of Kansas.  While \"PMA's lobbyists pushed or directed company executives to maximize personal or Political Action Committee (PAC) campaign contributions and to attend specific fundraisers while pursuing earmarks,\" the report notes, \"the evidence did not show that Members or their official staff were included in discussions or correspondence about, coordinated with PMA on, or knew of these strategies.\" Committee assignments Committee on AppropriationsSubcommittee on Defense (Ranking Member)Subcommittee on Energy and Water DevelopmentCaucus memberships Congressional Steel Caucus (Vice Chair)Congressional Caucus on Armenian IssuesCongressional Caucus on India and Indian AmericansCongressional Diabetes CaucusCongressional Fire Services CaucusCongressional Hellenic CaucusCongressional Serbian CaucusGreat Lakes Task ForceMissing, Exploited, and Runaway Children CaucusNortheast-Midwest Congressional CoalitionBuy America CaucusDairy Farmers CaucusFrench CaucusMacedonian CaucusNational Parks CaucusSlovak CaucusFriends of SwitzerlandWine CaucusWire and Wire Products CaucusLaw Enforcement CaucusCongressional Arts Caucus", "Electoral history": "Indiana's 1st congressional district: Results 1984–2016YearDemocraticVotes%RepublicanVotes%Third PartyPartyVotes%Third PartyPartyVotes%1984Pete Visclosky147,03571%Joseph Grenchik59,98629%James WillisLibertarian9430%1986Pete Visclosky86,98373%William P. Costas30,39526%James WillisLibertarian6601%Tracy KyleWorkers League4030%1988Pete Visclosky138,25177%Owen Crumpacker41,07623%1990Pete Visclosky68,92066%William P. Costas35,45034%1992Pete Visclosky147,05469%David Vucich64,77031%1994Pete Visclosky68,61256%John Larson52,92044%1996Pete Visclosky133,55369%Michael Petyo56,41829%Michael CrassLibertarian3,1422%1998Pete Visclosky92,63473%Michael Petyo33,50326%Michael CrassLibertarian1,6171%2000Pete Visclosky148,68372%Jack Reynolds56,20027%Christopher NelsonLibertarian2,9071%2002Pete Visclosky90,44367%Mark Leyva41,90931%Timothy BrennanLibertarian2,7592%2004Pete Visclosky178,40668%Mark Leyva82,85832%2006Pete Visclosky104,19570%Mark Leyva40,14627%Charles BarmanIndependent5,2664%2008Pete Visclosky199,95471%Mark Leyva76,64727%Timothy BrennanLibertarian5,4212%2010Pete Visclosky99,38759%Mark Leyva65,55839%Jon MorrisLibertarian4,7623%2012Pete Visclosky187,74367%Joel Phelps91,29133%2014Pete Visclosky86,57961%Mark Leyva51,00036%Donna DunnLibertarian4,7143%2016Pete Visclosky207,51582%Donna DunnLibertarian47,05118%John MeyerIndependent170%", "introduction": "Peter John Visclosky (/vɪˈsklɒski/; born August 13, 1949) is the U.S. Representative for Indiana's 1st congressional district, serving since 1985. He is a member of the Democratic Party and the dean of the Indiana congressional delegation. The District lies in Northwest Indiana, and includes most of the Indiana side of the Chicago metropolitan area. Redistricting passed by the Indiana General Assembly in 2011 changed the district's boundaries, effective January 2013, to include all of Lake and Porter counties as well as the western and northwestern townships of LaPorte County, while shifting Benton, Newton, and Jasper counties out of the district.\n\n", "code": "01"}, "personal": {"Born": "Peter John Visclosky (1949-08-13) August 13, 1949 (age69)Gary, Indiana, U.S.", "Political party": "Democratic", "Spouse(s)": "Joanne Royce", "Education": "Indiana University Northwest (BA)University of Notre Dame (JD)Georgetown University (LLM)"}, "timeline": {"Member of the US House of Representativesfrom Indiana's 1st district": {"date": "Assumed office January 3, 1985", "Preceded by": "Katie Hall"}, "code": "01"}, "code": "R000515", "type": "4", "party": "Democrat", "description": "moderate Democratic follower", "economic": "-0.48", "social": "-0.2", "leadership": "0.31"}