{"name": "Ralph.Abraham", "picture": "A000374.jpg", "detail": {"Background": "Abraham is the son of the former Marlene Posey (1932–2015), a retired educator, and Ralph Abraham, Sr. (1933–1980). His paternal grandparents were emigrants from Lebanon.He graduated from Louisiana State University School of Veterinary Medicine, in Baton Rouge in 1980, and was a practicing veterinarian for 10 years. He returned to Louisiana State University School of Medicine for a medical degree in 1994, and practiced family medicine.Abraham has served in the United States Coast Guard Auxiliary and the Mississippi National Guard. He and his wife, Dianne, have three children.  He has been an aviation medical examiner.", "US House of Representatives": "Tenure Abraham defeated his Democratic opponent, Mayor Jamie Mayo of Monroe, by a margin of 134,612 votes (64.2 percent) to 75,004 (35.8 percent). He was sworn into office in the 114th United States Congress on January 3, 2015.After his election, Abraham chose Luke J. Letlow, his campaign manager, as chief of staff.In June, 2017, Abraham co-sponsored the Civil Rights Uniformity Act of 2017.In August 2017, Abraham endorsed the nomination by U.S. President Donald Trump of Terry Doughty, also of Richland Parish, for a seat on the United States District Court for the Western District of Louisiana, based in Monroe. The selection also carries the backing of U.S. Senators Bill Cassidy and John Neely Kennedy.In December 2017, Abraham voted in favor of the Tax Cuts and Jobs Act. After voting, Abraham stated that \"This is going to be a great tax bill, and great tax reform not only for Louisiana but for the United States.\" He says that businesses will benefit greatly and be able to \"reinvest in their infrastructure, reinvest in their employees.\" He says that wages will increase and job opportunities will grow.Committee assignments Committee on AgricultureSubcommittee on Conservation and ForestrySubcommittee on General Farm Commodities and Risk ManagementCommittee on Science, Space and TechnologySubcommittee on Space (Vice-Chair)Subcommittee on Research and TechnologySubcommittee on Oversight (Chair)United States House Committee on Armed ServicesSubcommittee on Emerging Threats and CapabilitiesSubcommittee on Seapower and Projection ForcesSubcommittee on Military PersonnelCaucus memberships Congressional Western CaucusCoast Guard CaucusHistoric Preservation CaucusGOP Doctor's CaucusMississippi River CaucusCongressional National Guard and Reserve Components CaucusNational Guard Youth Challenge CaucusCongressional Sportsmen's CaucusVeteran's CaucusVeterinary Medicine Caucus", "Political positions": "Domestic issues Agriculture In March 2017, Representative Abraham visited with about seventy farmers from the agricultural lobby, the Louisiana Farm Bureau Federation. He told the farmers, \"Food security is national security. Agriculture is at the forefront of the fight because any interruption in the food supply or a compromise in its safety goes right to the heart of the nation.\" Marty Wooldridge, a cattleman from Caddo Parish said that Abraham's slogan \"Food security is national security\" should be incorporated into the slogan of the Farm Bureau. Abraham, Louisiana's only member on the House Agriculture Committee, defined his job in part to \"educating members whose districts might be deeply metropolitan and who have no perspective on the importance of agriculture.\" In 2018, Abraham was named to the conference committee for the 2018 Farm Bill. The conference committee will resolve differences in the House and the Senate version of the Farm Bill.Gun law In the wake of the 2016 Orlando nightclub shooting, Abraham offered thoughts and prayers. He stressed that the shooter had pledged allegiance to ISIS and asked for the public to prayer for law enforcement and service members who fight terrorism.Health care Abraham believes the Affordable Care Act should be repealed. He opposes the expansion of Medicaid.Economic issues Tax reform He supports simplifying the tax code.Jobs Abraham supports equal pay for women.International issues Gas &  oil Abraham was in favor of the Keystone Pipeline.Immigration Regarding illegal immigration, Abraham opposes amnesty and supports strengthening border security.  Abraham supported President Donald Trump's 2017 executive order to temporarily halt immigration from the seven specified nations until the development of more enhanced screening methods. His spokesman said \"Dr. Abraham generally supports President Trump's temporary suspension of the refugee and immigration admittance program. Dr. Abraham agrees with President Trump that we must take all necessary steps to protect American citizens from potential terrorism threats, and this temporary measure from the President will allow for a thorough review of our policies and procedures for vetting applicants from war-torn areas.\"Social issues Abortion Abraham opposes late term abortions. In May 2005, he stated \"As a doctor, I know and I can attest that this bill is backed by scientific research showing that babies can indeed feel pain at 20 weeks, if not before\" .Cannabis Abraham has a \"D\" rating from NORML for his voting history regarding cannabis-related causes. Abraham opposes veterans having access to medical marijuana if recommended by their Veterans Health Administration doctor and if it is legal for medicinal purposes in their state of residence.LGBT Abraham supports efforts to ban transgender people from serving in the  military \"100 percent.\"", "Election of 2016": "In his bid for reelection in 2016, Abraham defeated one challenger, fellow Republican Billy Burkette of Baton Rouge, a former constable in East Feliciana Parish and a former chairman of the Louisiana Band of Choctaw Indians. Burkette claimed in his campaign that the Environmental Protection Agency has issued overly strict regulations that hamper farming.", "Election of 2018": "Abraham faces three challengers in the 2018 primary election. Billy Burkette, an Independent from Pride, La; Jessee Carlton Fleenor, a Democrat from Loranger, La; and Kyle Randol, a Libertarian from Monroe, La.", "introduction": "Ralph Lee Abraham Jr. (born September 16, 1954), is an American physician and former veterinarian from Alto, Louisiana, who won election on December 6, 2014, as a Republican to represent Louisiana's 5th congressional district in the United States House of Representatives.\n\n", "code": "05"}, "personal": {"Born": "Ralph Lee Abraham Jr. (1954-09-16) September 16, 1954 (age64)Monroe, Louisiana, U.S.", "Political party": "Republican", "Spouse(s)": "Dianne Abraham", "Children": "3", "Education": "Louisiana State University (BS, DVM)Louisiana State University, New Orleans (MD)"}, "timeline": {"Member of the US House of Representativesfrom Louisiana's 5th district": {"date": "Assumed office January 3, 2015", "Preceded by": "Vance McAllister"}, "Military service": {"Allegiance": "United States", "Service/branch": "Mississippi National Guard, United States Coast Guard Auxiliary"}, "code": "05"}, "code": "A000374", "type": "4", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.51", "social": "0.26", "leadership": "0.42"}