{"name": "Raúl.Labrador", "picture": "B001294.jpg", "detail": {"Early life, education, and career": "Born in Carolina, Puerto Rico, Labrador relocated to Las Vegas, Nevada, as a child and graduated from Las Vegas High School in 1985.  He was raised by a single mother who struggled financially.He attended Brigham Young University in Provo, Utah, and spent two years as a Mormon missionary in Chile, from 1987 to 1989. Labrador returned to BYU and received a B.A. in 1992, in Spanish with an emphasis in Latin American literature. He was admitted to the University of Washington School of Law in Seattle and received his J.D. in 1995.Married in 1991, Labrador relocated to his wife's home state of Idaho and practiced law and immigration law in private practice from 1995 until his election to the Idaho House of Representatives in 2006.", "Idaho House of Representatives": "2006 Labrador ran for and won the Republican nomination for Idaho House Seat B against two other challengers and the general election earning 65.55% against Daniel S. Weston.2008 He was unopposed in the May 2008 Republican primary. Labrador defeated Glida Bothwell in the general election getting 69.1% of the vote.Committee assignments This section of a biography of a living person does not include any references or sources. Please help by adding reliable sources. Contentious material about living people that is unsourced or poorly sourced must be removed immediately.Find sources: \"Raúl Labrador\" – news · newspapers · books · scholar · JSTOR (May 2017) (Learn how and when to remove this template message)Labrador served on the Environment, Energy, and Technology Committee in 2007Judiciary, Rules, and Administration Committee from 2007-2010State Affairs Committee from 2007-2010Transportation and Defense Committee from 2009-2010", "US House of Representatives": "Tenure ImmigrationLabrador was a member of the \"Gang of Eight,\" a bipartisan group of House members working on immigration reform legislation, but on June 5, 2013, he left the negotiations because he wanted language in the bill requiring that illegal immigrants be responsible for their own health care costs. Labrador said he would use his position on the House Judiciary Committee to pass immigration reform legislation.[citation needed]HealthHe voted for the American Health Care Act of 2017, which passed the House May 4, 2017. One of the few Republican lawmakers who hosted a town hall after this vote, Labrador received national attention for stating during the meeting at Lewis and Clark State College that \"Nobody dies because they don't have access to healthcare.\"  The statement caused a huge outcry from the audience present and on social media for several days.Labrador voted in favor of the Pain-Capable Unborn Child Protection Act in 2017.Civil libertiesIn June 2015, Labrador introduced HR 2802, titled the \"First Amendment Defense Act\" (FADA) which was said to protect those who oppose same-sex marriage based on their religious beliefs from action by the federal government. Critics, such as Ian Thompson of the American Civil Liberties Union claimed that the bill would \"open the door to unprecedented taxpayer-funded discrimination against LGBT people, single mothers, and unmarried couples.\"Town hallsLabrador was one of the few Republicans to host a town hall after the election of Donald Trump and the only member of United States congressional delegations from Idaho to host one.Tax reformLabrador voted in favor of the Tax Cuts and Jobs Act of 2017. He says the bill will \"allow hard-working Idahoans to keep more of their money,\" including helping them \"meet their expenses and make crucial investments.\"Committee assignments Committee on Natural ResourcesFederal LandsOversight and Investigations- ChairCommittee on the JudiciarySubcommittee on Immigration and Border Security- Vice ChairCrime, Terrorism, Homeland Security, and InvestigationsCaucus memberships Liberty CaucusFreedom CaucusCongressional Western Caucus", "Political positions": "Domestic issues Health care On April 20, 2017 Labrador said he does not believe healthcare is a human right. Labrador supports the full repeal of the Patient Protection and Affordable Care Act because he believes it will raise costs and kill jobs.Labrador supports requiring the undocumented to be responsible for their own health care costs.Economic issues Elections Labrador has stated that he supports the repeal of the 17th Amendment to the U.S. Constitution which provides for the direct election of members of the U.S. Senate by the voters in each state.  Before the amendment was ratified in 1913 Senators were selected by the legislatures of their respective states. With regard to this position, Labrador has stated \"I have a consistent philosophy about government and the importance of states' rights.\"Tax reform Labrador is in favor of tax reform, specifically reform that rids of loopholes, lowers \"overall rates,\" and reduces government spending so the national debt does not increase.International issues Energy & oil Labrador is seen by many in eastern Idaho, which is not in his congressional district, as an opponent of the Idaho National Laboratory (INL).Immigration On the July 6, 2014 episode of Meet the Press, Labrador stated that what the Obama administration needed to do was \"immediately deport\" young illegal immigrants. The comment came as part of a discussion about the estimated 52,000 unaccompanied minors from Central America who had tried to cross the border since October 2013.Social issues Abortion Labrador opposes late termination of pregnancy and believes \"life begins at conception\" and that \"The unborn child is still a child – made in the image of God, who will one day have the same hopes and dreams as the rest of us. The fact that life begins at conception might be an uncomfortable truth for some. But it's a truth, all the same.\"Family Rights Idaho is one of the states that has faith-healing exemption. In a debate, Labrador said he would not change it.Cannabis Labrador has a \"B\" rating from NORML for his voting history regarding cannabis-related causes. Labrador is in favor of veterans having access to medical marijuana if recommended by their Veterans Health Administration doctor and if it is legal for medicinal purposes in their state of residence. He also supports industrial hemp farming.", "Elections": "District 14 House Seat B - Part of Ada CountyYearCandidateVotesPctCandidateVotesPctCandidateVotesPct2006 PrimaryRaúl Labrador2,44846.4%John Tomkinson1,53529.1%Jim Borton1,29224.5%2006 GeneralRaúl Labrador13,20865.5%Daniel Weston6,94334.5%2008 PrimaryRaúl Labrador (incumbent)4,945100%2008 GeneralRaúl Labrador (incumbent)22,09369.1%Glida Bothwell9,86930.9%2010In 2010, Labrador defeated Vaughn Ward in the Republican primary 48%–39% on May 10, in what was widely considered a major upset. In the general election, Labrador defeated first-term Democratic incumbent Walt Minnick 51%–41%.2012Labrador supported Mitt Romney for president.2014On August 14, 2013, Labrador decided not to challenge incumbent Idaho Governor Butch Otter in the Republican primary, instead running for reelection to Congress for a third term.On August 19, 2013, Democratic State Representative Shirley Ringo decided to challenge Labrador instead of running for an eighth term in the Idaho state legislature.Labrador announced on June 13 that he would challenge House Majority Whip, Representative Kevin McCarthy for the leadership position; in a vote held June 19, 2014 the House selected McCarthy.Labrador won both the Republican Primary (78.6%) and the General Election (65%).2016Labrador supported Donald Trump in the 2016 election.Labrador won both the Republican Primary (81%) and the General Election (68.2%).", "2018 gubernatorial election": "On Tuesday, May 9, 2017, Labrador filed to run in the 2018 Idaho governor race. Labrador did a kick off tour in the last week of May 2017 with stops in Boise, Post Falls, and Idaho Falls.Labrador will not be able to run for Idaho's 1st congressional district and governor at the same time; leaving CD-1 an open seat for the 2018 Idaho election.In November 2017 Labrador was endorsed by Senator Ted Cruz for the position of governor of Idaho.Labrador took second in the Idaho gubernatorial election, 2018 Republican primary to incumbent Lieutenant Governor Brad Little taking 32.6%.", "Personal life": "Labrador lives in Eagle, Idaho, with his wife, Rebecca, and their five children. He is a member of The Church of Jesus Christ of Latter-day Saints (Mormon).", "introduction": "Raúl Rafael Labrador (born December 8, 1967) is an American politician serving as the U.S. Representative for Idaho's 1st congressional district since 2011. He is a member of the Republican Party.  Labrador previously represented District 14B in the Idaho House of Representatives from 2006 to 2010. Labrador opted not to seek another term in Congress to run for Governor of Idaho in the 2018 election; he lost the Republican primary to Idaho Lieutenant Governor Brad Little.\n\n", "code": "01"}, "personal": {"Born": "Raúl Rafael Labrador (1967-12-08) December 8, 1967 (age50)Carolina, Puerto Rico, U.S.", "Political party": "Republican", "Spouse(s)": "Rebecca Johnson (m.1991)", "Children": "5", "Education": "Brigham Young University (BA)University of Washington (JD)"}, "timeline": {"Member of the US House of Representativesfrom Idaho's 1st district": {"date": "Assumed office January 3, 2011", "Preceded by": "Walt Minnick"}, "Member of the Idaho House of Representativesfrom the 14th districtSeat B": {"date": "In officeDecember 1, 2006– December 1, 2010", "Preceded by": "Stan Bastian", "Succeeded by": "Reed DeMordaunt"}, "code": "01"}, "code": "B001294", "type": "4", "party": "Republican", "description": "moderate Republican follower", "economic": "0.52", "social": "-0.47", "leadership": "0.21"}