{"name": "Richard.Blumenthal", "picture": "B001277.jpg", "detail": {"Early life and education": "Blumenthal was born in Brooklyn, New York, the son of Jane (née Rosenstock) and Martin Blumenthal, who was the president of a commodities trading firm. His grandfather, Fred \"Fritz\" Rosenstock, raised cattle on his farm, where Blumenthal visited often in his youth. Blumenthal’s father was a Jewish immigrant from Frankfurt, Germany who emigrated alone at 17.Blumenthal attended Riverdale Country School in the Riverdale section of the Bronx before graduating from Harvard College with a A.B. degree magna cum laude as a member of Phi Beta Kappa. As an undergraduate, he was editorial chairman of The Harvard Crimson. Blumenthal was a summer intern reporter for The Washington Post in the London Bureau. Blumenthal was also selected for a Fiske Fellowship that allowed him to study at the University of Cambridge in England for one year after graduation from Harvard College.In 1973, Blumenthal received his J.D. degree from Yale Law School, where he was editor-in-chief of the Yale Law Journal. While at Yale, he was classmates with future President Bill Clinton and future Secretary of State Hillary Clinton. One of his co-editors on the Yale Law Journal was future United States Secretary of Labor Robert Reich. His brother, David Blumenthal, is the President of the Commonwealth Fund.", "Military service": "Blumenthal received five draft deferments during the Vietnam War, obtaining first educational deferments, and then deferments based on his occupation. With part-time service in the reserves or National Guard generally regarded as an alternative for those wishing to avoid serving in Vietnam, in April 1970, Blumenthal enlisted in the United States Marine Corps Reserve, and he served in units in Washington, D.C., and Connecticut from 1970 to 1976, attaining the rank of sergeant. During his 2010 Senate campaign, news reports that Blumenthal had claimed or implied that he'd served \"in Vietnam\" during the war created a controversy.  Blumenthal denied having intentionally misled voters into believing he fought in Vietnam, but acknowledged having occasionally \"misspoken\" about his service record, and later apologized for remarks about his military service he said had not been \"clear or precise\".", "Early political career": "Blumenthal served as administrative assistant to Sen. Abraham A. Ribicoff, as aide to Daniel P. Moynihan when Moynihan was Assistant to President Richard Nixon, and as a law clerk Judge Jon O. Newman, U.S. District Court of the District of Connecticut, and to Supreme Court Justice Harry A. Blackmun. At age 31, he became United States Attorney for the District of Connecticut, serving from 1977 to 1981, and as the chief federal prosecutor of that state successfully prosecuted many major cases involving drug traffickers, organized crime, white collar criminals, civil rights violators, consumer fraud, and environmental pollution. In 1982, he married Cynthia Allison Malkin, daughter of real estate investor Peter L. Malkin and granddaughter of lawyer and philanthropist Lawrence Wien.Before he became Attorney General, Blumenthal was a partner in the law firm of Cummings & Lockwood, and subsequently in the law firm of Silver, Golub & Sandak. In December 1982, while still at Cummings & Lockwood, he created and chaired the Citizens Crime Commission of Connecticut, a private, non-profit organization. From 1981 to 1986, he was a volunteer counsel for the NAACP Legal Defense Fund. In 1984, when he was 38, Blumenthal was elected to the Connecticut House of Representatives, representing the 145th district. In 1987, he won a special election to fill a vacancy in the 27th District of the Connecticut Senate, at the age of 41. Blumenthal resided in Stamford, Connecticut.In the 1980s, Blumenthal testified in the State Legislature in favor of abolishing Connecticut's death penalty statute. He did so after representing Florida death row inmate Joseph Green Brown, who had been wrongly convicted. Blumenthal succeeded in staving off Brown's execution just 15 hours before it was scheduled to take place.", "Attorney General career": "Blumenthal was first elected as the 23rd Attorney General in 1990 and was re-elected in 1994, 1998, 2002 and 2006. On October 10, 2002 he was awarded the Raymond E. Baldwin Award for Public Service by the Quinnipiac University School of Law.Pequot land annexation bid In May 1995, Blumenthal and the state of Connecticut filed lawsuits challenging a decision by the Department of the Interior to approve a bid by the Mashantucket Pequots for the annexation of 165 acres of land in the towns of Ledyard, North Stonington and Preston. The Pequots' bid sought to have the land placed in a Federal trust, a legal designation that would have given the tribe sovereign control. Blumenthal argued that the Interior Department's decision was \"fatally, legally flawed, and unfair,\" and that \"it would unfairly remove land from the tax rolls of the surrounding towns and bar local control over how the land is used, while imposing [a] tremendous burden.\" The tribe announced the withdrawal of the land annexation petition in February 2002.Interstate air pollution In 1997, both Blumenthal and Governor John G. Rowland petitioned the United States Environmental Protection Agency (EPA) to address interstate air pollution problems created from Midwest and southeastern sources. The petition was filed in accordance with Section 126 of the Clean Air Act, which allows a United States state to request pollution reductions from out-of-state sources that contribute significantly to its air quality problems.In 2003, Blumenthal and the Attorneys General of eight other states (New York, Maine, Maryland, Massachusetts, New Hampshire, New Jersey, Rhode Island, and Vermont) filed a federal lawsuit against the Bush Administration for \"endangering air quality by gutting a critical component of the federal Clean Air Act.\" The suit alleged that changes in the Act would have exempted thousands of industrial air pollution sources from the Act's New Source Review provision and that the new rules and regulations would lead to an increase in air pollution.Big Tobacco While Attorney General, Blumenthal was one of the leaders of a 46-state lawsuit against the tobacco industry, which alleged that the companies involved had deceived the public about the dangers of smoking. Blumenthal argued that the state of Connecticut should be reimbursed for Medicaid expenses related to smoking. In 1998, the tobacco companies reached a $246 billion national settlement, giving the 46 states involved 25 years of reimbursement payments. Connecticut's share of the settlement was estimated at about $3.6 billion.In December 2007, Blumenthal filed suit against RJ Reynolds alleging that a 2007 Camel advertising spread in Rolling Stone magazine used cartoons in violation of the master tobacco settlement, which prohibited the use of cartoons in cigarette advertising because they entice children and teenagers to smoke. The company paid the state of Connecticut $150,000 to settle the lawsuit and agreed to end the advertising campaign in question.Microsoft lawsuit In May 1998, Blumenthal, along with attorneys general from 19 other states and the District of Columbia, filed an anti-trust lawsuit against Microsoft accusing the company of abusing its monopoly power to stifle competition. The suit, which centered on Microsoft's Windows 98 operating system and the company's contractual restrictions imposed on personal computer manufacturers to tie the operating system to its Internet Explorer browser, was eventually merged with a federal case brought by the United States Department of Justice (DOJ) under Attorney General Janet Reno.A 2000 landmark federal court decision ruled that Microsoft had violated antitrust laws, and the court ordered that the company be broken up. In 2001, the federal appeals court agreed, but rather than breakup the company, sent the case to a new judge to hold hearings and determine appropriate remedies. Remedies were later proposed by Blumenthal and eight other attorneys general; these included requiring that Microsoft license an unbundled version of Windows in which middleware and operating system code were not commingled. In 2001, the Bush Administration's DOJ settled with Microsoft in an agreement criticized by many states and other industry experts as insufficient. In November 2002, a federal court ruling imposed those same remedies.In August 2007, Blumenthal, along with five other states and the District of Columbia, filed a report alleging that the federal settlement with Microsoft, and court-imposed Microsoft remedies, had failed to adequately reduce Microsoft's monopoly.Stanley Works On May 10, 2002 then Attorney General Blumenthal and Connecticut State Treasurer Denise L. Nappier helped to stop the hostile takeover of New Britain-based Stanley Works, a major Connecticut employer, by filing a lawsuit alleging that the move to reincorporate in Bermuda based on a shareholder's vote of May 9 was \"rife with voting irregularities.\" The agreement to temporarily halt the move was signed by New Britain Superior Court Judge Marshall Berger. On June 3 Blumenthal referred the matter to the U.S. Securities and Exchange Commission (SEC) for further investigation and on June 25 he testified before the U.S. House Committee on Ways and Means that \"Long-time American corporations with operations in other countries can dodge tens of millions of dollars in federal taxes by the device of reincorporating in another country\" by \"simply [filing] incorporation papers in a country with friendly tax laws, open a post-office box and hold an annual meeting there\" and that Stanley Works, along with \"Cooper Industries, Seagate Technologies, Ingersoll-Rand and PricewaterhouseCoopers Consulting, to name but a few, have also become pseudo-foreign corporations for the sole purpose of saving tax dollars.\" Blumenthal stated that \"Corporations proposing to reincorporate to Bermuda, such as Stanley, often tell shareholders that there is no material difference in the law\" but said that this was not the case and was misleading to their shareholders. In order to rectify this situation he championed the Corporate Patriot Enforcement Act to close tax loopholes.Charter schools lawsuit In September 1999, Blumenthal announced a lawsuit against Robin Barnes, the president and treasurer of New Haven-based charter school the Village Academy, for serious financial mismanagement of the state-subsidized charitable organization. Citing common law, Blumenthal's suit sought to recover money misspent and serious damages resulting from Barnes's alleged breach of duty.[citation needed]In a Connecticut Supreme Court decision, Blumenthal v. Barnes (2002), a unanimous court determined that the state's Attorney General could act using only the powers specifically authorized by the state legislature, and that since the Attorney General's jurisdiction is defined by statute rather than common law, Blumenthal lacked the authority to cite common law as the basis for filing suit against Barnes. Despite this ruling, Blumenthal announced that he intended to pursue a separate 2000 lawsuit against the school's trustees filed on behalf of the State Department of Education.Regional transmission organization In 2003 Blumenthal, along with former Massachusetts Attorney General Tom Reilly, Rhode Island Attorney General Patrick C. Lynch, and consumer advocates from Connecticut, Maine, and New Hampshire, opposed \"the formation of a regional transmission organization (RTO) that would merge three Northeast and mid-Atlantic power operators, called Independent Service Operators (ISOs), into a single super-regional RTO.\" In a press release he is quoted as saying \"This fatally flawed RTO proposal will raise rates, reduce accountability and reward market manipulation. It will increase the power and profits of transmission operators with an immediate $40 million price tag for consumers.\" The opposition was due to a report authored by Synapse Energy Economics, Inc., a Cambridge-based energy consulting firm, which alleged that consumers would be worse off under the merger.Gina Kolb lawsuit In 2004, Blumenthal sued Computer Plus Center of East Hartford and its owner, Gina Kolb, on behalf of the state. It was alleged that CPC overcharged $50 per computer, $500,000 in total, on a three-year, $17.2 million contract to supply computers to the state. Blumenthal sued for $1.75 million. Kolb was arrested in 2004 and charged with first degree larceny. Kolb later countersued, claiming the state had grossly abused its power. Kolb was initially awarded $18.3 million in damages; however, the Attorney General appealed the decision and the damages initially awarded were slashed by 90 percent to $1.83 million. In ruling, Superior Court judge Barry Stevens described the jury's initial award of $18.3 million as a \"shocking injustice\" and said it was \"influenced by partiality or mistake.\"Big East and ACC Attorney General Blumenthal played a pivotal role in one of the biggest college athletics stories of the decade; expansion of the Atlantic Coast Conference and the departures of Boston College, Miami, and Virginia Tech from the Big East. He led efforts by the Big East football schools (Virginia Tech, Rutgers, Pittsburgh, and West Virginia) in legal proceedings against the Atlantic Coast Conference, the University of Miami and Boston College, accusing them of improper disclosure of confidential information and of conspiring to dismantle the Big East. According to Blumenthal, the case was pursued because \"the future of the Big East Conference was at risk—the stakes huge for both state taxpayers and the university's good name.\" The suits cost the schools involved $2.2 million in the first four months of litigation. The lawsuit against the ACC was initially dismissed on jurisdictional grounds but was subsequently refiled. A declaratory judgment by the Supreme Judicial Court of Massachusetts exonerated Boston College in the matter. Virginia Tech accepted an invitation from the ACC and withdrew from the suit to remove themselves from the awkward position of suing their new conference. An out-of-court settlement in the amount of $5 million was eventually reached, which included a $1 million exit fee that Boston College was required to pay the Big East under the league's constitution.Some have speculated that the lawsuit was one of the biggest reasons that the University of Connecticut was not sought after by the ACC during their 2011 additions of then-Big East members Syracuse and Pittsburgh. UConn is currently a member of the less-lucrative American Athletic Conference, the successor to the original Big East.Interstate 84 On October 2, 2006, Blumenthal launched an investigation concerning a botched reconstruction project of the Interstate 84 in Waterbury and Cheshire. The original contractor for the job, L.G. DeFelice, went out of business and it was later revealed that hundreds of storm drains had been improperly installed. Blumenthal subsequently announced lawsuits against L.G. DeFelice and the Maguire Group, the engineering firm that inspected the project. United States Fidelity & Guaranty, the insurer behind the performance bond for the Interstate-84 construction, agreed to pay $17.5 million to settle the claims. Under the terms of the agreement, the state of Connecticut retained the right to sue L.G. DeFelice for additional funds. In 2009, the bonding company agreed to pay an additional $4.6 million settlement, bringing the total award to $22.1 million ($30,000 more than the repair costs).Lyme disease guidelines investigation In November 2006, Blumenthal launched an antitrust investigation into the Infectious Diseases Society of America's (IDSA's) 2006 guidelines regarding the treatment of Lyme disease. Responding to concerns from chronic Lyme disease advocacy groups, Blumenthal claimed the IDSA guidelines would \"severely constrict choices and legitimate diagnosis and treatment options for patients.\" The medical validity of the IDSA guidelines was not challenged, and a journalist writing in Nature Medicine suggested some IDSA members may not have disclosed potential conflicts of interest, while a Forbes piece described Blumenthal's investigation as \"intimidation\" of scientists by an elected official with close ties to Lyme advocacy groups. The Journal of the American Medical Association described the decision as an example of the \"politicization of health policy\" that went against the weight of scientific evidence and may have a chilling effect on future decisions by medical associations. In 2008, Blumenthal ended the investigation after the IDSA agreed to conduct a review of the guidelines. In 2010, an eight-member independent review panel unanimously agreed that the original 2006 guideline recommendations were \"medically and scientifically justified\" in the light of the evidence. The committee did not change any of the earlier recommendations but did alter some of the language in an executive summary of the findings. Blumenthal said he would review the final report.Internet pornography, prostitution, and sexual predators MySpace/Facebook In March 2006, Blumenthal noted that more than seven incidents of sexual assault in Connecticut had been linked directly to MySpace contacts. Earlier that year, Blumenthal and attorneys general in at least five other states were involved in discussions with MySpace that resulted in the implementation of technological changes aimed at protecting children from pornography and child predators on the company's website. At Blumenthal's urging, MySpace installed a link to free blocking software (\"K9 Web Protection\"); however, in May 2006, Blumenthal announced that the site had failed to make the program easy to find and that it was not clearly labeled. Blumenthal also urged MySpace to take further steps to safeguard children, including purging deep links to pornography and inappropriate material, tougher age verification, and banning users under 16.Blumenthal was co-chair, along with North Carolina Attorney General Roy Cooper, of the State Attorney General Task Force on Social Networking. In 2008, the attorneys general commissioned the Internet Safety Technical Task Force report, which researched \"ways to help squash the onslaught of sexual predators targeting younger social-networking clients\".Blumenthal's office subpoenaed MySpace for information about the number of registered sex offenders on its site. In 2009, MySpace revealed that over a 2-year span it had roughly 90,000 members who were registered sex offenders (nearly double what MySpace officials had originally estimated one year prior). Blumenthal accused MySpace of having \"monstrously inadequate counter-measures\" to prevent sex offenders from creating MySpace profiles.Blumenthal and Cooper secured agreements from MySpace and Facebook to push toward making their companies' sites safer. Both sites implemented dozens of safeguards, including finding better ways to verify users' ages, banning convicted sex offenders from using the sites, and limiting the ability of older users to search members under 18.Craigslist In March 2008, Blumenthal issued a letter to Craigslist attorneys demanding that the website cease allowing postings for erotic services, which he claimed promoted prostitution, and he accused the site of \"turning a blind eye\" to the problem. Blumenthal worked with Craigslist and a group of 40 attorneys general to create new measures on the site designed to thwart ads for prostitution and other illegal sexual activities. In April 2009, Craigslist came under the scrutiny of law enforcement agencies following the arrest of Philip Markoff (aka the \"Craigslist Killer\"), suspected of killing a 25-year-old masseuse he met through Craigslist at a Boston hotel. Blumenthal subsequently called for a series of specific measures to fight prostitution and pornography on Craigslist—including steep financial penalties for rule breaking, and incentives for reporting wrongdoing. Blumenthal claimed that \"Craigslist has the means—and moral obligation—to stop the pimping and prostituting in plain sight.\"Blumenthal, leading a coalition of 39 states, subpoenaed Craigslist in May 2010 as part of an investigation into whether the site was taking sufficient action to curb prostitution ads and whether it was profiting from them. Blumenthal stated that prostitution ads had remained on the site despite previous assurances that they would be removed. The subpoena sought documents related to the company's processes for reviewing potentially objectionable ads, as well as documents detailing the revenue gained from ads sold to the company's erotic services and adult services categories. In August 2010, Blumenthal called on the website to shut down the section permanently and take steps to eradicate prostitution ads from other parts of the site. Blumenthal also called on Congress to alter a landmark communications law (Communications Decency Act) that Craigslist has cited in defense of the ads.Following continued pressure, Craigslist removed the adult services sections from its U.S. sites in September 2010 and from its international sites in December 2010. Blumenthal called the company's decision a victory against sexual exploitation of women and children, and against human trafficking connected to prostitution.Blumenthal and other state attorneys general reached a settlement with Craigslist on the issue; the settlement called for the company to charge people via credit card for any ads that were suggestive in nature so the person could be tracked down if they were determined to in fact be offering prostitution. However, Blumenthal remarked that subsequent to the settlement, the ads had continued to flourish using veiled code words.Terrorist surveillance program In October 2007, Blumenthal and the attorneys general of four other states lobbied Congress for the rejection of proposals to provide immunity from litigation to telecommunications firms that cooperated with the federal government's terrorist surveillance program following the September 11 attacks in 2001. In 2008 the Congress passed and President George W. Bush signed into law a new terrorist surveillance bill including the telecom immunity provisions opposed by Blumenthal.Countrywide Financial In August 2008 Blumenthal announced that Connecticut had joined California, Illinois and Florida in suing subprime mortgage lender Countrywide Financial (now owned by Bank of America) for fraudulent business practices. The suit alleged that Countrywide pushed consumers into \"deceptive, unaffordable loans and workouts, and charged homeowners in default unjustified and excessive legal fees.\" According to Blumenthal, \"Countrywide conned customers into loans that were clearly unaffordable and unsustainable, turning the American Dream of homeownership into a nightmare\" and when consumers defaulted, \"the company bullied them into workouts doomed to fail.\" Blumenthal also claimed that Countrywide \"crammed unconscionable legal fees into renegotiated loans, digging consumers deeper into debt\" and that the company \"broke promises that homeowners could refinance, condemning them to hopelessly unaffordable loans.\" The lawsuit demanded that Countrywide make restitution to affected borrowers, give up improper gains and rescind, reform or modify all mortgages that broke state laws. It is also sought civil fines of up to $100,000 per violation of state banking laws, and up to $5,000 per violation of state consumer protection laws.In October 2008 Bank of America initially agreed to settle the states' suits for $8.4 billion, and in February 2010, Countrywide mailed payments of $3,452.54 to 370 Connecticut residents. The settlement forced Bank of America to establish a $150 million fund to help repay borrowers whose homes had been foreclosed upon, $1.3 million of which went to Connecticut.Blumenthal commented in defense of U.S. Senator and chairman of the Senate Banking Committee Christopher Dodd, who had been harshly criticized for accepting a VIP loan from Countrywide, stating that \"there's no evidence of wrongdoing on [Mr. Dodd's] part any more than victims who were misled or deceived by Countrywide.\" In August 2010, Dodd was cleared by the Senate Ethics Committee, which found \"no credible evidence\" that he knowingly tried to use his status as a U.S. senator to receive loan terms not available to the public.Global warming Blumenthal has been a vocal advocate of the position that human activity is responsible for rising global temperatures and that prompt action to reduce greenhouse gas emissions must be taken. He has urged the Environmental Protection Agency to declare carbon dioxide as a dangerous air pollutant. \"I urge the new Obama EPA to declare carbon dioxide a danger to human health and welfare so we can at last begin addressing the potentially disastrous threat global warming poses to health, the environment and our economy. We must make up for lost time before it's too late to curb dangerous warming threatening to devastate the planet and human society.\" He has brought suit against a number of electric utilities in the Midwest, arguing that coal-burning power plants are generating excess CO2 emissions. The Second Circuit Court of Appeals recently agreed to allow Blumenthal's lawsuit to proceed. Blumenthal personally has stated \"no reputable climate scientist disputes the reality of global warming. It is fact, plain and simple. Dithering will be disastrous.\"Trump emoluments lawsuit Blumenthal, together with Rep. John Conyers Jr. of Michigan, led a group of 196 congressmen in the filing of a federal lawsuit accusing President Trump of violating the emoluments clause of the US Constitution.", "Prospect of gubernatorial candidacy": "Blumenthal was frequently considered a top prospect as the Democratic candidate for Governor of Connecticut but he did not run against Republican governors John G. Rowland or M. Jodi Rell in the elections of 1998, 2002, and 2006.On March 18, 2007, Hartford Courant columnist Kevin Rennie reported Blumenthal had become seriously interested in running for Governor in 2010. On February 2, 2009, Blumenthal announced he would forgo a gubernatorial run and seek re-election that year as Attorney General.", "US Senate": "2010 election After Sen. Chris Dodd announced on January 6, 2010 that he would retire at the end of his term, Blumenthal told the Associated Press that he would run in the election for Dodd's seat in November 2010. Later that day, President Barack Obama and Vice President Joe Biden called Blumenthal to express their best wishes.The same day, Public Policy Polling released a poll they took on the two preceding evenings, including races where Blumenthal was paired against each of the three most mentioned Republicans contending for their party's nomination for the seat. He led by at least 30% in each hypothetical race: against Rob Simmons (59%–28%), against Linda McMahon (60%–28%), and against Peter Schiff (63%–23%), with a ±4.3% margin of error cited.Rasmussen Reports also polled after Blumenthal announced his candidacy and found a somewhat more competitive race, but with Blumenthal holding a strong lead.A February poll by Rasmussen found that Blumenthal held leads of 19 (against Simmons) and 20 (against McMahon), and that Republicans had made up little ground since the initial Rasmussen poll after Blumenthal announced.On May 21, Blumenthal received the Democratic nomination by acclamation.The New York Times reported that Blumenthal misspoke on at least one occasion by saying he'd served with the military \"in Vietnam\". Video emerged of him speaking to a group of veterans and supporters in March 2008 in Norwalk, Connecticut, saying, in reference to supporting troops returning from Iraq and Afghanistan, \"We have learned something important since the days that I served in Vietnam.\" There were also other occasions where he accurately described his military service. At a 2008 ceremony in Shelton, Connecticut, he said, \"I served during the Vietnam era... I remember the taunts, the insults, sometimes even physical abuse.\"Blumenthal's commanding officer in 1974 and 1975, Larry Baldino of Woodbridge, Connecticut, addressed the controversy in a letter to the editor in the New Haven Register. Baldino wrote that the misleading statement was too 'petty' to be the basis for supporting or not supporting Blumenthal. Baldino further portrayed Blumenthal as 'good natured' and described him as 'one of the best Marines with whom I ever worked'.Days after the nomination, Quinnipiac University Polling Institute polling indicated that Blumenthal held a 25-point lead over McMahon. The Cook Political Report changed its prediction on the race to Leans Democratic, making Blumenthal the favored candidate over McMahon.On the November 2 election, Blumenthal was elected, defeating former WWE CEO Linda McMahon, 55% to 43%.2016 election August Wolf, a former Olympian and current bond salesman, was the only declared candidate running as a Republican against Blumenthal in the 2016 Senate election.In August 2015, economist Larry Kudlow threatened to run against Blumenthal if Blumenthal voted in favor of the Iran Nuclear Deal.According to a pair of Quinnipiac polls on October 15, 2015, Blumenthal had a 34 percent lead over Kudlow and a 35 percent lead over August Wolf.Blumenthal ended up winning re-election with 63 percent of the vote against Republican state representative Dan Carter, becoming the first person in Connecticut's history to receive over a million votes in a single election.Tenure Blumenthal was sworn into the 112th United States Congress on January 5, 2011. He announced plans to return to Connecticut every weekend to join a \"listening tour\" of his home state.In March 2012, Blumenthal and New York Senator Chuck Schumer gained national attention after they called upon Attorney General Eric Holder and the Department of Justice to investigate practices by employers to require Facebook passwords for employee applicants and workers.Blumenthal has worked with Sen. Mark Kirk from Illinois to eliminate pensions for members of Congress who are convicted of felonies while serving in office.Committee assignments Committee on Armed ServicesSubcommittee on AirlandSubcommittee on CybersecuritySubcommittee on SeapowerCommittee on Commerce, Science and TransportationSubcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Consumer Protection, Product Safety, and Insurance (Ranking Member)Subcommittee on Oceans, Atmosphere, Fisheries, and Coast GuardSubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on the JudiciarySubcommittee on Antitrust, Competition Policy and Consumer RightsSubcommittee on Border Security and ImmigrationSubcommittee on Oversight, Agency Action, Federal Rights and Federal CourtsSubcommittee on the Constitution (Ranking Member)Committee on Veterans' AffairsSpecial Committee on AgingCommission on Security and Cooperation in EuropeCaucus memberships Senate Oceans CaucusSenate Ukraine Caucus", "Political positions": "Gun law As of 2010, Blumenthal had a \"F\" rating from the National Rifle Association for his pro-gun control voting record.In response to the 2015 San Bernardino attack, Blumenthal stated his support for improved access to mental health resources and universal background checks.In the wake of the 2016 Orlando nightclub shooting, Blumenthal stated that his \"heart breaks for the families of loved ones lost or injured – and for our nation, continuing to suffer from this unspeakable epidemic of gun violence.\" He blamed the Senate for their lack of action on gun violence prevention. He said that thoughts and prayers were not enough and that the country was calling for action.In October 2016, he participated in the Chris Murphy gun control filibuster, speaking in support of the Feinstein Amendment, which would have banned people known to be or suspected of being terrorists from buying guns. That same year, Blumenthal stated his support for efforts to require toy or fake firearms to have orange parts so they could more easily be distinguished from real guns.In response to the 2017 Las Vegas shooting, Blumenthal declared in an interview with Judy Woodruff, \"we must break the grip of the NRA\". He continued, \"we can at least save lives. Would it have prevented the Las Vegas atrocity, that unspeakable tragedy? We will never know. But it might have, and we can definitely prevent such mass shootings by adopting these kinds of commonsense measures.\"Marijuana Blumenthal has a \"C\" rating from NORML for his voting history regarding cannabis-related causes.Reproductive rights Blumenthal is pro-choice. He supports efforts to make it a crime for demonstrators to block access to health clinics. He opposed efforts by Walmart to ban the sale of emergency contraception and supports requirements that make it mandatory for pharmacies to fill birth control prescriptions. He support federal funding for family planning clinics.", "Potential 2020 presidential campaign": "In a poll conducted from August 18 to 21, 2017, by Public Policy Polling, Blumenthal topped President Donald Trump 42%-39% in a hypothetical 2020 U.S. presidential election match-up. Among the 887 registered voters that were polled, 19% were \"not sure\" of who to vote for between Blumenthal and Trump. On September 29, 2018, the subject was goaded by President Trump via Twitter in regards to his war service claim during his 2010 Senate campaign.", "Personal life": "In 1982, Blumenthal married the former Cynthia Malkin, who is 15 years his junior. They met at a party in Greenwich, when 16-year-old Malkin, who was accompanied by her parents, was paired up with 31-year-old Blumenthal in a game of tennis. They were engaged during her senior year at Harvard and married the following year. Her father, Peter L. Malkin, is a wealthy real estate investor, and her maternal grandfather, Lawrence Wien, was a prominent lawyer and philanthropist. Blumenthal and his wife have four children together.", "Electoral history": "Connecticut House of Representatives 145th District election in 1984PartyCandidateVotes%+%DemocraticRichard Blumenthal4,86368.17%RepublicanJohan Andersen, III2,27031.82%Connecticut Senate 27th District election in 1988PartyCandidateVotes%+%DemocraticRichard Blumenthal*21,94765.88%RepublicanTed Lewis11,36634.03%Connecticut Attorney General election in 1990PartyCandidateVotes%+%DemocraticRichard Blumenthal572,97259.18%RepublicanE. Gaynor Brennan, Jr.395,28940.82%Connecticut Attorney General election in 1994PartyCandidateVotes%+%DemocraticRichard Blumenthal*679,31366.34%RepublicanRichard Arnold344,62733.66%Write-inHoward Grayson, Jr.360.00%Blumenthal was also nominated on the A Connecticut Party line.Connecticut Attorney General election in 1998PartyCandidateVotes%+%DemocraticRichard Blumenthal*631,58868.55%RepublicanSanta Mendoza282,28930.64%LibertarianRichard Pober7,5370.88%Connecticut Attorney General election in 2002PartyCandidateVotes%+%DemocraticRichard Blumenthal*632,35165.65%RepublicanMartha Dean330,87434.35%Connecticut Attorney General election in 2006PartyCandidateVotes%+%DemocraticRichard Blumenthal*782,23574.08%RepublicanRobert Farr256,01824.25%GreenNancy Burton17,6841.67%Write-inJohn Joy40.00%United States Senate election in Connecticut (2010)PartyCandidateVotes%+%DemocraticRichard Blumenthal635,84055.15%11.93%RepublicanLinda McMahon498,34143.22%IndependentWarren Mosler11,2750.98%Connecticut for LiebermanJohn Mertens6,7350.58%Write-inBrian Hill5590.00%Write-inJeff Russell450.00%Write-inTodd Vachon450.00%Write-inCarl Vassar310.00%Write-inJay Giles170.00%Write-inJohn Traceski150.00%Write-inMatthew Coleman70.00%Write-inDave Olszata50.00%Blumenthal was also nominated on the Working Families line.United States Senate election in Connecticut (2016)PartyCandidateVotes%+%DemocraticRichard Blumenthal1,008,71463.19%+7.95%RepublicanDan Carter552,62134.62%-8.53%LibertarianRichard Lion18,1901.14%GreenJeffery Russell16,7131.05%Write-inAndrew Rule260.00%Write-inJohn M. Traceski120.00%", "Further reading": "Altimari, Dave and Mahony, Edmund (January 30, 2010). Computer Firm Owner Awarded $18 Million In Countersuit Against State. Courant.com. Retrieved February 7, 2010.Mosher, James (December 27, 2009). Don't outlaw our stoves, Eastern Connecticut farmers urge, Attorney general: Burning wood outside pollutes air. NorwichBulletin.com. Retrieved January 6, 2010.Pesci, Donald (December 10, 2009). Blumenthal: worst Attorney General in U.S.. RegisterCitizen.com. Retrieved January 6, 2010.Baue, William (July 9, 2002). Connecticut Fights to Keep Stanley Works from Disappearing to Bermuda. Socialfunds.com. Retrieved September 5, 2004.Connecticut Attorney General's Office (August 14, 1997). Governor, Attorney General Urge Tighter Restrictions on Air Pollution. Press release. Retrieved September 5, 2004.Connecticut Attorney General's Office (October 15, 2001). Attorney General Submits Comments To FERC Opposing Formation Of Regional Transmission Organization. Press release. Retrieved September 5, 2004.Connecticut Attorney General's Office (May 10, 2002). Lawsuit Filed By Blumenthal, Nappier Brings Halt To Stanley Works' Reincorporation Plans. Press release. Retrieved September 5, 2004.Connecticut Attorney General's Office (June 3, 2002). Attorney General Asks SEC To Investigate Stanley Works Vote. Press release. Retrieved September 5, 2004.Connecticut Attorney General's Office (September 30, 2003). Blumenthal, New England AGs And Consumer Advocates Warn That Proposed RTO Will Raise Rates, Without Consumer Benefit. Press release. Retrieved September 5, 2004.Connecticut Attorney General's Office (October 27, 2003). Connecticut and 11 Other States File Suit to Prevent Weakening of the Clean Air Act. Press release. Retrieved September 5, 2004.Patrick, Mike (October 10, 2003). Law School lauds Blumenthal with public service award. QUDaily. Retrieved September 5, 2004.Sorry, Stanley - editorial (May 9, 2003). Wall Street Journal, cited from the article at The Center for Freedom and Prosperity, https://web.archive.org/web/20030820081214/http://www.freedomandprosperity.org/Articles/wsj05-09-03/wsj05-09-03.shtml. Retrieved September 5, 2004.Peterson, Paul; White, David; Doolittle, Nick; & Roschelle, Amy (September 29, 2003) of Synapse, Energy Economics Inc. FERC's Transmission Pricing Policy: New England Cost Impacts. Report commissioned by Connecticut Attorney General's Office.Subcommittee on Select Revenue Measures of the House Committee on Ways and Means (June 6, 2002). Statement of the Hon. Richard Blumenthal, Attorney General, Connecticut Attorney General's Office. Retrieved September 5, 2004.Subcommittee on Select Revenue Measures of the House Committee on Ways and Means (June 25, 2002). Statement of the Hon. Richard Blumenthal, Attorney General, Connecticut Attorney General's Office, Hearing on Corporate Inversions. Retrieved September 5, 2004.Plotz, David (September 15, 2000). \"Richard Blumenthal: He was supposed to be president. So why is he only Connecticut's attorney general?\". Slate.com. Retrieved January 6, 2010.Titus, Elizabeth, \"Blumenthal predicts Hagel will be confirmed\", Politico, 1/13/13. Re: Chuck Hagel's nomination as US Secretary of Defense; Blumenthal seat on Armed Services noted; Blumenthal spoke on Fox News Sunday.", "introduction": "Richard Blumenthal (/ˈbluːmənθɔːl/; born February 13, 1946) is an American attorney and politician who has served as a United States Senator from Connecticut since 2011. He is a member of the Democratic Party.  He has been the state's senior senator since 2013 and is ranked as the second wealthiest member of the Senate. Previously, he served as Attorney General of Connecticut from 1991 to 2011. \nBorn in Brooklyn, New York, Blumenthal attended Riverdale Country School, a private school in the Bronx. Blumenthal is a graduate of Harvard College, where he was editorial chairman of The Harvard Crimson. He studied for a year at Trinity College, Cambridge, in England before attending Yale Law School, where he was editor-in-chief of the Yale Law Journal. While at Yale, he was a classmate of future President Bill Clinton and future Secretary of State Hillary Clinton. From 1970 to 1976, Blumenthal served in the United States Marine Corps Reserve, where he attained the rank of sergeant.\nAfter college, Blumenthal served as administrative assistant and law clerk for several Washington, D.C. figures. From 1977 to 1981, he was United States Attorney for the District of Connecticut. In the early 1980s he worked in private law practice, including serving as volunteer counsel for the NAACP Legal Defense Fund. He served in the Connecticut House of Representatives from 1985 to 1987, when he was elected to the Connecticut Senate. He was elected Attorney General of Connecticut in 1990, and served for twenty years. During this period he was frequently speculated as a contender for Governor of Connecticut, but he never pursued the office.\nBlumenthal announced his 2010 run for U.S. Senate after incumbent Democratic Sen. Chris Dodd announced his retirement. He faced professional wrestling magnate Linda McMahon in the 2010 election, winning by a 12-point margin with 55 percent of the vote. On January 5, 2011, he was sworn in and took seats on the Senate Armed Services; Judiciary; Aging; and Health, Education, Labor and Pensions Committees. He became Connecticut's senior senator after the retirement of Joe Lieberman in 2013. He won re-election in 2016 with 63.2% of the vote, becoming the first person to achieve more than one million votes in a statewide election in Connecticut.\n\n"}, "personal": {"date": "Born (1946-02-13) February 13, 1946 (age72)New York City, New York, U.S.", "Political party": "Democratic", "Children": "4", "Education": "Harvard University (BA)Trinity College, CambridgeYale University (JD)", "Signature": ""}, "timeline": {"United States Senatorfrom Connecticut": {"date": "Assumed office January 3, 2011Serving with Chris Murphy", "Preceded by": "Chris Dodd"}, "23rd Attorney General of Connecticut": {"date": "In officeJanuary 9, 1991– January 5, 2011", "Governor": "Lowell WeickerJohn RowlandJodi Rell", "Preceded by": "Clarine Riddle", "Succeeded by": "George Jepsen"}, "Member of the Connecticut Senatefrom the 27th district": {"date": "In officeJanuary 3, 1987– January 3, 1991", "Preceded by": "Anthony Truglia", "Succeeded by": "George Jepsen"}, "Member of the Connecticut House of Representativesfrom the 145th district": {"date": "In officeJanuary 3, 1985– January 3, 1987", "Preceded by": "Anthony Truglia", "Succeeded by": "Nicholas Pavia"}, "United States Attorney for the District of Connecticut": {"date": "In office1977–1981", "President": "Jimmy Carter", "Preceded by": "Peter Dorsey", "Succeeded by": "Alan Nevas"}, "Military service": {"Allegiance": "United States", "Service/branch": "United States Marine Corps", "Years of service": "1970–1976", "Rank": " Sergeant", "Unit": " U.S. Marine Corps Reserve"}}, "code": "B001277", "type": "3", "party": "Democrat", "description": "progressive Democratic leader", "economic": "-0.42", "social": "-0.09", "leadership": "0.69"}