{"name": "Sam.Graves", "picture": "G000546.jpg", "detail": {"Early life, education and career": "Graves was born in Tarkio, Missouri, a small city in the northwestern corner of Missouri not far from the Iowa and Nebraska borders. A lifelong resident of Tarkio, Sam is the son of Janice A. (née Hord) and Samuel Bruce Graves. He graduated from the University of Missouri College of Agriculture in Columbia, Missouri with a degree in Agronomy. He was a member of the Alpha Gamma Sigma fraternity, also known as AG-Sig.s", "Missouri Legislature": "Graves was elected to the Missouri House of Representatives in 1992. After only one term, he was elected to the Missouri Senate in 1994, and then reelected in 1998.", "US House of Representatives": "Committee assignments United States House Committee on Armed ServicesUnited States House Armed Services Subcommittee on Tactical Air and Land ForcesUnited States House Armed Services Subcommittee on ReadinessCommittee on Transportation and InfrastructureUnited States House Transportation Subcommittee on Highways and Transit (Chairman)Subcommittee on AviationSubcommittee on Railroads, Pipelines, and Hazardous MaterialsCaucus Memberships Congressional Cement Caucus", "Political positions": "Following the economic crisis of Wall Street in September 2008, Graves voted against the proposed bailout of United States financial system, claiming that it neither \"punished the wrongdoers nor adequately protected the innocent taxpayers, investors and retirees\" caught in the Wall Street banking crisis.\"In January 2014, Graves introduced the TRICARE Family Improvement Act. The bill would allow dependents of military members to stay on their parents' TRICARE health plan after turning age 26. The bill would change current law, which requires those dependents to change to a separate health plan after turning 26.", "Todd Graves controversy": "Graves is the brother of Todd Graves, former U.S. Attorney for the Western District of Missouri. In October 2008, U.S. Senator Kit Bond apologized to Todd Graves after a U.S. Justice Department report cited Bond forcing Graves out over a disagreement with Representative Graves. Following the report, U.S. Attorney General Michael Mukasey appointed a special prosecutor to investigate whether former U.S. Attorney General Alberto Gonzales and other officials involved in the firings of nine U.S. attorneys broke the law (dismissal of U.S. attorneys controversy).", "Ethics investigation": "In 2009, the House Ethics Committee began inquiring whether or not Graves used his position on the Small Business Committee to invite Brooks Hurst, a longtime friend and a business partner of his wife, to testify at a committee hearing on the federal regulation of biodiesel and ethanol production.  Graves had failed to mention the financial link between Hurst and Lesley Graves at the hearing, which dealt with federal subsidies for renewable fuels.  A review by the independent Office of Congressional Ethics found \"substantial reason to believe that an appearance of conflict of interest was created.\" Graves said in a statement, \"I look forward to a quick review of the facts and answering any questions that the committee may have. I believe that a speedy review will show that all the rules of the House concerning testimony in front of the Small Business Committee were followed.\" The  Office of Congressional Ethics referred the case to the House Ethics committee, which ended its own investigation in October, and released a report finding no ethical violations, as it asserted there was no standard in place for appearances like Hurst's.", "Political campaigns": "In 2000, Democratic U.S. Representative Pat Danner suddenly retired due to breast cancer. Graves filed within the short period of time left for filing. Graves faced Representative Danner's son, Steve Danner, a former State Senator, in the general election. Graves referred to Danner as a \"tax and spend liberal\" and won the race with 51% of the vote  largely by running up huge margins in the rural areas of the district. He was arguably helped by George W. Bush carrying the district in the 2000 presidential election, a theory known as the coattail effect.2000 2000 Election for U.S. Representative of Missouri's 6th Congressional DistrictPartyCandidateVotes%RepublicanSam Graves138,92550.85DemocraticSteve Danner127,79246.78LibertarianJimmy Dykes3,6961.35Natural LawMarie Richey2,7881.022002 2002 Election for U.S. Representative of Missouri's 6th Congressional DistrictPartyCandidateVotes%RepublicanSam Graves131,15163.03DemocraticCathy Rinehart73,20235.18LibertarianErik Buck3,7351.792004 2004 Election for U.S. Representative of Missouri's 6th Congressional DistrictPartyCandidateVotes%RepublicanSam Graves196,51663.83DemocraticCharles S. Broomfield106,98734.75LibertarianErik Buck4,3521.412006 2006 Election for U.S. Representative of Missouri's 6th Congressional DistrictPartyCandidateVotes%RepublicanSam Graves150,88261.64DemocraticSara Jo Shettles87,47735.73LibertarianErik Buck4,7571.94Progressive PartyShirley A. Yurkonis1,6790.692008 Graves faced a tougher reelection race in 2008 against Democratic nominee and former Kansas City Mayor Kay Barnes. He gained national attention early in the race for running an ad accusing Barnes of promoting \"San Francisco values.\" It was initially considered one of the hottest races in the country; however, Graves won reelection fairly handily, taking 59 percent of the vote to Barnes's 37 percent.2008 Election for U.S. Representative of Missouri's 6th Congressional DistrictPartyCandidateVotes%RepublicanSam Graves196,52659.43DemocraticKay Barnes121,89436.86LibertarianDave Browning12,2793.712010 2010 Election for U.S. Representative of Missouri's 6th Congressional DistrictPartyCandidateVotes%RepublicanSam Graves154,10369.44DemocraticClint Hylton67,76230.54Write-inKyle Yarber470.022012 2012 Election for U.S. Representative of Missouri's 6th Congressional DistrictPartyCandidateVotes%RepublicanSam Graves216,90665.00DemocraticKyle Yarber108,50332.52LibertarianRuss Monchil8,2792.482014 2014 Election for U.S. Representative of Missouri's 6th Congressional DistrictPartyCandidateVotes%RepublicanSam Graves124,61666.65DemocraticBill Hedge55,15729.50LibertarianRuss Monchil7,1973.852016 2016 Election for U.S. Representative of Missouri's 6th Congressional DistrictPartyCandidateVotes%RepublicanSam Graves238,38868.0DemocraticDavid Blackwell98,58828.4LibertarianRuss Monchil8,1232.3GreenMike Diel4,2411.2", "introduction": "Samuel Bruce Graves Jr. (born November 7, 1963) is the U.S. Representative for Missouri's 6th congressional district, serving since 2001. He is a member of the Republican Party. The district includes the entire northern third of the state, from the Kansas border to the Illinois border.  However, the bulk of its population lives in the northern suburbs of Kansas City.\n\n", "code": "06"}, "personal": {"Born": "Samuel Bruce Graves Jr. (1963-11-07) November 7, 1963 (age54)Tarkio, Missouri, U.S.", "Political party": "Republican", "Relatives": "Todd Graves (Brother)", "Education": "University of Missouri (BS)"}, "timeline": {"Chair of the House Small Business Committee": {"date": "In officeJanuary 3, 2011– January 3, 2015", "Preceded by": "Nydia Velázquez", "Succeeded by": "Steve Chabot"}, "Member of the US House of Representativesfrom Missouri's 6th district": {"date": "Assumed office January 3, 2001", "Preceded by": "Pat Danner"}, "code": "06"}, "code": "G000546", "type": "4", "party": "Republican", "description": "moderate Republican leader", "economic": "0.43", "social": "0.16", "leadership": "0.84"}