{"name": "Suzanne.Bonamici", "picture": "B001278.jpg", "detail": {"Early life, education, and law career": "Bonamici was born in Detroit and raised in a small Michigan town. She earned her bachelor's degree and law degree from the University of Oregon, and was a legal assistant at Lane County Legal Aid in Eugene.  Following law school, she became a consumer protection attorney for the Federal Trade Commission in the nation's capital. She went into private practice in Portland and represented small businesses.", "Oregon legislature": "Elections In 2006, incumbent Democratic State Representative Brad Avakian decided to retire to run for the Oregon Senate. She ran for the open seat in Oregon's 34th House District and defeated Republican Joan Draper 62%-36%.On April 30, 2008, Bonamici was appointed by Commissioners from both Washington and Multnomah counties to represent Oregon's 17th Senate District. The seat became vacant when Avakian was appointed Commissioner of the Oregon Bureau of Labor and Industries. She was sworn in on May 19, 2008.Bonamici was unopposed in the November 2008 special election for the balance of Avakian's four-year term, and was elected with 97 percent of the vote. In 2010, she won re-election with 64% of the vote.", "US House of Representatives": "Elections Special electionIn early 2011, Bonamici's name was floated as a possible successor to then-Congressman David Wu after The Oregonian and Willamette Week reported Wu exhibited odd behavior and clashed with his staff in the midst of apparent mental illness during the 2010 election cycle. Following Wu's resignation from Congress, Bonamici announced her candidacy for the special election to replace him, touting endorsements from former Governor Barbara Roberts, former Congresswoman Elizabeth Furse, and incumbent Oregon Attorney General John Kroger, among others.On November 8, 2011, Bonamici won the Democratic Party of Oregon's nomination, winning an outright majority of the vote in every county in the district and capturing 66% of the vote overall, with a 44-point margin over second-place finisher Brad Avakian. She faced Republican nominee Rob Cornilles in the special election on January 31, 2012, winning by a 14-point margin.Prior to her election to Congress, Bonamici resigned from the Oregon Senate on November 21, and was replaced by Elizabeth Steiner Hayward in December.2012 regular electionIn November 2012, Bonamici won re-election to her first full term with over 60% of the vote.Legislation On July 31, 2014, Bonamici introduced the Tsunami Warning, Education, and Research Act of 2014 (H.R. 5309; 113th Congress) into the House. The bill would authorize the National Oceanic and Atmospheric Administration (NOAA) to spend $27 million a year for three years on their on-going tsunami warning and research programs.Bonamici said \"the coastlines of the United States already play an integral role in the economic prosperity of this country and we must strengthen their preparedness and resiliency so they can continue to play that role going forward.\" She added that this bill \"will improve the country's understanding of the threat posed by tsunami events\" because it will \"improve forecasting and notification systems, support local community outreach and preparedness and response plans, and develop supportive technologies.\"Committee assignments & Caucuses Committee on Science, Space and TechnologySubcommittee on Environment (Ranking Member)Subcommittee on SpaceCommittee on Education and the WorkforceSubcommittee on Higher Education and Workforce TrainingSubcommittee on Workforce ProtectionsCongressional STEAM CaucusCongressional Progressive Caucus.Congressional Arts CaucusCongressional Asian Pacific American Caucus", "Personal life": "She is married to Michael H. Simon, a federal judge. They have two children, Andrew and Sara. Bonamici was raised Episcopalian and Unitarian, and now attends synagogue with her husband, who is Jewish, and their children.", "introduction": "Suzanne Marie Bonamici /ˌbɒnəˈmiːtʃi/ (born October 14, 1954) is an American politician from Oregon. A member of the Democratic Party, she is the U.S. Representative for the state's 1st congressional district and was first elected in a special election on January 31, 2012. The district includes most of Portland west of the Willamette River, as well as all of Yamhill, Columbia, Clatsop, and Washington counties.\nBonamici previously represented District 17 in the Oregon State Senate from 2008 to 2011. She was first elected to the Oregon House of Representatives in 2006.\n\n", "code": "01"}, "personal": {"Born": "Suzanne Marie Bonamici (1954-10-14) October 14, 1954 (age63)Detroit, Michigan, U.S.", "Political party": "Democratic", "Spouse(s)": "Michael Simon", "Children": "2", "Education": "Lane Community CollegeUniversity of Oregon (BA, JD)"}, "timeline": {"Member of the US House of Representativesfrom Oregon's 1st district": {"date": "Assumed office January 31, 2012", "Preceded by": "David Wu"}, "Member of the Oregon Senatefrom the 17th district": {"date": "In officeMay 19, 2008– November 21, 2011", "Preceded by": "Brad Avakian", "Succeeded by": "Elizabeth Steiner Hayward"}, "Member of the Oregon House of Representativesfrom the 34th district": {"date": "In officeJanuary 2, 2007– May 19, 2008", "Preceded by": "Brad Avakian", "Succeeded by": "Chris Harker"}, "code": "01"}, "code": "B001278", "type": "4", "party": "Democrat", "description": "rank-and-file Democrat", "economic": "-0.39", "social": "-0.4", "leadership": "0.42"}