{"name": "Thom.Tillis", "picture": "T000476.jpg", "detail": {"Early life and education": "Tillis was born in Jacksonville, Florida, the son of Margie and Thomas Raymond Tillis, a boat draftsman. He was the oldest boy among six children with three older sisters. His family moved around 20 times when he was in school, and Tillis never attended the same school in back-to-back years, living in New Orleans and Nashville, among other places.In high school, Tillis was elected student body president and graduated near the top of his class. In 1978,  Tillis left home to get a job, telling The Charlotte Observer that he and his siblings \"weren't wired to go to college.\" He would eventually go back to school, attending Chattanooga State Community College and receiving a bachelor's degree in technology management from the University of Maryland University College in 1997.", "Business career and local politics (1980–2003)": "Tillis's first major job after high school was at Provident Life and Accident Insurance Co in Chattanooga, Tennessee, helping computerize records in conjunction with Wang Laboratories, a computer company in Boston. Wang eventually hired Tillis to work in their Boston office. He spent two and a half years there, before being transferred back to Chattanooga, and then Atlanta.In 1990, he was recruited to work for accounting and consulting firm PriceWaterhouse. He enrolled in an extension program, graduating from the University of Maryland University College in 1997, with a B.S. in technology management to meet job requirements. His client was Charlotte's NationsBank Corp, which in 1998 became Bank of America Corp. In 1998, Tillis moved his wife and two children from Fairfax, Virginia to Cornelius, North Carolina, a northern suburb of Charlotte, saying he was \"sick of commuting\".PricewaterhouseCoopers sold its consulting arm to IBM in 2002; Tillis retained the title of \"partner\" when joining IBM, as did many PricewaterhouseCoopers consulting partners, although such a position had not previously existed at IBM. Tillis began his political career in 2002 in Cornelius, where he lived, as he pushed for a local bike trail and was elected to the town's park board. He ran for town commissioner in 2003 and tied for second place in the voting.", "North Carolina House of Representatives": "After a two-year term as town commissioner, Tillis ran for the General Assembly in 2006. He defeated incumbent John W. Rhodes in the Republican primary, and went on to win the election, since no other candidate had filed in the general election. Tillis ran unopposed in three subsequent reelection bids, in 2008, 2010 and 2012. Tillis formally left IBM in 2009. He was campaign chairman for the House Republican Caucus in 2010. In that year's elections, Republicans won a majority in the House for the first time in almost 20 years. The House Republican Caucus selected Tillis to be the next Speaker over Paul Stam. When the legislative session opened on January 26, 2011, he was elected the fifth Republican Speaker of the North Carolina House in the state's history.In May 2011, Governing magazine named Tillis one of 17 \"GOP Legislators to Watch\" selected on the basis of such perceived qualities as leadership, ambition, and political potential. In the 2012 elections, the Republican Party added nine seats to its majority, winning 77 of the 120 House seats. In January 2013, Tillis was unanimously re-elected Speaker of the House by the Republican Caucus. The state house overseen by Tillis enacted a complete restructuring of the state's tax code, including a reduction of personal and business income taxes, elimination of the estate tax, and a cap on the gas tax. It passed legislation to sunset existing state rules and regulations and limit new regulations to a ten-year duration, unless renewed by the state government.", "US Senate": "Committee assignments Committee on Agriculture, Nutrition and ForestrySubcommittee on Jobs, Rural Economic and Energy InnovationSubcommittee on Livestock, Dairy, Poultry, Marketing and Agriculture SecuritySubcommittee on Nutrition, Specialty Crops, Food and Agricultural ResearchCommittee on Armed ServicesSubcommittee on Emerging Threats and CapabilitiesSubcommittee on PersonnelSubcommittee on SeapowerCommittee on the JudiciarySubcommittee on Antitrust, Competition Policy and Consumer RightsSubcommittee on the ConstitutionSubcommittee on Immigration and The National InterestSubcommittee on Privacy, Technology and the LawCommittee on Veterans' AffairsSpecial Committee on Aging2014 election In keeping with an earlier promise that he would serve only four terms (eight years) in the state house, Tillis announced that he would not run for re-election to the legislature again. Instead, he chose to run for U.S. Senate in the 2014 election against first-term incumbent Democrat Kay Hagan. In Tillis's Republican primary bid, his candidacy had received endorsements from former Florida Governor Jeb Bush, then-North Carolina Governor Pat McCrory, and former Presidential candidate Mitt Romney. Tillis's primary candidacy was also endorsed by the U.S. Chamber of Commerce.During his primary election campaign, Tillis skipped four candidate forums in an effort to avoid lesser known rivals in the crowded primary, and in attempt to cement his image as the \"inevitable nominee\". However, he participated in several televised debates with the four major Republican primary candidates. According to the National Journal, Tillis was criticized during the Republican primary campaign for raising money for his Senate campaign from groups lobbying the state house, which is allowed because he is running for federal office.In the Republican primary election on May 6, 2014, Tillis captured the Republican nomination for his U.S. Senate candidacy by a comfortable margin – 45.68% to his nearest challenger's 27.15%.Tillis was announced the winner of the close 2014 Senate race at approximately 11:30 PM on November 4, 2014. Tillis carried 48.82 percent of the vote, the lowest winning total in North Carolina history for a U.S. Senate candidate.During the campaign, Tillis paid $30,000 to Cambridge Analytica, a data analysis firm. The North Carolina Republican Party paid the firm $150,000 during the campaign. Cambridge Analytica touted its role in the Tillis 2014 campaign on its website and listed the race as a case study. Tillis paid $25,000 to Cambridge Analytica in 2015. In March 2018, Facebook banned Cambridge Analytica following reports that the firm had illicitly obtained information about Facebook users. Questions were raised as to whether the Tillis campaign benefitted from Cambridge Analytica's illicit activities and whether Cambridge Analytica's role in the 2014 Senate race was important enough to swing the close election.Positions Immigration Following President Trump's cancellation of President Obama's Deferred Action for Childhood Arrivals (\"DACA\") executive order, Tillis announced his intention to propose legislation to allow illegal immigrants, who arrived before January 1, 2012 and are under the age of 16 (\"Dreamers\"), legal status and allow them to remain in the US for five years with a pathway to citizenship.  The proposal would grant high school graduates without a serious criminal record conditional immigration status for a five-year period. During that time, if they earn a higher-education degree, serve in the military or stay employed, they could apply for permanent residency and, eventually, citizenship.  About 2.5 million DREAMers would be eligible.Environment In 2014, Tillis said that climate change is not a fact, and in 2015, voted against an amendment that said human activity is a contributor.In 2017, Tillis was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement. According to the Center for Responsive Politics, Tillis has received over $260,000 from oil, gas and coal interests since 2012.As of 2018, Tillis now says that human activity is in fact a contributing factor to climate change. Gun law Tillis has an \"A+\" rating from the National Rifle Association (NRA). In 2014, the NRA endorsed him for his senate run. As of 2017, Tillis was the fourth most funded recipient by the NRA, totaling $4,418,012 in donations.In response to the 2016 Orlando nightclub shooting, Tillis voted for two Republican-backed bills, neither which passed the senate. One bill would have expanded background checks and the other would have delayed gun sales for 72 hours for individuals on the terrorist watchlist while they were investigated by federal authorities. He also rejected two Democrat-sponsored bills, including the Feinstein Amendment which would have banned any individual on the terrorist watchlist from purchasing a gun and a second that would have required background checks at gun shows and during online sales.LGBT rights Tillis voted in favor of an amendment in 2015 that would allow same-sex married couples living in states that don't recognize same-sex marriage to have equal access to Social Security and veterans benefits. Commenting on Trump's recent ban on transgender individuals from serving in the military, Tillis said \"I would have significant objections to any proposal that calls for a specific group of American patriots currently serving in uniform to be removed from the military.\"Net neutrality Thom Tillis opposes net neutrality.Special Counsel In April 2018, following the FBI raid on the hotel room and offices of Trump's personal attorney, Michael Cohen, Tillis, together with Cory Booker, Chris Coons, and Lindsey Graham, introduced new legislation to \"limit President Trump's ability to fire special counsel Robert Mueller\". Termed the Special Counsel Independence and Integrity Act, the legislation would allow any special counsel, in this case Mueller, receive an \"expedited judicial review\" in the 10 days following being dismissed to determine if said dismissal was suitable. If negative, the special counsel would be reinstated. At the same time, according to The Hill, the bill would \"codify regulations\" that a special counsel could only be fired by a senior Justice Department, while having to provide reasons in writing.", "Personal life": "Tillis, and his wife Susan, currently live in Cornelius, North Carolina, and have two children, Lindsay and Ryan. Tillis had previously been twice married to and divorced from a girlfriend from high school.On May 17, 2017, while participating in a three-mile race at Anacostia Park in Washington D.C., Tillis collapsed and was taken to the hospital. Tillis later sent a video from Twitter announcing he was doing fine.", "Electoral history": "NC House of Representatives Primary ElectionYearRepublicanVotesPctRepublicanVotesPct2006John W. Rhodes1,06137%Thom Tillis1,80563%NC House of Representatives General ElectionYearDemocraticVotesPctRepublicanVotesPct2006No CandidateThom Tillis14,479100%2008No CandidateThom Tillis38,875100%2010No CandidateThom Tillis23,540100%2012No CandidateThom Tillis27,971100%2014 North Carolina U.S. Senate Republican primary electionPartyCandidateVotes%+%RepublicanThom Tillis223,17445.68%RepublicanGreg Brannon132,63027.15%RepublicanMark Harris85,72717.55%RepublicanHeather Grant22,9714.70%RepublicanJim Snyder9,4141.93%RepublicanTed Alexander9,2581.89%RepublicanAlex Lee Bradshaw3,5280.72%RepublicanEdward Kryn1,8530.38%2014 North Carolina U.S. Senate electionPartyCandidateVotes%±RepublicanThom Tillis 1,423,259 7001488200000000000♠48.82%  4.64 DemocraticKay Hagan1,377,6517001472600000000000♠47.26% 5.39LibertarianSean Haugh109,1007000374000000000000♠3.74% 0.62OtherWrite-ins5,2716999180000000000000♠0.18% 0.14Majority45,6087000156000000000000♠1.56%Turnout2,915,281Republican gain from DemocraticSwing 5.0", "introduction": "Thomas Roland Tillis (born August 30, 1960) is an American businessman and politician who is the junior United States Senator from North Carolina, serving since 2015.  A member of the Republican Party, he was previously the Speaker of the North Carolina House of Representatives.\nBorn in Jacksonville, Florida, Tillis is a graduate of Chattanooga State Community College and University of Maryland University College.  Prior to entering politics, he worked a business and technology consultant at PriceWaterhouse and IBM.  In 2006, Tillis was elected to the North Carolina House of Representatives representing the 98th district, which included parts of Mecklenburg County.  In 2011 he was elected Speaker of the North Carolina House of Representatives.\nIn 2014, Tillis was a candidate for United States Senate.  After defeating seven opponents in the Republican primary, he went on to defeat Democratic incumbent Kay Hagan in the general election.\n\n"}, "personal": {"Born": "Thomas Roland Tillis (1960-08-30) August 30, 1960 (age58)Jacksonville, Florida, U.S.", "Political party": "Republican", "Spouse(s)": "Susan Tillis", "Children": "2", "Education": "Chattanooga State Community CollegeUniversity of Maryland University College (BA)"}, "timeline": {"United States Senatorfrom North Carolina": {"date": "Assumed office January 3, 2015Serving with Richard Burr", "Preceded by": "Kay Hagan"}, "Speaker of the North Carolina House of Representatives": {"date": "In officeJanuary 26, 2011– January 3, 2015", "Preceded by": "Joe Hackney", "Succeeded by": "Tim Moore"}, "Member of the North Carolina House of Representativesfrom the 98th district": {"date": "In officeJanuary 2007– January 3, 2015", "Preceded by": "John Rhodes", "Succeeded by": "John R. Bradford III"}}, "code": "T000476", "type": "3", "party": "Republican", "description": "moderate Republican follower", "economic": "0.43", "social": "-0.01", "leadership": "0.22"}