{"name": "Tom.Cole", "picture": "C001053.jpg", "detail": {"Early life, education, and educating career": "Cole was born in Shreveport, Louisiana, the son of Helen Te Ata (née Gale) and John D. Cole. He is a fifth-generation Oklahoman, having been raised in Moore, Oklahoma. He graduated from Grinnell College in 1971 with a B.A. in history. His postgraduate degrees include an M.A. from Yale University (1974) and a Ph.D. from the University of Oklahoma (1984), both in British history. Cole's Ph.D. thesis was entitled Life and Labor in the Isle of Dogs: The Origins and Evolution of an East London Working-Class Community, 1800–1980. Cole did research abroad as a Thomas J. Watson Fellow and was a Fulbright Fellow (1977–78) at the University of London. He was a college professor in history and politics before becoming a politician.", "Early political career": "Following his mother Helen, who served as a state representative and senator, Cole served in the Oklahoma Senate from 1988 to 1991, resigning mid-term to become Executive Director of the National Republican Congressional Committee. From 1995 to 1999, he was Oklahoma's Secretary of State under Governor Frank Keating, and assisted with the recovery efforts following the 1995 Oklahoma City bombing. He resigned to become chief of staff to the Republican National Committee. He also served as Chairman of the Oklahoma Republican Party for much of the 1980s.Cole has been heavily involved in national politics as well, having served both as Executive Director of the NRCC and as Chief of Staff of the Republican National Committee (RNC).Cole spent two years working as a paid consultant for the United States Chamber of Commerce, but his primary involvement in politics was as a political consultant for candidates. Along with partners Sharon Hargrave Caldwell and Deby Snodgrass, his firm (Cole, Hargrave, Snodgrass and Associates) played a large part in the reconstruction of Oklahoma's political landscape, and backed a number of candidates that took office during the Republican Revolution of 1994. Among their clients have been Keating, J.C. Watts, Tom Coburn, Frank Lucas, Mary Fallin, Wes Watkins, Steve Largent, former Mississippi congressman Chip Pickering, and Hawaii governor Linda Lingle.", "US House of Representatives": "Elections During his initial campaign for the House of Representatives in 2002, Cole received the endorsement of Watts, the popular outgoing congressman. This helped him win a hard-fought general election over Democratic nominee and former Oklahoma State Senator Darryl Roberts. Cole subsequently won easy re-election campaigns in 2004, 2006, 2008, 2010, 2012, 2014 and 2016.Tenure Following the 2006 election cycle, the members of the House Republican Conference elected Cole to the post of NRCC Chairman, placing him in charge of national efforts to assist Republican candidates for Congress.His voting record during his nine years in the House marks Cole as a solid conservative with occasional libertarian sympathies. He has consistently voted anti-abortion and pro-business positions, and established himself as a supporter of free trade, gun rights, the military, veterans, and American Indian issues. He favors loosening immigration restrictions and imposing stricter limits on campaign funds.  In 2012, he sponsored H.R. 5912 which would prohibit public funds from being used for political party conventions.  This legislation passed the House in September but awaits action by the Senate.Cole has consistently voted against positions supported by lobbies for senior citizens, labor unions, and teachers' unions. However, he was critical in brokering protections for DOD civilian workers.In June 2013, after another failure of the United States farm bill in Congress, Cole called the failure of the legislation inexcusable. His district in Oklahoma includes some of the state's farming communities, and if the Farm Bill passed, it would have saved $40 billion over a ten-year period.As Chairman of the House Appropriations Subcommittee on the Legislative Branch, Cole was responsible for introducing the Legislative Branch Appropriations Act, 2015 (H.R. 4487; 113th Congress). The bill would appropriate $3.3 billion to the legislative branch for FY 2015, which is approximately the same amount it received in FY 2014. According to  Cole, the bill meets its goals \"in both an effective and efficient manner, and has done so in a genuinely bipartisan, inclusive and deliberative fashion.\"In 2013, Cole introduced the Home School Equity Act for Tax Relief. The bill would allow some homeschool parents to take tax credits for purchasing classroom materials.Cole expressed his intention in 2018 to push his Tribal Labor Sovereignty Act into the spending bill as an omnibus. The bill would \"make clear that the National Labor Relations Board has no jurisdiction over businesses owned and operated by an Indian tribe and located on tribal land.\"Cole was ranked as the 91st most bipartisan member of the U.S. House of Representatives during the 114th United States Congress (and the most bipartisan member of the U.S. House of Representatives from Oklahoma) in the Bipartisan Index created by The Lugar Center and the McCourt School of Public Policy that ranks members of the United States Congress by their degree of bipartisanship (by measuring the frequency each member's bills attract co-sponsors from the opposite party and each member's co-sponsorship of bills by members of the opposite party).2016 House Speakership election In the contest for House Speaker that followed the resignation of John Boehner Cole supported the claims of Paul Ryan:\"Anyone who attacks Paul Ryan as being insufficiently conservative is either woefully misinformed or maliciously destructive...Paul Ryan has played a major role in advancing the conservative cause and creating the Republican House majority. His critics are not true conservatives. They are radical populists who neither understand nor accept the institutions, procedures and traditions that are the basis of constitutional governance.\"Committee membership As of the 115th United States Congress, Tom Cole is a member of the following U.S. House committees:Committee on AppropriationsSubcommittee on Labor, Health and Human Services, Education, and Related Agencies (Chair)Subcommittee on DefenseSubcommittee on Interior, Environment, and Related AgenciesCommittee on the BudgetUnited States House Committee on RulesPolitical stances Cole supported President Donald Trump's 2017 executive order to impose a temporary ban on entry to the U.S. to citizens of seven Muslim-majority countries. He stated that \"It is fair and appropriate to debate the merits of President Trump's executive order and its initial implementation. But it is inappropriate to engage in demagogic, inflammatory, inaccurate and reckless rhetoric that is designed to create and exploit a political issue rather than address a real threat to our security. I fear that is exactly what we are seeing from many of the President's critics.\"", "Electoral history": "Oklahoma's 4th congressional district: Results 2002–2016YearRepublicanVotesPctDemocratVotesPct3rd PartyPartyVotesPct2002Tom Cole106,45253.83%Darryl Roberts91,32246.17%2004Tom Cole198,98577.77%(no candidate)Charlene K. BradshawIndependent56,86922.23%2006Tom Cole118,26664.61%Hal Spake64,77535.39%2008Tom Cole180,08066.02%Blake Cummings79,67429.21%David E. JoyceIndependent13,0274.78%2010*Tom Cole32,58977.26%(no candidate)RJ HarrisRepublican9,59322.74%2012Tom Cole176,56167.89%Donna Marie Bebo71,15527.60%RJ HarrisIndependent11,7254.51%2014Tom Cole117,72170.80%Bert Smith40,99824.66%Dennis B. JohnsonIndependent7,5494.54%2016Tom Cole203,94269.64%Christina Owen76,30826.08%Sevier WhiteLibertarian12,5484.28%In 2010, no Democrat or independent candidate filed to run in OK-4.  The results printed here are from the Republican primary, where the election was decided.", "Personal life": "Cole and his wife, Ellen, have one son, Mason. He is a member of the United Methodist Church and lives in Moore.Cole has said, \"I was raised to think of myself as Native American and, most importantly, as Chickasaw.\"Cole has said that a great-aunt of his was the Native American storyteller Te Ata. Describing his heritage, he said his \"mother Helen Cole was...extraordinarily proud of [their] Native American history and was, frankly, the first Native American woman ever elected to state senate in Oklahoma.\"Cole sits on the Smithsonian Institution Board of Regents and the National Fulbright Association.Cole is featured in the play Sliver of a Full Moon by Mary Kathryn Nagle for his role in the re-authorization of the Violence Against Women Act in 2013.", "introduction": "Thomas Jeffery Cole (born April 28, 1949) is the U.S. Representative for Oklahoma's 4th congressional district, serving since 2003. He is a member of the Republican Party. He is a Deputy Majority Whip. The chairman of the National Republican Congressional Committee (NRCC) from 2006 to 2008, he was, during his tenure, the fourth-ranking Republican leader in the House. As of 2015, Cole – a member of the Chickasaw Nation – is one of only two registered Native Americans in Congress (the other being fellow Oklahoman Markwayne Mullin).\n\n", "code": "04"}, "personal": {"Born": "Thomas Jeffery Cole (1949-04-28) April 28, 1949 (age69)Shreveport, Louisiana, U.S.", "Political party": "Republican", "Spouse(s)": "Ellen Cole", "Children": "1 son", "Education": "Grinnell College (BA)Yale University (MA)University of Oklahoma (PhD)"}, "timeline": {"Member of the US House of Representativesfrom Oklahoma's 4th district": {"date": "Assumed office January 3, 2003", "Preceded by": "J. C. Watts"}, "26th Secretary of State of Oklahoma": {"date": "In officeJanuary 9, 1995– March 16, 1999", "Governor": "Frank Keating", "Preceded by": "Glo Henley", "Succeeded by": "Michael Hunter"}, "code": "04"}, "code": "C001053", "type": "4", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.34", "social": "0.36", "leadership": "0.47"}