{"name": "Vicente.González", "picture": "G000581.jpg", "detail": {"Early life": "Gonzalez was born in Corpus Christi in 1967. Gonzalez grew up in a working class family, often working odd jobs and displaying entrepreneurial skills at a young age[citation needed]. He went to Roman Catholic School in Corpus Christi, Texas, for part of his young life and eventually dropped out of high school during his junior year. He went onto obtain a G.E.D. and returned to school by enrolling at Del Mar Junior College where he received an Associate’s Degree in Banking and Finance.He then received, in 1992, his Bachelor of Science degree in Aviation Business Administration from the Embry–Riddle Aeronautical University on the Corpus Christi Naval Air Station. After high school and throughout college, Congressman Gonzalez traveled to almost 100 countries around the world.In 1996, he then graduated from Texas Wesleyan University School of Law (now known as Texas A&M University School of Law,) where he obtained his Juris Doctor. While a law student, he interned for the United States Congress. González trained in Negotiation at Harvard Law School. He founded his law firm, V. Gonzalez & Associates, in 1997. He is a member of the bar associations of Texas and New York.As an attorney, Gonzalez recovered millions of dollars for businesses, homeowners and public schools throughout the country[citation needed]. Prior to his election to the U.S. House of Representatives, Gonzalez was a successful plaintiffs attorney in Texas and New York.[citation needed] He is eligible to practice law in Texas, New York and before the U.S. Supreme Court.[citation needed]", "US House of Representatives": "2016 campaign González declared his candidacy for the 2016 elections for the United States House of Representatives in Texas's 15th congressional district after Rubén Hinojosa, the incumbent representative, announced he would not run for reelection. He won the Democratic Party nomination, defeating Sonny Palacios in the runoff election. He defeated Republican Tim Westley in the November general election, winning 57.3% of the vote to Westley's 37.7%.Tenure Rep. González was sworn in January 3, 2017. At the start of his career in Congress, he was appointed to the House Financial Services Committee the Blue Dog Coalition, and the Problem Solvers Caucus. In June 2017, Congressman Gonzalez announced the formation of the Congressional Oil & Gas Caucus and will be serving as its chair. On November 5, 2017, the day of the Sutherland Springs church shooting, González twice incorrectly named the shooter as \"Sam Hyde\", a comedian who is often jokingly referred to as the perpetrator on social media. González said that he had been given that name by officials. During his first six months in office, Congressman Gonzalez brought Democratic Leader Nancy Pelosi to the Rio Grande Valley. He was also the first Texas Democrat and first Latino in Congress to be invited by President Donald Trump to a private dinner at the White House.Committee assignments Committee on Financial ServicesSubcommittee on Capital Markets, Securities and InvestmentSubcommittee on Housing and InsuranceSubcommittee on Oversight and InvestigationsCaucus memberships Congressional Hispanic Caucus", "Personal life": "González's wife, Lorena, is a former teacher and school administrator from McAllen, TX. His father was a merchant marine who served in the Korean War.", "introduction": "Vicente Gonzalez (/vɪˈsɛnteɪ/; born September 4, 1967) is an American attorney and politician who is the United States Representative of Texas's 15th congressional district. He won the 2016 general election and took office on January 3, 2017.\n\n", "code": "15"}, "personal": {"Born": " (1967-09-04) September 4, 1967 (age51)Corpus Christi, Texas, U.S.", "Political party": "Democratic", "Spouse(s)": "Lorena Saenz", "Education": "Del Mar CollegeEmbry–Riddle Aeronautical University (BA)Texas Wesleyan University (JD)"}, "timeline": {"Member of the US House of Representativesfrom Texas's 15th district": {"date": "Assumed office January 3, 2017", "Preceded by": "Rubén Hinojosa"}, "code": "15"}, "code": "G000581", "type": "4", "party": "Democrat", "description": "centrist Democratic follower", "economic": "-0.36", "social": "0.64", "leadership": "0.06"}