{"name": "Ami.Bera", "picture": "B001287.jpg", "detail": {"Early life, education, and career": "Bera's father, Babulal Bera, immigrated to the United States from India  in 1958. Two years later, Babulal Bera was joined by his wife, Kanta. Ami Bera was born in Los Angeles and raised in the Orange County city of La Palma. Bera's parents are from Rajkot, Gujarat and he can understand Gujarati.He has a bachelor's degree in biological sciences from the University of California at Irvine, also earning his Doctor of Medicine degree there in 1991. He served as associate dean for admissions at the UC Davis School of Medicine and later served as the chief medical officer for the County of Sacramento..  Further Details of his professional employment are as follows: Clinical Professor, University of California Davis School of Medicine, 2005-2012Former Chief Resident, Internal Medicine, California Pacific Medical CenterPhysician, MedClinic Medical GroupAssociate Dean, Admissions, University of California Davis School of Medicine, 2004-2007Chief Medical Officer, County of Sacramento, 1999-2004Medical Director, Care Management, Mercy Healthcare for Sacramento, 1997-1999", "US House of Representatives": "Elections 2010 Bera challenged three-term Republican incumbent Dan Lungren in the general election for California's 3rd congressional district. He ran unopposed for the Democratic nomination in California's 3rd congressional district. He raised more money than incumbent Dan Lungren for the five quarters through mid-2010, making him the only Democratic challenger with more cash than a sitting Republican member of the House. Bera was one of 17 candidates the Democratic Congressional Campaign Committee targeted to take over Republican-held or open seats in 2010.Lungren was the only incumbent Republican whose race was rated as a \"tossup\" by CQ Politics, but was later rated back to \"Lean GOP\" in the final days before the election; and the district was considered competitive by both parties. Polling by the liberal website Daily Kos in September 2010 showed Lungren leading Bera, 46%–38%. Bera cited health care, education and economic recovery among his top legislative priorities. In November, Lungren won re-election, defeating Bera 51%–43%.In 2010, after Bera accepted a $250 donation from Basim Elkarra, Executive Director of the Sacramento chapter of theCouncil on American-Islamic Relations (CAIR), the California Republican Party called on him to return the money. Bera returned the money after these concerns were raised.2012 Bera announced a rematch against Lungren in 2012. The district had been renumbered as the 7th District, and made somewhat more compact. It lost all of its territory outside of Sacramento County, making it slightly friendlier to Democrats.On November 13, 2012, Bera attended freshman orientation as congressman-elect while votes were still being counted. Candidates in these tight races sometimes attend the orientation by the Committee on House Administration, which was overseen by Bera's opponent, Dan Lungren.On November 15, 2012, the AP called the race for Bera, who won 51%–49%.2014 Bera ran for re-election in 2014, facing former Republican congressman Doug Ose, who had represented what was then the 3rd from 1999 to 2005, in the general election. The Rothenberg Political Report rated the 7th district \"Lean Democratic,\" but The Sacramento Bee reported that Bera was \"viewed by both parties as one of the most vulnerable Democrats in the country.\" Bera was a member of the Democratic Congressional Campaign Committee's Frontline program, designed to support vulnerable candidates. In June 2014, Politico reported that the DCCC planned to support Bera with $1.7 million in ads throughout fall 2014, and the House Majority PAC, a political action committee designed to support Democratic candidates, reserved $200,000 for late-election television ads.The Hill reported that Bera's campaign received donations from parents of another Democratic candidate, Kevin Strouse, only to have Bera's parents then donate a similar amount to Strouse's campaign. According to The Philadelphia Inquirer, \"The donations appear legal, campaign finance experts say, though two said any agreement among the parents to trade donations could be viewed as an attempted end run around contribution limits.\" In May 2016, Bera's father, Babulal, pleaded guilty to two felony counts of elections fraud.No Labels co-founder and former George W. Bush advisor Mark McKinnon said of Bera, \"He is the most important member of our Problem Solvers – of the entire group. He stepped up immediately as a freshman to take a leadership position. He was out early advocating on our big issues like No Budget, No Pay.”In response to a poll, from the American Sikh Committee to Evaluate Congressional Candidates, Bera did not answer two questions relating to the Indian government's part in the 1984 anti-Sikh riots. Instead, he noted that in 2005, the former Indian Prime Minister, Manmohan Singh, had publicly apologized to the Sikh community for the government's role. Bera also stated that, while it was a tragedy, he was more focused on the treatment of Sikhs in the U.S. and could not dictate how the Indian government should approach the matter. In response, some members of the Sikh-American community publicly withdrew their support for Bera. But with the majority of the Sikh-American population coming from outside of Bera's district, the advocates acknowledged that they were unlikely to affect the outcome of the race.On election night, Bera \"was down by more than 3,000 votes...but came back to win after all the absentee and mail-in ballots were in.\" In the end, he won 50.4% of the vote to Ose's 49.6%.2016 Bera ran for re-election in 2016. He faced Republican Scott Jones, the sheriff of Sacramento County, in the general election. In January 2016, the Elk Grove-South County Democratic Club, Bera's home club, voted against endorsing him, citing concerns with Bera's record on trade and Syrian refugees.Bera defeated Jones in the general election, winning 51% of the vote to Jones' 49%. The margin of victory was 4,802 votes.Bera's 2016 race was \"one of the nastiest Congressional races with allegations and insinuations being bandied back and forth\" and was also \"one of the last two House races in the entire nation yet to be called.\" As he began his third term, he was joined by three new Indian-American House members – Raja Krishnamoorthi from Illinois, Pramila Jayapal from Washington state, and Ro Khanna from California. Silicon Valley entrepreneur M. R. Rangaswami said Bera \"was the first Indian American to be in Congress in a long time and now can actually lead a Caucus...able to shepherd Pramila, Raja and Ro and get them going during their freshman year.\"Since the 2016 elections, which saw the election to the House of three other Indian-Americans and to the Senate of the first Indian-American Senator, Kamala Devi Harris, Bera has been described as the \"Godfather\" of Indian-Americans on Capitol Hill.During the 2016 Congressional race the Bera also failed to gain endorsement from the democrat party as well as the Sikh PAC since 2014 after he as refused to acknowledge that the Indian government was responsible for the 1984 slaughter of thousands of SikhsTenure In an interview covered in the Elk Grove Citizen, Bera said his first year in Congress \"was about being focused here in the district but also building my reputation in Washington, D.C.\"In October 2013, Bera announced that he would give up his federal pay for the duration of the government shutdown. He also announced that in response to sequester cuts, he would donate 8.2% of his check each month to local organizations impacted by sequester cuts.In a 2015 op-ed supporting the Trans-Pacific Partnership in the Sacramento Bee, Bera copied several sentences from documents produced by the Business Roundtable and Third Way and from an Obama White House report. \"I don't know if this cut-and-paste job rises to the level of plagiarism,\" said Jason Stanford, a top official at the Coalition To Stop Fast Track, a labor-backed effort to pressure Democrats to vote against the White House on trade, \"but Congressman Bera sure comes across like someone whose spending more time listening to corporate lobbyists than speaking for the thousands of his constituents who have asked him not to vote for fast track.\" Steve Smith, a spokesman for the California Labor Federation, said, \"It's really unfortunate that Rep. Bera would rather parrot the talking points of corporate lobbyists and D.C. insiders than listen to folks in his own district who overwhelmingly oppose fast-tracking a critical trade deal that could lead to hundreds, if not thousands, of lost jobs in the Sacramento region.\" Bera later wrote an apology for copying the corporate line too closely.Political issues Health care In May 2013, Bera voted against repeal of the Patient Protection and Affordable Care Act.Syrian refugees On November 19, 2015, Bera voted for HR 4038, legislation that would effectively halt the resettlement of refugees from Syria and Iraq to the United States.Pakistan and terrorism In 2016, Bera called on the Pakistani government \"to take responsibility and start cracking down\" on terrorists based in its country, and praised the Indian government for its \"restraint\" in the face of a recent attack on an Indian air-force based by Pakistan-based militants.Indian-U.S. relations After a June 2016 speech by Indian prime minister Narendra Modi to a joint session of the U.S. Congress, Bera exulted, calling it \"the perfect speech for this moment in time\" and echoing his view that India was becoming \"a global leader and a global partner with the United States.\" \"As an Indian American and a Gujarati American,\" Bera said, \"I was thrilled by the prime minister's speech.\"Committee assignments Committee on Foreign AffairsSubcommittee on Africa, Global Health, and Human RightsSubcommittee on Asia and the PacificCommittee on Science, Space and TechnologySubcommittee on EnvironmentSubcommittee on Space (Ranking Member)In February 2017, Bera was elected ranking member of the House space subcommittee by House Democrats. His district includes a major Aerojet Rocketdyne facility, located east of Sacramento.Caucus memberships American Sikh Congressional CaucusNew Democrat CoalitionCongressional Asian Pacific American Caucus", "Personal life": "Bera and his wife, Janine Bera, have one child. They reside in Elk Grove, California.", "Electoral history": "California's 3rd congressional district election, 2010PartyCandidateVotes%RepublicanDan Lungren (incumbent)131,16950.1DemocraticAmi Bera113,12843.2American IndependentJerry L. Leidecker6,5772.5LibertarianDouglas Arthur Tuma6,2752.4Peace and FreedomMike Roskey4,7891.8Total votes261,938100.0Republican holdCalifornia's 7th congressional district election, 2012Primary electionPartyCandidateVotes%RepublicanDan Lungren (incumbent)63,58652.7DemocraticAmi Bera49,43341.0No party preferenceCurt Taras3,8543.2LibertarianDouglas Arthur Tuma3,7073.1Total votes120,580100.0General electionDemocraticAmi Bera141,24151.7RepublicanDan Lungren (incumbent)132,05048.3Total votes273,291100.0Democratic gain from Republican California's 7th congressional district election, 2014Primary electionPartyCandidateVotes%DemocraticAmi Bera (incumbent)51,87846.7RepublicanDoug Ose29,30726.4RepublicanIgor Birman19,43117.5RepublicanElizabeth Emken7,9247.1LibertarianDouglas Arthur Tuma1,6291.5No party preferencePhill A. Tufi8690.8Total votes111,038100.0General electionDemocraticAmi Bera (incumbent)92,52150.4RepublicanDoug Ose91,06649.6Total votes183,587100.0Democratic holdCalifornia's 7th congressional district election, 2016Primary electionPartyCandidateVotes%DemocraticAmi Bera (incumbent)93,50654.0RepublicanScott Jones79,64046.0Total votes173,146100.0General electionDemocraticAmi Bera (incumbent)152,13351.2RepublicanScott Jones145,16848.8Total votes297,301100.0Democratic holdCalifornia's 7th congressional district election, 2018Primary electionPartyCandidateVotes%DemocraticAmi Bera (incumbent)84,77651.7RepublicanAndrew Grant51,22131.2RepublicanYona Barash22,84513.9GreenRobert Christian \"Chris\" Richardson3,1831.9No party preferenceReginald Claytor2,0951.3Total votes164,120100.0General electionDemocraticAmi Bera (incumbent)RepublicanAndrew GrantMajorityTotal votes100.0", "introduction": "Amerish Babulal \"Ami\" Bera /ˈɑːmi ˈbɛrə/ (born March 2, 1965) is an American physician and politician who has been the U.S. Representative for California's 7th congressional district since 2013. He is a member of the Democratic Party. Bera was re-elected in both 2014 and 2016 in very competitive races. Bera is the only Unitarian Universalist in Congress. He is also a member of the New Democrat Coalition, a consortium of moderate Democrats.\n\n", "code": "07"}, "personal": {"Born": "Amerish Babulal Bera (1965-03-02) March 2, 1965 (age53)Los Angeles, California, U.S.", "Political party": "Democratic", "Spouse(s)": "Janine Bera", "Children": "1", "Education": "University of California, Irvine (BS, MD)"}, "timeline": {"Member of the US House of Representativesfrom California's 7th district": {"date": "Assumed office January 3, 2013", "Preceded by": "George Miller"}, "code": "07"}, "code": "B001287", "type": "4", "party": "Democrat", "description": "centrist Democratic follower", "economic": "-0.23", "social": "0.01", "leadership": "0.23"}