{'name': 'Angus.King', 'picture': 'K000383.jpg', 'detail': {'Early life, education, and early career': "King was born in Alexandria, Virginia, the son of Ellen Archer (née Ticer) and Angus Stanley King Sr., a lawyer. He graduated from Dartmouth College in 1966 with a B.A. and the University of Virginia School of Law in 1969 with a J.D. While a student at Dartmouth, King joined the Delta Upsilon social fraternity.Soon after graduation from Virginia, King entered private law practice in Brunswick, Maine. He was a staff attorney for Pine Tree Legal Assistance in Skowhegan. In 1972, he served as chief counsel to the U.S. Senate Subcommittee on Alcoholism and Narcotics. King served as a legislative assistant to Democratic U.S. Senator William Hathaway in the 1970s. He was also well-known statewide as a television host on public television. In 1973, when he was 29, King was diagnosed with an aggressive form of malignant melanoma. King has said he believes he survived cancer only because he had health insurance, and he has highlighted this experience when explaining his support for the Affordable Care Act.In 1975, King returned to Maine to practice with Smith, Loyd and King in Brunswick. In 1983, he was appointed vice president of Swift River/Hafslund Company, which developed alternative energy (hydro and biomass) projects in New England. In 1989, King founded Northeast Energy Management, Inc., a company that developed and operated electrical energy conservation projects. In 1994, he sold the company. In 2012, King's investments were valued at between $4.8 million and $22.5 million.", 'Governor of Maine': '1994 election In May 1993, King announced he would run for governor of Maine as an independent, as incumbent Governor John McKernan, a Republican, was term-limited and could not seek another term. King abandoned his lifelong affiliation with the Maine Democratic Party. "The Democratic Party as an institution has become too much the party that is looking for something from government," King explained to the Bangor Daily News a few weeks after he announced he would be running.The Republican nominee was Susan Collins, Commissioner of Professional and Financial Regulation under Governor John McKernan and a protégée of U.S. Senator William Cohen, and at the time relatively unknown to the electorate. The Democratic nominee was former Governor and U.S. Representative Joseph E. Brennan. It was Brennan\'s fifth campaign for governor.The general election was a highly competitive four-way race between King, Collins, Brennan, and Green Party nominee Jonathan Carter. King decided to invest early in television advertising during Maine\'s unusually early June primary, allowing him to emerge from the primary season on an equal footing with his rivals. King positioned himself as a businessman and a pragmatic environmentalist focused on job creation and education. The Washington Times described him as an idealist who "wants to slash regulations but preserve the environment; hold the line on taxes; impose work and education requirements on welfare recipients; experiment with public school choice and cut at least $60 million from the state budget." His opponents criticized him for flip-flopping. Collins argued King "presents different images, depending on who he is talking to. Angus has been a Democrat his whole life. In my opinion, he became an independent because he didn\'t think he could beat Joe Brennan in a primary. He\'s extremely smooth, articulate and bright, but he says different things to different groups."King narrowly won the November 8 election with 35% of the vote to Brennan\'s 34%, a margin of just 7,878 votes. (Collins received 23% of the vote and Carter 6%.) King won eight counties, Collins five and Brennan three. King\'s election as an independent was not unprecedented in Maine politics, as independent James B. Longley had been elected twenty years earlier.1998 election King won reelection to a second term in 1998 with 59% of the vote. He defeated Republican Jim Longley Jr. (the son of the former governor) (19%) and Democrat Thomas Connolly (12%). King\'s 59% was the highest a candidate had received since Brennan\'s 1982 reelection with 62% of the vote. Brennan\'s 1982 victory was also the last time before 1998 that a gubernatorial candidate had won a majority of the vote, and King\'s 1998 reelection remains the last time in a Maine gubernatorial election that the winner got a majority.Tenure This section of a biography of a living person needs additional citations for verification. Please help by adding reliable sources. Contentious material about living persons that is unsourced or poorly sourced must be removed immediately, especially if potentially libelous or harmful. (March 2018) (Learn how and when to remove this template message)During his tenure, King was the only governor in the United States unaffiliated with any political party. He was also one of only two governors nationwide not affiliated with either of the two major parties, the other being Jesse Ventura of Minnesota, who was elected in 1998 as a member of the Reform Party. The term of Connecticut\'s independent governor Lowell Weicker ended when King\'s began. In his book Independent Nation (2004), political analyst John Avlon describes all three governors as radical centrist thinkers.In 2002, King launched the Maine Learning Technology Initiative (MLTI) to provide laptops for every public middle-school student in the state, the first initiative of its kind in the nation.It met with considerable resistance due to its cost but was enacted by the Maine Legislature. On September 5, 2002, the state began the program with a four-year $37.2-million contract with Apple Inc. to equip all 7th- and 8th-grade students and teachers in the state with laptops.One of King\'s more controversial initiatives was a law requiring all school employees – including volunteers and contractors working in schools – to be fingerprinted by the Maine State Police, and to have background checks conducted on them. The program purported to protect children from abuse by potential predators working within the schools but met with strong resistance from teachers\' unions, which considered it a breach of civil liberties. The law\'s supporters claimed the fingerprinting requirement would stop previous offenders from coming to Maine to work in the schools and that if Maine did not have this requirement it would send a message to previous offenders that they could work in Maine without fear of being identified as child abusers. The law\'s critics maintained that there was no evidence of a problem with child abuse by school employees and the fingerprinting represented a violation of constitutional guarantees (a claim not supported by Supreme Court rulings on the issue). Fifty-seven teachers from across the state resigned in protest of the bill. The Maine Legislature voted to exempt current school employees, but King vetoed that in April 1997. The cost of the requirement was initially to be paid by the school employees themselves but the Legislature voted to have the state fund it.[citation needed]', 'Post-gubernatorial career (2003–2013)': 'The day after he left office in 2003, King, his wife, Mary Herman, and their two children, who were 12 and 9 at the time, embarked on a road trip in a 40-foot motor home to see America. Over the next six months, the family traveled 15,000 miles and visited 33 states before returning home in June 2003.In 2004 King became a lecturer at Bowdoin College. In 2009 and 2010 he taught a course there called "Leaders and Leadership".In 2007, King and Rob Gardiner, formerly of the Maine Public Broadcasting Network, formed Independence Wind, a wind energy company. In August 2009, Independence Wind along with joint venture partner Wagner Forest Management won Maine DEP approval for construction of a proposed $120-million, 22-turbine, utility-scale wind power project along a prominent mountain ridge in Roxbury, Maine. To avoid the appearance of a conflict of interest, King sold his share of the company after entering the 2012 U.S. Senate election. Of the project, King has said, "People who say wind is only an intermittent resource are looking for a one-shot solution. And my experience is that there are rarely silver bullets, but there is often silver buckshot. Wind is an adjunct source of energy. Ten percent, 20% can be very significant".', 'United States Senate': 'Elections On March 5, 2012, King announced that he was running for the U.S. Senate seat being vacated by Olympia Snowe. King said "hogwash" to allegations by some Republicans that he had cut a deal with Democrats to keep U.S. Rep. Chellie Pingree out of the race.King\'s Senate campaign came under scrutiny for posting a heavily edited newspaper profile of him to the campaign website.On November 6, 2012, King won the Senate race with 53% of the vote, beating Democrat Cynthia Dill and Republican Charlie Summers. The following week, King announced that he would caucus with Senate Democrats, explaining not only that it made more sense to affiliate with the party that had a clear majority, but that he would have been largely excluded from the committee process had he not caucused with a party. King said he had not ruled out caucusing with the Republicans if they took control of the Senate in 2014, but when that happened, he remained in the Democratic caucus.Tenure The website "That\'s My Congress" places King ideologically in the "mushy middle" of the Senate, while the website On the Issues considers him a "left-liberal".King supports reform of the Senate filibuster, noting that senators are no longer required to stand on the floor and speak during a filibuster. He also points out that the Constitution contains no 60-vote requirement to conduct business in the Senate.[non-primary source needed] Accordingly, in 2013 King voted in favor of the so-called nuclear option to eliminate the filibuster for most presidential nominees.[non-primary source needed]King opposes attempts by the U.S. House to cut $40 billion from the Supplemental Nutrition Assistance Program over ten years, fearing that it "would affect people in a serious way" and drive more people to soup kitchens and food banks. He supports the more modest Senate efforts to save $4 billion over the same period by closing loopholes.In 2014 King was chosen for the annual tradition of reading George Washington\'s Farewell Address to the Senate.King endorsed his colleague Susan Collins for reelection in the 2014 U.S. Senate election, calling her a "model Senator". At the same time, he endorsed Democratic Senator Jeanne Shaheen of New Hampshire for reelection. King also endorsed Eliot Cutler for governor in the 2014 election, as he had done in 2010, although on October 29, 2014, he switched his endorsement to Democratic nominee Mike Michaud. He also endorsed Democrat Emily Cain for the Maine\'s second congressional district election and Republican Senator Lamar Alexander of Tennessee in his reelection campaign.After Republicans gained the Senate majority in the November 4, 2014 election, King announced that he would continue to caucus with the Democrats. He cited his belief that it is good for a state to have a senator from each party, and that it is important to have a senator who caucuses with the same party as the President, saying, "In the end, who I caucus with is less important than who I work with." He further said, "It does not mean I have become a Democrat. It does not mean I have made a promise to anybody."In June 2015, King underwent a successful surgery that removed a cancerous prostate that had been detected in a screening and biopsy. The surgery did not change King\'s plans to run for reelection in 2018.Committee assignments Committee on Armed ServicesSubcommittee on PersonnelSubcommittee on SeapowerSubcommittee on Strategic ForcesCommittee on the BudgetCommittee on Energy and Natural ResourcesSubcommittee on EnergySubcommittee on National ParksSubcommittee on Water and PowerCommittee on Rules and AdministrationSelect Committee on IntelligenceCaucus memberships Afterschool Caucuses', 'Political positions': 'King has been described as a moderate Independent. He has called himself "neither a Democrat nor a Republican, but an American." The nonpartisan National Journal gave him a 2013 composite ideology score of 59% liberal and 41% conservative. His Crowdpac score is -4.3 (10 is the most conservative, -10 the most liberal), based on a data aggregation of his campaign contributions, votes, and speeches. King votes with the majority of Democrats about 90% of the time. In a study published by The Washington Post called "Party Unity scores," King only voted with the Democratic Party 43% of the time. He has also received higher approval ratings from liberal interest groups than conservative ones. King has been rated 89% by the average liberal interest group; the average conservative interest group rates him 14.5%. GovTrack ranks King among the more moderate members of the Senate, near the Senate\'s ideological center. According to Five ThirtyEight, which tracks Congressional votes, King had voted in line with President Trump\'s position on legislation 45.3% of the time as of July 2018.Economy King has called for the continuation of a tariff on imported athletic footwear and rejects discussing the potential removal of the tariff in trade talks with Vietnam, citing the potential loss of jobs at New Balance\'s Skowhegan and Madison factories in Maine. New Balance is the only remaining domestic manufacturer of athletic footwear. Also while governor, King vetoed a bill that would have raised Maine\'s minimum wage by 25 cents per hour.In 2017, King was a strong opponent of the Republican tax bill, criticizing its rushed passage on a party-line vote without hearings, saying: "The Bangor City Council would not amend the leash law using this process." King criticized the legislation for adding $1 trillion to the U.S. budget deficit over ten years and sought to return the bill to committee, but his proposal failed on a party-line vote.Foreign relations and national security King has voted to arm Syrian rebels who are fighting Syrian President Bashar al-Assad and ISIL militants.In 2015, King gave his support to the Joint Comprehensive Plan of Action, an international agreement with Iran. In voting against a "resolution of disapproval" in opposition to the agreement, King stated, "The current alternatives, if this agreement is rejected, are either unrealistic or downright dangerous."King favors the normalization of U.S.-Cuba relations. He opposes the U.S. embargo against Cuba, calling it an "antiquated" relic of the Cold War; in 2015, King introduced legislation to lift the embargo.As a member of the Senate Intelligence Committee, King is participating in its probe of Russia\'s interference in the 2016 U.S. elections. King said that the entire committee had "no doubt whatsoever" about the Kremlin\'s culpability in the meddling and described the cyberattacks as "a frontal assault on our democracy" that could present a long-term threat.Environment and energy King supports action to combat climate change and carries a laminated graph of increases in carbon dioxide in Earth\'s atmosphere to respond to climate change denialists. King was the only member of Congress to join a three-day U.S. Coast Guard fact-finding mission to Greenland in 2016, where he witnessed melting ice sheets firsthand and said that the impacts of climate change were "amazing and scary."King opposes oil drilling in the Arctic National Wildlife Refuge, believing the amount of oil is not worth the environmental risk of extracting it. He also believes that new developments in the energy field, such as fracking, should be subject to "all appropriate environmental safeguards to protect the American people and the American land."[non-primary source needed] King is opposed to the Keystone XL pipeline, stating that the "project will facilitate the transport of some of the world\'s dirtiest and most climate-harming oil through our country"[non-primary source needed] and has cast several votes against legislation authorizing its construction. King has said that he is "frustrated" with President Obama\'s delay in deciding whether to authorize construction, but that he opposes Congress legislating the approval or disapproval of a construction project.King has expressed opposition to the creation of a Maine Woods National Park, stating on his 2012 campaign website that local control is the best way to conserve land, but in 2014 stating that he was keeping an open mind about the idea.King initially expressed "serious reservations" about proposals to establish the Katahdin Woods and Waters National Monument, but expressed support for President Obama\'s creation of the monument in 2016, saying that the administration had made commitments that convinced him that "the benefits of the designation will far outweigh any detriment"; that the monument would not hurt Maine\'s pulp and paper industry, and that the monument would help diversify the local economy.King opposes efforts in Maine to ban the baiting and trapping of bears, including an effort to put the question to voters in 2014, calling such practices necessary to prevent interaction between bears and people, and stating the practices are based on science and the views of experts.Immigration King strongly criticized President Donald Trump\'s Executive Order 13769, which barred the admission of refugees to the U.S. and barred travel by nationals of several Muslim-majority countries to the country. King stated: "This is probably the worst foreign policy decision since the invasion of Iraq. What it\'s done is played right into ISIS\'s hands. They want us to turn this into a war of the west against Islam. They have explicitly said they want to drive a wedge ... There are 1.6 billion Muslims in the world and we don\'t want a war with all of them. We don\'t need a war with all of them. We\'re not opposed to all of them." King noted that U.S. forces fought alongside Muslim Iraqi troops, and that much valuable counterterrorism intelligence was shared with the U.S. by Muslim nations.Gun laws King supports expanding background checks to most firearms transactions, with exceptions for transfers between family members, calling such a position "the single most effective step" that can be taken to keep guns out of the wrong hands. He supports limiting the size of magazines to 10 rounds, and to make purchasing a gun for someone not legally allowed to have one a federal crime. He does not support a ban on assault weapons, believing it will not work and that such a ban is not based on the functionality of the weapons, which are not relevantly different from the many hunting rifles owned by Maine residents. He noted that the vast majority of gun crimes are committed with handguns, not rifles.King voted for the Manchin-Toomey amendment to expand background checks for gun purchases.Health issues King supports the Patient Protection and Affordable Care Act (ACA or Obamacare), but has expressed support for modest adjustments to the legislation if they can be done on a bipartisan basis. In 2013, King voted to restore funding for the ACA as part of an amendment to legislation that funded government operations for 45 days. He has said that those opposed to the ACA who are attempting to discourage people from purchasing health insurance are "guilty of murder" and that doing so was "one of the grossest violations of our humanity that I could think of." In making this comment, King noted a time in his life when he believed he would have died had he not just acquired health insurance.In January 2017, King voted against the Republican Senate budget plan to accelerate repeal of the ACA and block repeal legislation from being filibustered; the measure passed on a party line 51-48 vote. He spoke out against the House Republican repeal legislation, noting that the Congressional Budget Office estimated that 14 million Americans would lose health insurance if the legislation were enacted. King stated that the House Republican bill, "If you were designing a bill to hammer my state, it would be this bill," saying that it would most adversely affect Maine residents between the ages of 50-65.King is a supporter of the Children\'s Health Insurance Program (CHIP) program.King favors abortion rights.King criticized Trump\'s 2017 budget proposal for its cuts to medical research. In 2018, King voted with all Republicans except Rand Paul and six other Democrats to confirm Alex Azar, Trump\'s nominee for Health Secretary.King has voted against Republican attempts to completely defund Planned Parenthood, calling the proposals an "unfounded yet relentless assault" and "another example of misguided outrage that would only hurt those who need help the most." No federal funds go to Planned Parenthood for abortions (federal dollars pay for other health care services provided by the group, such as contraception and screenings for cancer and sexually transmitted diseases), but Republicans have sought to completely defund the organization because it provides abortions with other funds. King stated that supporters of the bill were in effect voting to deprive low-income Americans of healthcare over an issue "that has nothing to do with the 97 percent of the services that Planned Parenthood provides," saying: "To me, this bill is like attacking Brazil after Pearl Harbor."Same-sex marriage King supports same-sex marriage. He signed an amicus brief to the U.S. Supreme Court in United States v. Windsor encouraging it to strike down the Defense of Marriage Act.', 'Electoral history': 'Maine gubernatorial election, 1994PartyCandidateVotes%+%IndependentAngus King180,82935%DemocraticJoseph Brennan172,95134%RepublicanSusan Collins117,99023%GreenJonathan Carter32,6956%Write-inEd Finks6,5761%Maine gubernatorial election, 1998PartyCandidateVotes%+%IndependentAngus King (inc.)246,77259%RepublicanJames Longley Jr.79,71619%DemocraticThomas Connolly50,50612%GreenPat LaMarche28,7227%ConstitutionWilliam Clarke Jr.15,2934%U.S. Senate election in Maine, 2012PartyCandidateVotes%+%IndependentAngus King370,58051%RepublicanCharles Summers Jr.215,39930%DemocraticCynthia Ann Dill92,90013%IndependentStephen Woods10,2891%IndependentDanny Francis Dalton5,8071%IndependentAndrew Ian Dodge5,6241%', 'Personal life': "King's first wife was Edie Birney. She is the mother of King's oldest son, Angus Stanley King III. King and Birney divorced in 1982.In 1984, King married Mary Herman, his current wife. King has five children and six grandchildren.King is an Episcopalian. He rides a Harley-Davidson motorcycle.", 'introduction': "Angus Stanley King Jr. (born March 31, 1944) is an American politician and attorney serving as the junior United States Senator from Maine since 2013. A political independent since 1993, he was the 72nd Governor of Maine from 1995 to 2003.\nKing won Maine's 2012 Senate election to replace the retiring Republican Olympia Snowe and took office on January 3, 2013. For committee assignment purposes, he caucuses with the Democratic Party. He is one of two independents currently serving in the Senate, the other being Bernie Sanders of Vermont.\n\n"}, 'personal': {'Born': 'Angus Stanley King Jr. (1944-03-31) March 31, 1944 (age74)Alexandria, Virginia, U.S.', 'Political party': 'Independent (1993–present)', 'Other politicalaffiliations': 'Democratic (before 1993)', 'Spouse(s)': 'Edith C. Hazard(div.1982)Mary Herman (m.1984)', 'Children': '5', 'Education': 'Dartmouth College (BA)University of Virginia (JD)', 'Signature': '', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Maine': {'date': 'Assumed office January 3, 2013Serving with Susan Collins', 'Preceded by': 'Olympia Snowe'}, '72nd Governor of Maine': {'date': 'In officeJanuary 5, 1995– January 8, 2003', 'Preceded by': 'John McKernan', 'Succeeded by': 'John Baldacci'}}, 'code': 'K000383'}