{'name': 'Anna.Eshoo', 'picture': 'E000215.jpg', 'detail': {'Early life, education, and business career': 'Anna Eshoo was born in New Britain, Connecticut, of Assyrian and Armenian heritage.  Her mother fled from Armenia to Iraq, and subsequently to the United States. Her father, Fred Georges, a jeweler and watchmaker, was an Assyrian Christian. She is a Chaldean Catholic.  Eshoo graduated from New Britain High School in 1960, and later moved to California.  She received an associate of arts degree from Cañada College in 1975.', 'Early political career': 'Eshoo was Chair of the San Mateo Democratic Party from 1978 to 1982. She was also a member of the Democratic National Committee in the 1980s. She was chief of staff to Speaker pro tempore Leo McCarthy of the California State Assembly in 1981–82. Eshoo was elected to the San Mateo County Board of Supervisors in 1982 and served until 1992. She was president of the board in 1986.', 'US House of Representatives': 'Elections 1988In the middle of Eshoo\'s second term on the San Mateo Board of Supervisors, she ran for Congress in California\'s 12th congressional district. She won the Democratic primary with a plurality of 43%, but lost the general election to Republican Stanford law professor Tom Campbell, 51–46%.1992Campbell gave up his congressional seat to make an unsuccessful bid for the United States Senate, and Eshoo entered the Democratic primary for the open seat, which had been renumbered as the 14th District. She won the seven-way primary with a plurality of 40%. In the general election, she defeated Republican nominee Tom Huening, 57–39%.1994She survived the Republican Revolution, winning reelection with 61% of the vote.2008She won reelection against Republican Ronny Santana, 70–22%.2010She won reelection against Republican Dave Chapman, 69–28%.2012After redistricting, Eshoo ran for and won reelection in California\'s 18th congressional district based in San Mateo, Santa Clara, and Santa Cruz counties.2014After a bitter race that brought to the fore some dissatisfaction over party leadership, regarded as a proxy battle between Steny Hoyer and Nancy Pelosi, Eshoo lost a party vote to Frank Pallone for ranking member of the House Energy and Commerce Committee. Nancy Pelosi had said Eshoo\'s elevation to the top Democratic spot on that committee would be important for the Democrats, allowing Eshoo "to tap into lucrative fundraising interests in Silicon Valley and elsewhere that the committee has jurisdiction."Tenure In 2003, Eshoo was elected by her Democratic colleagues in the 108th Congress as an At-Large Democratic Whip, and she has served in that position to the present.On January 30, 2008, Eshoo formally endorsed U.S. Senator Barack Obama for president.Energy In 2005, Eshoo worked with Nancy Pelosi to develop the Democratic Innovation Agenda, which called for America to achieve independence from Middle East oil over the next ten years. She has led efforts to raise fuel standards for automakers, and pursued reliance on alternative energy sources both in California and nationally. Legislation includes:H.R. 6, Creating Long-Term Energy Alternatives for the Nation (CLEAN) Energy Act, co-sponsor – Repeals $14 billion in subsidies to the gas and oil industries, and commits that money to renewable resources.H.R. 1506, Fuel Economy Reform Act, co-sponsor – Raises fuel economy standards, with a target goal of 35 miles per gallon by 2018.H.R. 1590, Safe Climate Act, co-sponsor – An emissions reduction bill which includes a provision calling for 20% of all electricity generated in the United States to come from renewable resources by 2008.H.R. 550, Securing America\'s Energy Independence Act, co-sponsor – Extends tax credits for homeowners and business using solar energy.S. 2598, Strategic Petroleum Reserve Fill Suspension and Consumer Protection Act – Temporarily suspends filling of the Strategic Petroleum Reserve, in order to lower the cost of petroleum to consumers.H.R. 6074, Gas Price Relief for Consumers Act – Authorizes lawsuits against oil cartel members for price fixing.H.R. 1742, A bill to establish a program to deploy and integrate plug-in electric drive vehicles in multiple regions, which was ultimately incorporated into the body of H.R. 2454, the American Clean Energy and Security Act, which was the primary energy bill for 2009.Click here to download a copy of Eshoo\'s floor statement on H.R. 3321, the New Direction for Energy Independence Act.Human rights Eshoo is a strong supporter of the gay rights movement. In 1992, when a gay-bashing mailer was directed at Supervisor Tom Nolan (the first openly gay supervisor in San Mateo and her opponent for her congressional seat), Eshoo stood fast in defending him, his record and years of service. She opposed the Marriage Protection Amendment and the Marriage Protection Act. Her website called the bill "discriminatory, singling out for the first time a minority to prevent their interests from being considered by the highest courts in the land."As one of just two Assyrian members of Congress, Eshoo has worked hard to protect indigenous Assyrian Christians in Iraq from continuing religious persecution and political exclusion. She authored an amendment to H.R. 2601, the Foreign Relations Authorization Act, stating that "special attention should be paid to the welfare of Chaldo-Assyrians and other indigenous Christians in Iraq."Eshoo has been a strong supporter of the Congressional resolution recognizing the Armenian genocide. She also supports closer ties between Armenia and the U.S.Eshoo has fought strongly against certain provisions of the Patriot Act, particularly Section 215 (Access to Business Records), which gives federal investigators the right to obtain any tangible business record without a subpoena.[citation needed]Eshoo also introduced "Kevin\'s Law," which would have given the U.S. Department of Agriculture the power to close down plants that produce contaminated meat.As an Assyrian and Armenian American, Eshoo is co-chair and co-founder of the Religious Minorities in the Middle East Caucus. She also serves on the Board of Advisors of THE INSTITUTE on Religion and Public Policy, a freedom of religion organization.Immigration Eshoo has worked to create a legal "pathway to citizenship" for foreign workers of all kinds, from doctors and computer programmers to migrant farm workers. She has voted to increase the annual cap on H-1B visas to allow more temporary foreign professionals to work in the United States (especially those with Master\'s Degrees or higher).In California, where as much as 90% of the agricultural workforce is composed of illegal immigrants, Eshoo cosponsored H.R. 371, the Agricultural Jobs Act, which would confer blue-card status on illegal immigrants who had worked an agricultural job in the United States for 150 days or more. This bill never became law.National security On July 29, 2015, Eshoo co-introduced H.R. 3299, the Strengthening Public Health Emergency Response Act of 2015, which would streamline government decisions and provide incentives for vaccines and treatment of dangerous pathogens and diseases. Eshoo co-sponsored the legislation with lead sponsor Rep. Susan Brooks in response to an October 2015 report by the Blue Ribbon Study Panel on Biodefense.Other legislation includes:H.R. 1275, American Dream Act, cosponsor – Allows states to provide tuition to students that are illegal immigrants, provided they meet certain criteria.H.R. 1379, Citizen Promotion Act, cosponsor – Assists lawfully admitted aliens in becoming permanent citizens of the United States.H.R. 2221, Uniting American Families Act, cosponsor – Amends the Immigration and Nationality Act to include "or permanent partner" where spouse occurs.Technology In November 2005, Eshoo led the House Democratic Caucus in introducing the "Innovation Agenda." She developed this comprehensive policy in conjunction with Nancy Pelosi and others after extensive consultation with Silicon Valley, tech leaders, venture capitalists, and scholars.Eshoo authored two bills authorizing electronic signatures that became law, The Government Paperwork Elimination Act of 1998 (GPEA) and ESIGN. She also introduced controversial legislation to alleviate the proliferation of unsolicited email, known as spam. The U.S. House of Representatives passed The CAN-SPAM Act of 2003 (S. 877), which authorizes a “Do Not Spam” list, regulates commercial email, and imposes fines on spammers. Eshoo authored the Consumer Internet Privacy Enhancement Act of 2001 (H.R. 237), created a program to provide discounts to schools and libraries for Internet access, and authored the Computer Donation Incentive Act.Eshoo introduced HR 2428, the Broadband Conduit Deployment Act of 2009. The bill would require new federal road projects to include plastic conduits buried along the side of the roadway, and enough of them to "accommodate multiple broadband providers." "According to industry experts, more than half of the cost of new broadband deployment is attributable to the expense of tearing up and repaving roads," Eshoo said. "By putting the broadband conduit in place while the ground beneath the roadways is exposed, we will enable any authorized communications provider to come in later and install fiber-optic cable at far less cost." The bill is supported by Google.Together with Rep. Edward Markey, Eshoo introduced the Internet Freedom Preservation Act of 2009, which would make Net Neutrality the law.Eshoo is co-chair of the Congressional Internet Caucus, a bipartisan group of over 150 members of the House and Senate working to educate their colleagues about the promise and potential of the Internet.Eshoo supported the Federal Communications Commission Process Reform Act of 2013 (H.R. 3675; 113th Congress), a bill that would make a number of changes to procedures that the Federal Communications Commission (FCC) follows in its rulemaking processes. The FCC would have to act more transparently as a result of this bill, forced to accept public input about regulations. Eshoo expected Senate support for the bill, saying that they "shouldn\'t find it menacing" and arguing that the bill was "about the functioning of the FCC in the 21st century."Committee assignments Committee on Energy and CommerceSubcommittee on Communications and TechnologySubcommittee on HealthCaucus memberships Congressional E-911 Caucus, Co-ChairArthritis Caucus, Co-ChairCaucus on Religious Minorities in the Middle East, Co-Chair and Founding MemberCancer Care Working Group, Co-ChairHouse 21st Century Health Care Caucus, Vice ChairHouse Information Technology Working Group, Co-ChairCongressional Internet Caucus, Founding Member and Co-ChairHouse Medical Technology Caucus, Co-ChairAhmadiyya Muslim CaucusBipartisan Congressional Task Force on Alzheimer\'s DiseaseCalifornia Democratic Congressional DelegationArmenian CaucusCoalition for Autism Research and Education (CARE)Congressional Asian Pacific American CaucusCongressional Biomedical Research CaucusCongressional Caucus for Women\'s IssuesCongressional Caucus on Armenian IssuesCongressional Coalition on AdoptionCongressional Diabetes CaucusCongressional Food Safety CaucusCongressional Kidney CaucusCongressional Organic CaucusCongressional Prevention CoalitionCongressional Shipbuilding CaucusCongressional Taiwan CaucusCongressional Wildlife Refuge CaucusHouse Biotechnology CaucusHouse Cancer CaucusHouse National Marine Sanctuary CaucusHouse Oceans CaucusHouse Recycling CaucusLong-Term Care CaucusUnited States-Philippines Friendship CaucusCongressional Arts CaucusCongressional NextGen 9-1-1 Caucus', 'Personal life': 'Eshoo was married to attorney George Eshoo, with whom she has two children, Karen and Paul. They are divorced. She resides in Atherton, California.', 'Electoral history': 'United States House of Representatives elections, 2016PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)230,46071.1RepublicanRichard Fox93,47028.9Total votes323,930100.0Turnout\xa0Democratic holdCA-18 Congressional Primary Election, 2016PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)132,72668.2RepublicanRichard Fox47,48424.4DemocraticBob Harlow14,4117.4Total votes194,621100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 2014PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)133,06067.8RepublicanRichard B. Fox63,32632.2Total votes196,386100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 2012PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)212,83170.5RepublicanDave Chapman89,10329.5Total votes301,934100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 2010PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)150,54269.1RepublicanDave Chapman60,66827.9LibertarianPaul Lazaga6,6853.0Total votes217,895100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 2008PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)190,30169.8RepublicanRonny Santana60,61022.3LibertarianBrian Holtz11,9294.3GreenCarol Brouillet9,9263.6Total votes272,766100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 2006PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)141,15371.1RepublicanRob Smith48,09724.3LibertarianBrian Holtz4,6922.3GreenCarol Brouillet4,6332.3Total votes198,575100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 2004PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)182,71269.8RepublicanChris Haugen69,56426.6LibertarianBrian Holtz9,5883.6No partyDennis Mitrzyk (write-in)240.01%Total votes262,088100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 2002PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)117,05568.2RepublicanJoe Nixon48,34628.2LibertarianAndrew B. Carver6,2773.6Total votes171,678100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 2000PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)161,72070.3RepublicanBill Quraishi59,33825.8LibertarianJoseph W. Dehn III4,7152.0Natural LawJohn Black4,4891.9Total votes230,262100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 1998PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)129,66368.64RepublicanChris Haugen53,71928.44LibertarianJoseph W. Dehn III3,1661.68Natural LawAnna Currivan2,3621.25Total votes188,910100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 1996PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)149,31364.9RepublicanBen Brink71,57331.1Peace and FreedomTimothy Thompson3,6531.6LibertarianJoseph Dehn3,4921.5Natural LawRobert Wells2,1440.9Total votes230,175100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 1994PartyCandidateVotes%DemocraticAnna Eshoo (incumbent)130,71360.60RepublicanBen Brink78,47539.40Total votes199,188100.0Turnout\xa0Democratic holdUnited States House of Representatives elections, 1992PartyCandidateVotes%DemocraticAnna Eshoo146,87356.7RepublicanTom Huening101,20239.0LibertarianChuck Olson7,2202.8Peace and FreedomDavid Wald3,9121.5No partySims (write-in)120.01%No partyMaginnis (write-in)30.003%Total votes259,232100.0Turnout\xa0Democratic gain from RepublicanUnited States House of Representatives elections, 1988PartyCandidateVotes%RepublicanTom Campbell136,38451.7DemocraticAnna Eshoo121,52346.0LibertarianTom Grey6,0232.3Total votes263,930100.0Turnout\xa0Republican hold', 'Organizations': "Chair, San Mateo County General Hospital Board of Directors, 1984–1992Member, American Association of University WomenFormer Chair, Bay Area Air Quality Management DistrictFormer Member, Bay Conservation and Development CommissionDemocratic Activists for Women NowJunior League of Palo AltoLeague of Conservation VotersMember, League of Women VotersCo Founder, San Mateo Women's Hall of Fame.", 'Awards and honors': "1989 Legislator of the Year Award from the California's Governor's Committee on the Employing of the Disabled1991 Margaret Sanger Community Service Award from San Mateo County Planned Parenthood1990 Friend of BAYMEC Award1989 Public Official of the Year by the State Commission on Aging1987 Humanitarian of the Year by Easter SealFirst woman to join her local chapter of Kiwanis International.Honorary doctorate, Humane Letters, Menlo College", 'introduction': "Anna Georges Eshoo /ˈɛʃuː/ (born December 13, 1942) is the U.S. Representative from California's 18th congressional district, serving since 1993. She is a member of the Democratic Party. The district, numbered as the 14th District from 1993 to 2013 is based in the Silicon Valley, including the cities of Redwood City, Sunnyvale, Mountain View, and Palo Alto, as well as part of San Jose. She is the only Assyrian American in Congress, and is also one of only two congresswomen of Armenian descent, with Jackie Speier being the other. She is Assyrian paternally and Armenian maternally.\n\n", 'code': '18'}, 'personal': {'Born': 'Anna Georges (1942-12-13) December 13, 1942 (age75)New Britain, Connecticut, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'George Eshoo (Divorced)', 'Children': '2', 'Education': 'Cañada College'}, 'timeline': {"Member of the US House of Representativesfrom California's 18th district": {'date': 'Assumed office January 3, 2013', 'Preceded by': 'Dennis Cardoza'}, "Member of the US House of Representativesfrom California's 14th district": {'date': 'In officeJanuary 3, 1993– January 3, 2013', 'Preceded by': 'Tom Campbell', 'Succeeded by': 'Jackie Speier'}, 'code': '18'}, 'code': 'E000215'}