{"name": "Ben.Cardin", "picture": "C000141.jpg", "detail": {"Early life and career": "Benjamin Louis Cardin was born in Baltimore, Maryland, the son of Dora (née Green) and Meyer M. Cardin (1907–2005). The family name was originally \"Kardonsky\", before it was changed to \"Cardin\". Cardin's grandparents were Russian Jewish immigrants. His grandfather, Benjamin Green, operated a neighborhood grocery store that later turned into a wholesale food distribution company. His father, Meyer Cardin, served in the Maryland House of Delegates (1935–1937) and later sat on the Baltimore City Supreme Bench (1961–1977).Cardin and his family attended the Modern Orthodox Beth Tfiloh Congregation near their home, with which the family had been affiliated for three generations. Cardin attended City College High School, graduating in 1961; In 1964, he earned a Bachelor of Arts degree cum laude from the University of Pittsburgh, where he was a member of the Pi Lambda Phi fraternity. He earned a Juris Doctor from the University of Maryland School of Law in 1967, graduating first in his class. Cardin was admitted to the Maryland Bar that same year, and joined the private practice of Rosen and Esterson until 1978.", "Political career": "Maryland House of Delegates While still in law school, Cardin was elected to the Maryland House of Delegates in November 1966. He held the seat once held by his uncle, Maurice Cardin, who had decided to not run for re-election so that his nephew could instead pursue the seat. He was chairman of the Ways & Means Committee from 1974 to 1979, then served as the 103rd Speaker of the House until he left office.  At age 35, he was the youngest Speaker in Maryland history at the time.  As Speaker, he was involved with reform efforts involving Maryland's property tax system, school financing formula, and ethical standards for elected officials.U.S. House of Representatives In 1986, with Congresswoman Barbara Mikulski mounting what would be a successful bid for the U.S. Senate seat vacated by retiring Senator Charles Mathias, Cardin ran for Mikulski's seat representing the 3rd Congressional District, which covered a large slice of inner Baltimore, as well as several close-in suburbs. Cardin won the Democratic nomination with 82 percent of the vote—the real contest in this heavily Democratic district. He won the general election with 79 percent of the vote against a perennial candidate, Republican Ross Z. Pierpont.Cardin was reelected nine times, rarely facing serious opposition and even running unopposed in 1992. In the 2000 round of redistricting, his district was redrawn to add significant portions of Anne Arundel County, including the state capital of Annapolis. His last two opponents hailed from Anne Arundel and nearly carried the district's portion of that county.In the House, Cardin was involved with fiscal issues, pension reform, and health care. His legislation to increase the amount individuals can store in their 401k plans and IRAs was passed in 2001. His bill to expand Medicare to include preventive benefits such as colorectal, prostate, mammogram, and osteoporosis screening was also enacted. He also authored legislation to provide a Medicare prescription drug benefit for chronic illnesses; fund graduate medical education; and guarantee coverage for emergency services.Cardin has also advocated, via proposed legislation, welfare reform. His bill to increase education and support services for foster children between ages 18 and 21 was signed into law in 1999. He authored bills to expand child support, improve the welfare-to-work program, and increase the child care tax credit.In 1998, Cardin was appointed Chairman of the Special Study Commission on Maryland Public Ethics Law by the Maryland General Assembly. In 1997, he co-chaired the Bipartisan Ethics Task Force in an effort to reform ethics procedures in the House of Representatives. He also held leadership positions on the Organization, Study and Review Committee and the Steering Committee of the House Democratic Caucus, and served as Senior Democratic Whip.Cardin has been commended for his work with fiscal policy. He has been honored by Worth magazine and by Treasury and Risk Management for his work protecting retirement plans and government-supported medical care for the elderly. He has also received scores of 100 percent from the League of Conservation Voters and the NAACP, indicating stances that are in favor of environmental protection and civil rights. Cardin was also one of 133 members of Congress to vote against the 2002 Iraq Resolution.Committee assignments As of  May 2006[update], Cardin served on the following House committees:Member of the Ways and Means Committee.Ranking member of the Trade Subcommittee.Member of the Human Resources Subcommittee.Chairman of the Commission on Security and Cooperation in Europe.In 2015, Cardin became the ranking Democratic member on the Senate Foreign Relations Committee after the departure of Senator Robert Menendez as ranking Democrat and Chairman. Two weeks after Menendez departure, Cardin was credited with facilitating achievement of a unanimous committee vote in favor of the markup for the bill on the USA's involvement in the negotiations with Iran on nuclear technology.U.S. Senate 2006 election On April 26, 2005, Cardin announced that he would seek the U.S. Senate seat of long-standing senator Paul Sarbanes (D-MD), following the announcement by Sarbanes that he would not be running for re-election in 2006. On September 12, 2006, Cardin faced a challenging primary battle with other Maryland Democrats, including Kweisi Mfume, Josh Rales, Dennis F. Rasmussen, and Allan Lichtman. Cardin won, however, with 44 percent of the vote, compared to 40 percent for Mfume, five percent for Rales, and two percent for Rasmussen. He was declared the winner after just two percent of the precincts had reported.Cardin won election on November 7, 2006, defeating Republican challenger Michael Steele 54 percent to 44 percent. Cardin became the third consecutive Representative from Maryland's 3rd Congressional District to be elected Senator (following Sarbanes and Mikulski).2012 election Cardin ran for re-election to a second term in 2012. He turned back a primary challenge from State Senator C. Anthony Muse, defeating him 74% to 16%, with seven other candidates taking the remaining 10%.In the general election, he faced Republican Dan Bongino, a former United States Secret Service agent, Independent Rob Sobhani, an economist and businessman, and Libertarian Imad-ad-Dean Ahmad, President of the Minaret of Freedom Institute. Cardin easily won the election, taking 56% of the vote to Bongino's 26.3%, Sobhani's 16.4% and Ahmad's 1%.2018 election Cardin is running for re-election to a third term in 2018.Committee assignments Cardin currently serves on the following Senate Committees in the 115th United States Congress:Commission on Security and Cooperation in EuropeCommittee on Environment and Public WorksSubcommittee on Clean Air and Nuclear SafetySubcommittee on Fisheries, Water, and WildlifeSubcommittee on Transportation and InfrastructureCommittee on FinanceSubcommittee on Health CareSubcommittee on Taxation and IRS OversightCommittee on Foreign RelationsSubcommittee on Africa and Global Health Policy (Ex Officio)Subcommittee on East Asia, The Pacific and International Cybersecurity Policy (Ex Officio)Subcommittee on Europe and Regional Security Cooperation (Ex Officio)Subcommittee on Multilateral International Development, Multilateral Institutions, and International Economic, Energy and Environmental Policy (Ex Officio)Subcommittee on Near East, South Asia, Central Asia and Counterterrorism (Ex Officio)Subcommittee on State Department and USAID Management, International Operations and Bilateral International Development (Ex Officio)Subcommittee on Western Hemisphere, Transnational Crime, Civilian Security, Democracy, Human Rights and Global Women's Issues (Ex Officio)Committee on Small Business and Entrepreneurship (Ranking Member)Caucus membership Senate Oceans CaucusSenate Military Family CaucusSenate Ukraine Caucus[not in citation given]", "International experience": "Cardin has been a Commissioner on the Commission on Security and Cooperation in Europe (the U.S. Helsinki Commission) since 1993, serving as Ranking Member from 2003 to 2006. He subsequently served two terms as co-chair of the Commission, from 2007 to 2008, and 2011 to 2012; and also two terms as chair, from 2009 to 2010, and 2013 to 2014. From 2015 to 2016 he was again ranking member. In 2006 he was elected vice president of the Organization for Security and Cooperation in Europe (OSCE) Parliamentary Assembly, and served through 2014.", "Honors": "Cardin holds honorary degrees from several institutions, including the University of Baltimore School of Law (1990); University of Maryland, Baltimore (1993); Baltimore Hebrew University (1994); Goucher College (1996); and Villa Julie College (2007).As of  2016[update] Cardin sits on the Board of Visitors of the University of Maryland School of Law, his law school alma mater.From 1988 to 1995, he chaired the Maryland Legal Services Corp. Through much of his political career, he has continued to work with law policy.From 1988 to 1999, Cardin served on the St. Mary's College of Maryland Board of Trustees, and in 2002, he was appointed to the St. Mary's Advisory Board for the Study of Democracy. In 1999, he was appointed to the Goucher College Board of Trustees.Cardin has been awarded the following foreign honor: Commander of the Order of the Star of Romania, Romania (June 8, 2017)", "Political positions": "On a list by Congressional Quarterly of the members of Congress who were most supportive of President Barack Obama's legislative agenda in 2009, Cardin was tied for fifth most supportive Senator with five other Senators. In 2013, National Journal rated him as tied with six other Democratic senators for fifth most liberal Senator.Death Penalty Senator Cardin is a supporter of the death penalty.Education In 2007, Cardin supported the United States Public Service Academy Act. The Act would serve to create \"an undergraduate institution devoted to developing civilian leaders.\" Like the Military Academies, this would give students 4 years of tuition-free education in exchange for 5 years of public service upon graduation.Environmentalism Liberal environmentalists criticized Cardin for compromising too much while working with conservative James Inhofe on an amendment to Cardin's Chesapeake Bay legislation. Josh Saks, senior legislative representative for water resources campaigns with the National Wildlife Federation, praised Cardin as \"the lead voice for clean water and the restoration of America's great waters in Congress.\"Gun control Cardin has an \"F\" rating from the National Rifle Association.In response to the Orlando nightclub shooting, Cardin questioned the legality of military style assault weapons stating that \"in my observations in Maryland, I don't know too many people who need to have that type of weapon in order to do hunting in my state or to keep themselves safe.\"Cardin opposed the 2016 sale of approximately 26,000 assault rifles to the national police of the Philippines. His opposition led to the U.S. State Department halting the sale.In the wake of the 2017 Las Vegas shooting, Cardin stated that thoughts and prayers were not going to save more people from dying in mass shootings. He also made a call for action to change gun laws, stating on Twitter that \"Automatic weapons aren't needed to hunt deer or ducks; they're meant to kill people.\" In response to the shooting, Cardin sponsored Dianne Feinstein's proposal to ban bump-fire stocks, which were used by the shooter to kill 59 individuals and injure over 500.Health In the 111th Congress, Cardin helped secure dental benefits in the State Children's Health Insurance Plan.International policy On 31 October 2011 Cardin endorsed the proposal for the United Nations Parliamentary Assembly (UNPA).  He is one of only six persons who served as members of the United States Congress ever to do so and is the only one who did so while in office.Cardin has often supported positions that aim to strengthen America's relationship with Israel. In 2017, Cardin sponsored a bill, the Israel Anti-Boycott Act (S. 720)), that would penalize commercial businesses that wanted to aid International NGOs and/or organizations in boycotting Israel.He supported civilian nuclear cooperation with India.Weeks after the 2014 Hong Kong class boycott campaign and Umbrella Movement broke out which demands genuine universal suffrage among other goals, Cardin among bipartisan colleagues joined U.S. Senator Sherrod Brown and Rep. Chris Smith's effort to introduce Hong Kong Human Rights and Democracy Act which would update the United States–Hong Kong Policy Act of 1992 and U.S. commitment to Hong Kong's freedom and democracy. \"Civil society and democratic freedoms are under attack around the world and Hong Kong is on the front lines. The United States has a responsibility to protect human rights and defend against these threats,\" Cardin, chairman of the Senate Foreign Relations East Asian and Pacific Affairs Subcommittee said.Online privacy Cardin supports Net Neutrality, as shown by his vote during the 109th Congress in favor of the Markey Amendment to H.R. 5252 which would add Net Neutrality provisions to the federal telecommunications code. Cardin also supports Combating Online Infringement and Counterfeits Act, which gives DOJ the tools to target those site owners who are engaged in illegal digital piracy.Taxes Cardin is opposed to eliminating the tax deduction for charitable donations and supports raising taxes on higher income earners. During a December 20, 2012, interview with Maria Bartiromo on CNBC, Cardin stated, \"We're now a few days away from Christmas. The easiest way to get the revenues is to get the rates from the higher income, uh, taxpayers.\" In response to the question, \"Are you prepared to vote to limit the loophole of charitable deductions?\" Cardin responded, \"No.\"Whistleblowers In November 2011, Cardin's intended update of the 1917 Espionage Act upset some public disclosure advocates. They complained that it \"would make it harder for federal employees to expose government fraud and abuse.\"", "Personal life": "Cardin married high school sweetheart Myrna Edelman, a teacher, on November 24, 1964. They have a daughter, Deborah. Their son Michael committed suicide on March 24, 1998 at age 30.In 2002, Ben's 32-year-old nephew, Jon S. Cardin, who graduated from University of Maryland law school in 2001, was elected as a Delegate representing District 11 of western Baltimore County. With state legislative District 11 overlapping Congressional District 3, there were two Cardins on the ticket in this area in 2002. Present at Jon's swearing in was the oldest living former member of the House of Delegates at 95 years of age, Meyer Cardin, Jon's grandfather and Ben's father. Also in attendance was Ben himself, who stated, \"The next generation's taking over.\" After Ben announced that he would vacate his Congressional seat to run for the U.S. Senate, Jon Cardin stated that he was exploring a campaign for his uncle's Congressional seat, though he ultimately decided to seek reelection to the House of Delegates.", "Volunteer service": "For many years Cardin served on the Board of Trustees for St. Mary's College of Maryland. He was very active on the board and also played key roles in the establishment of the Center for the Study of Democracy at the college, where he also served on the advisory board.", "Election history": "Maryland's 3rd congressional district Democratic primary election, 1986PartyCandidateVotes%+%DemocraticBen Cardin69,98082%DemocraticEdward Ellison, Jr.4,4225%DemocraticJohn Ascher4,0855%DemocraticEarl Koger, Sr.3,7144%DemocraticRobert Lewis2,9683%Maryland's 3rd congressional district Democratic primary election, 1988PartyCandidateVotes%+%DemocraticBen Cardin (incumbent)52,85086%DemocraticCharles Walker8,45114%Maryland's 3rd congressional district Democratic primary election, 1990PartyCandidateVotes%+%DemocraticBen Cardin (incumbent)43,49683%DemocraticMartin Glaser8,78817%Maryland's 3rd congressional district Democratic primary election, 1992PartyCandidateVotes%+%DemocraticBen Cardin (incumbent)63,79384%DemocraticCarl Mueller11,70716%Maryland's 3rd congressional district Democratic primary election, 1994PartyCandidateVotes%+%DemocraticBen Cardin (incumbent)64,74287%DemocraticDan Hiegel9,98713%Maryland's 3rd congressional district Democratic primary election, 1996PartyCandidateVotes%+%DemocraticBen Cardin (incumbent)34,49690%DemocraticDan Hiegel3,72010%Maryland's 3rd congressional district Democratic primary election, 1998PartyCandidateVotes%+%DemocraticBen Cardin (incumbent)50,24090%DemocraticDan Hiegel5,85610%Maryland's 3rd congressional district Democratic primary election, 2002PartyCandidateVotes%+%DemocraticBen Cardin (incumbent)62,93890%DemocraticJohn Rea6,98610%Maryland's 3rd congressional district Democratic primary election, 2004PartyCandidateVotes%+%DemocraticBen Cardin (incumbent)54,39890%DemocraticJohn Rea6,16310%U.S. Senate Democratic primary election in Maryland, 2006PartyCandidateVotes%+%DemocraticBen Cardin257,54544%DemocraticKweisi Mfume238,95741%DemocraticJosh Rales30,7375%DemocraticDennis Rasmussen10,9972%DemocraticMike Schaefer7,7731%DemocraticAllan Lichtman6,9191%DemocraticTheresa Scaldaferri5,0811%DemocraticJames Hutchinson4,9491%DemocraticDavid Dickerson3,9501%DemocraticRobert Kaufman3,9081%DemocraticAnthony Jaworski3,4861%DemocraticThomas McCaskill3,4591%DemocraticGeorge English2,305<1%DemocraticBob Robinson2,208<1%DemocraticLih Young2,039<1%DemocraticBlaine Turner1,848<1%DemocraticJoseph Werner1,832<1%DemocraticCharles Ulysses Smith1,702<1%U.S. Senate Democratic primary election in Maryland, 2012PartyCandidateVotes%+%DemocraticBen Cardin (incumbent)240,70474%DemocraticC. Anthony Muse50,80716%DemocraticChris Garner9,2743%DemocraticRaymond Levi Blagmon5,9092%DemocraticJ. P. Cusick4,7782%DemocraticBlaine Taylor4,3761%DemocraticLih Young3,9931%DemocraticRalph Jaffe3,3131%DemocraticEd Tinus1,064<1%YearOfficeElectionSubjectPartyVotes%OpponentPartyVotes%OpponentPartyVotes%1986Congress, MD-3GeneralBenjamin CardinDemocratic100,16179.11%Ross PierpontRepublican26,45220.89%1988Congress, MD-3GeneralBenjamin CardinDemocratic133,77972.9%Ross PierpontRepublican49,73327.1%1990Congress, MD-3GeneralBenjamin CardinDemocratic82,54569.73%Harwood NicholsRepublican35,84130.27%1992Congress, MD-3GeneralBenjamin CardinDemocratic163,35499.98%Unopposed1994Congress, MD-3GeneralBenjamin CardinDemocratic117,26970.97%Robert TouseyRepublican47,96629.03%1996Congress, MD-3GeneralBenjamin CardinDemocratic130,20467.31%Patrick McDonoughRepublican63,22932.69%1998Congress, MD-3GeneralBenjamin CardinDemocratic137,50177.61%Colin HarbyRepublican39,66722.39%2000Congress, MD-3GeneralBenjamin CardinDemocratic169,34775.66%Colin HarbyRepublican53,82724.05%Joseph PomykalaLibertarian2382002Congress, MD-3GeneralBenjamin CardinDemocratic145,58965.72%Scott ConwellRepublican75,72134.18%2004Congress, MD-3GeneralBenjamin CardinDemocratic182,06663.39%Bob DuckworthRepublican97,00833.77%Patsy AllenGreen4,2242.75%2006MD Senator, Class 1GeneralBenjamin CardinDemocratic965,56754.20%Michael S. SteeleRepublican787,35244.20%Kevin ZeeseGreen27,5701.55%2012MD Senator, Class 1GeneralBenjamin CardinDemocratic1,474,02856.0%Dan BonginoRepublican693,29126.3%S. Rob SobhaniIndependent430,93416.4%", "Further reading": "Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of Congress", "introduction": "Benjamin Louis Cardin (born October 5, 1943) is an American politician serving as the senior United States Senator from Maryland, first elected to that seat in 2006. A Democrat, he previously was a member of the United States House of Representatives for Maryland's 3rd congressional district from 1987 to 2007 and of the Maryland House of Delegates from 1967 to 1987. He served as Speaker of the Maryland House of Delegates from 1979 to 1987, the youngest to hold that position in the history of Maryland. In his half-century career as an elected official, he has never lost an election.\nCardin was elected to succeed Paul Sarbanes in the 2006 U.S. Senate election, defeating Republican Michael Steele, the Lieutenant Governor of Maryland, by a margin of 54% to 44%. He was reelected in the U.S. Senate election, 2012 taking 56% of the vote. He became a senior U.S. Senator on January 3, 2017 upon Barbara Mikulski's retirement. Cardin is running for reelection to a third term in the U.S. Senate election, 2018.\n\n"}, "personal": {"Born": "Benjamin Louis Cardin (1943-10-05) October 5, 1943 (age75)Baltimore, Maryland, U.S.", "Nationality": "American", "Political party": "Democratic", "Spouse(s)": "Myrna Edelman (m.1964)", "Children": "2", "Education": "University of Pittsburgh (BA)University of Maryland, Baltimore (JD)"}, "timeline": {"United States Senatorfrom Maryland": {"date": "Assumed office January 3, 2007Serving with Chris Van Hollen", "Preceded by": "Paul Sarbanes"}, "Ranking Member of the Senate Foreign Relations Committee": {"date": "In officeApril 2, 2015– February 6, 2018", "Preceded by": "Bob Menendez", "Succeeded by": "Bob Menendez"}, "Member of the US House of Representativesfrom Maryland's 3rd district": {"date": "In officeJanuary 3, 1987– January 3, 2007", "Preceded by": "Barbara Mikulski", "Succeeded by": "John Sarbanes"}, "Speaker of the Maryland House of Delegates": {"date": "In officeJanuary 6, 1979– January 3, 1987", "Preceded by": "John Hanson Briscoe", "Succeeded by": "Clayton Mitchell"}, "Member of the Maryland House of Delegatesfrom the 42nd district": {"date": "In officeJanuary 6, 1967– January 3, 1987", "Preceded by": "Maurice Cardin", "Succeeded by": "David Shapiro"}}, "code": "C000141", "type": "3", "party": "Democrat", "description": "moderate Democratic leader", "economic": "-0.33", "social": "-0.25", "leadership": "0.92"}