{"name": "Ben.Sasse", "picture": "S001197.jpg", "detail": {"Early life": "Sasse was born on February 22, 1972, in Plainview, Nebraska, the son of Gary Lynn Sasse, a high-school teacher and football coach, and Linda Sasse. He graduated from Fremont Senior High School, Fremont, Nebraska in 1990 and was valedictorian of his class.Sasse graduated from Harvard University in 1994 with a bachelor's degree in government. He also studied at the University of Oxford during the fall of 1992 on a junior year abroad program. In 1998, Sasse obtained a Master of Arts in Liberal Studies from the Graduate Institute at St. John's College. He also obtained Master of Arts, Master of Philosophy, and Ph.D degrees in history from Yale University. Sasse's doctoral dissertation, \"The Anti-Madalyn Majority: Secular Left, Religious Right, and the Rise of Reagan's America\", won the Theron Rockwell Field and George Washington Egleston Prizes.", "Early career": "From September 1994 to November 1995, Sasse worked as an associate consultant at the management consulting firm Boston Consulting Group. For the next year, he served as consultant/executive director for Christians United For Reformation (CURE). During his tenure, CURE merged with the Alliance of Confessing Evangelicals (ACE), and Sasse became executive director of ACE in Anaheim, California.From January 2004 to January 2005, Sasse served as chief of staff for the U.S. Department of Justice Office of Legal Policy in Washington, D.C. and as a part-time assistant professor at the University of Texas at Austin, commuting to Austin to teach. Sasse left the Department of Justice to serve as chief of staff to Representative Jeff Fortenberry (R-Nebr.) from January 2005 to July 2005.Sasse then advised the U.S. Department of Homeland Security in Washington, D.C., on national security issues from July to September 2005 as a consultant. He moved to Austin, Texas, to resume his professorship full-time from September 2005 to December 2006.From December 2006 to December 2007, Sasse served as counselor to the secretary at the U.S. Department of Health and Human Services (HHS) in Washington, D.C., where he advised the secretary on a broad spectrum of health policy issues, from healthcare access to food safety and security.In July 2007, Sasse was nominated by President George W. Bush to the post of assistant secretary for planning and evaluation in the U.S. Department of Health and Human Services. His appointment was confirmed by the Senate in December 2007 and he served until the end of the Bush administration, in January 2009. During his tenure at HHS, Sasse took an unpaid leave from the University of Texas.During 2009, Sasse advised private equity clients and health care investors and taught at the University of Texas. In October 2009, he officially joined the University of Texas LBJ School of Public Affairs' Center for Politics and Governance as a fellow, before being appointed president of Midland University.", "Midland University": "Sasse was announced as the 15th president of Midland Lutheran College (now Midland University) in October 2009. At age 37, he was one of the youngest chief executives in American higher education when he took over leadership of the 128-year-old institution in the spring of 2010. Sasse's grandfather, Elmer Sasse, worked for Midland for 33 years, mainly as vice president of finance. The school was experiencing financial and academic difficulties; Sasse has been credited with \"turn(ing) it around,\" rebranding \"Midland Lutheran College\" as Midland University, instituting new policies (including spot quizzes and class attendance), and \"prodigious fundraising.\"Sasse was officially installed as president on December 10, 2010. When he was appointed, enrollment was at a historic low and the college was \"on the verge of bankruptcy.\" During his tenure as president, enrollment grew from 590 to 1,300 students. When nearby Dana College was forced to close, Sasse managed to hire much of the faculty and enable most of the students to transfer to Midland.When Sasse announced his intention to run for U.S. Senate, he offered to resign his post at Midland. Instead, the Board asked him to stay at Midland under a partial leave of absence; in October 2013, his employment contract was amended to reduce his remuneration. Sasse stepped down as president of Midland on December 31, 2014.", "US Senate": "2014 election In October 2013, Sasse announced his candidacy for the United States Senate seat occupied by Republican Mike Johanns, who was not running for reelection. As of October 2013, his fundraising total of nearly $815,000 from individual donors in his first quarter broke Nebraska's previous record of $526,000 from individual donors, set in 2007 by Johanns while he was the U.S. Secretary of Agriculture.Upon announcing his candidacy, Sasse expressed strong opposition to the Affordable Care Act. His primary opponent, Shane Osborn, questioned the depth of Sasse's opposition to the ACA, publicizing articles and speeches Sasse delivered during and after the act's passage through Congress; according to the Omaha World-Herald, \"Osborn's campaign appears intent on questioning whether Sasse is a true conservative.\" The Osborn campaign cited, among other pieces, a 2009 Bloomberg Businessweek column titled \"Health-Care Reform: The Rush to Pass a Bad Bill\", stating that \"There's an emerging consensus that this [an individual mandate] might be a good idea\", and a 2010 speech in which Sasse said Republicans would probably lack the votes to repeal the ACA, stating that \"a middle-class entitlement has never been repealed\", and opining that Republicans had failed to offer a viable alternative, preferring to stage \"symbolic repeal votes\". Sasse's response to the Osborn campaign's assertions was that in his articles and speeches, he was describing the political landscape rather than giving his own opinions on the merits of the ACA's provisions; to a World-Herald reporter, he declared, \"I have never changed my position on thinking Obamacare is a bad idea\".On May 13, 2014, Sasse won 92 of 93 counties and secured the Republican nomination with 109,829 votes, or 49.4% of all votes cast; banker Sid Dinsdale came in second, with 49,829 votes (22.4%), followed by Osborn, with 46,850 votes (21.1%).On November 4, 2014, Sasse won the general election for the U.S. Senate, defeating Democratic nominee David Domina with 64.4% of the vote to Domina's 31.5%.Tenure Sasse assumed office as a United States senator on January 3, 2015. He was officially sworn in when the 114th Congress convened on January 6, 2015.CommitteesSasse has been appointed to serve on the following committees in the 115th Congress:Committee on Armed ServicesCommittee on Banking, Housing, and Urban AffairsSubcommittee on Economic PolicySubcommittee on National Security and International Trade and FinanceSubcommittee on Securities, Insurance, and InvestmentJoint Economic CommitteeCommittee on the Judiciary", "Political positions": "Abortion Sasse's campaign website indicated that he was pro-life, stating \"even one abortion is too many\".Donald Trump In early 2016, during both parties' presidential primary election seasons, Sasse announced that he would not support Republican front-runner Donald Trump should Trump become the party's nominee; he was the first sitting senator to make such an announcement. Sasse questioned Trump's commitment to the U.S. Constitution, in particular accusing him of attacking the First Amendment; stated that Trump had refused to condemn the Ku Klux Klan; and suggested that Trump \"thinks he's running for King\". He stated that if Trump won the party's nomination, then he would vote neither for him nor for Democratic front-runner Hillary Clinton, but would probably \"look for some third candidate—a conservative option, a Constitutionalist\". He did not say that he would leave the party if Trump was nominated.Trump, asked about Sasse's third-party suggestion, replied, \"That would be the work of a loser.\" Several Nebraska Republican politicians, among them state senators Bob Krist and Beau McCoy and U.S. senator Deb Fischer, took exception to Sasse's statements. Krist described them as \"very immature\" and declared that Sasse should \"quietly and in a statesmanlike manner allow the system to work out and provide the leadership that needs to be provided\"; Fischer said that voting for a third-party alternative would essentially guarantee a Clinton victory.Sasse has described Trump as a \"'megalomaniac strongman,'\" has \"called the president’s tariffs on steel and aluminum imports 'dumb,' and has described Trump’s escalating trade war with China [as] 'nuts.'\"In March 2018, Sasse criticized Trump for congratulating Vladimir Putin on his election win, saying, \"The president of the United States was wrong to congratulate him, and the White House press secretary was wrong to duck a simple question about whether or not Putin's reelection was free and fair. It was not. The American people know that, the Russian people know that and the world knows that. The White House refused to speak directly and clearly about this matter; we were weakened as a nation and a tyrant was strengthened.\"In July 2018, Politico reported that Sasse had \"quietly launched a new political non-profit group, fueling speculation that he might launch a Hail Mary bid for president rather than seek another term in the Senate.\" However, Politico also reported that Sasse and the President have been talking multiple times each month. Sasse has not ruled out a 2020 presidential bid.Guns In Sasse's Senate run in 2014, he received an \"AQ\" rating from the National Rifle Association (NRA). According to the NRA's press release, the rating was the most favorable that could be given to a candidate who had no voting record on gun-related issues. The NRA endorsed Sasse in the race.Health care In announcing his Senate candidacy, Sasse expressed strong opposition to the Affordable Care Act (ACA, a.k.a. \"Obamacare\"), describing himself as \"the anti-Obamacare candidate\" and later declaring that \"[i]f it lives, America as we know it will die.\" In the Senate, Sasse continued to support repeal of the ACA. In 2017, with Republicans unable to develop a repeal-and-replace plan that could secure a majority in the Senate, Sasse proposed an immediate repeal with a one-year delay in implementation, and called on the Senate to give up its August recess to allow it to work on a replacement measure.In 2016, Sasse was the only senator from either party to vote against the Comprehensive Addiction and Recovery Act, which was intended to address abuse of heroin and opioid drugs by providing funds to the states for treatment and prevention programs and by making the anti-overdose drug naloxone more widely available to first responders and law enforcement agencies. Sasse said he was \"distressed by opioid abuse\" but questioned whether drug treatment should be addressed at the federal level.LGBT issues in 2014, Sasse's campaign website did not refer explicitly to same-sex marriage, but stated, \"Ben believes marriage is between one man & one woman\".Spending In September 2018, Sasse, five other Republican senators (Jeff Flake, Mike Lee, Rand Paul, David Perdue, and Pat Toomey), and Bernie Sanders voted against a $854 billion spending bill meant to avoid a government shutdown. The bill included funding for the departments of Defense, Health and Human Services, Labor and Education.", "Books": "Sasse is the author of The Vanishing American Adult (2017) and Them: Why We Hate Each Other - and How to Heal (2018).Sasse also co-edited the book Here We Stand!: A Call from Confessing Evangelicals for a Modern Reformationwith theologian James Montgomery Boice.", "Personal life": "Sasse and his wife, Melissa (née McLeod) Sasse, live in Fremont, Nebraska, with their three children. The children are homeschooled.Sasse was raised a Lutheran and baptized in the Lutheran Church–Missouri Synod. As an undergraduate in the early 1990s, he encountered the teachings of W. Robert Godfrey at the Bolton Conference. Sasse identifies this as the time when he and his wife first began to embrace the \"reformed faith\".  He later became an elder in the United Reformed Churches in North America and served on the board of trustees for Westminster Seminary California. He is a member of Grace Church, a Presbyterian Church in America (PCA) congregation, in Fremont.", "introduction": "Benjamin Eric Sasse ( /ˈsæs/ SASS; born February 22, 1972) is an author, professor, consultant, educational administrator and politician from the U.S. state of Nebraska.  In 2014, he was elected to a seat in the U.S. Senate.  Sasse is a member of the Republican Party. \nBorn in Plainview, Nebraska, Sasse earned a doctorate in American history from Yale University. He taught at the University of Texas and served as an Assistant Secretary in the U.S. Department of Health and Human Services. In 2010, he was named president of Midland University in Fremont, Nebraska.  In 2014, he successfully ran for a vacant seat in the U.S. Senate, defeating Democratic Party nominee David Domina by a margin of 65% to 31%.\n\n"}, "personal": {"Born": "Benjamin Eric Sasse (1972-02-22) February 22, 1972 (age46)Plainview, Nebraska, U.S.", "Political party": "Republican", "Spouse(s)": "Melissa McLeod", "Children": "3", "Education": "Harvard University (BA)St. John's College, Maryland(MA)Yale University (MA, MPhil, PhD)"}, "timeline": {"United States Senatorfrom Nebraska": {"date": "Assumed office January 3, 2015Serving with Deb Fischer", "Preceded by": "Mike Johanns"}, "15th President of Midland University": {"date": "In officeDecember 10, 2010– December 31, 2014", "Preceded by": "Stephen Fritz", "Succeeded by": "Jody Horner"}, "Assistant Secretary of Health and Human Services for Planning and Evaluation": {"date": "In officeDecember 19, 2007– January 20, 2009", "President": "George W. Bush", "Preceded by": "Michael O'Grady", "Succeeded by": "Sherry Glied"}}, "code": "S001197", "type": "3", "party": "Republican", "description": "moderate Republican follower", "economic": "0.81", "social": "-0.28", "leadership": "0.24"}