{"name": "Beto.O'Rourke", "picture": "O000170.jpg", "detail": {"Early life, education and music career": "O'Rourke is a fourth-generation Irish American, born at Hotel Dieu Hospital in El Paso, the son of El Paso County Judge[a] Pat Francis O'Rourke and Melissa Martha (Williams), a stepdaughter of Fred Korth, who was the Secretary of the Navy under President John F. Kennedy, His family always called him \"Beto\", a common Spanish nickname for Roberto, Gilberto, and Alberto, initially to distinguish him from his namesake grandfather. His father was a political associate of former Texas Governor Mark White. Judge O'Rourke was killed in July 2001, at the age of fifty-eight, when he was struck from behind by a car while riding his bicycle over the New Mexico state line.O'Rourke attended Carlos Rivera and Mesita Elementary Schools and El Paso High School. He graduated from Woodberry Forest School in 1991. In the early 1990s, he was a bassist in the band Foss, which included Cedric Bixler-Zavala (vocalist for At the Drive-In and The Mars Volta) on vocals and drums. The group released a self-titled demo and a 7\" record, \"The El Paso Pussycats\", on Western Breed Records in 1993.O'Rourke attended Columbia University where he captained Columbia's rowing crew. He graduated from Columbia in 1995 with a Bachelor of Arts degree in English literature. He is fluent in Spanish.O'Rourke was arrested by University of Texas at El Paso (UTEP) police in 1995 on burglary charges after jumping a fence on the university's property. The UTEP police department later declined to pursue charges. In 1998, O'Rourke was arrested for driving while intoxicated (DWI), but the charges were later dismissed in 1999 after he completed a court-recommended DWI program.  He has publicly discussed the incident since that time and has apologized for it.", "Business career (1995–2005)": "Following college, O'Rourke worked at Internet service providers in New York City before his return to El Paso in 1998. The following year, he co-founded Stanton Street Technology, an internet services and software company that develops websites and software. His wife, Amy, operates the business as of March 2017.", "El Paso City Council (2005–2011)": "In mid-2005, O'Rourke ran for the El Paso City Council and defeated two-term incumbent City Councilman Anthony Cobos, 57%–43%. O'Rourke is one of the youngest representatives ever to have served on the City Council. In 2007, he won re-election to a second term, defeating Trini Acevedo, 70%–30%.In January 2009, O'Rourke sponsored a resolution calling for a \"comprehensive examination\" of the War on Drugs and \"the repeal of ineffective marijuana laws\". The resolution, which was unanimously supported by his colleagues on the El Paso City Council, was vetoed by then-Mayor John Cook and spurred a larger national discussion on the topic. He told reporters that the reason he decided to speak up about what he called the failed war on drugs was the thousands of people who have been killed in the drug war in the adjoining city of Ciudad Juarez, Chihuahua, Mexico. \"I hope it has all had its intended effect of starting the national discussion of the wisdom of the war on drugs […] and probably more importantly, helping to bring about a better solution than the status quo, which has led to the terror and tragedy in Juarez.\"", "US House of Representatives (2012–present)": "Elections2012In 2012, O'Rourke filed for the Democratic primary against the eight-term Silvestre Reyes to represent Texas's 16th congressional district. The primary was seen as the real contest in this deeply Democratic, Latino-majority district. O'Rourke took 50.5 percent of the vote, just a few hundred votes above the threshold required to avoid a runoff against Reyes. He was contrasted with Reyes in his support for LGBT rights and drug liberalization. He defeated his Republican opponent, Barbara Carrasco, in the general election with 65 percent of the vote.2014O'Rourke was re-elected in 2014 with 67% of the vote.During the fall of 2014, O'Rourke donated at least $28,000 from his own campaign funds to fellow Democratic candidates for House seats.2016In June 2016, O'Rourke endorsed Hillary Clinton for President. As a sitting member of Congress, O'Rourke was a superdelegate to the Democratic National Convention.  In October 2015, O'Rourke announced his bid for a third term in 2016. He won the Democratic primary and defeated his Green and Libertarian opponents in the general election.  When Nancy Pelosi faced a leadership challenge from Rep. Tim Ryan of Ohio, O'Rourke backed Ryan. O'Rourke said that he believed in term limits, and therefore that it was time for new leadership.Committee assignmentsCommittee on Armed ServicesSubcommittee on Emerging Threats and CapabilitiesSubcommittee on Strategic ForcesCommittee on Veterans' AffairsSubcommittee on Disability Assistance and Memorial AffairsSubcommittee on Oversight and InvestigationsCaucus membershipsNew Democrat CoalitionCongressional Arts Caucus", "2018 Senate campaign": "On March 31, 2017, O'Rourke formally announced his candidacy for the United States Senate seat held by incumbent Republican Party member Ted Cruz. In March 2018, O'Rourke became the Democratic Party nominee, winning 61.8% of the primary vote.  Texans haven’t elected a Democrat to statewide office since 1994.O'Rourke has campaigned in all of Texas's 254 counties, sometimes drawing large crowds and sometimes speaking to as few as 15 or 20 people.  He has said that he plans to run a positive campaign not focused on President Trump or Ted Cruz, although his political positions may be seen as a direct criticism of them.  O'Rourke is running his campaign without professional pollsters or consultants and instead is relying on volunteers, many of whom have no experience in running a political campaign.  Some supporters say that O'Rourke's \"promise of compassion\" more than any specific policy positions has drawn their support for him.FundingO'Rourke pledged  not to accept PAC contributions for his Senate campaign.  He raised $2 million within the first three months, mostly from small donations. During the campaign, PolitiFact rated his claim of not taking PAC money as \"true\". He received his first major organizational endorsement from End Citizens United in June 2017, which found that he had raised triple the funds of Cruz without accepting corporate special interest money. In the most recently reported quarter, he raised $10.4 million to Cruz’s $4.6 million,  with each candidate having raised $23 million by September 1. DebatesThe first of three scheduled debates with O'Rourkes's Republican opponent Ted Cruz took place on September 21, 2018.  The candidates disagreed sharply on every topic of discussion including gun rights, immigration, marijuana legalization, the \"take a knee\" controversy, and other issues including the confirmation of Supreme Court nominee Brett Kavanaugh.  At the close of the debate asked to \"say something nice about each other,\" O'Rourke praised Cruz's parenting. Cruz returned the compliment and went on to  compare O'Rourke to Bernie Sanders saying he \"admired [his] willingness to stand up for socialist beliefs and high taxes even though he knew it must be unpopular,\" to which O'Rourke replied \"True to form.\"During the debate, O'Rourke was asked about a DWI accident he'd been involved in when he was 26. O'Rourke said he did not try to leave the scene.  The Washington Post fact checker, Glenn Kessler, and PolitiFact both found O'Rourke's denial to be false, based on a police report which cited a witness who said he saw O'Rourke attempt to leave the scene of the accident. O'Rourke maintains the police report from the accident is inaccurate.EndorsementsSinger and activist Willie Nelson has announced his support for O’Rourke and held a rally for him on September 29 in Austin, Texas.  In a statement Nelson said, “My wife Annie and I have met and spoken with Beto and we share his concern for the direction things are headed.  Beto embodies what is special about Texas, an energy and an integrity that is completely genuine.”Polls and news coverageA September 18, 2018, Quinnipiac poll based on phone interviews put Cruz 9 percentage points ahead of O’Rourke among likely voters, but a September 19 Ipsos online poll done in conjunction with Reuters and the University of Virginia showed O'Rourke leading Cruz by 2 percentage points.  The Ipsos poll also questioned respondents about their major concerns; Republicans reported immigration as their major concern while Democrats reported healthcare.  Questioned regarding their likelihood of voting in the midterm elections, more Democrats than Republicans reported the likelihood that they would turn out.  Ipsos Vice President Chris Jackson called that \"unusual since Republicans usually have the momentum advantage in Texas.  It demonstrates how Democrats are mobilized.  This election is going to be really competitive and its going to be very hard fought.”", "Political views": "O'Rourke is a member of the New Democrat Coalition, which is described as moderate or centrist. He is sometimes considered to be a progressive or liberal Democrat. The non-partisan National Journal gave O'Rourke a composite ideology of 85% liberal and 15% conservative in 2013. Describing himself, O'Rourke has said that he does not know where he falls on the political spectrum, and he has sponsored bipartisan bills as well as broken with his party on issues like free trade. GovTrack places Representative O'Rourke near the ideological center of the House Democrats, being to the right of some and to the left of others; the American Civil Liberties Union gave him an 88% rating, while the United States Chamber of Commerce, a more fiscally conservative group, gave him a 47% rating. According to FiveThirtyEight, which tracks Congressional voting records, O'Rourke has voted in line with President Trump's position on legislation 28.7% of the time as of August 2018.EnvironmentO'Rourke supports efforts to combat global warming.  He supports putting a price on carbon emissions and wants to substantially increase the use of renewable energy.  He has been a vocal critic of the Administration's elimination of greenhouse gas regulations and the shrinking of the budget for environmental projects.O'Rourke has introduced legislation to establish a  national monument at Castner Range, near El Paso and successfully included a provision in the National Defense Authorization Act to protect the area, which includes a historic military training facility.O’Rourke’s holds a lifetime voting record of 95 percent and a 2017 score of 100 percent with the League of Conservation Voters’ national environmental ranking.Business and the economyO'Rourke supports stronger antitrust laws to break up monopolies which he believes \"stifle competition and innovation\".  He promotes industry and business regulations that promote competition, help the economy to grow, and protect consumers.  He believes, \"We must connect those out of work with the high value jobs being created right here in Texas by investing in the training, certification and apprenticeship programs that make it possible.\"He differs sharply from Cruz in that he has received high scores from labor unions with lifetime and yearly position scores of between 90% and 100% from the AFL-CIO to a 2017 Cruz score of 9%, and a 95% lifetime score from AFSCME to a 0% for Cruz.EducationO'Rourke is in favor of increasing federal aid to public schools in low-income communities. He believes that teachers and local education officials should have more autonomy in setting classroom standards with a reduction of emphasis on \"arbitrary, high-stakes tests.\"BipartisanshipAllegheny College bestowed the 2018 Prize for Civility in Public Life to O'Rourke together with Will Hurd, a Texas Republican. In March 2017, facing snowstorm induced flight cancellations O’Rourke and Hurd, both stuck in San Antonio, needed to get back to Washington for a House vote. They rented a car and embarked on a 1,600-mile drive that they captured on Facebook Live. O'Rourke and Hurd have worked collaboratively on important legislation since the road trip.Drug policyO'Rourke favors the decriminalization of possession and sale of small amounts of cannabis. In 2011, O'Rourke co-authored a book, Dealing Death and Drugs: The Big Business of Dope in the U.S. and Mexico, which in part argues for an end to the prohibition on marijuana. He has called for the arrest records of individuals sentenced for possession of small amounts of cannabis to be expunged. During the 2018 Senate campaign, O'Rourke's opponent, Ted Cruz, falsely claimed that O'Rourke sought to legalize heroin; what he had actually called for in 2009 was an \"honest, open national debate on ending the prohibition on narcotics\".VeteransO'Rourke has held monthly veterans town hall meetings since he was elected in 2013. Hearing about long wait times, especially regarding mental health, he did his own local survey of veterans.  The results of his survey showed wait times far exceeding what the VA was reporting. To try to better meet veteran's needs, O'Rourke and others worked to establish a new program at the El Paso VA designed to care for military related health issues within the hospital while using community clinics or medical facilities in the area for more standard medical needs.O'Rourke co-sponsored the bipartisan bill H.R. 1604, the Veterans' Mental Health Care Access Act, with Republican Congressmen Tom MacArthur, which expanded options for veterans seeking mental health care to non-VA facilities. O'Rourke serves on both the House Veterans' Affairs Committee, and the House Armed Services Committee, which oversees military installations such as Fort Bliss, headquartered in El Paso.Criminal justice reformO'Rourke has called for an end to cash bail, saying it disproportionately places poor individuals in jail as they cannot afford bail.AbortionO'Rourke has a lifetime score of 100% from the Planned Parenthood Action Fund and a rating of 100% from NARAL Pro-Choice America. He voted against the No Taxpayer Funding for Abortion and Abortion Insurance Full Disclosure Act of 2017, which made a permanent prohibition on the use of federal funds for abortions and made reforms to the Patient Protection and Affordable Care Act to prohibit qualified health plans from including coverage for abortions.[non-primary source needed]LGBT rightsO'Rourke told the Dallas Voice that he called marriage equality a core civil rights issue during his House primary campaign. While on the El Paso City Council, O'Rourke led a successful fight to overturn the domestic partnership ban. He was a co-sponsor of the Domestic Partnership Benefits and Obligations Act of 2013 (H.R. 3135).ImmigrationO'Rourke favors comprehensive immigration reform. O'Rourke opposed Trump's decision to end Deferred Action for Childhood Arrivals (DACA), which granted temporary stay to some undocumented immigrants who were brought to the United States as minors. O'Rourke said it is a \"top priority\" to protect DREAMers. He has criticized President Donald Trump's rhetoric on immigration, saying: \"[Trump is] constantly stoking anxiety and fear about Mexicans, immigrants and the border with Mexico. Unfortunately this President takes another step into a dark world of fear, isolation and separation.\"Ted Cruz asserted in 2018 that O'Rourke wanted \"open borders and wants to take our guns.\" PolitiFact found that Cruz's claims were \"false,\" noting that O'Rourke had \"not called for opening the borders or for government agents to take guns from law-abiding residents.\"In June 2018, O'Rourke led protests in Tornillo, Texas,  to protest the Trump administration family separation policy which involved the separation of children of immigrant families. The city is located just miles from the Rio Grande, the river that creates the border of the United States and Mexico in the state of Texas. The Trump administration had created a \"tent-city\" in Tornillo, where separated children were being held without their parents. O'Rourke called this practice \"Un-American\" and the responsibility of all Americans.Health careO'Rourke has expressed support for single-payer legislation to achieve universal health coverage, but has released a statement saying he's critical of John Conyers' Medicare For All bill (HR 676) for not allocating funds toward for-profit healthcare providers. He supports stabilization of the insurance markets to improve the Patient Protection and Affordable Care Act. He also supports the expansion of Medicaid and is a co-sponsor of the Medicare-X Choice Act of 2017.Gun policyOn the evening of June 22, 2016, O'Rourke participated in the sit-in in the House of Representatives that attempted to force a vote on gun control legislation. When the Republicans ordered C-SPAN to turn off its normal coverage of the chamber, O'Rourke and Representative Scott Peters transmitted images by cell phone to social media for C-SPAN to broadcast.He supports universal background checks for gun purchases. On March 7, 2018, O'Rourke told Alisyn Camerota of CNN: \"We have a great tradition and culture of gun ownership and gun safety for hunting, for sport, for self-defense... I think that can allow Texas to take the lead on a really tough issue, which the country is waiting for leadership and action on.\" He has called for a complete ban on assault rifles.Trump–Putin SummitIn July 2018, O'Rourke said that Trump's performance while attending the 2018 Russia–United States summit in Helsinki warranted impeachment. Addressing the Trump–Putin joint press conference of July 16, he said standing \"on stage in another country with the leader of another country who wants to and has sought to undermine this country, and to side with him over the United States—if I were asked to vote on this I would vote to impeach the president\".IsraelO'Rourke denounced the move of the US embassy to Jerusalem as \"provocative\".  He supports a two-state solution and believes that the U.S. could best support a peaceful settlement by urging Israel  to discontinue settlements in the West Bank and assist the Palestinian Authority to negotiate  in good faith and recognize Israel's right to exist.Racial inequalityO'Rourke has spoken out against racial inequality.  He supports the football players who have taken part  in the \"Take a knee\" protests.  Speaking in a video that went viral, O'Rourke said he believes there is \"nothing more American than to peacefully stand up, or take a knee, for your rights, anytime, anywhere or any place.\"", "Personal life": "O'Rourke married Amy Hoover Sanders, the daughter of Louann and William Sanders of El Paso, on September 24, 2005, in Santa Fe, New Mexico. The couple has three children. Louann Sanders is the director of education development for the La Fe Community Development Corporation and executive director of the La Fe Preparatory charter school.In 2013, LegiStorm reported that O'Rourke may have violated the Stop Trading on Congressional Knowledge (STOCK) Act, which prohibits members of Congress from participating in the initial public offering (IPO) of company stocks. O'Rourke had purchased seven stocks, including stock in Twitter, at IPO prices, seeing a 39 percent increase on shares that he sold either the same day or within days of IPOs. After being contacted by LegiStorm, O'Rourke reported himself to the United States House Committee on Ethics. The case was closed by the ethics committee after O'Rourke acknowledged that he may have violated the law and agreed to sell his remaining IPO shares and surrender his $7,136 in profit to the U.S. Treasury.", "Publications": "O'Rourke, Beto and Byrd, Susie (2011). Dealing Death and Drugs: The Big Business of Dope in the U.S. and Mexico. Cinco Puntos Press .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em}ISBN 1933693940", "introduction": "Robert Francis \"Beto\" O'Rourke (/ˈbɛtoʊ/; born September 26, 1972) is an American politician and businessman serving as the U.S. Representative for Texas's 16th congressional district since 2013. He is the nominee of the Democratic Party in the 2018 Texas U.S. Senate race, running against Republican incumbent Ted Cruz.\nA native of El Paso, he was elected to the United States House of Representatives in 2012 by defeating incumbent Democratic U.S. Representative Silvestre Reyes in the Democratic primary that year. The district includes most of El Paso County. Prior to his election to Congress, O'Rourke was on the El Paso City Council from June 2005 to June 2011. \n\n", "code": "16"}, "personal": {"Born": "Robert Francis O'Rourke (1972-09-26) September 26, 1972 (age46)El Paso, Texas, U.S.", "Political party": "Democratic", "Spouse(s)": "Amy Hoover Sanders (m.2005)", "Children": "3", "Residence": "Sunset Heights, El Paso, Texas, U.S.", "Education": "Columbia University (BA)"}, "timeline": {"Member of the US House of Representativesfrom Texas's 16th district": {"date": "Assumed office January 3, 2013", "Preceded by": "Silvestre Reyes"}, "Member of the El Paso City Councilfrom the 8th district": {"date": "In officeJune 1, 2005– June 27, 2011", "Preceded by": "Anthony Cobos", "Succeeded by": "Cortney Niland"}, "code": "16"}, "code": "O000170", "type": "4", "party": "Democrat", "description": "rank-and-file Democrat", "economic": "-0.3", "social": "-0.33", "leadership": "0.41"}