{'name': 'Bill.Nelson', 'picture': 'N000032.jpg', 'detail': {'Early life and family': 'Nelson was born on September 29, 1942, in Miami, Florida, the only child of Nannie Merle (née Nelson) and Clarence William Nelson. He is of Scottish, Irish, English, and Danish descent. His father died of a heart attack when Nelson was 14 and his mother of Lou Gehrig\'s disease (ALS) when he was 24.Nelson grew up in Melbourne, Florida, where he attended Melbourne High School.He attended Baptist and Episcopal churches but later was baptized through immersion in a Baptist church. He served as International President of Kiwanis-sponsored Key Club International in 1959–60. In 2005, he joined the First Presbyterian Church in Orlando.Nelson attended the University of Florida, where he was a member of Florida Blue Key, and the Beta Theta Pi social fraternity. He transferred to Yale University, where he was a member of the Book and Snake secret society. He received a law degree from the University of Virginia.In 1965, during the Vietnam War, he joined the U.S. Army Reserve. He served on active duty from 1968 to 1970, attaining the rank of captain, and he remained in the Army until 1971. Nelson was admitted to the Florida bar in 1968, and began practicing law in Melbourne in 1970. In 1971, he worked as legislative assistant to Governor Reubin Askew.In 1972, Nelson married Grace Cavert. The couple have two adult children: Charles William "Bill Jr." Nelson and Nan Ellen Nelson.', 'Space Shuttle Columbia': "In 1986, Nelson became the second sitting member of Congress (and the first member of the House) to travel into space. He went through NASA training with Senator Jake Garn of Utah. Nelson was a Payload Specialist on Space Shuttle Columbia's STS-61-C mission from January 12 to January 18, 1986. The Space Shuttle Columbia landed at Edwards AFB at 5:59\xa0a.m. PST, on January 18. The mission's elapsed time was 6 days, 2 hours, 45 minutes, and 51 seconds. This flight was the last successful space shuttle flight prior to the Challenger accident, which occurred only ten days after the return of the Columbia. In 1988, Nelson published a book about his space flight experience entitled Mission: An American Congressman's Voyage to Space.", 'Early political career': 'Florida legislature In 1972, Nelson was elected to the Florida House of Representatives from the 47th District, representing much of Brevard County and portions of Orange and Seminole Counties. He won reelection in 1974 and 1976.U.S. House of Representatives Nelson was elected to the U.S. House of Representatives in 1978 in the open 9th District after the five-term Republican incumbent, Louis Frey Jr., chose to run for governor rather than for re-election. In 1980, Nelson was reelected to that district, which encompassed all of Brevard and part of Orange County. He was redistricted to the 11th District, encompassing all of Brevard and parts of Orange, Indian River, and Osceola counties, and won re-election in 1982, 1984, 1986, and 1988. He remained a member of the U.S. House until 1991.1990 gubernatorial election In 1990, Nelson ran unsuccessfully for the Democratic nomination for Governor of Florida. He lost to former U.S. Senator Lawton Chiles, who went on to win the general election. Treasurer, Insurance Commissioner and Fire Marshal In 1994 Nelson announced his intention to seek the office of Treasurer, Insurance Commissioner and Fire Marshal of Florida. He won the election with 52% of the vote over State Rep. Tim Ireland\'s 48%. In 1998, he won re-election to the office, again defeating Ireland.In 2000, Nelson announced that he would be running for the United States Senate seat held by retiring Republican Connie Mack III. Florida\'s "resign-to-run" law requires an incumbent office holder seeking another elective office to submit an irrevocable resignation from the office he or she currently holds unless that tenure would end anyway before the office holder would, if elected, assume the new position. The candidate may designate the effective date of the resignation to be in the future, but it must be no later than the date on which he or she would assume the new office. This law compelled Nelson to submit his resignation as Treasurer, Insurance Commissioner and Fire Marshall early in 2000 when he began to campaign for the U.S. Senate seat. He chose January 3, 2001, as the effective date of his resignation, as that was the date on which new Senators would be sworn in.', 'United States Senate': 'Elections 2000 election In 2000, Nelson ran as a Democrat for the U.S. Senate seat vacated by retiring Republican Senator Connie Mack III. He won the election, defeating U.S. Representative Bill McCollum, who ran as the Republican candidate.2006 election Following the 2004 election, in which Republican George W. Bush was re-elected and the Republican Party increased its majority in both the House and the Senate, Nelson was seen as vulnerable. He was a Democrat in a state that Bush had won, though by a margin of only five percentage points.Evangelical Christian activist James Dobson declared that Democrats, including Nelson, would be "in the \'bull\'s-eye\'" if they supported efforts to block Bush\'s judicial nominees. Nelson\'s refusal to support efforts in Congress to intervene in the Terri Schiavo case was seen as "a great political issue" for a Republican opponent to use in mobilizing Christian conservatives against him.Katherine Harris, the former Florida Secretary of State and two-term U.S. representative, defeated three other candidates in the September 5 Republican primary. Harris\'s role in the 2000 presidential election made her a polarizing figure. Many Florida Republicans were eager to reward her for her perceived party loyalty in the Bush-Gore election, while many Florida Democrats were eager to vote against her for the same reason. In May, when the party found itself unable to recruit a candidate who could defeat Harris in the primary, many Republican activists admitted that the race was already lost.Nelson focused on safe issues, portraying himself as a bipartisan centrist problem-solver.He obtained the endorsement of all 22 of Florida\'s daily newspapers. Harris failed to secure the endorsement of Jeb Bush, who publicly stated that she could not win; the U.S. Chamber of Commerce, which had supported her in her House campaigns, did not endorse her in this race.As the election approached, polls showed Harris trailing Nelson by 26 to 35 points. Nelson transferred about $16.5 million in campaign funds to other Democratic candidates, and won the election with 60.4% of the vote to Harris\'s 38.2%.2012 election Vice President Joe Biden called Nelson crucial to President Obama\'s chances for winning Florida in 2012. In March 2011, Biden was reported as having said that if Nelson lost in 2012, "it means President Obama and the Democratic presidential ticket won\'t win the key battleground state, either." Congressman Connie Mack IV, the son of Nelson\'s direct predecessor in the Senate, won the Republican nomination. Nelson eventually defeated Mack with 55.2% of the vote to Mack\'s 42.2%.2018 election Nelson is running for re-election in 2018. He ran unopposed in the Democratic Party primary, which took place on August 28, 2018.Committee assignments In the 113th United States Congress, Nelson served on the following committees:Committee on Armed ServicesSubcommittee on AirlandSubcommittee on Emerging Threats and CapabilitiesSubcommittee on SeapowerCommittee on the BudgetCommittee on Commerce, Science, and TransportationSubcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Oceans, Atmosphere, Fisheries, and Coast GuardSubcommittee on Science and Space (Chairman)Committee on FinanceSubcommittee on Health CareSubcommittee on Energy, Natural Resources, and InfrastructureSubcommittee on Social Security, Pensions, and Family PolicySpecial Committee on Aging (Chairman)In the 114th United States Congress, Nelson served on the following committees:Committee on Commerce, Science and Transportation (Ranking Member)Subcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Consumer Protection, Product Safety, Insurance and Data SecuritySubcommittee on Oceans, Atmosphere, Fisheries, and Coast GuardSubcommittee on Space, Science and CompetitivenessSubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on Armed ServicesSubcommittee on Emerging Threats and Capabilities (Ranking Member)Subcommittee on Sea PowerSubcommittee on Strategic ForcesCommittee on FinanceSubcommittee on Energy, Natural Resources, and InfrastructureSubcommittee on International Trade, Customs, and Global CompetitivenessSubcommittee on Taxation and IRS OversightUnited States Senate Special Committee on Aging', 'Political positions': 'Nelson is often considered to be a moderate Democrat. He has styled himself as a centrist during his various campaigns. During Nelson\'s 2018 re-election campaign, challenger Rick Scott characterized Nelson as a "socialist"; PolitiFact described the assertion as "pants-on-fire" false. According to ratings by the National Journal, Nelson was given a 2013 composite score of 21% conservative and 80% liberal. In 2011, he was given composite scores of 37% conservative and 64% liberal. He also has a lifetime conservative rating of nearly 30% from the American Conservative Union. Conversely, the Americans for Democratic Action gave Nelson a 90% liberal quotient for 2016. In the 115th Congress, Nelson was more conservative than 93% of other congressional Democrats. GovTrack, which analyzes a politician\'s record, places Nelson near the Senate\'s ideological center and GovTrack placed him among the most moderate Senators in 2017.The only Florida Democrat in statewide office as of 2017, he was described by Politico in March of that year as "a Senate indicator species...an institutional centrist." Politico wrote that the Democratic Party "is shifting left and so is he."As of July 2017, Nelson had a 53% approval rating and 25% disapproval rating, with 22% of survey respondents having no opinion on his job performance. FiveThirtyEight, which tracks Congressional votes, shows that Nelson has voted with President Donald Trump\'s positions 42.5% of the time as of June 2018.Interest group ratings Nelson scores 100% on Planned Parenthood Action Fund\'s Congressional Scorecard and 100% on NARAL\'s Congressional Record.Nelson scored a 28.4 lifetime rating on the American Conservative Union\'s scale of 0 to 100, but a 0 out of 100 in its 2015 ratings. He scored a 9 out of 100 on the 2016 FreedomWorks ratings. He scored a 7 out of 100 on Club for Growth\'s 2015 scorecard and an 11 out of 100 on its lifetime ratings; in 2015-16 the National Tax Limitation Committee gave him a 5% rating. In 2018, Conservative Review gave him a 0% rating. He scored a 90% from the Americans for Democratic Action in 2015, the most recent year they made ratings public.In 2015, Nelson had an 84% rating from the League of Conservation Voters.He has received a 19% rating from the Council for Citizens Against Government Waste (2016), 5% from Club for Growth (2016), 17% from National Taxpayers Union (2016). In 2015 and 2017 respectively, Nelson received 0% ratings from the Federation for American Immigration Reform and Numbers USA, both of which support immigration limits.In 2017, he received 100% ratings the American Public Health Association.Vote Smart issue positions Vote Smart, a non-profit, non-partisan research organization that collects and distributes information on candidates for public office in the United States, "researched presidential and congressional candidates\' public records to determine candidates\' likely responses on certain key issues." According to Vote Smart\'s 2016 analysis, Nelson generally supports pro-choice legislation, opposes U.S. combat operations in Afghanistan, supports reducing defense spending in order to balance the budget, supports an income tax increase in order to balance the budget, supports federal spending as a means of promoting economic growth, supports providing tax incentives to businesses for the purpose of job creation, supports requiring states to adopt federal education standards, opposes reducing restrictions on offshore energy production, supports the federal regulation of greenhouse gas emissions, supports restrictions on the purchase and possession of guns, opposes repealing the Affordable Care Act, opposes requiring immigrants who are unlawfully present to return to their country of origin before they are eligible for citizenship, and opposes allowing individuals to divert a portion of their Social Security taxes into personal retirement accounts.Economic issues TradeIn 2005, Nelson was one of ten Democrats who voted in favor of the Dominican Republic – Central America Free Trade Agreement (CAFTA) on its 55–45 passage in the Senate.Tax policyOn several occasions, Nelson has voted to reduce or eliminate the estate tax, notably in June 2006, when he was one of four Democrats voting for a failed (57–41) cloture motion on a bill to eliminate the tax.Nelson voted against a Republican plan to extend the Bush tax cuts to all taxpayers. Instead, Nelson supported extending the tax cuts for those with incomes below $250,000. Nelson voted for the Buffett Rule in April 2012. Speaking of his support for the Buffett Rule, Nelson said he voted to raise the minimum tax rate on incomes over $1 million per year to 30% in order to reduce the budget deficit and to make the tax code more fair. Nelson said, "In short, tax fairness for deficit reduction just makes common sense."Nelson voted in 2011 to end Bush-era tax cuts for those earning over $250,000 but voted for $143 billion in tax cuts, unemployment benefits, and other economic measures.In 2013 Nelson advocated tax reform, which he defined as "getting rid of special interest tax breaks and corporate subsidies." Stating needed qualities of said reform, he listed "simplicity, fairness, and economic growth".He and Susan Collins introduced legislation in 2015 that would "make it easier for smaller businesses to cut administrative costs by forming multiple-employer 401(k)-style plans."Government spendingNelson voted for the American Recovery and Reinvestment Act of 2009, often referred to as economic stimulus, proposed by President Obama. In August 2011, Nelson voted for a bill to increase the debt ceiling by $400 billion. Nelson said that while the bill was not perfect, "this kind of gridlock doesn\'t do anything." Nelson voted against Paul Ryan\'s budget.Consumer affairsIn May 2013, Nelson asked the Federal Trade Commission and the Consumer Financial Protection Bureau to investigate why consumers who carried out a real-estate short sale were having their credit scores lowered to the same degree as those who went through foreclosure. Nelson suggested a penalty if the issue was not addressed within ninety days.Flood insuranceNelson voted in favor of the Biggert–Waters Flood Insurance Reform Act of 2012, which required the National Flood Insurance Program to raise insurance rates for some properties at high risk of flooding to better reflect true flood risk costs and keep the program solvent. In 2014, following an outcry by Florida property owners facing steep flood insurance-rate hikes, Nelson supported legislation that would provide retroactive refunds for taxpayers who had experienced large hikes in their flood-insurance rates due to the sale or purchase of a home. The proposal would also cap average annual premium increases at 15 to 18 percent and allow insurance-rates subsidies based on current flood maps.EarmarksIn 2010, PolitiFact found that Nelson had flip-flopped on the issue of earmarks, pushing for a moratorium on the practice after saying that "earmarks were an important part of creating jobs and growing Florida\'s economy."Terrorism In September 2014, Nelson said the U.S. should hit back at ISIS immediately because "the U.S. is the only one that can put together a coalition to stop this group that\'s intent on barbaric cruelty."He supported the "Denying Firearms and Explosives to Dangerous Terrorists Act." Introduced in 2013 and again in 2015, it would keep guns from people with suspected terrorist links.Standing outside the Orlando Pulse nightclub immediately after the June 2016 massacre there, Nelson called Omar Mateen a "lone wolf," and when asked if it was an act of jihad he said he could not confirm that. Shortly afterwards, citing intelligence sources, Nelson said there was apparently "a link to Islamic radicalism," perhaps ISIS. Nelson later said on the Senate floor that "terrorists...want to divide people" but that Mateen had instead "brought people together. Following the massacre, Nelson and Barbara Mikulski supported an increase in FBI funding. A year after the Orlando massacre, Nelson attended a memorial at which he reiterated that it had "united Orlando and it united the country."He supported the Terrorist Firearms Prevention Act of 2016.In August 2017, the Miami Herald urged Nelson to back Lindsey Graham\'s Taylor Force Act, which would block U.S. subsidies to the Palestinian Authority, which gives monetary assistance to "Palestinian prisoners, former prisoners and families of \'martyrs.\'" Nelson did vote for the bill, which passed overwhelmingly.Health care In March 2010, Nelson voted for the Patient Protection and Affordable Care Act, also known as Obamacare, and the Health Care and Education Reconciliation Act of 2010, which passed and were signed into law by President Obama.Nelson called in 2014 for the expansion of Medicaid.In 2016, he called the House Zika bill "a disaster," complaining that it would take "$500 million in health care funding away from Puerto Rico" and limit access to "birth control services needed to help curb the spread of the virus and prevent terrible birth defects." In 2017 Nelson wrote a letter to the Center for Disease Control and Prevention (CDC) asking them to prioritize Zika prevention.In September 2017, Nelson and Susan Collins (R-ME) introduced the Reinsurance Act of 2017, an effort "to stabilize the health insurance marketplace." It would provide $2.25 billion to "reduce risk for insurance companies by providing funds to insurers for high-risk enrollees" and "help keep premiums in check."Immigration In January 2017, Nelson wrote President Trump a letter protesting his immigration order. "Regardless of the constitutionality or legality of this Executive Order," he wrote, "I am deeply concerned that it may do more harm than good in our fight to keep America safe." U.S. success in the fight against terrorism, he argued, "depends on the cooperation and assistance of Muslims who reject radicalism and violence. Whether intended or not, this Executive Order risks alienating the very people we rely upon in the fight against terror."Space exploration and NASA In March 2010, Nelson complained that President Obama had made a mistake in canceling NASA\'s Constellation program. On July 7, 2011, it was reported that Nelson said Congress "starved" the space program of funding for several years, but suggested that the situation was turning around and called on the Obama administration to push for NASA funding.In 2017 and 2018, Nelson sought to prevent Jim Bridenstine, President Trump\'s nominee to head NASA, from being confirmed in the Senate. Bridenstine had no formal qualifications in science or engineering, and rejected the scientific consensus on climate change. Bridenstine was ultimately confirmed.LGBT rights On December 18, 2010, Nelson voted in favor of the Don\'t Ask, Don\'t Tell Repeal Act of 2010, which established a legal process for ending the policy that prevented gay and lesbian people from serving openly in the United States Armed Forces.On April 4, 2013, Nelson announced that he no longer opposed same-sex marriage. He wrote, "The civil rights and responsibilities for one must pertain to all. Thus, to discriminate against one class and not another is wrong for me. Simply put, if The Lord made homosexuals as well as heterosexuals, why should I discriminate against their civil marriage? I shouldn\'t, and I won\'t."Foreign policy Iraq WarNelson voted for the Authorization for Use of Military Force Against Iraq Resolution of 2002 authorizing military action against Iraq.VenezuelaIn April 2017, Nelson called for tougher economic sanctions against Venezuela, which he called an "economic basket case."CubaHe opposed a 2009 spending bill until his concerns about certain provisions in the bill related to Cuba were assuaged by Treasury Secretary Tim Geithner, who assured him that those provisions "would not amount to a major reversal of the decades-old U.S. policy of isolating the communist-run island."Syria visitIn 2006, Nelson met with Syrian President Bashar Assad in Damascus at the recommendation of the bipartisan Iraq Study Group to try to improve US-Syria relations and help stabilize Iraq. He did this despite the United States Department of State and the White House saying they disapproved of the trip.Gun control In 2012, the National Rifle Association (NRA) gave Nelson a "F" rating for his support of gun control. Nelson is an advocate for new gun control laws, including an assault weapons ban, a ban on magazines over ten rounds, and a proposal that would require individuals buying guns at gun shows to have background checks.In response to the 2016 Orlando nightclub shooting, Nelson expressed remorse that the Democrats\' Feinstein Amendment, which would have banned the sale of guns to individuals on the terrorist watch list, and a Republican proposal to update background checks and to create an alert for law enforcement when an individual is placed on the terrorist watch list, had failed to pass the Senate. He stated "What am I going to tell the community of Orlando that is trying to come together in the healing? Sadly, what I am going to have to tell them is that the NRA won again." Both he and Marco Rubio supported the bills.In October 2017, after the Las Vegas mass shooting, Nelson and Diane Feinstein sponsored a bill to ban bump stocks for assault weapons. "I\'m a hunter and have owned guns my whole life," he said. "But these automatic weapons are not for hunting, they are for killing."Nelson spread misinformation via Twitter after the Parkland shooting, falsely claiming that shooter Nikolas Cruz wore a gas mask and tossed smoke grenades as he shot people. After an April 2018 shooting in Liberty City, Nelson claimed that assault weapons had been used in the shooting, when in fact handguns were used.Student loans In July 2017, Nelson introduced legislation to cut interest rates on student loans to 4 percent.Environment Nelson and Mel Martinez co-sponsored a 2006 bill banning oil drilling off Florida\'s Gulf Coast. In 2017 he said he wanted the ban to continue to 2027, but that it was "vigorously opposed by the oil industry." Along with 16 Florida congress members from both parties, he urged the Trump administration to keep the eastern Gulf of Mexico off limits to oil and gas drilling. "Drilling in this area," they wrote, "threatens Florida\'s multibillion-dollar tourism-driven economy and is incompatible with the military training and weapons testing that occurs there."In 2011, Nelson co-sponsored the RESTORE Act, which directed money from BP fines to states affected by the Deepwater Horizon oil spill.On June 27, 2013, Nelson co-sponsored the Harmful Algal Bloom and Hypoxia Research and Control Amendments Act of 2013 (S. 1254; 113th Congress), a bill that would reauthorize and modify the Harmful Algal Bloom and Hypoxia Research and Control Act of 1998 and would authorize the appropriation of $20.5 million annually through 2018 for the National Oceanic and Atmospheric Administration (NOAA) to mitigate the harmful effects of algal blooms and hypoxia.In 2015, after Gov. Rick Scott directed Florida officials to stop using the terms "climate change" and "global warming," Nelson introduced an amendment to prevent federal agencies from censoring official communications on climate change. It "fell to a point of order after a 51-49 vote, though Senator Marco Rubio (R-FL) joined Nelson in supporting the amendment."Hurricanes After Hurricane Maria in 2017, Nelson and Marco Rubio agreed that Trump had taken too long to send the U.S. military to Puerto Rico to take part in relief efforts. "For one week we were slow at the switch," Nelson said in San Juan. "The most efficient organization in a time of disaster is an organization that is already capable of long supply lines in combat. And that\'s the U.S. military." After Hurricane Maria led many Puerto Ricans to flee to Florida, Nelson encouraged them to register to vote there.Nelson was criticized for sending campaign fundraising emails in the wake of Hurricane Irma.Supreme Court Nelson opposed and filibustered the nomination of Neil Gorsuch for the Supreme Court.Security and surveillance In 2007, Nelson was the only Democrat on the Senate Intelligence Committee to vote against an amendment to withhold funds for the use by the CIA of enhanced interrogation techniques on terrorism suspects. His vote, combined with those of all Republican members of the committee, killed the measure.In January 2018, Nelson voted to reauthorize the Foreign Intelligence Surveillance Act, which allows the National Security Agency to extend a program of warrantless spying on internet and phone networks. In 2015, he had called for a permanent extension of the law.', "Claims about Russian interference in Florida's 2018 elections": 'On August 7, 2018, Nelson made a controversial claim that Russian operatives had penetrated some of Florida\'s election systems ahead of the 2018 midterm elections. He stated that more detailed information was classified. The Washington Post could not find evidence to backup Nelson\'s claims, doubt that the classified information exists and pointed out other inaccuracies in Nelson\'s statements on the matter. PolitiFact did not evaluate Nelson\'s statements regarding alleged Russian election hacking because it could not "independently evaluate classified information," but wrote that Nelson "offered little evidence to back up his point."  However, later that August, "three people familiar with the intelligence" told NBC News "that there is a classified basis for Nelson\'s assertion." A government official familiar with the intelligence told McClatchy that Russian hackers had penetrated some of Florida\'s county voting systems. The Tampa Bay Times reported that Nelson had been told by leaders of the Senate Intelligence Committee of a penetration of some of Florida\'s voter registration databases.Department of Homeland Security Secretary Kirstjen Nielsen and FBI director Christopher Wray refuted Nelson\'s claims in a letter to Florida election officials. Amid the criticism, Nelson defended his assertions about Russian penetration, saying he and fellow Florida Senator Marco Rubio had been instructed by Mark Warner and Richard Burr, leaders of the Senate Intelligence Committee, to warn the Florida Secretary of State about Russian interference. Warner and Burr neither confirmed nor denied Nelson\'s claim that Florida\'s systems had been penetrated, while Rubio "has taken a line on the controversy similar to Burr and Warner\'s." The Foundation for Accountability and Civic Trust, a conservative watchdog group, filed an ethics complaint against Nelson, saying that he "discussed classified information or made it up."', 'Electoral history': 'Florida State House of Representatives election 1972PartyCandidateVotes%±DemocraticBill Nelson 26,771 68.9  RepublicanDavid Vozzola12,07831.1Florida 9th District U.S. House of Representatives election 1978PartyCandidateVotes%±DemocraticBill Nelson 89,543 61.5  RepublicanEdward J. Gurney56,07438.5Florida 9th District U.S. House of Representatives election 1980PartyCandidateVotes%±DemocraticBill Nelson (Incumbent) 139,468 70.4  RepublicanStan Dowiat58,73429.6Florida 11th District U.S. House of Representatives election 1982PartyCandidateVotes%±DemocraticBill Nelson (Incumbent) 101,746 70.6  RepublicanJoel Robinson42,42229.4Florida 11th District U.S. House of Representatives election 1984PartyCandidateVotes%±DemocraticBill Nelson (Incumbent) 145,764 60.5  RepublicanRob Quartel95,11539.5Florida 11th District U.S. House of Representatives election 1986PartyCandidateVotes%±DemocraticBill Nelson (Incumbent) 149,109 72.7  RepublicanScott Ellis55,95227.3Florida 11th District U.S. House of Representatives election 1988PartyCandidateVotes%±DemocraticBill Nelson (Incumbent) 168,390 60.8  RepublicanBill Tolley108,37339.2Florida Governor, Democratic primary election 1990PartyCandidateVotes%±DemocraticLawton Chiles 745,325 69.5  DemocraticBill Nelson327,73130.5Florida State Treasurer, Insurance Commissioner and Fire Marshal election 1994PartyCandidateVotes%±DemocraticBill Nelson 2,070,604 51.7  RepublicanTim Ireland1,933,57048.3Florida State Treasurer, Insurance Commissioner and Fire Marshal election 1998PartyCandidateVotes%±DemocraticBill Nelson (Incumbent) 2,195,283 56.5 +4.8 RepublicanTim Ireland1,687,71243.5-4.8Florida U.S. Senate election 2000PartyCandidateVotes%±DemocraticBill Nelson 2,987,644 52.1  RepublicanBill McCollum2,703,60847.2Florida U.S. Senate election 2006PartyCandidateVotes%±DemocraticBill Nelson (Incumbent) 2,890,548 60.3 +9.8 RepublicanKatherine Harris1,826,12738.1Florida U.S. Senate election 2012PartyCandidateVotes%±DemocraticBill Nelson (Incumbent) 4,523,451 55.23 -5.07 RepublicanConnie Mack IV3,458,26742.23+4.13', 'Further reading': 'Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of CongressBill Nelson official NASA astronaut biography', 'introduction': 'Clarence William Nelson II (born September 29, 1942) is an American politician serving as the senior United States Senator from Florida. Before becoming a politician he served in the U.S. Army Reserve in the Vietnam War. He was first elected to the Senate in 2000. A member of the Democratic Party, Nelson served in the Florida House of Representatives from 1972 to 1978. He then served in the United States House of Representatives from 1979 to 1991. In January 1986, he became the second sitting member of the United States Congress to fly in space when he served as a payload specialist on the Space Shuttle Columbia.\nNelson retired from Congress in 1990 to run for Governor of Florida, but was unsuccessful. He was appointed Treasurer, Insurance Commissioner and Fire Marshal of Florida, serving from 1995 to 2001. In 2000, Nelson was elected to the U.S. Senate seat that had been vacated by retiring Republican Senator Connie Mack III. He was re-elected in 2006 with 60% of the vote and in 2012 with 55% of the vote. In the Senate, he is generally considered a moderate Democrat. As of 2018, he is the only Democratic statewide elected official in Florida.\n\n'}, 'personal': {'date': 'BornClarence William Nelson II (1942-09-29) September 29, 1942 (age76)Miami, Florida, U.S.', 'Political party': 'Democratic', 'Children': '2', 'Education': 'University of FloridaYale University (BA)University of Virginia (JD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Florida': {'date': 'Assumed office January 3, 2001Serving with Marco Rubio', 'Preceded by': 'Connie Mack III'}, 'Ranking Member of the Senate Commerce Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'John Thune'}, 'Chair of the Senate Aging Committee': {'date': 'In officeJanuary 3, 2013– January 3, 2015', 'Preceded by': 'Herb Kohl', 'Succeeded by': 'Susan Collins'}, 'Treasurer, Insurance Commissioner and Fire Marshal of Florida': {'date': 'In officeJanuary 3, 1995– January 3, 2001', 'Governor': 'Lawton ChilesBuddy MacKayJeb Bush', 'Preceded by': 'Tom Gallagher', 'Succeeded by': 'Tom Gallagher'}, 'Member of theUS House of Representativesfrom Florida': {'date': 'In officeJanuary 3, 1979– January 3, 1991', 'Preceded by': 'Louis Frey Jr.', 'Succeeded by': 'Jim Bacchus', 'Constituency': '9th district (1979–1983)11th district (1983–1991)'}, 'Member of the Florida House of Representativesfrom the 47th district': {'date': 'In officeNovember 7, 1972– November 7, 1978', 'Preceded by': 'Redistricted', 'Succeeded by': 'Tim Deratany'}, 'Military service': {'Allegiance': 'United States', 'Service/branch': 'United States Army', 'Years of service': '1965–1968, 1970–1971 (Reserve)1968–1970 (Active)', 'Rank': ' Captain'}, 'NASA payload specialist': {'Time in space': '6d 02h 03m', 'Missions': 'STS-61-C', 'Mission insignia': ''}}, 'code': 'N000032'}