{'name': 'Bob.Corker', 'picture': 'C001071.jpg', 'detail': {'Early life and family': 'Corker was born in Orangeburg, South Carolina, the son of Jean J. (née Hutto) and Robert Phillips "Phil" Corker. His great-great-grandfather was U.S. Congressman Stephen A. Corker. His family moved to Tennessee when he was eleven.Corker graduated from Chattanooga High School in 1970 and earned a Bachelor of Science degree in Industrial Management from the University of Tennessee, Knoxville in 1974. Corker is a member of Sigma Chi fraternity. Corker\'s roommate in the Sigma Chi fraternity was Cleveland Browns owner Jimmy Haslam, whose brother is the current Tennessee governor Bill Haslam.During his twenties Corker participated in a mission trip to Haiti, which he credits with inspiring him to become more active in his home community. Following his return, Corker helped found the Chattanooga Neighborhood Enterprise, a nonprofit organization that has provided low-interest home loans and home maintenance education to thousands of Tennesseans since its creation in 1986.Corker and his wife Elizabeth, whom he married on January 10, 1987, have two daughters. The family\'s permanent residence is at the Anne Haven Mansion, built by Coca-Cola Bottling Company heirs Anne Lupton and Frank Harrison.', 'Business career': 'In an interview with Esquire, Corker said that he started working when he was 13, collecting trash and bagging ice. Later he worked at Western Auto and as a construction laborer. After graduating from college, he worked for four years as a construction superintendent. During this time he saved up $8,000, which he used to start a construction company, Bencor, in 1978. The company\'s first large contract was with Krystal restaurants, building drive-through windows. The construction company became successful, growing at 80 percent per year, according to Corker, and by the mid-1980s carried out projects in 18 states. He sold the company in 1990.In 1999, Corker acquired two of the largest real estate companies in Chattanooga: real estate developer Osborne Building Corporation and property management firm Stone Fort Land Company. In 2006 he sold the properties and assets that had formed these companies to Chattanooga businessman Henry Luken.In recognition of his business success, in 2005 the University of Tennessee at Chattanooga named him to their "Entrepreneurial Hall of Fame." Corker has said that he believes his business background has been valuable in his political career and that experience "gives [him] unique insights and allows [him] to weigh in, in valuable ways". As of 2008, Corker\'s assets were estimated at more than $19 million.', '1994 Senate campaign': 'Corker first ran for the United States Senate in 1994, finishing second in the Republican primary to eventual winner Bill Frist. During the primary campaign, Frist\'s campaign manager attacked Corker, calling him "pond scum". Despite the rhetoric, Corker arrived in Nashville the morning after the primary to offer the Frist campaign his assistance. He went on to campaign for Frist in the general election.From 1995 to 1996, Corker was the Commissioner of Finance and Administration for the State of Tennessee, an appointed position, working for Governor Don Sundquist.', 'Mayor  of Chattanooga': "Corker served as mayor of Chattanooga from 2001–05. While in office he implemented a merit-based bonus system for teachers. The system, established in 2002, awards teachers and principals bonuses for improving student performance at Chattanooga's lowest performing schools. Two years after its implementation, a study published in The Tennessean showed that the percentage of third graders reading at or above grade level had increased from 53% to 74%. However, a report by the think tank Education Sector suggested that specific teacher training had at least as much to do with the student improvement.In 2003 Corker started a program called ChattanoogaRESULTS, facilitating monthly meetings with public service department administrators to evaluate their performance and set goals for improvement. The program has been continued by Corker's successor, Ron Littlefield. Corker has credited the increased collaboration between departments for decreasing crime in Chattanooga. City data showed a nearly 26% decrease in crime and a 50% reduction in violent crimes between 2001 and 2004.Corker was also heavily involved in the development of the Enterprise South Industrial Park in Chattanooga. Later, as a U.S. Senator, he worked with state and local officials to recruit Volkswagen to open a production facility at the site.During his tenure as mayor, Corker also oversaw a $120 million riverfront renovation project, including an expansion of the Hunter Museum, a renovation of the Creative Discovery Museum, an expansion of Chattanooga's River Walk, and the addition of a new salt water building to the Tennessee Aquarium.", 'US Senate': 'Elections 2006In 2004, Corker announced that he would seek the U.S. Senate seat to be vacated by incumbent Republican Senator Bill Frist, who had announced that he would not run for reelection. In the Republican primary, Corker faced two former congressmen, Ed Bryant and Van Hilleary. Both of his opponents ran as strong conservatives, denouncing Corker as a moderate and eventually labelling him a leftist. In the course of his campaign, Corker spent $4.2 million on television advertising, especially in the western portion of the state, where he was relatively unknown. In the August primary, he won with 48% of the vote; Bryant got 34% and Hilleary got 17%.In the general election campaign, Corker\'s Democratic opponent, Harold Ford, Jr., challenged Corker to seven televised debates across the state. In response, Corker said he would debate Ford, though he did not agree to seven debates. The two candidates eventually participated in three televised debates: in Memphis on October 7, in Chattanooga on October 10, and in Nashville on October 28.The race between Ford and Corker was described as "among the most competitive and nasty" in the country. In October 2006, as polls indicated that Ford maintained a slight lead over Corker, the Republican National Committee ran a controversial television advertisement attacking Ford. In the 30-second ad, sound bites of "people in the street" pronouncing Ford wrong for Tennessee were interspersed with two shots of a white woman animatedly recalling meeting Ford—who is African-American and was unmarried at the time—at "the Playboy party". The ad concludes with this woman leeringly inviting Ford to phone her. Corker denounced the ad and asked that it be taken off the air.Corker won the election by less than three percentage points. He was the only non-incumbent Republican to be elected to the U.S. Senate in the 110th Congress. Corker was sworn in as Senator on January 4, 2007.2012In November 2012, Corker won his re-election bid with 65% of the vote. Corker faced the conservative Democrat Mark E. Clayton, from Davidson County, near Nashville, who received 30% of the general election vote. Clayton was disavowed by his own party, the leadership of which urged Democrats to write in a candidate of their choice in the race against Corker; the reason given by the party was Clayton\'s association with a hate group, an apparent reference to the fact that Clayton was vice president of the interest group Public Advocate of the United States, based in Washington, D.C.Tenure Corker was one of the original members of the Gang of 10, now consisting of twenty members, which is a bipartisan coalition seeking comprehensive energy reform. The group is pushing for a bill that would encourage state-by-state decisions on offshore drilling and authorize billions of dollars for conservation and alternative energy.In June 2008 Corker was among the 36 senators who voted against a cloture motion needed to allow the further progress of the Lieberman-Warner Climate Security Act, a measure to set up a "cap-and-trade" framework to reduce greenhouse gas emissions in the United States. Shortly before, Corker had offered three amendments to the act which focused on returning as much money as possible to American consumers, in part by eliminating free allowances and international offsets. Two years later he supported a proposed Senate resolution to express disapproval of the rule submitted by the Environmental Protection Agency on its endangerment finding identifying greenhouse gases as a matter for regulation under the Clean Air Act. In spring 2011 he was a co-sponsor of the Energy Tax Prevention Act, which would have amended the Clean Air Act to prohibit the EPA from regulating greenhouse gases, and thus aimed to protect households and businesses from paying increased costs passed on to them by businesses compelled to comply with new regulations. Corker said at the time that he hoped that as an alternative to administrative regulations by the EPA, Congress would "determine a rational energy policy for the country, broadly advancing our energy security and maintaining existing policies to ensure clean air and water."In 2008, Corker was one of the only sixteen Senators who opposed the tax rebate stimulus plan, criticizing it as "political stimulus" for electoral campaigns. He later described the stimulus package that passed Congress as "silly".In December 2008, Corker opposed the federal bailout of failing U.S. automakers, and expressed doubt that the companies could be salvaged. Corker proposed that federal funds be provided for automakers only if accompanied by cuts in labor costs and other concessions from unions. The United Auto Workers (UAW), which had previously accepted a series of cuts in its current contract, sought to put off any further cuts until 2011, while Corker requested that cuts go into effect in 2009. Republicans blamed the UAW for failure to reach an agreement, while the UAW claimed that Corker\'s proposal singled out "workers and retirees for different treatment and make[s] them shoulder the entire burden of restructuring." Corker\'s plan to protect taxpayers through tough conditions on any federal aid, however, was ultimately embraced by both President George W. Bush, who put Corker\'s stipulations in an executive order, and President Barack Obama, through his auto task force.In September 2009, Corker became the ranking member of the Senate Special Committee on Aging, replacing former Sen. Mel Martinez.On May 20, 2010, despite his initial role as the key Republican negotiator on financial regulatory reform, Corker voted against the Senate financial regulations bill ("Restoring American Financial Stability Act", S. 3217, the Senate version of what eventually became the Dodd–Frank Wall Street Reform and Consumer Protection Act), which included provisions for increased scrutiny of financial derivatives traded by major U.S. banks and financial institutions.Following the Senate vote, Corker expressed his disappointment with the bill, stating, among other things, that it did not adequately address concerns about the integrity of loan underwriting, or the need to strengthen bankruptcy laws, and provide for orderly liquidation. The main critique of financial reform offered by Corker on June 10, 2010, at the joint House and Senate conference on Financial Regulation, was that it would hurt industry and jobs if passed.Corker opposes limits to credit card fees imposed by banks on merchant transactions.Corker was one of three Republicans to support the New Strategic Arms Reduction Treaty (New START) in the Senate Foreign Relations Committee in September 2010.In April 2013, Corker was one of forty-six senators to vote against a bill which would have expanded background checks for all gun buyers. Corker voted with 40 Republicans and 5 Democrats to stop the passage of the bill.Corker has called for tempering the role of outside spending in elections by giving political candidates the right to approve advertising on their behalf made by an outside party committee.Committee assignments Committee on Banking, Housing, and Urban AffairsSubcommittee on Housing, Transportation, and Community DevelopmentSubcommittee on Securities, Insurance and InvestmentSubcommittee on Financial Institutions and Consumer ProtectionCommittee on Foreign Relations (Chairman)Subcommittee on African Affairs (Ex Officio)Subcommittee on European Affairs (Ex Officio)Subcommittee on East Asian and Pacific Affairs (Ex Officio)Subcommittee on Near Eastern and South and Central Asian Affairs (Ex Officio)Subcommittee on Western Hemisphere and Global Narcotics Affairs (Ex Officio)Subcommittee on International Development and Foreign Assistance, Economic Affairs, and International Environmental Protection (Ex Officio)Subcommittee on International Operations and Organizations, Human Rights, Democracyand Global Women\'s Issues (Ex Officio)Special Committee on Aging (Ranking member, 2009-2011)Retirement On September 26, 2017, Corker announced that he would not seek re-election in 2018, keeping his pledge when he ran in 2006 to only serve two terms in the Senate. After announcing his retirement, Corker intensified his opposition to President Donald Trump, accusing him of lying, debasing the United States, and weakening its global standing. However, Corker refused to use his powers as Senate Foreign Relations chairman to use procedural leverage in the Senate to influence Trump\'s rhetoric and actions.', 'Political positions': 'Corker scored 80% on American Conservative Union\'s 2017 Ratings of Congress. According to National Journal\'s 2009 Vote Ratings, he was ranked as the 34th most conservative member of the Senate.111th CongressNational Journal: 66% ConservativeEconomic: 29% Liberal / 69% ConservativeSocial issue: 29% Liberal / 70% ConservativeForeign-policy: 41% Liberal / 56% ConservativeAmericans for Democratic Action: 10% (Liberal Score)National Taxpayers Union: 83% (Grade: B; Rank: 24)Social policy In the 2006 primary campaign, Corker\'s opponents claimed he had changed his view on abortion since his first Senate campaign in 1994. Corker responded that he "was wrong in 1994" when he said that the government should not interfere with an individual\'s right to an abortion, stating that he now believes that life begins at conception. Corker has since changed his position and opposes abortion on demand except when the life of the mother is endangered or in cases of rape or incest.Corker opposes same-sex marriage. However, in 2015, Corker was one of 11 Republican Senators who voted with Democrats in support of giving social security benefits to same-sex couples living in states that had not yet recognized same-sex marriage.Fiscal policy In 2006, Corker supported making the 2001 tax cut and the 2003 tax cut permanent. He has shown interest in replacing the federal progressive income tax with a flat tax.He endorsed the initial $350 billion of TARP funding in 2008, and opposed releasing additional $350 billion of it in 2009.In 2011, Corker voted in favor of the Republican alternative budget proposed by Representative Paul Ryan (R-WI), a proposal that would eliminate the health care provided through the Medicare program and instead give seniors subsidies for part of the cost of obtaining private medical insurance. Corker referred to such programs as Medicare and Social Security as "generational theft".In 2013, Corker endorsed the Marketplace Fairness Act and voted for its passage in the Senate. The Marketplace Fairness Act would enable states to begin collecting sales taxes on online purchases.Corker was the only Republican senator to vote against the Senate version of the Tax Cuts and Jobs Act of 2017 before it was sent to a conference committee with the House, citing concerns about the deficit. On December 20, 2017, Corker, who previously said he would "take a close look at the product developed in conference before making a decision on the final legislation," voted in favor of the Tax Cuts and Jobs Act conference report, saying, "In the end, after 11 years in the Senate, I know every bill we consider is imperfect and the question becomes is our country better off with or without this piece of legislation. I think we are better off with it. I realize this is a bet on our country\'s enterprising spirit, and that is a bet I am willing to make."Several commentators pointed out that a provision newly added to the final version of the bill, which some termed the "Corker Kickback," could financially benefit the Senator. In response, Corker\'s office stated that the senator was not a member of the tax-writing committee nor was he involved in crafting the legislation, and that he requested no specific tax provisions throughout the months-long debate. Senate Finance Committee Chairman Orrin Hatch (R-Utah) called the assertions about Corker\'s vote "categorically false," adding, "It takes a great deal of imagination – and likely no small amount of partisanship – to argue that a provision that has been public for over a month, debated on the floor of the House of Representatives, including a House-passed bill, and identified by JCT as an issue requiring a compromise between conferees is somehow a covert and last-minute addition to the conference report." House Ways and Means Committee Chairman Kevin Brady (R-Texas) also rebutted the charges, saying, "To claim that Sen. Corker had anything to do with it, in my view, is baloney. This was a provision that we have fought for, we thought was important and is important to the ultimate pass-through approach." Senate Majority Whip John Cornyn (R-Texas) added, "What the whole purpose of this exercise was, this false and invented story, is to undermine public confidence in this tax reform package ... Some of our friends on the other side of the aisle and their allies in the so-called mainstream media ran with it in a dishonest attempt to derail us from passing the bill and undermine the reputation for integrity of one of our fellow senators."Foreign policy Corker traveled to Iraq for the first time as a senator in February 2007 as a member of the Foreign Relations Committee to study the situation on the ground. In March 2007, he subsequently expressed his opposition to an arbitrary withdrawal deadline of U.S. troops in Iraq and declared his support for General David Petraeus\'s counterinsurgency strategy. Corker said that any further reduction in U.S. forces in Iraq should be based on improved conditions in the country. In May 2008, Corker and Democratic U.S. Senator Bob Casey advocated for greater burden sharing among Iraq\'s neighbors in funding reconstruction efforts in the country.In April 2009, Corker criticized President Obama\'s Afghan war strategy, which boosted civilian efforts to rebuild the impoverished country and placed nuclear-armed Pakistan at the center of the fight: "I have no idea what it is, other than sending additional troops. I hope we dig a lot deeper," said Corker. He expected that the United States is having to build the economic and governmental structure of Afghanistan after decades of war.In April 2015, Corker\'s position on Iraq was that turmoil in the Middle East predated Barack Obama\'s presidency, and that by invading Iraq in 2003 the U.S. "took a big stick and beat a hornets\' nest", unleashing rivalries that might take decades to resolve.Corker supports supplying Ukraine (fighting the War in Donbass) with lethal weapons.In 2017, Corker criticized President Trump\'s provocative tweets against North Korea as impulsive. He said, "A lot of people think that there is some kind of \'good cop, bad cop\' act underway, but that\'s just not true." He further expressed concern that Trump\'s reckless behavior could lead to war.  Corker\'s comments were not met with public dissent; Republicans appeared to agree with Corker.Health care policy In September 2009, Corker opposed a health-care reform amendment that would legally allow Americans to buy cheaper Canadian drugs. He opposed President Barack Obama\'s health reform legislation. He voted against the Patient Protection and Affordable Care Act in December 2009, and he voted against the Health Care and Education Reconciliation Act of 2010.In late February 2010, Corker became the sole senator to back retiring Senator Jim Bunning of Kentucky in filibustering a 30-day extension of expiring unemployment and COBRA benefits.Amid Republican efforts to repeal the ACA following the election of Trump, Corker said in July 2017 he would support a repeal bill in the Senate even if it did not include a replacement effort.Environment While Corker has expressed skepticism regarding the degree to which humans contribute to global warming, in 2015 he supported a resolution expressing the sense of the Senate that climate change is real and that humans contribute to it. He favors imposing a tax on carbon. Corker opposed John McCain\'s 2008 campaign proposal to suspend the 18-cents-per-gallon federal gasoline tax, calling it "pandering extraordinaire".', 'Controversies': 'Sale of protected wetlands In 2003, Osborne Enterprises, an affiliate of the real estate company Corker Group, sold protected wetlands near South Chickamauga Creek in Chattanooga to Wal-Mart for $4.6 million. In July 2003 environmental educator Sandy Kurtz filed a restraining order to stop the construction of the Wal-Mart. After briefly being upheld, the lawsuit was dismissed on July 15, 2003. The Wal-Mart opened in May 2004.Attorney Joe Prochaska, who represented Kurtz, served from 1992 to 1997 as a member of the Davidson County Democratic Party\'s executive committee. Prochaska accused Corker of selling the land shortly after the construction easement was approved. However, public records show that the land was approved for development by the city prior to Corker becoming mayor in April 2001. As part of the development plans, the Corps of Engineers approved the filling in of 2.5 acres of the wetlands, to widen an access road, in exchange for the creation of an additional 11 acres of new wetlands in a nearby area. Public records show no involvement of Corker in the approval process.In 2006, during Corker\'s United States Senate campaign against Democrat Harold Ford Jr., a second lawsuit was filed by Kurtz, again represented by Prochaska, and the Tennessee Environmental Council. The lawsuit accused Wal-Mart of encroaching onto an adjacent protected nature area that was also held by a company owned by Corker. The suit alleged that Corker did not fully disclose his interest in the property where the Wal-Mart was built or in the adjacent nature area at the time the deal was made. The Corker campaign countered that an article published on March 5, 2003 in the Chattanooga Times Free Press publicly identified Corker\'s ownership interest in the land, through Osborne Enterprises, and that as mayor, a blind trust barred Corker from being involved in issues like these that affected his business.On October 13, 2006, lawyers involved in the case announced a settlement agreement. Details of the settlement were not announced, but court records indicate that a portion of the settlement involved a 45-day option for the Tennessee Environmental Council to purchase over 13 acres (53,000\xa0m2) of the land in dispute that the Council hopes to dedicate for public use.Blind trust Shortly after taking office as mayor, Corker voluntarily placed his Hamilton County real estate holdings and businesses into a blind trust to avoid "even the perception of any conflict". Corker stated that the visibility of his properties and public knowledge of his ownership in them served as another check on his actions as mayor.On October 11, 2006, The Commercial Appeal reported that the blind trust that Corker set up to run his businesses to avoid conflicts of interest while he was mayor "may not have been all that blind". According to e-mails discovered by the Appeal (some of which had previously presumed to be lost):Corker met often with employees from his private companies while mayor from 2001 to 2005, and he shared business tips with others. Corker also got help organizing his 2001 mayoral campaign from City Hall, where a government secretary passed on voting lists and set up meetings for the millionaire commercial real estate developer.The e-mails show that Corker often met with officials from his private company, the Corker Group, which was part of the blind trust, while he was mayor. When asked about these e-mails by the Appeal, Corker said that he thought the blind trust had "worked very well" and that he had sold most of his business holdings so that he could avoid the appearance of conflicts of interest in the Senate.Volkswagen In 2014, Corker, a long-time opponent of unions in Tennessee, tried to influence the ballot election of blue-collar workers at the Chattanooga Volkswagen plant whether to allow the United Auto Workers to represent them.On the first day of the three-day election, Corker said that he "had conversations" and "based on those am assured that should the workers vote against the UAW, Volkswagen will announce in the coming weeks that it will manufacture its new mid-size SUV here in Chattanooga." Corker\'s public statement went counter to statements by Volkswagen officials in the lead-up to the vote that the outcome of the vote would not affect the determination of whether the SUV would be made in Chattanooga  or at the Puebla, Mexico plant. National Labor Relations Board expert Kenneth G. Dau-Schmidt of Indiana University Bloomington said that Corker\'s remarks were "shocking" and an attempt to intimidate workers into voting against UAW representation. The UAW  was dealt a "stinging defeat" after a majority of employees at the Volkswagen plant voted against joining the union.', 'Electoral history': '2006 United States Senate Republican primary election, TennesseePartyCandidateVotes%RepublicanBob Corker231,54148.1RepublicanEd Bryant161,18933.5RepublicanVan  Hilleary83,07817.3RepublicanTate Harrison5,3091.12006 United States Senate election, TennesseePartyCandidateVotes%±RepublicanBob Corker929,91150.7-14.4DemocraticHarold Ford, Jr.879,97648.0+15.8IndependentEd Choate10,8310.6n/aIndependentDavid "None of the Above" Gatchell3,7460.2n/aIndependentEmory "Bo" Heyward3,5800.2n/aIndependentH. Gary Keplinger3,0330.2n/aGreenChris Lugo2,5890.1n/aMajority49,9352.7Turnout1,833,6932012 United States Senate Republican primary election, TennesseePartyCandidateVotes%RepublicanBob Corker (incumbent)389,61385.2RepublicanZach Poskevich28,3116.2RepublicanFred Anderson15,9513.5RepublicanMark Twain Clemens11,7952.6RepublicanBrenda Lenard11,3842.5United States Senate election in Tennessee, 2012PartyCandidateVotes%±RepublicanBob Corker (incumbent)1,496,66864.9%DemocraticMark E. Clayton700,75330.4%GreenMartin Pleasant37,9641.6%LibertarianShaun Crowell20,8130.9%ConstitutionKermit Steck18,4900.8%IndependentJames Higdon8,0360.3%IndependentMichael Joseph Long8,0430.3%IndependentTroy Stephen Scoggin7,1050.3%IndependentDavid Gatchell6,4690.3%Majority795,91534.5%Turnout2,304,341', 'Further reading': 'Calabresi, Massimo (April 20, 2015). With reporting by Alex Altman, Alex Rogers and Zeke J. Miller. "The tireless Tennessee dealmaker". Politics. Time (South Pacific ed.). 185 (14): 10–14.', 'introduction': "Robert Phillips Corker Jr. (born August 24, 1952) is an American businessman and politician serving as the junior United States Senator from Tennessee since 2007. He is the current chairman of the Senate's Committee on Foreign Relations (115th Congress). He is a member of the Republican Party.\nIn 1978, Corker founded a construction company, which he sold in 1990. He ran in the 1994 U.S. Senate election in Tennessee, but was defeated in the Republican primary by future Senate Majority Leader Bill Frist. Appointed by Governor Don Sundquist, Corker served as Commissioner of Finance and Administration for the State of Tennessee from 1995 to 1996. He later acquired two of the largest real estate companies in Chattanooga, Tennessee, before being elected the 71st Mayor of Chattanooga in 2000; he served one term (2001–2005).\nCorker announced his candidacy for the 2006 U.S. Senate election in Tennessee after Frist announced his retirement. Corker defeated Democratic Representative Harold Ford, Jr. in the general election, with 51% of the vote. In 2012 Corker was reelected, defeating Democrat Mark E. Clayton, 65% to 30%. On September 26, 2017, Corker announced that he would not seek reelection in 2018.\n\n"}, 'personal': {'Born': 'Robert Phillips Corker Jr. (1952-08-24) August 24, 1952 (age66)Orangeburg, South Carolina, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Elizabeth Corker (m.1987)', 'Children': '2', 'Education': 'University of Tennessee (BS)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Tennessee': {'date': 'Assumed office January 3, 2007Serving with Lamar Alexander', 'Preceded by': 'Bill Frist'}, 'Chair of the Senate Foreign Relations Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Bob Menendez'}, '71st Mayor of Chattanooga': {'date': 'In officeApril 16, 2001– April 18, 2005', 'Preceded by': 'Jon Kinsey', 'Succeeded by': 'Ron Littlefield'}, 'Finance and Administration Commissioner of Tennessee': {'date': 'In officeJanuary 1995– July 1, 1996', 'Governor': 'Don Sundquist', 'Preceded by': 'David Manning', 'Succeeded by': 'John Ferguson'}}, 'code': 'C001071'}