{'name': 'Bruce.Westerman', 'picture': 'W000821.jpg', 'detail': {'Background': "Westerman was reared in and still resides in Hot Springs, Arkansas. He worked as an engineer and forester before running for the Arkansas House, to which he was elected in 2010. He was Majority Leader in the 2013-2014  legislative session.Westerman graduated as valedictorian of Fountain Lake High School in Hot Springs. He attended the University of Arkansas in Fayetteville, where he played college football for the Arkansas Razorbacks football team. He graduated with a Bachelor of Science in engineering in 1990 and subsequently received a master's degree in forestry from Yale University in New Haven, Connecticut.Westerman was formerly employed as an engineer and forester by the Mid-South Engineering Company. He served as president of the Arkansas chapter of the American Society of Agricultural and Biological Engineering. He is also a former chair of the Arkansas Academy of Biological and Agricultural Engineers. He formerly served on the school board of the Fountain Lake School District.", 'Arkansas House of Representatives': "Elections He ran for the Arkansas House of Representatives in 2010 without opposition to succeed fellow Republican Bill Sample, who was instead elected to the Arkansas State Senate.With the 2012 election, Westerman was transferred to his current District 22, in which he also ran without opposition in both the Republican primary and the general election. The incumbent District 22 lawmaker, Republican Nate Bell of Polk County was switched to District 20.Tenure Westerman served as the House Minority Leader in 2012 and House Majority Leader in 2013.In 2013, Representative Westerman co-sponsored the amending of state income tax rates and supported the proposed spending cap on the state budget, but the latter measure failed by a two-vote margin in the House. He joined the majority to override the vetoes of Democratic Governor Mike Beebe to enact legislation to require photo identification for casting a ballot in Arkansas and to ban abortion after twenty weeks of gestation. He was a co-sponsor of both of those measures. Westerman also supported related pro-life legislation to outlaw abortion whenever fetal heartbeat is detected, to forbid the inclusion of abortion in the state insurance exchange, and to make the death of an unborn child a felony in certain cases.On Second Amendment issues, Westerman co-sponsored allowing officials of universities and religious institutions to engage in the concealed carry of firearms. He voted to reduce the application fee for obtaining a concealed carry permit, but the measure was defeated in the House. Westerman  supported the measure which prohibits the governor from regulating firearms during an emergency. He voted for the failed measure to prohibit the closing of schools based on a two-year pupil enrollment analysis. He voted to establish a tiered system of lottery scholarships. He voted against legislation to make the office of prosecuting attorney in Arkansas nonpartisan, which nevertheless passed sixty-three to twenty-four. He supported the bill, signed by Governor Beebe, to permit the sale of up to five hundred gallons per month of unpasteurized whole milk directly from the farm to consumers.In 2011, Westerman voted for dress codes and the establishment of state standards for biblical instruction in public schools. He voted to prohibit cell phone usage in school zones. He voted to require that state driver's license tests be administered only in the English language. He co-sponsored the Capital Gains Reduction Act and the reduction of taxes on manufacturers' utilities. He voted against the 2011 congressional redistricting act.In December 2017, Westerman voted in favor of the Tax Cuts and Jobs Act.Committee assignments Revenue And Taxation CommitteeSubcommittee on Sales, Use, Miscellaneous Taxes and Exemptions (Chair)State Agencies And Governmental Affairs CommitteeInsurance and Commerce Committee", 'US House of Representatives': '2014 election Westerman won the Republican congressional primary on May 20, 2014, by defeating Tommy Moll 54%–46%. In November, he defeated Democratic nominee James Lee Witt, a former associate of U.S. President Bill Clinton, 54%-43%.Tenure Westerman voted for the Tax Cuts and Jobs Act of 2017.Committee assignments In the 114th Congress, Westerman serves on the:Committee on the BudgetCommittee on Natural ResourcesSubcommittee on Federal LandsSubcommittee on Oversight and InvestigationsCommittee on Science, Space and TechnologySubcommittee on Environment (Vice Chair)Subcommittee on Research and TechnologyRepublican Study Committee', 'Electoral history': 'Arkansas House of Representatives 30th District Election, 2010PartyCandidateVotes%RepublicanBruce Westermann/a100.00Arkansas House of Representatives 22nd District Election, 2012PartyCandidateVotes%RepublicanBruce Westermann/a100.00Arkansas 4th Congressional District Republican Primary Election, 2014PartyCandidateVotes%RepublicanBruce Westerman18,71954.45RepublicanTommy Moll15,65945.55Arkansas 4th Congressional District Election, 2014PartyCandidateVotes%RepublicanBruce Westerman110,78953.75DemocraticJames Lee Witt87,74242.57LibertarianKen Hamilton7,5983.69Write-insWrite-ins20.00', 'introduction': "Bruce Eugene Westerman (born November 18, 1967) is a Republican U.S. Representative for Arkansas' 4th congressional district. Previously, he served as the Majority Leader of the Arkansas House of Representatives.\nIn 2014, Westerman ran successfully for the U.S. House to succeed Tom Cotton, who had unseated Democratic U.S. Senator Mark Pryor.\n\n", 'code': '04'}, 'personal': {'Born': 'Bruce Eugene Westerman (1967-11-18) November 18, 1967 (age50)Hot Springs, Arkansas, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Sharon French', 'Children': '4', 'Education': 'University of Arkansas (BS)Yale University (MS)', 'Website': 'House website'}, 'timeline': {"Member of the US House of Representativesfrom Arkansas's 4th district": {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Tom Cotton'}, 'Majority Leader of the Arkansas House of Representatives': {'date': 'In officeJanuary 2013– January 2015', 'Preceded by': 'Johnnie Roebuck', 'Succeeded by': 'Ken Bragg'}, 'Member of the Arkansas House of Representativesfrom the 22nd district': {'date': 'In officeJanuary 2013– January 2015', 'Preceded by': 'Nate Bell', 'Succeeded by': 'Mickey Gates'}, 'Member of the Arkansas House of Representativesfrom the 30th district': {'date': 'In officeJanuary 2011– January 2013', 'Preceded by': 'Bill Sample', 'Succeeded by': 'Charles Armstrong'}, 'code': '04'}, 'code': 'W000821'}