{'name': 'Catherine.Cortez.Masto', 'picture': 'C001113.jpg', 'detail': {'Early life': 'Cortez Masto was born in Las Vegas, Nevada, the daughter of Joanna (née Musso) and Manny Cortez. Her father was the longtime head of the Las Vegas Convention and Visitors Authority and served as a Clark County Commissioner and as an attorney for the County. Manny Cortez, now deceased, and Harry Reid had a longstanding friendship. Her father is of Mexican descent and her mother is of Italian descent. Her paternal grandfather, Edward Cortez, immigrated to Nevada from the Mexican state of Chihuahua.', 'Education and law career': "Cortez Masto earned a Bachelor of Science in Business Administration degree in finance from the University of Nevada, Reno in 1986 and a J.D. from Gonzaga University School of Law in 1990.She was admitted to the State Bar of Nevada in 1990, the U.S. District Court, District of Nevada in 1991 and the U.S. Court of Appeals, for the Ninth Circuit in 1994. She is married to Paul Masto, a former Special Agent in the United States Secret Service.Her career includes four years as a civil attorney in Las Vegas and two years as a criminal prosecutor for the U.S. Attorney's Office in Washington, D.C. She also served as former Nevada Democratic Governor Bob Miller's chief of staff.In November 2003, Cortez Masto was named executive vice chancellor of the Nevada System of Higher Education. There was initial controversy because she was hired directly by the chancellor, and not the university system's board of regents; the chancellor indicated that the regents had previously recommended that he hire an assistant, and in December the board voted unanimously to approve her annual salary of $215,000.", 'Nevada Attorney General': 'In 2009, Cortez Masto\'s office launched an investigation against Brian Krolicki, the Republican Lieutenant Governor of Nevada. Krolicki faced felony charges related to allegations that he mishandled the Nevada College Savings Trust Fund when he was state treasurer. During the investigation, the Las Vegas Review-Journal discovered that Cortez Masto\'s husband, Paul, planned to host a fundraising party for Robert S. Randazzo, a Democratic candidate for lieutenant governor, four days before the attorney general\'s office was scheduled to prosecute Krolicki. Cortez Masto said she was unaware of the fundraising party. The charges against Krolicki were ultimately dismissed in Clark County District Court. The dismissal of charges against Krolicki was regarded as a political setback for Cortez Masto, who, according to the Las Vegas Sun, "opened herself to charges of politicizing her office and prosecutorial misconduct."In 2010, Cortez Masto\'s office began investigating Bank of America, accusing the company of raising interest rates on troubled borrowers. Her office sought to end Nevada\'s participation in a loan modification settlement in order to sue the bank over alleged deceptive marketing and lending practices. Bank of America denied any wrongdoing. The lawsuit was settled in 2012 for $750 million for lien reductions and short sales.Cortez Masto defended the state of Nevada\'s position in the lawsuit Sevcik v. Sandoval. The lawsuit challenged Nevada\'s denial of same-sex marriage as prohibited by the state\'s constitution and statutory law. After initially defending the state\'s same-sex marriage ban, Cortez Masto and the state abandoned their defense of the ban in light of a ruling by the United States Court of Appeals for the Ninth Circuit.', 'US Senate': "Elections Cortez Masto declined to run for Governor of Nevada in the 2014 election. When U.S. Senator Harry Reid decided not to run for re-election in the 2016 election, he endorsed Cortez Masto as his successor. Cortez Masto's campaign relied heavily on the political infrastructure Reid had assembled. Her opponent was United States Representative Joe Heck.Cortez Masto, who supports increased investments in renewable energy technology, was supported by the League of Conservation Voters. Cortez Masto was also financially supported by End Citizens United, a political action committee seeking to overturn Citizens United v. FEC, and pro choice groups such as EMILY's List and Planned Parenthood.Cortez Masto won 47% of the vote (520,658 votes), with Joe Heck behind at 45% (494,427 votes).She filled the seat of former Senator Harry Reid on January 3, 2017, becoming the first Latina in the United States Senate.Tenure Committee assignments Committee on Banking, Housing, and Urban AffairsSubcommittee on Financial Institutions and Consumer ProtectionSubcommittee on Securities, Insurance, and InvestmentCommittee on Energy and Natural ResourcesSubcommittee on EnergySubcommittee on Public Lands, Forests and MiningCommittee on Rules and AdministrationCommittee on Commerce, Science, and TransportationSubcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Consumer Protection, Product Safety, Insurance and Data SecurityCommittee on Indian AffairsSpecial Committee on AgingCaucus memberships Congressional Hispanic CaucusCongressional Caucus for Women's Issues", 'Political positions': 'Environment Cortez believes in human caused climate change and that the federal government should limit the amount of greenhouse gas emissions from power plants. She supports the growth of green jobs and increasing Nevada\'s reliance on solar power and other forms of clean energy. She opposes the use of Yucca Mountain as a nuclear waste repository.Gun law Cortez Masto is a gun owner. The National Rifle Association (NRA) has given Cortez Masto a "F" rating due to her support for gun control. During the 2016 election cycle, the NRA spent $1 million on an attack ad against her. She opposes allowing individuals on the terrorist watch list to buy guns, stating that allowing them to do so "makes no sense."In response to the 2017 Las Vegas shooting, Cortez Masto co-sponsored a bill with Dianne Feinstein to ban bump stocks. She stated that, although the bill cannot bring back the lives of those lost, it can be a start towards decreasing gun violence and mass shootings.Health care Cortez Masto does not support the repeal of the Affordable Care Act (also known as Obamacare). However, she does support improving upon the act, which she has called "imperfect." She has co-sponsored the Marketplace Certainty Act to bring more stability to the healthcare marketplace in lieu of insurance providers leaving the program.Immigration She supports the DREAM Act and allowing undocumented immigrants to obtain citizenship.LGBT Cortez Masto supports gay marriage.Women\'s health Cortez Masto is pro-choice. In the 2016 election, she was endorsed by Planned Parenthood and funded by their action fund.Additionally, she does not believe that companies can withhold access to birth control from women based on religious beliefs.Cannabis Cortez Masto has cosponsored the bipartisan STATES Act proposed in the 115th U.S. Congress by Massachusetts Senator Elizabeth Warren and Colorado Senator Cory Gardner that would exempt individuals or corporations in compliance with state cannabis laws from federal enforcement of the Controlled Substances Act.', 'introduction': "Catherine Marie Cortez Masto (born March 29, 1964) is an American attorney and politician serving as the junior United States Senator from Nevada since 2017. A member of the Democratic Party, she previously served as the 32nd Attorney General of Nevada (2007–2015).\nCortez Masto graduated from University of Nevada, Reno and Gonzaga University School of Law. She worked four years as a civil attorney in Las Vegas and two years as a criminal prosecutor for the U.S. Attorney's Office in Washington, D.C. before being elected Nevada Attorney General in 2006 to replace George Chanos. Reelected in 2010, she was not eligible to run for a third term in 2014 because of lifetime term limits established by the Constitution of Nevada.\nCortez Masto defeated Joe Heck in the U.S. Senate election in Nevada to replace outgoing Democratic Senator Harry Reid, becoming the first woman elected to represent Nevada in the Senate and the first Latina elected to serve in the Senate. She took office on January 3, 2017.\n\n"}, 'personal': {'Born': 'Catherine Marie Cortez (1964-03-29) March 29, 1964 (age54)Las Vegas, Nevada, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Paul Masto', 'Education': 'University of Nevada, Reno (BS)Gonzaga University (JD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Nevada': {'date': 'Assumed office January 3, 2017Serving with Dean Heller', 'Preceded by': 'Harry Reid'}, '32nd Attorney General of Nevada': {'date': 'In officeJanuary 1, 2007– January 5, 2015', 'Governor': 'Jim GibbonsBrian Sandoval', 'Preceded by': 'George Chanos', 'Succeeded by': 'Adam Laxalt'}}, 'code': 'C001113'}