{"name": "Chris.Murphy", "picture": "M001169.jpg", "detail": {"Early life, education, and early career": "Murphy was born on August 3, 1973, in White Plains, New York, the son of Catherine A. (née Lewczyk) and Scott L. Murphy. He is of Irish and Polish descent. Murphy's father is a corporate litigator who served as the managing partner of Shipman & Goodwin, a Hartford law firm, and his mother is a retired ESL teacher from the Hanmer Elementary School in Wethersfield, Connecticut. Murphy has two younger siblings, a sister, Susannah, and a brother, Ben.Murphy is a graduate of Wethersfield High School.  He received his B.A. degree from his father's alma mater, Williams College, and his J.D. degree from the University of Connecticut School of Law. As an undergraduate exchange student, Murphy also studied at the University of Oxford, where he was a member of Exeter College. On May 19, 2013, Murphy received an honorary Doctor of Humane Letters degree from the University of New Haven.In 1996, Murphy was campaign manager for Charlotte Koskoff's unsuccessful campaign for the House against Nancy Johnson; a decade later, Murphy himself would unseat Johnson. From 1997 to 1998, Murphy worked for Connecticut State Senate Majority Leader George Jepsen. Murphy was first elected to office in 1997, when he won a seat on the Planning and Zoning Commission in Southington.", "Connecticut Legislature": "House of Representatives Elections In 1998, at age 25, Murphy challenged 14-year incumbent Republican State Representative Angelo Fusco. Murphy was endorsed by the six largest labor unions in the state. The CT Employees Independent Union endorsed Murphy, the first time the union endorsed Fusco's opponent. Fusco described himself as a union member, an environmentalist, and a moderate. Murphy defeated Fusco 55%-45%. In 2000, he won re-election to a second term, defeating Barbara Morelli 68%-32%.Tenure As early as March 1999, he criticized U.S. Congresswoman Nancy Johnson's vote for impeaching President Bill Clinton. In 2001, he was a co-sponsor of a bill to eliminate child poverty. He proposed legislation that would give free tuition to students of the state's community-technical colleges. He proposed legislation that would ban smoking in state colleges and universities. He co-sponsored a bill that would create an earned income tax credit.He was a supporter of same-sex marriage as early as 2002. During his tenure, he served on the Judiciary Committee.Senate Elections After two terms, Murphy decided to run for a seat in the Connecticut State Senate at the age of 29. The open 16th district had been held by a Republican for more than a decade. He defeated Republican State Representative Ann Dandrow, 53%-47%. In 2004, he won re-election to a second term, defeating Republican Christopher O'Brien, 60%-37%.Tenure In 2003, he joined the Clean Car Alliance and supported California-like environmental standards on auto manufacturers.In 2004, Murphy supported a bill that would ban smoking in all restaurants and bars.In 2005, Murphy authored legislation establishing the new Office of Child Protection, to \"better coordinate advocacy for abused and neglected children\". Murphy also wrote Public Act 05-149, an act permitting stem-cell research while prohibiting human cloning.The act, signed into law by Governor Jodi Rell, made Connecticut the third state in the nation to permit taxpayer-subsidized stem-cell research.During his tenure in the State Senate, Murphy was one of the first ten co-sponsors of a civil union bill that passed the General Assembly in 2005. On his Senate campaign website, Murphy summarized his stance, \"Let me be clear and simple: LGBT rights are human rights. Marriage equality and nondiscrimination in the military, workplace, classroom and healthcare system, based on real or perceived sexual orientation and gender identity, are civil rights that must be protected under law.\" During his tenure he served as Chairman of the Public Health Committee.", "US House of Representatives": "Elections Murphy chose not to run for re-election to the State Senate, targeting instead the U.S. House seat held by 12-term incumbent Republican Nancy Johnson. In order to challenge Johnson, Murphy moved from Southington to Cheshire. Murphy was elected in 2006 with 56% of the vote, defeating Johnson by a margin of about 22,000 votes; among incumbents, only John Hostettler lost by a larger margin that year.He carried 35 of the district's 41 cities and towns, including several that had reliably supported Johnson for decades. He defeated Johnson by a significant margin in her hometown of New Britain, which she had represented for over 30 years in both the state senate and in Congress. He was re-elected again in 2008 and 2010, with 60% and 54% of the vote, respectively.[citation needed]Tenure Murphy has received high scores from liberal groups such as Americans for Democratic Action, NARAL Pro-Choice America, and various labor unions; and low scores from conservative groups as the Club for Growth, American Conservative Union, and FreedomWorks.In August 2008, Murphy sent a letter to House Majority Leader Steny Hoyer expressing support for increased oil drilling as part of a bipartisan energy bill.Murphy supports reform of federal supportive housing programs, which assist low-income people with severe disabilities. In 2008, the House of Representatives passed the \"Frank Melville Supportive Housing Investment Act\", which Murphy authored to modernize and streamline Section 811, which governs federal supportive housing grants.Murphy has called for the closure of the Guantanamo Bay detention camp; however, in February 2011, Murphy voted to extend provisions of the Patriot Act.Health care reformIn 2009, Murphy helped draft HR 3200, the House health-care reform bill. Murphy defended his role in supporting the bill at a contentious town hall meeting in Simsbury in August 2009.A longtime supporter of health insurance reform, Murphy is a strong proponent of the public option, which entails the creation of an independent, government-sponsored health insurance plan to compete with private companies. Murphy has argued that such a plan would not require government financing and would help to introduce competition into monopolized health insurance markets and help bring down costs.When singer Justin Bieber said in an interview with Rolling Stone that he admired the health care system in his native Canada, Murphy sent a tweet to The Huffington Post expressing approval of Bieber's comments. Shortly thereafter Murphy noticed that Bieber, in the same interview, spoke out against the practice of abortion, so Murphy sent out another tweet to distance himself from Bieber on that issue.Ethics reformIn May 2007, Murphy organized a group of freshmen House members to support the creation of an independent, non-partisan ethics panel to review complaints filed against members of the U.S. House of Representatives. He has been credited with helping to shape the independent Office of Congressional Ethics, which was passed into law by the House in March 2008.Murphy sponsored a bill that would subject Supreme Court Justices to the same ethical code that applies to other federal judges, and suggested in 2011 the possibility of an investigation to decide whether Justice Clarence Thomas had committed ethical violations that would justify removing him from office. The matter in question was Thomas's connection to Harlan Crow  and other supporters of the Republican Party. Murphy circulated a draft letter to other members of Congress asking the House Judiciary Committee leadership to hold a hearing on the Supreme Court Transparency and Disclosure Act, which would end the Supreme Court's immunity to judicial ethics laws.Contractors operating overseasAs a member of the House Oversight and Government Reform Committee, Murphy was highly critical of for-profit government contractors operating in Iraq, which functioned with little government oversight and scrutiny. He introduced and successfully passed into law the \"Government Funding Transparency Act of 2008\" which required private companies that do the majority of their businesses with the federal government to publicly disclose their top executives' salaries.Local issuesTwo home invasions occurred in Murphy's district in 2007 and 2008; the latter in Cheshire being especially brutal, with the rape and murder of a mother and her two young daughters. In response, Murphy proposed making home invasion a federal crime.Murphy has been a proponent of the proposed New Haven-Hartford-Springfield Commuter Rail Line, an effort to use existing railroad tracks owned by Amtrak to provide daily commuter service on par with Southwestern Connecticut's Metro-North service into New York. In 2008, Murphy successfully added an amendment to rail legislation making it easier for Amtrak and the state of Connecticut to cooperate on the rail project. The line began operation in June 2018.Murphy proposed reforms of the nation's 'missing-persons' databases, introducing \"Billy's Law\" in 2009 to improve coordination of law-enforcement efforts to locate missing persons. The legislation was named in honor of Billy Smolinski, Jr., a one-time resident of Murphy's district who disappeared in 2004.Committee assignments Committee on Foreign AffairsSubcommittee on the Middle East and South AsiaCommittee on Oversight and Government ReformSubcommittee on Health Care, District of Columbia, Census and the National ArchivesSubcommittee on Technology, Information Policy, Intergovernmental Relations and Procurement Reform", "US Senate": "2012 election Murphy announced on January 20, 2011, that he would run for the Senate seat held by Joe Lieberman, who was retiring in the face of a very low approval rate. It was announced in mid-July that a group spearheaded by a state Capitol lobbyist was forming a Super PAC for his campaign, hoping to raise $1 million to combat a possible opponent.Murphy defeated former Connecticut Secretary of State Susan Bysiewicz in the Democratic primary and defeated Republican candidate Linda McMahon in the general election. After McMahon's negative ads left Murphy \"on the defensive virtually nonstop\" and struggling to respond, the Democratic Senatorial Campaign Committee sent additional staff and money to Murphy to help with his campaign, saying they are \"100 percent behind [him].\"  Among the issues raised was Chase Home Finance sued for foreclosure against Murphy, whose campaign initially responded by claiming that Murphy had missed \"a couple of mortgage payments.\" Murphy claimed that he did not know he was in default until legal proceedings started. Murphy received a loan at the rate of 4.99% from Webster Bank in 2008 to consolidate his previous mortgages. At the time of this loan, Murphy was serving on the House Financial Services Committee. Murphy's opponent McMahon accused him of receiving what she called \"special interest loans,\" and called on Murphy to release his financial records. Bank officials and outside experts claim there was nothing improper about the loans made to Murphy.On November 6, Murphy defeated McMahon with 55% of the vote, winning every county except Litchfield County. At the time, it was the most expensive political race in Connecticut history, and one of the most expensive Senate races in 2012.Tenure Murphy took office as the junior United States Senator for Connecticut on January 3, 2013. In the Senate, Murphy has worked on issues funding for transportation and infrastructure, the preservation of Long Island Sound, growing small farms and promoting Connecticut manufacturing.In 2016, Murphy walked 126 miles across the state of Connecticut, listening to constituents and holding daily town hall meetings. Murphy repeated the walk in 2017, covering 106 miles and holding five town hall meetings.Health care Murphy has been a leading supporter of the Affordable Care Act in the Senate and has opposed Republican attempts to repeal the law, consistently speaking on the floor about the positive impact it has had on his constituents.Murphy called the American Health Care Act of 2017 \"an intellectual and moral dumpster fire,\" that will cause 24 million Americans to lose their health care coverage.Economic issues Murphy has introduced two pieces of legislation, the American Jobs Matter Act and the 21st Century Buy American Act to close loopholes in the existing Buy American laws and encourage the U.S. government to purchase American-made goods.Mental Health On August 5, 2015, Murphy introduced the bipartisan Mental Health Reform Act of 2015 with Republican Senator Bill Cassidy from Louisiana. The legislation, aimed at overhauling the mental health system, would build treatment capacity, promote integrated care models, expand the mental health workforce and encourage the enforcement of existing mental health parity laws.The bill was informed by listening sessions that Senator Murphy conducted across the state of Connecticut. The bill was widely supported by the mental health community, with organizations including the American Psychiatric Association, Mental Health America and the National Council for Behavioral Health applauding its introduction.[citation needed]On March 16, 2016, the Mental Health Reform Act was pass unanimously by the Senate Health, Education, Labor, and Pensions (HELP) Committee. On December 7, 2016, the Senate passed Mental Health Reform as a part of the 21st Century Cures Act. The bill also provided $1 billion in funding to address the opioid crisis and funding for NIH Cancer Moonshot initiative. The bill was signed into law by President Obama on December 13, 2016.Gun control Murphy has an F rating with the the National Rifle Association and a 100% rating with the Brady Campaign to Prevent Gun Violence.Following the Sandy Hook Elementary School shooting, Murphy became a leading voice in the movement to prevent gun violence, supporting numerous policies including universal background checks and ending the ban on gun violence research at the CDC. Murphy supported the bipartisan Manchin-Toomey background checks proposal, which would have strengthened and expanded the existing background check system and established a National Commission on Mass Violence to study in-depth all the causes of mass violence.When the proposal failed to meet the 60 vote threshold for advancement, Murphy stated, \"This is a day when the Republican filibuster stood in the way of 90% of Americans.\"In his first month in office, he criticized the National Rifle Association and Apple Inc. for a video game involving shooting with guns that was labeled appropriate for children as young as four.On June 24, 2015, Murphy stated that: \"Since Sandy Hook there has been a school shooting, on average, every week\"; The Washington Post described this statement as misleading. On June 15–16, 2016, Murphy staged a filibuster regarding gun control following the 2016 Orlando nightclub shooting, the deadliest mass shooting in US history prior to the mass shooting in Las Vegas in 2017. The filibuster entered the list of the top 10 longest filibusters in US history.[citation needed]In the wake of the 2016 Orlando nightclub shooting, Murphy offered thoughts and prayers to victims and stated \"This phenomenon of near constant mass shootings happens only in America – nowhere else.\" He blamed Congress for being \"complicit\" in the shooting.After the 2017 Las Vegas Strip shooting, Murphy reinforced his criticism of gun laws.Following the Sutherland Springs church shooting Murphy and fellow U.S. Senator John Cornyn (R-TX) introduced the bipartisan Fix NICS Act to ensure criminal records are submitted to the federal background check system.Following the shooting at the Marjory Stoneman Douglas High School in Parkland, Florida on February 14, 2018, Murphy made an impassioned call for action in the Senate stating that \"this happens nowhere else other than the United States of America, this epidemic of mass slaughter, this scourge of school shooting after school shooting. It only happens here not because of coincidence, not because of bad luck, but as a consequence of our inaction. We are responsible for a level of mass atrocity that happens in this country with zero parallel anywhere else. As a parent it scares me to death that this body doesn't take seriously the safety of my children, and it seems like a lot of parents in South Florida will be asking the same question today. We pray for families, for the victims. We hope for the best.\"Foreign policy Murphy is one of the first members of Congress to come out in opposition to US support for the Saudi-led military campaign in Yemen, which was launched in 2015. In a speech on January 29, 2016, he recommended that the US stop supporting this military campaign and suspend military sales to Saudi Arabia until the US receives assurances that the war will not distract from Saudi efforts against al-Qaeda and ISIS and Saudi Arabia lessens its worldwide support of Wahhabism. Murphy is a member of the Senate Foreign Relations Committee and the ranking Democratic member of the subcommittee on the Middle East and Counter-terrorism. In the edition of June 8, 2015 of Foreign Affairs, Murphy co-authored \"Principles for a Progressive Foreign Policy,\" proposing a framework for a Democratic foreign policy strategy.In November 2017, Murphy accused the United States of complicity in the war crimes committed in Yemen by the Saudi-led military coalition and in Yemen's humanitarian crisis, saying: \"Thousands and thousands inside Yemen today are dying. ... This horror is caused in part by our decision to facilitate a bombing campaign that is murdering children and to endorse a Saudi strategy inside Yemen that is deliberately using disease and starvation and the withdrawal of humanitarian support as a tactic.\"In March 2016, Murphy authored the bipartisan bill the Countering Foreign Propaganda and Disinformation Act, along with Republican Senator Rob Portman. Congressman Adam Kinzinger introduced the U.S. House version of the bill. After the 2016 U.S. presidential election, worries grew that Russian propaganda spread and organized by the Russian government swayed the outcome of the election, and representatives in the U.S. Congress took action to safeguard the National security of the United States by advancing legislation to monitor incoming propaganda from external threats. On November 30, 2016, legislators approved a measure within the National Defense Authorization Act to ask the U.S. State Department to take action against foreign propaganda through an interagency panel. The legislation authorized funding of $160 million over a two-year-period. The initiative was developed through the Countering Foreign Propaganda and Disinformation Act.Marijuana Murphy has a \"B\" rating from NORML for his voting history regarding cannabis-related causes. In 2016, he voted in favor of the Daines/Merkley Amendment to enable Veterans Administration doctor's to discuss the benefits of medical marijuana with their patients. He also voted in favor of Mikulski Medical Marijuana Amendment, which protects users in states with medical marijuana laws from federal interference.Committee assignments United States Senate Committee on AppropriationsUnited States Senate Appropriations Subcommittee on Legislative Branch (Ranking Member)United States Senate Appropriations Subcommittee on Military Construction, Veterans Affairs, and Related AgenciesUnited States Senate Appropriations Subcommittee on State, Foreign Operations, and Related ProgramsUnited States Senate Appropriations Subcommittee on Transportation, Housing and Urban Development, and Related AgenciesUnited States Senate Appropriations Subcommittee on Commerce, Justice, Science, and Related AgenciesCommittee on Foreign RelationsSubcommittee on East Asian and Pacific AffairsSubcommittee on European Affairs (Ranking Member)Subcommittee on International Development and Foreign Assistance, Economic Affairs and International Environmental Protection, and Peace CorpsSubcommittee on Western Hemisphere and Global Narcotics AffairsCommittee on Health, Education, Labor, and PensionsSubcommittee on Primary Health and AgingJoint Economic CommitteeFunding In May 2013, Murphy was awarded[clarification needed] $60 million of a total $75 million to house 55 of the 330 homeless veterans living in Connecticut.", "Personal life": "Chris Murphy and his wife Catherine (née Holahan) married in August 2007. They have two sons, Owen and Rider. Raised as an Congregationalist, Murphy identifies as \"Protestant/unaffiliated\" but acknowledged he was \"not a regular churchgoer these days, in part, because of kids. In part because of a busy schedule.\"", "Electoral history": "YearOfficeDistrict/ClassDemocraticRepublican1998Connecticut House of RepresentativesConnecticut's 81st DistrictChris Murphy55%Angelo Fusco45%2000Connecticut House of RepresentativesConnecticut's 81st DistrictChris Murphy68%Barbara Morelli32%2002Connecticut State SenateConnecticut's 16th DistrictChris Murphy53%Ann Dandrow47%2006U.S. House of RepresentativesConnecticut's 5th DistrictChris Murphy56%Nancy L. Johnson (inc.)43%2008U.S. House of RepresentativesConnecticut's 5th DistrictChris Murphy (inc.)59%David Cappiello39%2010U.S. House of RepresentativesConnecticut's 5th DistrictChris Murphy (inc.)54%Sam S. F. Caligiuri45%2012U.S. SenateConnecticut Class 1Chris Murphy55%Linda McMahon43%Note: In all elections to the House, Murphy also ran on the line of the Connecticut Working Families Party, on a fusion ticket.", "introduction": "Christopher Scott Murphy (born August 3, 1973) is an American politician serving as the junior United States Senator from Connecticut since 2013. A member of the Democratic Party, he previously served in the United States House of Representatives, representing Connecticut's 5th congressional district from 2007 to 2013. Before being elected to Congress, Murphy was a member of both chambers of the Connecticut General Assembly, serving two terms each in the Connecticut House of Representatives (1999–2003) and the Connecticut Senate (2003–07).\nMurphy ran for the U.S. Senate in 2012 after long-time incumbent Joe Lieberman announced in January 2011 that he would retire from politics rather than seeking a fifth term in office. He defeated former Connecticut secretary of state Susan Bysiewicz in the Democratic primary, and subsequently defeated Republican candidate Linda McMahon for the open seat in the general election. Aged 39 at the time, Murphy was the youngest Senator of the 113th Congress. Arkansas' Tom Cotton, elected at age 37, later surpassed Murphy as the youngest incumbent Senator, two years later.\n\n"}, "personal": {"Born": "Christopher Scott Murphy (1973-08-03) August 3, 1973 (age45)White Plains, New York, U.S.", "Political party": "Democratic", "Spouse(s)": "Cathy Holahan (m.2007)", "Children": "2", "Education": "Williams College (BA)University of Connecticut School of Law (JD)"}, "timeline": {"United States Senatorfrom Connecticut": {"date": "Assumed office January 3, 2013Serving with Richard Blumenthal", "Preceded by": "Joe Lieberman"}, "Member of the US House of Representativesfrom Connecticut's 5th district": {"date": "In officeJanuary 3, 2007– January 3, 2013", "Preceded by": "Nancy Johnson", "Succeeded by": "Elizabeth Esty"}, "Member of the Connecticut Senatefrom the 16th district": {"date": "In officeJanuary 3, 2003– January 3, 2007", "Preceded by": "Steve Somma", "Succeeded by": "Sam Caligiuri"}, "Member of the Connecticut House of Representativesfrom the 81st district": {"date": "In officeJanuary 3, 1999– January 3, 2003", "Preceded by": "Angelo Fusco", "Succeeded by": "Bruce Zalaski"}}, "code": "M001169", "type": "3", "party": "Democrat", "description": "rank-and-file Democrat", "economic": "-0.31", "social": "-0.18", "leadership": "0.34"}