{"name": "Chris.Coons", "picture": "C001088.jpg", "detail": {"Early life and education": "Coons was born in Greenwich, Connecticut, the son of Sarah Louise \"Sally\" (née Ives) and Kenelm Winslow \"Ken\" Coons. His ancestry includes English and Irish. Coons grew up in Hockessin, Delaware, where he attended the public Yorklyn Elementary School and later H.B. DuPont Middle School. He graduated from Tower Hill School and then Amherst College in 1985 with a Bachelor of Arts in chemistry and political science. While in college, he was a member of Delta Kappa Epsilon fraternity (Sigma chapter). In 1983, Chris Coons was awarded the Truman Scholarship. During his junior year of college, Coons studied abroad at the University of Nairobi in Kenya through St. Lawrence University's Kenya Semester Program. He earned a master's degree in Ethics from Yale Divinity School and a J.D. degree from Yale Law School.", "Professional career": "After college, Coons worked in Washington, D.C., for the Investor Responsibility Research Center, where he wrote a book on South Africa and the U.S. divestment movement. He then worked as a volunteer for the South African Council of Churches and as a relief worker in Kenya, before returning to the U.S. to work for the National Coalition for the Homeless in New York. In 1992, he earned a J.D. degree from Yale Law School, and a master's degree in ethics from Yale Divinity School.Coons clerked for Judge Jane Richards Roth on the United States Court of Appeals for the Third Circuit, and then worked for the National \"I Have a Dream\" Foundation in New York. After returning to Delaware in 1996, Coons began his eight-year career as in-house counsel for W.L. Gore & Associates, Inc., Newark, Delaware-based makers of Gore-Tex fabrics and other high-tech materials. There he was responsible for the ethics training program, federal government relations, e-commerce legal work, and for general commercial contracting.He has also worked for several nonprofits, including the Coalition for the Homeless, the education-oriented \"I Have a Dream\" Foundation, and the South African Council of Churches. Coons has served on several boards including First State Innovation, the Bear/Glasgow Boys & Girls Club, and the Delaware College of Art & Design.Coons is on the Board of Selectors of Jefferson Awards for Public Service.", "Early political career": "Coons first became involved in politics working on behalf of Republican politicians. As a 17-year-old, in 1980, he independently campaigned for Ronald Reagan's presidential run. He also worked on Bill Roth's U.S. Senate campaign in 1982. During college, he switched from being a Republican to a Democrat and in 1988, Coons became the issues director for the U.S. Senate campaign of Democratic Delaware Lt. Gov. Shien Biau Woo. He was a delegate from Wilmington to the 1996 Democratic National Convention in Chicago.His first elected office was president of the New Castle County Council, elected in 2000 and serving four years before being elected county executive in 2004. He was the endorsed candidate of the New Castle County Democratic Party in 2008, and was re-nominated by the party on September 9, 2008. Coons was re-elected on November 4, 2008, unopposed in the general election. In his six years in office as county executive, Coons balanced the budget with a surplus in fiscal year 2010 by cutting spending and raising taxes. As New Castle county executive, Coons raised taxes despite having campaigned on a promise not to increase them. New Castle County maintained a AAA bond rating throughout his tenure.", "US Senate": "2010 election Coons ran in the 2010 special election for the U.S. Senate seat then held by Ted Kaufman, who was appointed after Joe Biden resigned.  He was initially set to face Republican Congressman and former Governor Mike Castle in the general election.  Coons was initially a decided underdog in part due to Castle's moderate profile and longstanding popularity in the state.  However, the dynamics of the race were significantly altered when Christine O'Donnell, a considerably more conservative Republican who had been Biden's opponent in 2008, upset Castle in the Republican primary.In the first post-primary polls, Rasmussen Reports showed Coons with a double-digit lead over O'Donnell, describing this as a \"remarkable turnaround\" given that the race had leaned Republican before O'Donnell's primary victory. In the first week of October, Fairleigh Dickinson University's PublicMind Poll released the results of its research, showing Coons with a 17-point lead, 53%-36%, over O'Donnell, and pointing out that 85% of self-identified Democratic voters had united behind Coons, while only 68% of Republican voters endorsed O'Donnell.  Days before the election, a second Fairleigh Dickinson poll showed Coons leading 57% to 36% among likely voters, and leading 72% to 20% among voters who described themselves as moderates. As polls closed at 8 p.m. Eastern Standard Time, multiple news sources announced that Coons had defeated O'Donnell based on exit poll data. Final results gave Coons close to a 17-point margin over O'Donnell, capturing 56.6% of the vote to her 40%.During the campaign, a controversy arose surrounding an article Coons wrote in 1985 for his college newspaper, entitled \"Chris Coons: The Making of a Bearded Marxist\". In it, he describes his transformation from a Republican to what Fox News described as a \"Democrat suspicious of America's power and ideals.\" Dave Hoffman, a Coons campaign spokesman, said the title of the article was designed as a humorous take-off on a joke Coons' college friends had made about how his time outside the country had affected his outlook. \"After witnessing crushing poverty and the consequences of the Reagan Administration's 'constructive engagement' with the South African apartheid regime, he rethought his political views, returned to the America he loved and proudly registered as a Democrat,\" Hoffman said in a statement to Politico.According to Fox News, Coons was \"targeted by Republicans\" over the 25-year-old piece. Coons himself downplayed the article, as well as controversial past statements by O'Donnell, saying that voters were interested in current issues such as job creation and the national debt and were not \"particularly interested in statements that either of us made 20 or 30 years ago.\" David Weigel, writing in Slate, opined: \"If the Tea Party Express slings the 'bearded Marxist' nonsense, I doubt it will work.\"2014 election Incumbent U.S. Senator Chris Coons was elected to his first full term by defeating Republican challenger Kevin Wade and Green Party candidate Andrew Gross on Tuesday, November 4, 2014. Wade, an engineer and businessman also ran against U.S. Senator Tom Carper in 2012. Coons won 55.8% of the popular vote (130,655 to Wade's 98,823 and to Groff's 4,560).Tenure On November 15, 2010, Coons was sworn in as Delaware's newest senator by Vice President Joe Biden, the former occupant of Coons' seat in the Senate. Joe Manchin of West Virginia was sworn in on the same day, though he took an advantage in seniority over Coons, as the former Governor of West Virginia.The Affordable Care Act (commonly called Obamacare) had already been passed when Coons took office, but he has voted against repealing it, emphasizing that seniors in Delaware would have to pay higher prescription drug prices if it was repealed. In a May 8, 2017 appearance on Morning Joe, Coons predicted the final product of the Republican health care bill would not be produced until after the 2018 midterm elections. During an interview in September 2017, Coons said the Graham-Cassidy bill, meant to replace the Affordable Care Act, would be playing \"Russian roulette with the American health care system.\"On the issue of abortion, Coons has received a 100% rating from the Planned Parenthood Action Fund and 0% rating from the National Right to Life Committee.In June 2013, after the death of Democratic Senator Frank Lautenberg of New Jersey, Coons was appointed to his seat on the influential Committee on Appropriations, becoming the first senator from Delaware to serve on the committee in 40 years. As a result, Coons gave up his seat on the Committee on Energy and Natural Resources.In October 2013, Coons announced the formation of the inaugural Senate Chicken Caucus in the United States Senate. He stated, \"I hope that the Senate Chicken Caucus will give America's chicken producers a platform to better inform legislators about the industry's vital contributions to our economy, and promote policy solutions that help their businesses grow and thrive.\"On December 11, 2013, Coons introduced the Victims of Child Abuse Act Reauthorization Act of 2013 (S. 1799; 113th Congress), a bill that would reauthorize the Victims of Child Abuse Act of 1990 and would authorize funding through 2018 to help child abuse victims. Coons said that \"we have a responsibility to protect our children from violence and abuse.\"In March 2014, Coons voted against President Obama's nomination of civil rights lawyer Debo Adegbile to be Assistant Attorney General for Civil Rights, even though he believed that Adegbile would have been \"an asset to the Justice Department.\" He stated that voting for a nominee \"who would face such visceral opposition from law enforcement on his first day on the job\" was troubling and the vote was \"one of the most difficult I have taken since joining the Senate\". President Obama described the Senate's vote against Adegbile as \"a travesty based on wildly unfair character attacks against a good and qualified public servant.\" An open letter to Coons from students, faculty and alumni of the Yale Law and Divinity Schools, of which Coons is an alumnus, criticized his vote as \"alarm[ing]\" and \"signal[ing] a lack of respect for the fundamental American legal principle that all parties have a right to zealous representation.\"Coons was mentioned as a possible replacement for the late Justice Antonin Scalia in February 2016.In April 2017, after President Trump tweeted that North Korea had \"disrespected the wishes of China & its highly respected President\" with a recent missile launch, Coons said Trump was understanding China was his sole \"constructive path forward on North Korea\" but that diplomacy would not work through tweeting. In September, Coons said, \"Congress and the administration need to prepare for what would happen if we were required by increased threats that were increasingly credible from North Korea, to prepare for escalation of conflict.\"In April 2018, following the FBI raid on the hotel room and offices of Trump's personal attorney, Michael Cohen, Coons, together with Cory Booker, Lindsey Graham, and Thom Tillis, introduced new legislation to \"limit President Trump's ability to fire special counsel Robert Mueller\". Termed the Special Counsel Independence and Integrity Act, the legislation would allow any special counsel, in this case Mueller, receive an \"expedited judicial review\" in the 10 days following being dismissed to determine if said dismissal was suitable. If negative, the special counsel would be reinstated. At the same time, according to The Hill, the bill would \"codify regulations\" that a special counsel could only be fired by a senior Justice Department, while having to provide reasons in writing.Committee assignments Select Committee on Ethics (Vice Chairman)Committee on AppropriationsSubcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on Energy and Water DevelopmentSubcommittee on Financial Services and General Government (Ranking Member)Subcommittee on the Department of State, Foreign Operations, and Related ProgramsSubcommittee on Transportation, Housing and Urban Development, and Related AgenciesCommittee on Foreign RelationsSubcommittee on Africa and Global Health PolicySubcommittee on Multilateral International Development, Multilateral Institutions, and International Economic, Energy and Environmental PolicySubcommittee on State Department and USAID Management, International Operations and Bilateral International DevelopmentCommittee on the JudiciarySubcommittee on Crime and TerrorismSubcommittee on Oversight, Agency Action, Federal Rights and Federal CourtsSubcommittee on Privacy, Technology and the Law (Ranking Member)Subcommittee on the ConstitutionCommittee on Small Business and EntrepreneurshipPrevious (2010–2015)Committee on the BudgetCommittee on Energy and Natural ResourcesSource: United States SenateCaucus memberships Senate Law Enforcement Caucus (co-chair)Senate Competitiveness Caucus (co-chair)Senate Chicken Caucus (co-chair)Senate Human Rights Caucus (co-chair)Congressional Trademark Caucus (co-chair)Senate Fuel Cell and Hydrogen Caucus (co-chair)Senate Caucus on Malaria and Neglected Tropical Diseases (co-chair)Senate Oceans CaucusSenate Manufacturing CaucusSenate Renewables and Energy Efficiency CaucusCongressional International Creativity and Theft-Prevention CaucusSenate National Guard CaucusSenate Small Brewers CaucusCongressional Bicameral High-Speed & Intercity Passenger Rail CaucusSenate Diabetes CaucusSenate Global Internet Freedom CaucusSenate India CaucusCongressional French CaucusCloud Task Force, Congressional High Tech CaucusBicameral Congressional AIDS CaucusSenate Veterans Jobs CaucusSenate Air Force CaucusNational Service Congressional CaucusCongressional Inventions CaucusAfterschool CaucusesSource: United States Senate", "Political positions": "Gun law As of 2010, Coons had a \"F\" rating from the National Rifle Association due to his stance on gun control. In 2015, Coons co-signed a letter to Obama, along with 23 other Democratic Senators, asking the president to take executive action on gun control in the wake of the Umpqua Community College shooting. Coons supported the Feinstein Amendment, which sought to ban known and suspected terrorists from buying firearms. The next year, Coons participated in the Chris Murphy gun control filibuster.", "Electoral history": "YearOfficeElectionCandidatePartyVotes%OpponentPartyVotes%2000County CouncilPrimaryChristopher A. CoonsDemocratic7,52048%Vincent D'AnnaMartha DenisonDwight L. DavisDemocratic3,2202,4142,37021%16%15%2000County CouncilGeneralChristopher A. CoonsDemocratic113,05056%Michael RamoneRepublican87,46244%2004County ExecutivePrimaryChristopher A. CoonsDemocratic17,58467%Sherry FreeberyRichard KornDemocratic4,7024,13018%15%2004County ExecutiveGeneralChristopher A. CoonsDemocratic131,39758%Christopher CastagnoRepublican93,42442%2008County ExecutiveGeneralChristopher A. CoonsDemocratic194,005100%2010United States SenateGeneralChristopher A. CoonsDemocratic173,90056.6%Christine O'DonnellRepublican123,02540%2014United States SenateGeneralChristopher A. CoonsDemocratic130,64555.8%Kevin WadeRepublican98,81942.2%", "Personal life": "Coons is married to the former Annie Lingenfelter. They have three children: twins Mike and Jack, and daughter Maggie. They live in Wilmington, Delaware. Although Coons is Presbyterian, his wife is Catholic, and they attend St. Ann's Catholic Church in Wilmington. Coons describes himself as \"someone who is, privately, fairly religious,\" though he has never thought \"that needs to be a big part of [campaigning].\"In 1999, he was awarded the Governor's Outstanding Volunteer Award for his work with the \"I Have a Dream\" Foundation, the Governor's Mentoring Council, and the United Way of Delaware.", "introduction": "Christopher Andrew Coons (born September 9, 1963) is an American politician serving as the junior United States Senator from Delaware since 2010. A member of the Democratic Party, he won a special election to succeed Ted Kaufman, who had been appointed to the seat when Joe Biden resigned to become Vice President of the United States. Previously, Coons was the county executive of New Castle County. Coons is the 1983 Truman Scholar from Delaware, and the first recipient of the award to serve in the United States Senate.\nRaised in Hockessin, Delaware, Coons graduated from Amherst College and received graduate degrees from Yale Divinity School and Yale Law School. He went to work as a volunteer relief worker in Kenya, where he had taken classes in the University of Nairobi, later returning to the U.S. to work for the Coalition for the Homeless in New York. He spent some time as a legal clerk in New York before returning to Delaware in 1996, where he spent eight years as in-house counsel for a materials manufacturing company. In the interim he worked for several nonprofit organizations.\nHe worked on several political campaigns in his early career, including Ronald Reagan's 1980 presidential campaign. In college he switched from being a Republican to a Democrat, and in 1996 he became a delegate from Wilmington to the Democratic National Convention in Chicago. His political career began in earnest on the New Castle County Council in 2000, where he served as council president. He was elected county executive in 2004 and served for six years. There he balanced the county budget with a surplus in fiscal year 2010 by cutting spending and raising taxes, and the county maintained a AAA bond rating.\nCoons won the 2010 special election against the Republican candidate Christine O'Donnell. Coons was elected to a full term in 2014. Coons is currently the vice chair of the Senate Ethics Committee. His other committee assignments include Appropriations, Foreign Relations, Judiciary, and Small Business and Entrepreneurship. Coons previously served as ranking member of the Foreign Relations Subcommittee on African Affairs and the Judiciary Subcommittee on Bankruptcy and the Courts.\nCoons is the incoming co-chair for the 2019 National Prayer Breakfast. He previously co-chaired the 2017 National Prayer Breakfast. Coons currently co-chairs the weekly Senate Prayer Breakfast.\n\n"}, "personal": {"Born": "Christopher Andrew Coons (1963-09-09) September 9, 1963 (age55)Greenwich, Connecticut, U.S.", "Political party": "Democratic (1988–present)", "Other politicalaffiliations": "Republican (before 1988)", "Spouse(s)": "Annie Lingenfelter", "Children": "3", "Education": "Amherst College (BA)Yale University (MA, JD)"}, "timeline": {"United States Senatorfrom Delaware": {"date": "Assumed office November 15, 2010Serving with Tom Carper", "Preceded by": "Ted Kaufman"}, "Vice Chair of the Senate Ethics Committee": {"date": "Assumed office January 3, 2017", "Preceded by": "Barbara Boxer"}, "County Executive of New Castle County": {"date": "In officeJanuary 4, 2005– November 15, 2010", "Preceded by": "Thomas Gordon", "Succeeded by": "Paul Clark"}, "President of the New Castle County Council": {"date": "In officeJanuary 2, 2001– January 4, 2005", "Preceded by": "Stephanie Hansen", "Succeeded by": "Paul Clark"}}, "code": "C001088", "type": "3", "party": "Democrat", "description": "rank-and-file Democrat", "economic": "-0.24", "social": "-0.21", "leadership": "0.58"}