{'name': 'Cindy.Hyde-Smith', 'picture': 'H001079.jpg', 'detail': {'Early life': 'Hyde-Smith was born in Brookhaven, Mississippi, the daughter of Lorraine Hyde and the late Luther Hyde, and grew up in Monticello, Mississippi. She graduated from Copiah-Lincoln Community College and the University of Southern Mississippi.', 'Early political career': "Hyde-Smith was a member of the Mississippi Senate, representing the 39th District from 2000 to 2012. She had a conservative voting record in the state Senate, and in 2010, she switched parties from Democratic to Republican. Hyde-Smith's switch made the Senate equally divided between Republicans and Democrats, with each holding 26 seats.Hyde-Smith chaired the Senate Agriculture committee from 2004 to 2012 and was a member of the Appropriations, Constitution, Corrections, Elections, Forestry, Public Health and Welfare, Veterans and Military Affairs, and Wildlife, Fisheries and Parks committees. She was also Vice Chair of the National Agriculture Committee of State Legislators.", 'Mississippi Commissioner of Agriculture and Commerce': 'Hyde-Smith was elected in 2011 and took office on January 5, 2012.Hyde-Smith was elected to a second term as commissioner as 2015, defeating Democratic nominee Addie Lee Green.', 'US Senate': 'Appointment On March 21, 2018, Governor Phil Bryant announced Hyde-Smith as his choice to fill the United States Senate seat held by Thad Cochran, who indicated he would be resigning the seat at a later date due to ongoing health issues. The Trump administration reportedly did not support her appointment because of her history as a Democrat. Hyde-Smith has announced she intends to seek election to the seat in the 2018 special election on November 6. In August 2018, Trump endorsed Hyde-Smith.Tenure Hyde-Smith became the first woman to represent the state in the United States Congress. Cochran resigned on April 1, and Bryant formally appointed Hyde-Smith on April 2. The Senate was in a district work period and was not conducting legislative business at that time, so she did not take the oath of office until the Senate reconvened for legislative business on April 9.Committee assignments Committee on Agriculture, Nutrition and ForestryCommittee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related AgenciesSubcommittee on the Interior, Environment, and Related AgenciesSubcommittee on Labor, Health and Human Services, Education, and Related AgenciesSubcommittee on the Legislative BranchSubcommittee on State, Foreign Operations, and Related ProgramsCommittee on Rules and AdministrationPolitical positions Cindy Hyde-Smith identifies herself as a conservative Republican. From 1999 to 2010, she served in elected office as a Democrat. She switched to the Republican Party in 2010. She described herself as having been a conservative Democrat during her tenure in the state legislature. She voted in the Democratic primary in 2008. In 2012, she endorsed Republican candidate Mitt Romney for President. In 2018, as a Republican, Hyde-Smith faces a primary challenge from Chris McDaniel, who has criticized her past Democratic affiliation. Hyde-Smith has responded that she has "always been a conservative" and has the support of Governor Phil Bryant. She has highlighted her support for Second Amendment rights, opposition to abortion, and advocacy for the state’s defense business.FiveThirtyEight, which tracks Congressional votes, reported that Hyde-Smith has voted with Trump\'s position 100% of the time; she voted with Trump\'s position more often than any other Republican senator as of June 2018. Trump stumped for Hyde-Smith in suburban north Mississippi, but she has declined to debate her political opponents. Her predecessor, Thad Cochran, often did the same. She has mixed ratings from political action committees (PACs) representing a range of views on the ideological spectrum. In 2018, the Conservative Review, a right-wing PAC and media company, gave Hyde-Smith a 50% rating and Numbers USA, which opposes illegal immigration and seeks to reduce legal immigration, gave her a 77% score. The American Civil Liberties Union gave her a 0% score and the Mississippi Human Services Coalition, which generally gave Democrats higher scores than most Republicans, gave Hyde-Smith a rating of 33% in 2008 and 56% in 2006.Fiscal policy Hyde-Smith describes her economic positions as fiscally conservative.In 2018 Hyde-Smith was one of 29 Republicans who joined all Democrats in opposing Senator Rand Paul\'s bill to cut federal spending by 1% over 5 years, known as the Penny Bill. Republican opponents of the bill said it could threaten federal defense and domestic programs. She faced criticism from the bill\'s supporters.Hyde-Smith supports the Trump-backed Tax Cuts and Jobs Act of 2017. As a state legislator, she voted in favor of increasing unemployment benefits and in favor of raising taxes on cigarettes. She also voted with all Mississippi Democrats in the state legislature to restore funding that had been previously eliminated due to budget cuts.Social issues Hyde-Smith\'s campaign describes her as a "strong social conservative voting record with a 100 percent pro-life rating [who is] a lifetime member of the NRA." Gun Owners of America, which supports gun owners\' rights and is in favor of loosening restrictions on guns, gave her a rating of 50% in 2018.Hyde-Smith considers herself pro-life and opposes legal abortion. As a state senator, she authored a bill requiring that all abortions after 12 weeks of pregnancy be performed in a hospital or ambulatory surgical facility; the bill was blocked by federal courts. In 2018, she voted with Senate Republicans to prohibit federal funding from being given to any organization or facility that promotes abortion services or family planning.In 2018 Hyde-Smith released a statement supporting the Trump administration\'s travel ban. Her campaign platform says she supports the construction of a wall along the southern US border.In 2012, as the Commissioner of Agriculture and Commerce, Hyde-Smith was personally opposed to a same-sex commitment ceremony at the Mississippi Agriculture & Forestry Museum, but instructed the museum to allow it after consulting with Mississippi Attorney General Jim Hood.  She declared she would seek a change in state law and request from the legislature "clear and straightforward definitions about what activities can take place on the property owned by the State of Mississippi."', 'Personal life': "Hyde-Smith is a member of the American Cancer Society, the Junior Auxiliary, Hospice, the Mississippi Cattleman's Association, the Mississippi Wildlife Federation, the National Rifle Association, Mississippi National Guard Legislative Caucus, and the Copiah Lincoln Community College Foundation Board.", 'Family': 'She is married to a cattle farmer, Mike, and they have one daughter, Anna Michael. They are active members of Macedonia Baptist Church.', 'Electoral history': '2003 Mississippi State Senate 39th district Democratic primary election, 2003PartyCandidateVotes%DemocraticCindy Hyde-Smith (incumbent)11,94465.47DemocraticW. L. Rayborn6,29934.53Mississippi State Senate 39th district election, 2003PartyCandidateVotes%DemocraticCindy Hyde-Smith (incumbent)18,091100.002007 Mississippi State Senate 39th district election, 2007PartyCandidateVotes%DemocraticCindy Hyde-Smith (incumbent)12,84479.45RepublicanEdwin Case3,32320.552011 Mississippi Commissioner of Agriculture and Commerce Republican primary election, 2011PartyCandidateVotes%RepublicanCindy Hyde-Smith144,87352.93RepublicanMax Phillips96,04935.09RepublicanDannie Reed32,80911.99Mississippi Commissioner of Agriculture and Commerce election, 2011PartyCandidateVotes%RepublicanCindy Hyde-Smith493,41756.91DemocraticJoel Gill352,21340.63ReformCathy Toole21,3472.462015 Mississippi Commissioner of Agriculture and Commerce election, 2015PartyCandidateVotes%RepublicanCindy Hyde-Smith (incumbent)433,29561.47DemocraticAddie Lee Green256,76636.43ReformCathy Toole14,8522.11', 'introduction': "Cindy Hyde-Smith (born May 10, 1959) is an American politician who is the junior United States Senator from Mississippi, in office since April 2018.  A member of the Republican Party, she was previously the Mississippi Commissioner of Agriculture and Commerce and a member of the Mississippi State Senate. \nIn 1999, Hyde-Smith was elected to the Mississippi State Senate as a Democrat. She represented the 39th district from 2000 to 2012. In 2010, Hyde-Smith switched parties and became a Republican, citing her conservative beliefs. Hyde-Smith was elected Mississippi Agriculture Commissioner in 2011, and was the first woman elected to the office. \nOn March 21, 2018, Governor Phil Bryant announced his intention to appoint Hyde-Smith to the United States Senate seat being vacated due to the resignation of Thad Cochran. Hyde-Smith was sworn into office on April 9, 2018. She is the first woman to represent Mississippi in Congress.\nHyde-Smith is a candidate in the 2018 U.S. Senate special election for the remainder of Cochran's term, which expires in 2021.\n\n"}, 'personal': {'Born': 'Cindy Hyde (1959-05-10) May 10, 1959 (age59)Brookhaven, Mississippi, U.S.', 'Political party': 'Republican (2010–present)', 'Other politicalaffiliations': 'Democratic (before 2010)', 'Spouse(s)': 'Michael Smith', 'Residence': 'Brookhaven, Mississippi', 'Education': 'Copiah–Lincoln Community CollegeUniversity of Southern Mississippi (BA)'}, 'timeline': {'United States Senatorfrom Mississippi': {'date': 'Assumed office April 9, 2018Serving with Roger Wicker', 'Appointed by': 'Phil Bryant', 'Preceded by': 'Thad Cochran'}, '7th Mississippi Commissioner of Agriculture and Commerce': {'date': 'In officeJanuary 10, 2012– April 1, 2018', 'Governor': 'Phil Bryant', 'Preceded by': 'Lester Spell', 'Succeeded by': 'Andy Gipson'}, 'Member of the Mississippi Senatefrom the 39th district': {'date': 'In officeJanuary 4, 2000– January 10, 2012', 'Preceded by': 'W. L. Rayborn', 'Succeeded by': 'Sally Doty'}}, 'code': 'H001079'}