{'name': 'Claire.McCaskill', 'picture': '', 'detail': {'Early life, education, and early law career': "McCaskill was born in Rolla, Missouri. Her father, William Young McCaskill (1925–1993), served as a state Insurance Commissioner during the administration of Governor Warren E. Hearnes. Her mother, Betty Anne (née Ward; 1928–2012), was the first woman elected to the City Council of Columbia, Missouri. Betty Anne McCaskill lost a race for a seat in the state House of Representatives to Leroy Blunt, the father of U.S. Senator Roy Blunt and grandfather of former Missouri Governor Matt Blunt.McCaskill spent her early childhood in the small Missouri town of Houston, later moving to Lebanon, and eventually Columbia. McCaskill attended David H. Hickman High School in Columbia, where she was a cheerleader, Pep Club president, a member of the debate club, a musical cast member, and homecoming queen. While attending the University of Missouri, McCaskill joined Kappa Alpha Theta sorority, graduating in 1975 with a B.A. in political science. She received her Juris Doctor (J.D.) from the University of Missouri School of Law in 1978. In the summer of 1974, before graduating from the University of Missouri, McCaskill studied at the Institute on Comparative Political and Economic Systems at Georgetown University.Except for three years spent in private practice as an attorney in the firm of a Kansas City trial lawyer (1989 to 1991), McCaskill has worked in the public sector continuously since graduating from law school in 1978. Following her graduation from law school, she spent one year as a law clerk on the Missouri Court of Appeals for the Western District, which sits in Kansas City. Thereafter, McCaskill joined the Jackson County prosecutor's office, where she specialized in arson cases.", 'Early political career': 'State legislature In 1982, McCaskill was elected to represent the Brookside neighborhood of Kansas City in the Missouri House of Representatives. She left the State House and contemplated running for Jackson County Prosecutor in 1988, but did not pursue the position when her mentor, fellow Democrat and incumbent Prosecutor Albert Riederer decided to seek another term.County politics In 1990, McCaskill was elected to the Jackson County Legislature (the equivalent of a county commission or county council).In February 1991, she testified for a Missouri Senate bill that would prohibit a man accused of raping his wife from using marriage as a defense. "This is simply an issue of fundamental justice. It\'s embarrassing that we live in a state where it\'s okay to rape your wife," McCaskill said.In December 1991, McCaskill announced her intention to run for county prosecutor. At the time of the announcement, Riederer had not announced whether he was going to seek reelection. McCaskill said that crime had "run amok" during Riederer\'s eleven years as county prosecutor. McCaskill won the Democratic primary, and she went on to win the 1992 general election with 53 percent of the vote. McCaskill was the first woman to serve as prosecutor for Jackson County. She was reelected in 1996 with 71 percent of the vote.State Auditor In 1998, McCaskill was elected to State Auditor with 50.3 percent of the vote in the general election. She was the second female to hold the post, the first having been her immediate predecessor, Margaret B. Kelly.When McCaskill ran for reelection in 2002, the winner of the Republican Party primary was Al Hanson, who had previously been incarcerated for fraud. Hanson said he was qualified to detect fraud because he had committed fraud himself. Because of Hanson\'s history, the leader of the Missouri Republican Party urged voters not to vote for Hanson in the general election. McCaskill was reelected with 60 percent of the vote.2004 gubernatorial campaign On August 3, 2004, McCaskill defeated incumbent Governor Bob Holden in the Democratic primary, becoming the first candidate to defeat an incumbent Governor in a primary election in state history.On November 2, 2004, McCaskill lost to her Republican opponent, then-Secretary of State Matt Blunt in the general election by a margin of 51% to 48%. McCaskill\'s loss to Blunt was the first defeat in her twenty-year political career.', 'US Senate': 'Elections 2006Both incumbent Jim Talent and McCaskill easily defeated their opponents in their respective primaries on August 8, 2006. McCaskill and Talent debated each other on Meet the Press on October 8, 2006. On November 8, 2006, McCaskill defeated Talent by a margin of 49.6% to 47.3% with two minor-party candidates taking the remainder.2012McCaskill ran unopposed in the Democratic primary and faced Republican nominee Todd Akin in the general election. Until mid-August, polling showed them running neck and neck. Then, in a television interview on August 12, Akin claimed that women who were the victims of what he described as "legitimate rape" rarely ended up pregnant. His comments caused controversy and he was criticized by members of both parties. He faced calls to withdraw from the race but did not do so, and McCaskill opened up an increasing lead in opinion polls. Akin\'s comments caused a backlash among voters, particularly women, and McCaskill was re-elected with 54.7% of the vote to his 39.2%.In August 2015, McCaskill penned a Politico article describing how her campaign ran ads in the primary criticizing Akin as being too extreme in his conservative views to, via reverse psychology, help Akin win, since Akin was the candidate she was most likely to be able to beat.2018McCaskill has announced she is running for her third term. As of January 2018, she has six declared Democratic opponents, and five Republicans, including poll leader state Attorney General Josh Hawley, are declared candidates for the GOP primary. On July 27, The Daily Beast reported that Microsoft had discovered that in September 2017, GRU "Fancy Bear" hackers had attempted spoofing hacks of her staff aides\' email in an attempt to target her candidacy efforts.Tenure McCaskill is the first elected woman to represent Missouri in the U.S. Senate. Jean Carnahan was appointed to the Senate following her husband\'s death and posthumous election, but was defeated in a close election by Jim Talent.Political positions Through 2012, McCaskill was named by the National Journal as one of the ten most "moderate" Senators. In 2011, she was ranked 50th on its scale of the 100 senators, from most-liberal to most-conservative. In 2013, the National Journal rated McCaskill\'s voting record as 53% liberal and 47% conservative. The Washington Post reported in 2012 that she was the second-most-likely Democratic Senator to vote against her party. The conservative Americans for Prosperity gave her a 30% score for being in line with their positions in 2016. The progressive Americans for Democratic Action gave her a 65% liberal quotient in 2015. As of 2018, Five ThirtyEight, which tracks Congressional votes, found that McCaskill voted with President Trump\'s position nearly 47% of the time.2008 presidential election In January 2008, McCaskill endorsed then-Senator Barack Obama in his campaign for the Democratic nomination for president, making her one of the first Senators to do so. She was one of the most visible faces for his campaign, and her support was crucial to Obama\'s narrow victory in the Missouri primary in February 2008. She has credited her daughter Maddie as having persuaded her to publicly endorse Obama. She was frequently mentioned as a possible vice-presidential nominee for Obama, but was never seriously considered. She spoke on the opening day of the Democratic National Convention in August 2008.2016 presidential election In 2013, McCaskill announced that she would be supporting Hillary Clinton in the 2016 presidential election. During the primaries, McCaskill was among Clinton\'s top surrogates. She described Bernie Sanders as "too liberal" and "extreme" and saying that the enthusiasm of his supporters was no more impressive than that of Ron Paul\'s supporters in 2012. On March 21, after Clinton\'s sweep of Southern primaries, McCaskill called for Sanders to throw his support to Clinton.Economic issues In 2013, the National Journal gave her a 46% score on "Liberal on Economic Policy" and a 53% score on "Conservative on Economic Policy." In 2016, FreedomWorks and the Club for Growth, both of which support lower taxes, gave her ratings of 10% and 15%, respectively.In November 2017, President Trump visited Missouri to promote his tax bill and said that if McCaskill didn\'t support his tax plan, she should be voted out of office. She said that she could support a tax bill put together "in a bipartisan way" and that she would support "doubling the standard deduction," "enhancing the child tax credit," and even "some corporate tax relief as long as we were cleaning up some of the loopholes that allow so many corporations to avoid paying their fair share." But she did not support Trump\'s tax bill, which in Missouri, she said, would mainly help rich St. Louis suburbanites.Ahead of an August 7, 2018, Missouri vote on Proposition A on adopting a right-to-work law in Missouri, McCaskill endorsed a "no" vote on the proposition.Immigration In 2010, McCaskill voted for the DREAM Act, which would have given undocumented immigrants who entered the United States as children a pathway to citizenship provided that they fulfilled certain conditions.McCaskill has said that "protecting the DREAMers has to be a very top priority." McCaskill opposed the Trump administration\'s policy of separating immigrant families who crossed the border illegally. McCaskill supported legislation to end the family separation policy.Government spending She co-sponsored the Saving Federal Dollars Through Better Use of Government Purchase and Travel Cards Act, which sought to improve the processes related to the use of credit cards by government employees.Armed services As a member of the Senate Armed Services Committee, McCaskill has called for nuclear weapons modernization. In June 2017, she voted to support Trump\'s $350 billion arms deal with Saudi Arabia.On January 14, 2014, she introduced the Victims Protection Act of 2014 (S. 1917; 113th Congress), which seeks to help victims of sexual assault in the military. This bill was a watered down version of a similar sexual assault bill previously introduced by Senator Kirsten Gillibrand. The latter proposal would have streamlined the prosecution process by removing it from the military chain of command. McCaskills\' bill allows victims to give a preference as to whether they would prefer their cases to be tried in the military or in the civilian justice system. The bill passed the Senate on March 10, 2014 by a vote of 97–0.Disaster recovery As a member of the Senate ad hoc subcommittee on disaster recovery, McCaskill criticized the Federal Emergency Management Agency\'s handling of Hurricane Katrina recovery efforts.Health care In 2017, the Planned Parenthood Action Fund gave her a 100% lifetime rating for her positions on health care. In 2016, the American Public Health Association also gave her a 100% rating for the positions she had taken on health-care issues during the previous year.McCaskill voted for the Patient Protection and Affordable Care Act, popularly known as ObamaCare, in December 2009.In April 2017, McCaskill expressed her opposition to a single-payer healthcare system, saying it is too expensive and not realistic.In August 2017, she introduced the Health Care Options for All Act, whereby people living in counties with no health-care exchanges "would be able to buy coverage through the D.C. small business exchange, called SHOP," with the U.S. government "contribut[ing] toward the cost of premiums if they meet a certain income threshold." Criticizing Trump\'s health-care bill in September 2017, she called it "a bait-and-switch, in which they\'re trying to buy off certain states with promises of more money now, but with no guarantee that healthcare dollars in our state won\'t ultimately go down." She added that the bill would not help "folks in Missouri who\'ve been sick before and have a pre-existing condition, and older Missourians."At each event during her 2018 re-election bid campaign, McCaskill asked attendees with preexisting conditions to stand up, and vowed to keep in place health insurance protections for such individuals.Gun law McCaskill has an "F" rating from the National Rifle Association (NRA) for its belief that she does not support Second Amendment rights and opposes all right-to-carry legislation.She has voted for expanded background checks and co-sponsored the Feinstein Amendment, which if passed, would have made it illegal for individuals on the terror watchlist to purchase guns. In June 2016, McCaskill participated in the Chris Murphy gun control filibuster and in a sit-in on the House floor urging votes for gun control.In response to the 2017 Las Vegas shooting, McCaskill co-sponsored a bill to ban bump stocks.Facebook posting by Maria Chappelle-Nadal In August 2017, Missouri State Senator Maria Chappelle-Nadal (D-University City) wrote on Facebook: "I hope Trump is assassinated!" McCaskill condemned the posting: "I condemn it. It\'s outrageous. And she should resign."#MeToo In October 2017, in the midst of a flurry of news reports about sexual assaults by politicians and other celebrities, McCaskill said on Meet the Press that while serving in the state legislature, she had asked the House Speaker, Bob F. Griffin, to discuss a bill she was sponsoring. "And I explained to him the bill I had, and did he have any advice for me on how I could get it out of committee?" McCaskill said. "And he looked at me, and he paused, and he said, \'Well, did you bring your knee pads?\'"Men In November 2015, in a video for The Late Show with Stephen Colbert, McCaskill encouraged men to "\'sometimes just shut the hell up\'". McCaskill added, "\'It’s not that women don’t value your thoughts, it’s just that we don’t value all of them\'". She then set forth a variety of topics about which "\'women no longer need to hear men\'s opinions\'". Regarding the topic of "\'what women do with their bodies\'", McCaskill advised men to "\'hush\'". McCaskill described the video as a joke.Net neutrality In January 2018, McCaskill announced her support for a Senate bill intended to reverse the Federal Communications Commission\'s repeal of net neutrality; as she was the 30th Senator to support the bill, it was ensured that the bill would reach the floor of the Senate. In October 2017, McCaskill was one of four Democrats who voted to confirm FCC Commissioner Ajit Pai, who announced the plan to reverse net neutrality rules earlier that year. In explaining her vote, McCaskill said that she disagreed with Pai on net neutrality but voted for Pai because "the president has a right to the chairman because he won the election". According to Ars Technica, "it\'s common for [FCC] commissioners to get broad bi-partisan support in the Senate even if their policies are opposed by one of the two major parties."Trade McCaskill opposed Trump\'s trade tariffs, saying they were "hurting Missouri farmers and manufacturing."Voting rights In July 2018, McCaskill introduced legislation that would make it illegal to knowingly and intentionally spread false information about an election, such as false information about the time and place of voting, voter qualifications and registration status. She said, "Misinformation campaigns intended only to suppress the vote and disenfranchise Missourians are crimes that run counter to our democratic values."Committee assignments Committee on Armed ServicesSubcommittee on AirlandSubcommittee on CybersecuritySubcommittee on PersonnelUnited States Senate Committee on FinanceUnited States Senate Finance Subcommittee on International Trade, Customs, and Global CompetitivenessUnited States Senate Finance Subcommittee on Taxation and IRS OversightCommittee on Homeland Security and Governmental Affairs (Ranking Member)Subcommittee on Federal Financial Management, Government Information and International SecurityPermanent Subcommittee on Investigations (Ranking Member)Ad Hoc Subcommittee on State, Local, and Private Sector Preparedness and IntegrationMcCaskill also served as the Chairwoman of the Select Committee for the Impeachment of Samuel B. Kent, which was disbanded July 22, 2009, after Judge Kent resigned, and the United States Senate Homeland Security Ad Hoc Subcommittee on Contracting Oversight, which was disbanded in 2013.', 'Controversies': 'Private airplane On March 16, 2011, McCaskill told reporters that she was "embarrassed" about revelations that her office had used taxpayer money for the senator\'s use of a private airplane she co-owned with her husband and friends. According to a government audit, the plane was used for 90 flights taken between Washington, D.C., and her home in suburban St.\xa0Louis, as well as to numerous sites around the state of Missouri. According to McCaskill\'s Senate office, all but 1 of the 90 flights in question were within Senate rules. As soon as the story broke, McCaskill sent a check for $88,000 to the U.S. Treasury as reimbursement for the flights.The Missouri Republican Party filed a formal complaint with the Senate Ethics Committee on March 16. In response McCaskill said, "The Missouri Republican Party is going to try to ride this horse as long as they can. They\'re going to try to make this as big a deal as they can. Them filing the ethics complaint is about as surprising as the sun coming up." On March 21, 2011, Politico reported that McCaskill and her husband had failed to pay more than $280,000 in property taxes on the plane and was planning to sell it. "I have convinced my husband to sell the damn plane", McCaskill said on a conference call with reporters. "I will never set foot on the plane again". The Senate Ethics Committee dismissed the Missouri Republican Party\'s complaint.The plane, a 2001 Pilatus PC-12, was sold in October 2011. It was stored at Spirit of St. Louis Airport, McCaskill confirmed, and owned by Timesaver LLC, a Delaware-based corporation. McCaskill noted that she had paid $38,800 in sales taxes on the plane, and she had only recently become aware that Missouri also imposed a property tax on private aircraft. She said she was "disappointed" in herself for not ensuring that Timesaver LLC paid the property taxes. "Frankly, having the plane owned in Delaware would not negate the necessity of paying the personal property tax in Missouri," she said. "This is a mistake. It should have been reported in Missouri. It was owed in Missouri. It will be paid in Missouri today".Meetings with Russian government officials On March 2, 2017, McCaskill tweeted that she had had "No call or meeting w/Russian ambassador. Ever". After her own tweets of January 20, 2013 ("Off to meeting w/Russian Ambassador.") and August 6, 2015 ("Today calls with British, Russian, and German Ambassadors") were exposed, McCaskill recanted her tweet of March 2, blaming Twitter\'s character limit. McCaskill had been a leading critic of Attorney General Jeff Sessions\'s meetings with Russian government officials in his capacity as United States senator and had called for Sessions\'s resignation on this account. McCaskill also said that the nature of her meetings with the Russian ambassador were different to his. PolitiFact rated McCaskill\'s assertion false, and also noted "though the context for McCaskill\'s and Sessions\' interactions with Kislyak may be very different, she goes too far in saying she didn\'t "ever" have that meeting or phone call."', 'Electoral history': 'State Auditor Missouri State Auditor Democratic Primary, 1998PartyCandidateVotes%±DemocraticClaire McCaskill 151,595 51.0%  DemocraticStephen J. Conway114,99738.7%−12.3DemocraticTimothy Marshall Walters30,88810.4%−40.6Missouri State Auditor election, 1998PartyCandidateVotes%±DemocraticClaire McCaskill 780,178 50.3%  RepublicanCharles (Chuck) A. Pierce719,65346.4%−3.9%LibertarianGerald R. Geier26,9551.7%−48.6ReformGeorge D. Weber24,1881.6%−48.7Missouri State Auditor election, 2002PartyCandidateVotes%±DemocraticClaire McCaskill (incumbent) 1,090,593 60.0%  RepublicanAl Hanson664,98236.6%−23.4LibertarianArnold J. Trembley39,8912.2%−57.8GreenFred Kennell23,5211.3%−58.7American IndependentTheo (Ted) Brown, Sr.540.0%−60Governor Missouri gubernatorial Democratic primary election, 2004PartyCandidateVotes%±DemocraticClaire McCaskill 437,780 51.6%  DemocraticBob Holden (incumbent)383,73445.3%−6.3DemocraticJim LePage16,7612.0%−49.6DemocraticJeffery A. Emrick9,4731.1%−50.5Missouri gubernatorial election, 2004PartyCandidateVotes%±RepublicanMatt Blunt 1,382,419 50.8%  DemocraticClaire McCaskill1,301,44247.9%−2.9LibertarianJohn M. Swenson24,3780.9%−49.9ConstitutionRobert Wells11,2990.4%−50.4NonpartisanKenneth J. Johnson610%−50.8U.S. Senator Missouri United States Senate Democratic primary election, 2006PartyCandidateVotes%+%DemocraticClaire McCaskill282,76780.8%DemocraticBill Clinton Young67,17319.2%Missouri United States Senate election, 2006PartyCandidateVotes%±DemocraticClaire McCaskill 1,055,255 49.6 +0.9 RepublicanJim Talent (Incumbent)1,006,94147.3−2.3Missouri United States Senate Election, 2012PartyCandidateVotes%±DemocraticClaire McCaskill (Incumbent) 1,484,683 54.7% +5.1 RepublicanTodd Akin1,063,69839.2%-15.5LibertarianJonathan Dine164,9916.1%-45.1', 'Personal life': 'McCaskill was married to David Exposito, with whom she had three children. The couple divorced in 1995, after 11 years of marriage, while McCaskill was Jackson County Prosecutor. David Exposito was found murdered in Kansas City, Kansas on December 12, 2005. Exposito\'s murder has never been solved.On the October 3, 2009 episode of NPR\'s Wait Wait... Don\'t Tell Me!, McCaskill spoke about a vacation early in her career as a lawyer, where she was a contestant on High Rollers. McCaskill would reign as champion for four days, and later sold several of her prizes to pay off her student loan debt.McCaskill\'s mother, Betty Anne McCaskill, died on October 29, 2012, from natural causes at the age of 84.A convert to Roman Catholicism, McCaskill was denied communion for her pro-choice stance on abortion by then-Bishop Raymond Burke, later Cardinal Raymond Burke.She joined Sheryl Sandberg\'s movement to encourage young women to be more assertive in professional interactions.On February 22, 2016, McCaskill announced that she had been diagnosed with breast cancer. She stated through Tumblr, "It\'s a little scary, but my prognosis is good and I expect a full recovery."', 'introduction': 'Claire Conner McCaskill (/məˈkæskəl/; born July 24, 1953) is an American politician who serves as the senior United States Senator from Missouri, a seat she was first elected to in 2006. She is the second female U.S. Senator from Missouri after Jean Carnahan who served from her appointment in 2001 until 2002, and the first female US Senator from Missouri to be elected in her own right. A Democrat, McCaskill was re-elected in 2012 and is running for re-election in 2018.\nBefore her election to the U.S. Senate, McCaskill was the 34th State Auditor of Missouri from 1999 to 2007. She previously served as Jackson County Prosecutor from 1993 to 1998 and as a member of the Missouri House of Representatives from 1983 to 1989. She ran for Governor of Missouri in the 2004 election, beating Democratic incumbent Bob Holden in the primary election but losing to Republican Matt Blunt in a close general election. A native of Rolla, she graduated from the University of Missouri and the University of Missouri School of Law.\n\n'}, 'personal': {'Born': 'Claire Conner McCaskill (1953-07-24) July 24, 1953 (age65)Rolla, Missouri, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'David Exposito(m.1984; div.1995)Joseph Shepard (m.2002)', 'Children': '3', 'Education': 'University of Missouri (BA, JD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Missouri': {'date': 'Assumed office January 3, 2007Serving with Roy Blunt', 'Preceded by': 'Jim Talent'}, 'Ranking Member of the Senate Homeland Security Committee': {'date': 'Assumed office January 3, 2017', 'Preceded by': 'Tom Carper'}, '34th Auditor of Missouri': {'date': 'In officeJanuary 3, 1999– January 3, 2007', 'Governor': 'Mel CarnahanRoger WilsonBob HoldenMatt Blunt', 'Preceded by': 'Margaret Kelly', 'Succeeded by': 'Susan Montee'}, 'Prosecutor of Jackson County': {'date': 'In office1993–1998', 'Preceded by': 'Albert Riederer', 'Succeeded by': 'Robert Beaird'}, 'Member of the Missouri House of Representativesfrom the 42nd district': {'date': 'In officeJanuary 5, 1983– February 2, 1988', 'Preceded by': 'James Barnes', 'Succeeded by': 'Joseph F. Kenton'}}, 'code': ''}