{'name': 'Cory.Booker', 'picture': 'B001288.jpg', 'detail': {'Early life and education': "Booker was born on April 27, 1969, in Washington, D.C., and grew up in Harrington Park, New Jersey, 20 miles (32\xa0km) north of Newark, New Jersey. His parents, Carolyn Rose (née Jordan) and Cary Alfred Booker, were among the first black executives at IBM. Booker has stated that he was raised in a religious household, and that he and his family attended a small African Methodist Episcopal Church in New Jersey.Booker graduated from Northern Valley Regional High School at Old Tappan, where he played varsity football and was named to the 1986 USA Today All-USA high school football team. Booker went on to Stanford University, receiving a Bachelor of Arts in political science in 1991 and a Master of Arts in sociology the following year. While at Stanford, he played football as a tight end and was teammates with Brad Muster and Ed McCaffrey, and also made the All–Pacific-10 Academic team and was elected senior class president. In addition, Booker ran The Bridge Peer Counseling Center, a student-run crisis hotline, and organized help from Stanford students for youth in East Palo Alto, California.After Stanford, Booker was awarded a Rhodes Scholarship to study at the University of Oxford, where he earned an honors degree in United States history in 1994 as a member of The Queen's College. He earned his Juris Doctor in 1997 from Yale Law School, where he operated free legal clinics for low-income residents of New Haven, Connecticut. At Yale, Booker was a founding member of the Chai Society (now Shabtai), was a Big Brother with Big Brothers Big Sisters of America, and was active in the National Black Law Students Association.", 'Newark Municipal Council': 'Contemplating advocacy work and a run for city council in Newark after graduation from law school, Booker lived in the city during his final year at Yale. After graduation, he served as staff attorney for the Urban Justice Center in New York and program coordinator of the Newark Youth Project. In 1998, Booker won an upset victory for a seat on the Municipal Council of Newark, defeating four-term incumbent George Branch. To draw attention to the problems of open-air drug dealing and associated violence, he went on a 10-day hunger strike and lived in a tent and later in a motor home near drug-dealing areas of the city. Booker proposed council initiatives that impacted housing, young people, law and order, and the efficiency and transparency of city hall, but was regularly outvoted by all of his fellow councilors.', 'Mayor of Newark': 'Mayoral campaigns2002 electionOn January 9, 2002, Booker announced his campaign for Mayor of Newark rather than running for re-election as councilman; this pitted him against longtime incumbent Sharpe James. James, who had easily won election four consecutive times, saw Booker as a real threat, and responded with mudslinging, at one campaign event calling him "a Republican who took money from the KKK [and] Taliban ... [who\'s] collaborating with the Jews to take over Newark". In the campaign, James\' supporters questioned Booker\'s suburban background, calling him a carpetbagger who was "not black enough" to understand the city. Booker lost the election on May 14, garnering 47% of the vote to James\' 53%. The election was chronicled in the Oscar-nominated documentary Street Fight.2006 electionBooker announced on February 11, 2006, that he would again run for mayor. Although incumbent Mayor Sharpe James filed paperwork to run for reelection, shortly thereafter he announced that he would instead cancel his bid to focus on his work as a State Senator, which he was originally elected to in 1999. At James\'s discretion, Deputy Mayor Ronald Rice decided to run as well. Booker\'s campaign outspent Rice\'s 25 to 1, for which Rice attacked him. In addition to raising over $6 million for the race, Booker attacked Rice as a "political crony" of James. Booker won the May 9 election with 72% of the vote. His slate of city council candidates, known as the "Booker Team", swept the council elections, giving Booker firm leadership of the city government.2010 electionOn April 3, 2010, Booker announced his campaign for reelection. At his announcement event, he remarked that a "united government" was crucial to progress, knowing his supporters in the city council faced tough reelections. Heavily favored to win, Booker faced former judge and Essex County prosecutor Clifford J. Minor, as well as two minor candidates. On May 11, Booker won reelection with 59% of the vote, although two of his nine council candidates were defeated.[citation needed]TenureBefore taking office as mayor, Booker sued the James administration, seeking to terminate cut-rate land deals favoring two redevelopment agencies that had contributed to James\'s campaigns and listed James as a member of their advisory boards. Booker argued that the state\'s "pay-to-play" laws had been violated and that the land deals would cost the city more than $15 million in lost revenue. Specifically, Booker referenced a parcel at Broad and South Streets that would generate only $87,000 under the proposed land deals yet was valued at $3.7 million under then-current market rates. On June 20, 2006, Superior Court Judge Patricia Costello ruled in favor of Booker.In late June 2006, before Booker took office, New Jersey investigators foiled a plot to assassinate Booker led by Bloods gang leaders inside four New Jersey state prisons. The motive for the plot was unclear, but was described variously as a response to the acrimonious campaign and to Booker\'s campaign promises to take a harder line on crime.First termBooker assumed office as Mayor of Newark on July 1, 2006. After his first week in office, he announced a 100-day plan to implement reforms in Newark. The proposed changes included increasing police forces, ending background checks for many city jobs to help former offenders find employment in the city, refurbishing police stations, improving city services, and expanding summer youth programs.One of Booker\'s first priorities was to reduce the city\'s crime rate. In furtherance of this, he appointed Garry McCarthy, former deputy commissioner of operations of the New York City Police Department, as director of the Newark Police Department. Crime reduction was such a central concern to the Booker administration that Booker, along with his security team, was known to personally patrol the streets of Newark until as late as 4\xa0a.m.Booker is a member of the Mayors Against Illegal Guns Coalition, a bipartisan group with a stated goal of "making the public safer by getting illegal guns off the streets". Booker was honored in October 2009 by the Brady Center to Prevent Gun Violence with the Sarah Brady Visionary Award for his work in reducing gun violence. During his mayoralty, crime dropped significantly in Newark, which led the nation in violent crime reduction from 2006 to 2008. March 2010 marked Newark\'s first murder-free month in over 44 years, although murder and overall crime rates began to rise again after 2008. In addition to his crime-lowering initiatives, Booker doubled the amount of affordable housing under development and quadrupled the amount under pre-development, and reduced the city budget deficit from $180 million to $73 million.After taking office, Booker voluntarily reduced his own salary twice, reducing his salary by 8% early in his first year as mayor. He also raised the salaries of many city workers. However, his administration imposed one-day-a-month furloughs for all non-uniformed employees from July through December 2010, as well as 2% pay cuts for managers and directors earning more than $100,000 a year. In 2008 and 2009 the City of Newark received the Government Finance Officers Association\'s Distinguished Budget Presentation Award. In an effort to make government more accessible, Booker held regular open office hours during which city residents can meet with him personally to discuss their concerns. In 2010, Booker was among the finalists for the World Mayor prize, ultimately placing seventh. He was an unsuccessful candidate for the 2012 award.Second termOn October 10, 2010, Booker established Let\'s Move! Newark as part of First Lady Michelle Obama\'s national Let\'s Move! initiative against childhood obesity. In October 2011 he expanded the program to include Let\'s Move! Newark: Our Power, a four-month fitness challenge for Newark public school students run by public health advocate Jeff Halevy.Booker gained national attention when, on December 28, 2010, a constituent used Twitter to ask him to send someone to her father\'s house to shovel his driveway because her elderly father was going to attempt to do it himself. Booker responded by tweeting, "I will do it myself; where does he live?" Other people volunteered, including one person who offered his help on Twitter, and 20 minutes later Booker and some volunteers showed up and shoveled the man\'s driveway. On April 12, 2012, Booker saved a woman from a house fire, suffering smoke inhalation and second-degree burns on his hands in the process. Newark Fire Chief John Centanni said that Booker\'s actions possibly saved the woman\'s life. After Hurricane Sandy destroyed much of the shoreline areas of New Jersey and New York in late October 2012, Booker invited Newarkers without power to eat and sleep in his home. In February 2013, responding to a Twitter post, Booker helped a nervous constituent propose to his girlfriend. Booker rescued a dog from freezing temperatures in January 2013 and another dog that had been abandoned in a cage in July 2013.On November 20, 2012, a melee occurred at a Newark City Council meeting attended by Booker. The nine-seat council was to vote on the successor to the seat vacated by newly elected U.S. Representative Donald M. Payne,\xa0Jr. Booker\'s opponents on the council, including Ras Baraka, sought to appoint John Sharpe James, son of the former mayor, while Booker and his supporters favored Shanique Speight. Booker attended the meeting to deal with the eventuality of the lack of a quorum or a tie vote, in which state law would allow him to cast a deciding vote. After Baraka was refused an opportunity to address the council by acting Council President Anibal Ramos,\xa0Jr., Baraka and two other council members walked away in protest. Booker cast the deciding vote for Speight. Supporters of James stormed the stage and were held back by riot police, who eventually used pepper spray on some members of the crowd. Baraka later blamed Booker for inciting the disturbance, while Booker refused comment to the media after the vote.In December 2012, after discussions with a constituent about New Jersey\'s Supplemental Nutrition Assistance Program (SNAP), Booker began a week-long challenge attempting to live on a food budget of $30 per week—the amount SNAP recipients receive. When critics noted that the very name of the SNAP program shows that it is intended to "supplement" an individual\'s food budget, not be its sole source, Booker replied that his aim was to spark a discussion about the reality that many Americans rely solely on food stamps to survive.Newark WatershedThe Newark Watershed comprises 35,000 acres of reservoirs and water treatment systems for more than 500,000 customers in northern New Jersey, including Newark and neighboring Belleville, Elizabeth, Bloomfield, and Nutley. It is considered one of the city\'s greatest assets. A New Jersey State Comptroller report issued in February 2014 revealed irregularities and corruption within the Newark Watershed and Development Corporation, which is in the process of being dismantled after being taken over by the city while on Booker\'s watch.[excessive citations]Public opinion pollingThroughout Booker\'s mayoralty, Fairleigh Dickinson University\'s public opinion poll PublicMind asked New Jersey residents statewide whether or not they had heard of Mayor Booker and whether they had a favorable or unfavorable opinion of him. The results are as follows:March 2014Name recognition: 88%Favorable opinion: 47%Unfavorable opinion: 23%LegacyBooker\'s mayoralty and personal celebrity drew much media attention to Newark. While he enjoyed high ratings from city residents, his legacy has received mixed reviews. During his tenure, millions of dollars were invested in downtown development, but underemployment and high murder rates continue to characterize many of the city\'s neighborhoods. Despite legal challenges initiated during his term, Newark Public Schools has remained under control of the state for nearly twenty years. Newark received $32 million in emergency state aid in 2011 and 2012, requiring a memorandum of understanding between Newark and the state that obligates the city to request and the state to approve appointments to city hall administrative positions.While Mayor of Newark, Booker claimed in an interview that Newark\'s unemployment rate had fallen by two percentage points. This statement was rated "false" by PolitiFact because he used data that had not been seasonally adjusted; the actual rate was 0.7 percentage points.', 'US Senate': '2013 electionOn December 20, 2012, Booker announced that he would explore running for the U.S. Senate seat that was then occupied by Frank Lautenberg in the 2014 election, ending speculation that he would challenge Governor Chris Christie in the 2013 gubernatorial election. On January 11, 2013, Booker filed papers to form a campaign committee, without announcing whether or not he would run. Roughly one month after declaring his interest in running for the Senate, incumbent Lautenberg announced that he would not seek reelection.On June 3, Lautenberg died of viral pneumonia; five days later Booker announced his intention to run for Lautenberg\'s seat in the 2013 special election. Booker announced his candidacy at two events: one in Newark and the other in Willingboro.On August 13, 2013, Booker was declared the winner of the Democratic primary, with approximately 59% of the vote. On October 16, 2013, he defeated Republican Steve Lonegan in the general election 55% to 44%, making him the first African-American U.S. Senator from New Jersey and the first African-American to be elected to the Senate since Barack Obama in 2004. The night before his victory, Booker visited the gravesite of Rabbi Menachem M. Schneerson, where he offered his prayers and lit a vigil candle in memory of his father.TenureOn October 31, 2013, Booker was sworn into the Senate. In November 2013, Booker co-sponsored and voted for the Employment Non-Discrimination Act. In December 2013, he was one of the original cosponsors of Bob Menéndez\'s Nuclear Weapon Free Iran Act of 2013, which would toughen sanctions against Iran. He also voted for the National Defense Authorization Act for Fiscal Year 2014 and the Bipartisan Budget Act of 2013. In January 2014, he cosponsored the Respect for Marriage Act. In February 2014, Booker voted against the Federal Agriculture Reform and Risk Management Act of 2013.  In March, Booker pledged to meet with each of his Republican colleagues in the Senate in order to find common ground and he was spotted having dinner with Senator Ted Cruz in Washington.Booker has faced criticism on the left. Speaking in Salon, Alex Pareene called him an avatar of the wealthy elite, a camera hog, and a political cipher. Leading up to the 2016 presidential election, Booker endorsed Hillary Clinton for the Democratic nomination. He was speculated as a potential vice presidential candidate during the primary and as the general election began, though Booker stated on June 16, 2016, that he was not being vetted. After the election, in which Donald Trump defeated Clinton, on January 11, 2017, Booker testified against Attorney General nominee Jeff Sessions, the first instance of a sitting senator testifying against another during a cabinet position confirmation hearing.Booker was supportive of fellow New Jersey Senator Bob Menendez while Menendez faced trial on federal corruption and bribery charges. During the trial, Booker was a character witness for Menendez, giving him effusive praise. After the judge declared a mistrial, Booker argued that prosecutors ought not to take Menendez to trial again. When Menendez ran for re-election, Booker praised Menendez, saying he was "so grateful for Bob Menendez and that I get to work with him and stand beside him". Booker downplayed the corruption allegations, saying "to try to continue to try to throw this kind of mud at him, it\'s not going to stick. It didn\'t stick when the government tried to do it and it should not stick now."Cory Booker was named as part of the "Hell-No Caucus" by Politico in 2018, along with Senators Kamala Harris, Kirsten Gillibrand, Elizabeth Warren, and Bernie Sanders, given he voted "overwhelmingly to thwart his [Trump\'s] nominees for administration jobs", such as with Rex Tillerson, Betsy De Vos, and Mike Pompeo; all were considered potential 2020 presidential contenders at this point in time.In April 2018, following the FBI raid on the hotel room and offices of Trump\'s personal attorney, Michael Cohen, Booker, together with Chris Coons, Lindsey Graham, and Thom Tillis, introduced new legislation to "limit President Trump\'s ability to fire special counsel Robert Mueller". Termed the Special Counsel Independence and Integrity Act, the legislation would allow any special counsel, in this case Mueller, receive an "expedited judicial review" in the 10 days following being dismissed to determine if said dismissal was suitable. If negative, the special counsel would be reinstated. At the same time, according to The Hill, the bill would "codify regulations" that a special counsel could only be fired by a senior Justice Department official, while having to provide reasons in writing.On September 5, 2018, during the Senate Judiciary Committee\'s confirmation hearings for Brett Kavanaugh, nominated by Trump to replace retiring Associate Justice Anthony Kennedy on the Supreme Court, Booker questioned Kavanaugh on a series of E-mails marked "committee confidential", dating back to Kavanaugh\'s time in the office of the White House Counsel during the presidency of George W. Bush. The E-mails, which were released to the public by Booker\'s office the following day, appeared to show Kavanaugh and others in the Counsel\'s office discussing the possibility of using racial profiling as a means to combat terrorism, particularly after 9/11. Booker admitted that he had violated Senate rules in releasing the documents, with the penalty including possible expulsion from the Senate; he nonetheless defended his decision, referring to the process of producing documents for the hearing as a "sham" and challenging those who warned him about the consequences to "bring it on".Booker is considering a run for president in the 2020 election.Committee assignmentsCommittee on Commerce, Science, and TransportationSubcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Consumer Protection, Product Safety, Insurance and Data SecuritySubcommittee on Oceans, Atmosphere, Fisheries, and Coast GuardSubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and Security (Ranking Member)Committee on Environment and Public WorksSubcommittee on Fisheries, Water and WildlifeSubcommittee on Superfund, Waste Management, and Regulatory OversightCommittee on Foreign RelationsSubcommittee on Africa and Global Health Policy (Ranking Member)Subcommittee on Near East, South Asia, Central Asia and CounterterrorismSubcommittee on State Department and USAID Management, International Operations and Bilateral International DevelopmentCommittee on Small Business and EntrepreneurshipCommittee on the JudiciaryCaucus membershipsCongressional Black CaucusCongressional NextGen 9-1-1 Caucus2014 electionAfter being defeated in the 2013 special election, Steve Lonegan announced that he would not run again for the seat in the 2014 race. Presumed candidates for the Republican primary were Thomas Kean Jr., Jay Webber, Jon Bramnick, and Michael J. Doherty. On January 9, 2014, Brian D. Goldberg, a West Orange resident and New Jersey businessman, announced that he would seek the Republican nomination.On February 4, 2014, conservative political consultant Jeff Bell announced his bid for the nomination. Bell won the Republican Primary and received significant support from the conservative American Principles Fund, which ran a direct mail operation costing over $80,000, and the National Organization for Marriage, an anti-same-sex marriage group, which paid for $6,000 of automated calling. Booker defeated Bell, capturing 55.8% of the vote to Bell\'s 42.4%. Brendan W. Gill was Booker\'s campaign manager.', 'Political positions': 'He has been described as a liberal, and a moderate. In a July 2013 Salon interview, Booker said that "there\'s nothing in that realm of progressive politics where you won\'t find me." In a September 2013 interview with The Grio, when asked if he considered himself a progressive, he stated that he is a Democrat and an American. George Norcross III described Booker as "a new Democrat—a Democrat that\'s fiscally conservative yet socially progressive." In May 2012, Booker defended Bain Capital\'s record and criticized Obama\'s attack on private equity. In response, the Republican National Committee, created a petition called "I Stand With Cory Booker". He has also received criticism from both progressives and liberals, such as Ronald Rice and Rush Holt.As mayor of Newark, New Jersey, he "drew criticism from liberal allies for embracing charter schools and voucher programs advocated by libertarians." "He also championed "enterprise zones," a free-market approach to solving urban blight credited to the late Jack Kemp, a hard-core supply-sider and occasional Republican presidential contender who helped raise money for Booker\'s first mayoral campaign." Besides social media advances, Booker wants to see the rest of the tech sector reach its fullest potential, and to do that, he thinks the U.S. government needs to ease up on regulations. "We\'re not moving at the speed of innovation due to regulations," he said, adding that because of this, key industries are leaving the U.S. to work on projects in other countries where the rules aren\'t as strict. For example, the Federal Aviation Administration has hindered drone innovation to the point where drone companies are leaving the U.S. to test and build in Europe. "We\'re being left behind on everything from next-generation nuclear energy to driverless cars and biologics," Booker said, "and we cannot get left behind." He supports long-term deficit reduction efforts to ensure economic prosperity, Cap and Trade taxation to combat climate change, and increased funding for education. He supports ending the War on Drugs. Daniel J. Mitchell of the Cato Institute identities Booker as having libertarian views in opposition to the War on Drugs. Booker supports abortion rights and affirmative action.Booker supports a single-payer health care plan.  In September 2017, he joined Bernie Sanders and 14 other co-sponsors in submitting  a single-payer health care plan to congress called the "Medicare for All" bill.On foreign policy, Booker supports scaling down U.S. involvement in Afghanistan and is against intervention in Syria. After the US strike on Syria in April 2017, Booker criticized military action "without a clear plan" or authorization from Congress. He supports a two-state solution to the Israeli–Palestinian conflict. On Iran, Booker has stated the country poses a direct threat to American and Israeli security and feels all options should be on the table for dealing with the conflict. However, his decision to back the Iran nuclear deal framework damaged his long-term relationship with Jewish voters and supporters. In an attempt to reduce the damage, Booker initiated an emergency summit for Jewish leaders, which some of his longstanding supporters did not attend.Domestic policyAbortionBooker opposes overturning Roe v. Wade.Affirmative actionWhen asked if affirmative action in university admissions should be based on class or race or banned completely, Booker said both race and class should be considered and cited the 2003 US Supreme Court ruling, Grutter v. Bollinger.BudgetWhen Cory Booker became Mayor of Newark, New Jersey in 2006, he was facing a $180 million budget crisis. When he left his office in 2013, he left the city with a balanced budget for the first time in a decade, twice as much affordable housing, two new hotels, a spate of made-over parks, a new residential tower, two (possibly three) new office towers, $150 million educational complex in the heart of Newark\'s downtown, and Newark having a larger population than when he entered office. He managed to balance the budget by raising taxes 20%, laying off hundreds of cops, cutting spending, and working with private sector-led urban development from wealthy investors.Booker supports smart spending and investment now with long-term deficit reduction efforts to ensure economic prosperity.Civil libertiesHe has called for amending the Patriot Act and said he was "troubled" by the revelations of the scope of the National Security Agency\'s secret spy programs, but has shied away from specifics. He voted for the USA Freedom Act which re-authorized certain provisions of the Patriot Act in modified form.Climate changeBooker believes climate change is man-made and supports cap-and-trade or carbon tax approach in dealing with greenhouse gas emissions.Confederate monumentsIn August 2017, Booker announced his plan to create a bill ordering the removal of Confederate monuments and memorials from the Capitol Building after Labor Day of that year.EducationBooker sits on the board of advisers of the political action committee Democrats for Education Reform, was on the board of Alliance for School Choice until 2008, co-founded the Excellent Education For Everyone, a board member of the Black Alliance for Educational Options, and has spoken favorably of StudentsFirst. He is an advocate of education reform and privatization of education; supporting things such as charter schools, school vouchers, and merit pay for teachers. In September 2010, with the support of Governor Chris Christie, Booker obtained a $100 million pledge from Facebook Inc. founder Mark Zuckerberg to Newark Public Schools.Gun rightsBooker has routinely defended the right of law-abiding citizens to own legal fire arms and blames most shootings on criminals with illegal guns. He voted to prohibit people on terror watch lists from buying guns.HealthcareBooker has called the Patient Protection and Affordable Care Act imperfect, said it needs to be improved, and wants to control health care costs. He opposes cutting Medicare, he supports expanding the program, and he supports transitioning to a "Medicare-for-all"-style single-payer healthcare system.In September 2017, Booker joined Bernie Sanders and 14 other co-sponsors in submitting a single-payer health care plan to Congress called the "Medicare for All" bill. The plan also covers vision and dental care, not currently covered by Medicare.ImmigrationBooker supports the passage of the DREAM Act.LGBT rightsBooker is a strong, outspoken advocate of same-sex marriage and claimed New Jersey\'s civil union law was not only bigoted, but also discriminated against New Jersey\'s same-sex couples who were denied 1,100 federal rights, privileges and benefits afforded to married couples. After Governor Chris Christie vetoed a bill legalizing same-sex marriage in New Jersey and said the issue should be left to a public referendum of the people of New Jersey, Booker criticized him and said that civil rights are guaranteed by the US Constitution and should not be allowed on the ballot. As Newark Mayor, Booker refused to perform any marriage ceremonies until same-sex couples were legally allowed to marry in New Jersey. On October 21, 2013, 12:01 am, the date when same-sex marriage became legal in New Jersey, Booker began performing same-sex and opposite-sex marriages in New Jersey.In November 2013, Booker co-sponsored and voted for the Employment Non-Discrimination Act. In January 2014, he co-sponsored the Respect for Marriage Act.Minimum wageBooker supports an increase of the minimum wage to $15 an hour.  Speaking to Newark airport workers in May 2017 he said, "It is un-American to be in this country, to work a full-time job and still live in poverty. That is unacceptable.  The minimum wage working at a lot of these contract companies only affords them about $22,000 a year ... You cannot live and raise a family on $22,000 a year. You can\'t afford housing, you can\'t afford child care and since your company isn\'t helping you with retirement, you can\'t save for retirement."Free market"Booker championed "enterprise zones," a free-market approach to solving urban blight credited to the late Jack Kemp, a hard-core supply-sider and occasional Republican presidential contender who helped raise money for Booker\'s first mayoral campaign."Besides social media advances, Booker wants to see the rest of the tech sector reach its fullest potential, and to do that, he thinks the U.S. government needs to ease up on regulations.  "We\'re not moving at the speed of innovation due to regulations," he said, adding that because of this, key industries are leaving the U.S. to work on projects in other countries where the rules aren\'t as strict. For example, the Federal Aviation Administration has hindered drone innovation to the point where drone companies are leaving the U.S. to test and build in Europe."We\'re being left behind on everything from next-generation nuclear energy to driverless cars and biologics," Booker said, "and we cannot get left behind."Social securityWhile running for Senate, Booker said he opposed raising the retirement age for social security except for people in their 20s or younger. Booker later tweeted that he opposed all cuts to Social Security and would expand the program.TaxesAs mayor of Newark, New Jersey, Booker raised taxes by 20 percent but now seeks to cut municipal taxes. He supports taxes on carbon emissions, corporate tax reform, and tax incentives.  He endorsed Governor Chris Christie\'s property tax agenda.War on DrugsBooker has condemned the War on Drugs, calling it a "tremendous failure", and criticizing the Obama administration for not honoring state drug laws. He has also expressed support for medical marijuana research, decriminalizing marijuana, ending mandatory minimum sentences for non-violent drug offenders, increasing funding for prisoner re-entry programs, and bringing an end to for-profit, private prisons. Booker has also cosponsored the bipartisan STATES Act proposed in the 115th U.S. Congress by Massachusetts Senator Elizabeth Warren and Colorado Senator Cory Gardner that would exempt individuals or corporations in compliance with state cannabis laws from federal enforcement of the Controlled Substances Act.Foreign policyAfghanistanAccording to Booker\'s campaign website, he supports scaling down US armed forces in Afghanistan in a responsible and safe manner.IranAccording to Booker\'s campaign website, Iran poses a threat to American and Israeli security.  He wants all options, including military action, that prevents Iran from gaining nuclear weapons. In December 2013, Booker was one of the original cosponsors of Bob Menéndez\'s Nuclear Weapon Free Iran Act of 2013, which would toughen sanctions against Iran.Iran Nuclear DealBooker\'s decision to back the Iran nuclear deal framework, damaged his long term relationship with Jewish voters and supporters. Booker initiated an emergency summit for Jewish leaders in attempt to reduce the damage, but some of his long standing supporters did not attend.IsraelAccording to Booker\'s campaign website, he is a strong advocate for the state of Israel and supports a two state solution to the Israeli–Palestinian conflict. However he stated certain conditions must remain non-negotiable, such as Israel\'s right to exist as a secure Jewish state free from terrorism.SyriaIn August 2013, during a Huffington Post interview, Booker stated he opposed military intervention in Syria. However, a few days later he said, "As part of the process of working with Congress, I expect that the president will clearly delineate what the strategic objectives are, and what limited military action will specifically achieve in Syria ..." and: "Obviously, there needs to be a response, but the question is what is it, and is it going to be perfectly attenuated to the outcomes we want,". During a September 2013 debate between him and Steve Lonegan, Booker stated he did not have sufficient information to say whether or not he would vote aye or nay on the resolution before the Congress at the time.', 'Other activities': 'Obama associationIn 2009, after Barack Obama became President of the United States, Booker was offered the leadership of the new White House Office of Urban Affairs. He turned the offer down, citing a commitment to Newark.Booker generated controversy on May 12, 2012, when he appeared on Meet The Press as a surrogate for the reelection campaign of Barack Obama and made remarks that were critical of that campaign. Booker said that the attacks on Republican presidential candidate Mitt Romney\'s record at Bain Capital were "nauseating to me on both sides. It\'s nauseating to the American public. Enough is enough. Stop attacking private equity. Stop attacking Jeremiah Wright." The comments were subsequently used by the Romney campaign against Obama. Booker made follow-up comments clarifying that he believed Obama\'s attacks on Romney\'s record at Bain were legitimate but did not retract his point about attacking private equity in general. Two weeks later, Booker\'s communications director Anne Torres tendered her resignation, although she maintained it was unrelated to Meet the Press.Affiliations and honorsBooker sits on the board of advisers of the political action committee Democrats for Education Reform. He is currently a member of the board of trustees at Teachers College, Columbia University, and was formerly a member of the Executive Committee at Yale Law School and the Board of Trustees at Stanford University.In 2010, Booker received the U.S. Senator John Heinz Award for Greatest Public Service by an Elected or Appointed Official, an award given out annually by the Jefferson Awards.In May 2009, Booker received an honorary Doctor of Humane Letters degree from the Newark-based New Jersey Institute of Technology for "his outstanding career in public service as the Mayor of Newark". In May 2009, he received an honorary doctorate from Brandeis University, and was a commencement speaker that year as well. Booker received another honorary Doctor of Humane Letters degree in December 2010 from Yeshiva University for "his bold vision for Newark and setting a national standard for urban transformation". In June 2011, Booker received an honorary Doctor of Laws degree and served as that year\'s commencement speaker at Williams College for the urban transformation of Newark. In May 2012, Booker received an honorary Doctor of Laws degree from Bard College and gave the commencement speech at the graduation. In 2010, Booker delivered the commencement addresses at Pitzer College in Claremont, California, on May 15, Columbia University\'s Teachers College in New York City on May 17, and Suffolk University Law School in Boston, Massachusetts, a week later on May 23, 2010. Booker gave the commencement address to New York Law School graduates on May 13, 2011, at Avery Fisher Hall at Lincoln Center. Booker also gave the commencement address at the University of Rhode Island in May 2011; he also received an honorary Doctor of Humane Letters degree. He delivered a commencement address to Stanford University graduates on June 17, 2012, at Stanford Stadium. He also received an honorary degree at Fairleigh Dickinson\'s 69th Commencement Ceremony in May 2012. In May 2013, Booker gave the commencement address at Washington University in St. Louis and received an honorary doctorate of law.On May 16, 2014, Booker gave the commencement speech for Ramapo College of New Jersey graduates at the IZOD Center.During the 2016 presidential election, when Clinton had an illness described as "pneumonia", Donna Brazile, the then DNC interim chair, considered that her ideal replacement ticket would consist of Joe Biden and Cory Booker. However, the possibility of a divisive reaction and the possibility of "allowing Trump to capture votes in confusion" caused her to "not entertain any more thoughts of replacing Hillary".FilmsBooker\'s 2002 mayoral campaign, which he lost, was chronicled by filmmaker Marshall Curry in his documentary Street Fight. The film was nominated in 2005 for the Academy Award for Best Documentary Feature.Since 2009, Booker has starred in the documentary series Brick City. The series focuses on Booker and his efforts to improve Newark by reducing crime and bringing about economic renewal. Brick City won a Peabody Award in 2009 and was nominated for a Primetime Emmy in 2010.Booker contributed to the 2011 documentary Miss Representation and commented on the representations of women in politics within mass media.Booker appeared in a scene in the Parks and Recreation episode "Ms. Ludgate-Dwyer Goes to Washington" alongside Orrin Hatch.Mark Zuckerberg donationIn July 2010, Booker attended a dinner at a conference in Sun Valley, Idaho, where he was seated with Facebook founder Mark Zuckerberg. Zuckerberg, who had no known ties to Newark, announced in September 2010 that he was donating $100 million of his personal fortune to the Newark school system. According to an article in The New York Times, Booker and Zuckerberg continued their conversation about Booker\'s plans for Newark. The initial gift was made to start a foundation for education. The gift was formally announced when Booker, New Jersey Governor Chris Christie, and Zuckerberg appeared together on The Oprah Winfrey Show. The timing of Zuckerberg\'s donation was questioned by some as a move for damage control to his image, as it was announced on the opening day of the movie The Social Network, a film that painted an unflattering portrait of Zuckerberg. On her show, however, Winfrey told the audience that Zuckerberg and Booker had been in talks for months and had actually planned the announcement for the previous month, and that she and Booker had to force Zuckerberg to put his name to the donation, which he had wanted to make anonymously.Conan O\'Brien "feud"In the fall of 2009, Tonight Show host Conan O\'Brien engaged in a satirical on-air and YouTube feud with Booker, with O\'Brien jokingly insulting the City of Newark and Booker responding that he would ban O\'Brien from the Newark airport. Then-Secretary of State Hillary Clinton called for the feud to end during a prepared comedy bit, telling Booker to chalk it up to a head injury suffered by O\'Brien less than two weeks earlier. Booker then appeared on O\'Brien\'s show and assured viewers that the feud was over and that he was actually a big fan of O\'Brien, who agreed that every time he made a joke about Newark, he would donate $500 to the City of Newark, and also made a $50,000 donation to the Newark Now charity, which was matched by NBC Universal.WaywireIn 2012, Booker and tech executives Sarah Ross and Nathan Richardson formed Waywire, a company focused on video sharing technology. Early investors included Oprah Winfrey, Eric Schmidt, Jeff Weiner, and Troy Carter. After Booker\'s relationship to Waywire was discussed in a front-page The New York Times story, board member Andrew Zucker stepped down from his position. Shortly thereafter, Waywire CEO Nathan Richardson departed the business as the company shifted its focus from content creation to content curation. In August 2013, Booker told NBC News he intended to resign from the Waywire board and put his holdings in a trust if elected to the Senate; by September, he had resigned his place on the board and donated his share of the company to charity. Waywire was sold to another video curation business the following month.', 'Personal life': 'Booker regularly exercises and has been a vegetarian since 1992, when he was a student at Oxford. He abstains from alcohol and "has no known vices or addictions" other than coffee. In 2014, Booker began practicing a vegan diet and has expressed his vegan ethical philosophy and advocacy for animals.Booker has never been married, and in 2013 he was named one of Town & Country\'s "Top 40 Bachelors". Although he has generally tried to keep his personal life private, Booker has in the past described himself as a "straight male" and has said that he is trying to date more in hopes of finding someone to settle down with.  In a 1990 column in the Stanford Daily, Booker admitted that as a teenager he had "hated gays".  Booker has himself been the target of rumors about being gay and has generally refused to address these on principle, which he explained in 2013: Because I want to challenge people on their homophobia. I love seeing on Twitter when someone says I\'m gay, and I say, "So what does it matter if I am? So be it. I hope you are not voting for me because you are making the presumption that I\'m straight.In September 2018, The Daily Caller revealed that in the 1990s Booker wrote of a 1984 incident where he groped a Stanford student at a New Year\'s party.From 1998 to 2006, Booker lived in Brick Towers, a troubled housing complex in Newark\'s Central Ward. In November 2006, as one of the last remaining tenants in Brick Towers, Booker left his apartment for the top unit in a three-story rental on Hawthorne Avenue in Newark\'s South Ward, an area described as "a drug- and gang-plagued neighborhood of boarded-up houses and empty lots". Brick Towers has since been demolished, and a new mixed-income development was built there in 2010.', 'Electoral history': 'United States Senate special election in New Jersey, 2013 – Democratic PrimaryPartyCandidateVotes%±DemocraticCory Booker 216,936 59.2 N/A DemocraticFrank Pallone Jr.72,58419.8N/ADemocraticRush Holt61,46316.8N/ADemocraticSheila Oliver15,6564.3N/AMajority144,35239.4N/ATurnout7,276N/AUnited States Senate special election in New Jersey, 2013PartyCandidateVotes%±DemocraticCory Booker 740,742 54.9 N/A RepublicanSteve Lonegan593,68444.2N/AEd the BarberEdward Stackhouse Jr.5,1380.4N/AIndependent (politician)Robert DePasquale3,1370.2N/AAlimony Reform NowStuart David Meissner2,0510.2N/AUnity is StrengthPablo Olivera1,5300.1N/AFreedom of ChoiceAntonio Nico Sabas1,3360.1N/ADemocratic-RepublicanEugene Martin Lavergne1,0410.08N/AMajority147,05810.9N/ATurnout1,348,65925N/ASwing to Democratic from RepublicanSwingUnited States Senate election in New Jersey, 2014PartyCandidateVotes%±DemocraticCory Booker (I) 1,043,866 55.8 +0.9 RepublicanJeff Bell791,29742.3-1.7LibertarianJoseph Baratelli16,7210.9+0.4Economic GrowthHank Schroeder5,7040.3+0.3IndependentJeff Boss4,5130.2+0.2Democratic-RepublicanEugene Martin Lavergne3,8900.2+0.1IndependentAntonio Nico Sabas3,5440.2+0.12Majority252,56913.5+2.6Turnout1,869,53534.2+38.6Democratic holdSwing', 'Further reading': 'Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of Congress', 'introduction': 'Cory Anthony Booker (born April 27, 1969) is an American politician serving as the junior United States Senator from New Jersey since 2013 and a member of the Democratic Party. The first African-American U.S. Senator from New Jersey, he was previously the 36th Mayor of Newark from 2006 to 2013. Before that Booker served on the Newark City Council for the Central Ward from 1998 to 2002. \nBooker was born in Washington, D.C. and raised in Harrington Park, New Jersey. He attended Stanford University where he received an undergraduate and master\'s degree in 1991 and 1992, respectively. He studied abroad at the University of Oxford on a Rhodes Scholarship before attending Yale Law School. He won an upset victory for a seat on the Municipal Council of Newark in 1998 where he staged a 10-day hunger strike and briefly lived in a tent to draw attention to urban development issues in the city. He ran for mayor in 2002, but lost to incumbent Sharpe James; he ran again in 2006 and won against deputy mayor Ronald Rice. His first term saw to the doubling of affordable housing under development and the reduction of the city budget deficit from $180 million to $73 million. He was re-elected in 2010. He ran against Steve Lonegan in the 2013 U.S. Senate special election and subsequently won reelection in 2014 against Jeff Bell.\nDuring his five years in office, Booker co-sponsored and voted for the Employment Non-Discrimination Act (2013), tougher sanctions against Iran, sponsored the Bipartisan Budget Act (2013), voted for the National Defense Authorization Act (2014) and co-sponsored the Respect for Marriage Act (2014). In 2017, he became the first sitting senator to testify against another when he testified against Attorney General nominee Jeff Sessions during his confirmation hearing. In April 2018, following the FBI raid on the offices of Michael Cohen–U.S. President Donald Trump\'s personal attorney–Booker together with Chris Coons, Lindsey Graham, and Thom Tillis, introduced the Special Counsel Independence and Integrity Act to limit the executive powers of Trump.\nHis political ideology closely aligns with the New Democrat movement and he has been described as a political moderate. Considered a social liberal, Booker supports women\'s rights, affirmative action, same-sex marriage and single-payer healthcare. His youth, public presence, and political ideology have marked him as a potential member of multiple U.S. presidential tickets. When asked about his desire to run for executive roles in American government he has stated, "life is about purpose, not position," neither confirming nor denying potential runs for President.\n\n'}, 'personal': {'Born': 'Cory Anthony Booker (1969-04-27) April 27, 1969 (age49)Washington, D.C., U.S.', 'Political party': 'Democratic', 'Education': "Stanford University (BA, MA)The Queen's College, Oxford (MA)Yale University (JD)", 'Signature': '', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom New Jersey': {'date': 'Assumed office October 31, 2013Serving with Bob Menendez', 'Preceded by': 'Jeffrey Chiesa'}, '36th Mayor of Newark': {'date': 'In officeJuly 1, 2006– October 31, 2013', 'Preceded by': 'Sharpe James', 'Succeeded by': 'Luis Quintana'}, 'Member of the Newark City Councilfrom the Central Ward': {'date': 'In officeJuly 1, 1998– June 30, 2002', 'Preceded by': 'George Branch', 'Succeeded by': 'Charles Bell'}}, 'code': 'B001288'}