{"name": "Cory.Gardner", "picture": "G000562.jpg", "detail": {"Early life, education, and early political career": "Gardner was born on August 22, 1974 in Yuma, Colorado, the son of Cindy L. (née Pagel) and John W. Gardner. He is of Irish, German, Austrian, and English descent. He graduated summa cum laude from Colorado State University with a Bachelor of Arts in political science in 1997.In college, Gardner switched from the Democratic Party to the Republican Party and interned at the Colorado State Capitol. He went to law school at the University of Colorado to earn his Juris Doctor in 2001. Gardner served as General Counsel and Legislative Director for former U.S. Senator Wayne Allard of Colorado from 2002-05.", "Colorado House of Representatives": "Elections Gardner was appointed to the Colorado House of Representatives in 2005 and elected to a full term in 2006. He represented District 63 in the Colorado House of Representatives from 2005 through 2011.Tenure Gardner proposed legislation in 2006 that would set aside money in a rainy-day fund that would help protect the state from future economic downturns. His proposal relied on Referendum C money[clarification needed] for future budget emergencies. He staunchly opposed any tax increases. He helped create the Colorado Clean Energy Development Authority, which issued bonds to finance projects that involve the production, transportation and storage of clean energy until it was repealed in 2012.In June 2006, he called on Republican Governor Bill Owens to call a special session addressing the issue of illegal immigration.In 2006, Gardner opposed legislation to allow pharmacists to prescribe emergency contraception, and offered an amendment to the budget to prohibit the state Medicaid plan from purchasing Plan B emergency contraception.In 2007, Gardner voted against a bill requiring hospitals to inform survivors of a sexual assault of the availability of emergency contraception.The Denver Post hailed Gardner as \"the GOP Idea Man\". He was named one of the Top 40 young Republican lawmakers by the magazine Rising Tide. He became House Minority Whip in January 2007.Committee assignments House Education CommitteeHouse Agriculture and Natural Resources CommitteeLegislative Council", "US House of Representatives": "Elections 2010Gardner won the Republican primary in the 4th Congressional District to challenge Democratic incumbent Betsy Markey. Also running were American Constitution Party nominee Doug Aden and Independent Ken \"Wasko\" Waszkiewicz. In an early September poll, Gardner was up 50% to 39% over Markey.Gardner was named one of the GOP Young Guns. He was endorsed by former U.S. Congressman Tom Tancredo. On November 2, 2010, Gardner defeated Markey, 52%–41%.2012Gardner ran unopposed in the Republican primary before going on to defeat Democratic nominee Brandon Shaffer 59%–37% in the general election. He was helped by the 2010 redistricting, which cut Fort Collins and Larimer County out of the district. Fort Collins had long been the 4th's largest city. For years, Larimer and the district's second-largest county, Weld County, home to Greeley, accounted for 85 percent of the district's population even though they only took up 15 percent of its land.Tenure Energy and environmental issues Shortly after taking office, Gardner introduced legislation that would speed up clean-air permits for companies engaged in offshore drilling in Alaska, which he says would create jobs and reduce dependence on foreign oil. The House passed Gardner's bill by a vote of 253 to 166 on June 22, 2011.On June 6, 2013, Gardner introduced the Reducing Excessive Deadline Obligations Act of 2013 (H.R. 2279; 113th Congress), a bill that would amend the Comprehensive Environmental Response, Compensation, and Liability Act of 1980 and the Solid Waste Disposal Act. The bill would change the frequency of reports from the United States Environmental Protection Agency (EPA) about solid waste regulations. Rather than automatically reviewing the regulations every three years, the EPA would be able to review them on an as needed basis. It would also grant precedence to state requirements for solid waste disposal when creating new federal requirements.On March 6, 2014, Gardner introduced the Domestic Prosperity and Global Freedom Act (H.R. 6; 113th Congress), a bill that would direct the United States Department of Energy (DOE) to issue a decision on an application for authorization to export natural gas within 90 days after the later of: (1) the end of the comment period for that decision as set forth in the Federal Register, or (2) the date of enactment of this Act.Economic issues In March 2011, Gardner introduced bipartisan legislation that would require congressional committees to hold hearings on programs that are deemed duplicative by a U.S. Government Accountability Office report. Gardner has said he believes such a measure would reduce waste in government.Gardner voted for the Ryan budget plan.On July 10, 2014, Gardner introduced legislation to reform the Earned Income Tax Credit program. The legislation seeks to reduce fraud in the program and dedicate the savings to increasing the credit for working families.In August 2014, Gardner broke ranks with the Republican Party and voted against a bill that would have dismantled the Deferred Action for Childhood Arrivals. Gardner has stated that he supports immigration reform in the form of a guest worker program and increased border security.Health care In 2011, he voted in support of the \"Respect for Rights of Conscience Act\", which states that \"nothing in the Affordable Care Act shall be construed to authorize a health plan to require a provider to provide, participate in, or refer for a specific item or service contrary to the provider's religious beliefs or moral convictions.\"At the end of 2013, Gardner announced that he would introduce a bill to prohibit executives of state healthcare exchanges from getting bonuses.Social issues In 2012, Gardner was one of 33 Republicans to vote for the Senate version of the Violence Against Women Act of 1994 (VAWA), which re-authorized the bill and expanded protections for Native Americans, immigrants, and gays.In 2012-13, Gardner co-sponsored personhood legislation titled the \"Life Begins at Conception Act\". Gardner later said that he changed his mind on personhood, after listening to voters. According to The Denver Post, \"Gardner conceded that with his new position on personhood, he might be accused of flip-flopping simply to make himself more palatable to statewide voters.\" The nonpartisan Factcheck.org said \"It would be clearer to say that Gardner supports efforts to ban abortion that could also ban some forms of birth control. As for his change of position, voters in Colorado should know Gardner still supports a federal bill that would prompt the same concerns over birth control as the state measure he says he rejects on the same grounds.\"In June 2014, Gardner called for over-the-counter access to oral contraceptives and said the birth control pill would be safer and cheaper if it was available over the counter.In October 2018, Gardner vowed to vote to confirm Hon. Brett Kavanaugh to the US Supreme Court amidst controversy surrounding Kavanaugh's past.Committee assignments Committee on Energy and CommerceSubcommittee on Energy and PowerSubcommittee on Communications and TechnologySubcommittee on Oversight and InvestigationsRepublican Study Committee", "US Senate": "Committee assignments Committee on Commerce, Science, and TransportationSubcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, and the InternetSubcommittee on Consumer Protection, Product Safety, and InsuranceSubcommittee on Science and SpaceCommittee on Energy and Natural ResourcesSubcommittee on Energy (Chairman)Subcommittee on Public Lands, Forests and MiningSubcommittee on Water and PowerCommittee on Foreign RelationsSubcommittee on Western Hemisphere, Transnational Crime, Civilian Security, Democracy, Human Rights and Global Women's IssuesSubcommittee on Europe and Regional Security CooperationSubcommittee on East Asia, The Pacific and International Cybersecurity Policy (Chairman)Subcommittee on International Development, Multilateral Institutions and International Economic, Energy and Environmental PolicyCommittee on Small Business and EntrepreneurshipCaucus memberships Congressional NextGen 9-1-1 CaucusElections 2014Gardner was the Republican nominee for Senate, and defeated incumbent Senator Mark Udall in the general election, 49% to 46%, receiving 965,974 votes to Udall's 916,245.In October 2014, the Denver Post endorsed Gardner, writing that \"he has emphasized economic and energy issues (and was, for example, an early supporter among Republicans of renewable energy). ... \"his past views on same-sex marriage are becoming irrelevant now that the Supreme Court has let appeals court rulings stand and marriage equality appears unstoppable. And contrary to Udall's tedious refrain, Gardner's election would pose no threat to abortion rights.\" Former Denver Broncos quarterback John Elway endorsed Gardner.No Labels performed independent get-out-the-vote efforts on behalf of its Problem Solvers, including Gardner.Tenure Gardner was ranked the 8th most bipartisan Senator in the first session of the 115th United States Congress by the Bipartisan Index, a metric created by The Lugar Center and Georgetown's McCourt School of Public Policy to assess Congressional bipartisanship. GovTrack noted that of the 157 bills Gardner cosponsored in 2017, 41% were introduced by legislators that were not Republican.", "Political Positions": "Gun law In 2014, the National Rifle Association (NRA) endorsed Gardner and gave him an \"A\" rating for being \"the only candidate in this race who will support the rights of Colorado's law-abiding gun owners and sportsmen,\" according to the NRA-Political Victory Fund's Chris W. Cox. As of 2017, Gardner has received $3,879,064 in donations from the NRA.In 2016, Gardner voted against the Feinstein Amendment, which sought to ban gun sales to anyone known or suspected of being a terrorist. He also opposed an amendment making it necessary for background checks to take place for guns bought at gun shows and online.In response to the 2017 Las Vegas Strip shooting, Gardner requested that the shooting not be \"politicized\" and offered thoughts and prayers to the victims.Health care Gardner was part of the group of 13 Republican Senators drafting the Senate version of the American Health Care Act, which is the GOP legislation to repeal-and-replace the Affordable Care Act (Obamacare). He voted in favor of all variations of AHCA that came up for a vote in the Senate. The New York Times reported that in September 2017, when the GOP made another attempt to pass legislation to repeal the Affordable Care Act, Gardner warned Republican legislators at a closed luncheon that failure to pass any repeal legislation would lead to a backlash by big donors to the Republican, as well as the grassroots.Immigration and refugees Gardner criticized President Donald Trump's 2017 executive order to impose a ban on travel to the U.S. by citizens of seven Muslim-majority countries, saying: \"While I am supportive of strengthening our screening processes and securing our borders, a blanket travel ban goes too far. I also believe that lawful residents of the United States should be permitted to enter the country. I urge the Administration to take the appropriate steps to fix this overly broad executive order.\"Energy and environmental issues Gardner has stated that he believes climate change is occurring, but he is unsure whether humans are causing it.  Gardner supports construction of the Keystone Pipeline. He is pro-fracking.Economic issues Gardner signed the Americans for Tax Reform's Taxpayer Protection Pledge. He supports legislation which would require that the US Federal Reserve be audited.Same sex marriage In response to the October 2014 announcement from the U.S. Supreme Court allowing same-sex marriage to become the law in 30 states including Colorado, Gardner reaffirmed his position that marriage should only be between a man and a woman but stated, \"This issue is in the hands of the courts and we must honor their legal decisions.\"Net Neutrality Gardner is an opponent of the Obama-era FCC policies on net neutrality, referring to the regulations as \"brazen abuse of power and overreach\". On May 16, Gardner voted against The Congressional Review Act bill to reinstate net neutrality.Cannabis Gardner cosponsored with Massachusetts Senator Elizabeth Warren the bipartisan STATES Act proposed in the 115th U.S. Congress that would exempt individuals or corporations in compliance with state cannabis laws from federal enforcement of the Controlled Substances Act.", "Electoral history": "Colorado District 63 election, 2006PartyCandidateVotes%±RepublicanCory Gardner15,73673%DemocraticPauline Artery5,73227%Colorado District 63 election, 2008PartyCandidateVotes%±RepublicanCory Gardner*Colorado's 4th Congressional District election, 2010PartyCandidateVotes%+%RepublicanCory Gardner138,63452%DemocraticBetsy Markey*109,24941%ConstitutionDoug Aden12,3125%IndependentKen \"Wasko\" Waskiewicz3,9862%Colorado's 4th Congressional District election, 2012PartyCandidateVotes%+%RepublicanCory Gardner*200,00658%DemocraticBrandon Shaffer125,80037%LibertarianJosh Gilliland10,6823%ConstitutionDoug Aden5,8482%U.S. Senate election in Colorado, 2014PartyCandidateVotes%+%RepublicanCory Gardner983,89148%DemocraticMark Udall*944,20346%LibertarianGaylon Kent52,8763%IndependentSteve Shogan29,4721%IndependentRaul Acosta24,1511%UnityBill Hammons6,4270%Independent (Write-in)Willoughby210%Republican (Write-in)Kathleen Cunningham170%", "introduction": "Cory Scott Gardner (born August 22, 1974) is an American politician serving as the junior United States Senator from Colorado since 2015. A Republican, he was the U.S. Representative for Colorado's 4th congressional district from 2011 to 2015 and a member of the Colorado House of Representatives from 2005 to 2011.\nGardner announced his candidacy for the U.S. Senate in March 2014, quickly clearing the Republican primary field, and defeated Democratic incumbent Mark Udall in the November 2014 race. Since 2017, Gardner has been chairman of the National Republican Senatorial Committee, ranking him sixth in the Senate Republican leadership.\n\n"}, "personal": {"Born": "Cory Scott Gardner (1974-08-22) August 22, 1974 (age44)Yuma, Colorado, U.S.", "Nationality": "American", "Political party": "Republican", "Spouse(s)": "Jaime Gardner", "Children": "3", "Education": "Colorado State University (BA)University of Colorado Boulder (JD)"}, "timeline": {"United States Senatorfrom Colorado": {"date": "Assumed office January 3, 2015Serving with Michael Bennet", "Preceded by": "Mark Udall"}, "Chair of the National Republican Senatorial Committee": {"date": "Assumed office January 3, 2017", "Leader": "Mitch McConnell", "Preceded by": "Roger Wicker"}, "Member of the US House of Representativesfrom Colorado's 4th district": {"date": "In officeJanuary 3, 2011– January 3, 2015", "Preceded by": "Betsy Markey", "Succeeded by": "Ken Buck"}, "Member of the Colorado House of Representativesfrom the 63rd district": {"date": "In officeJune 23, 2005– January 2, 2011", "Preceded by": "Greg Brophy", "Succeeded by": "Jon Becker"}}, "code": "G000562", "type": "3", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.45", "social": "-0.01", "leadership": "0.33"}