{'name': 'Dan.Sullivan', 'picture': 'S001198.jpg', 'detail': {'Early life and education': "Sullivan was born and raised in Fairview Park, Ohio, the son of Sandra (née Simmons) and Thomas C. Sullivan, currently the President and CEO of RPM International, a holding company founded by his own father, Frank C. Sullivan.He attended Culver Military Academy in Indiana and graduated in 1983. In 1987, Sullivan graduated magna cum laude from Harvard University with a bachelor's degree in economics. In 1993, he earned a J.D.-M.S.F.S. joint degree from Georgetown University, graduating cum laude. He was a member of the Georgetown Law Journal and interned for the United States Court of Appeals for the District of Columbia Circuit.", 'Military service': 'Sullivan has served in the United States Marine Corps since 1993, both on active duty and in the reserves. Sullivan, who has spent several years with a reconnaissance battalion based in Anchorage, Alaska, initially left active duty in 1997 when he first moved to Alaska, but has since been recalled to active duty three times: from 2004 to 2006, again in early 2009, and for a six-week tour in Afghanistan in July 2013.  He was recommended for promotion in 2011 to Lt. Colonel by then-retired General John Abizaid, a board member of the Sullivan family-based RPM International corporation since 2008. Sullivan is a recipient of the Defense Meritorious Service Medal.', 'Early legal career': 'Sullivan served as a judicial law clerk for Judge Andrew Kleinfeld of the United States Court of Appeals for the Ninth Circuit in Fairbanks from 1997 to 1998. He then clerked for Chief Justice Warren Matthews of the Alaska Supreme Court in Anchorage from 1998–99.In 2000, Sullivan joined the Anchorage office of the Perkins Coie law firm, focusing on commercial law and corporate law. He had joined the Alaska bar that same year.', 'Early political career': "White House and State Department In 2002, Sullivan began work in the Washington, D.C. area, where he headed the International Economics Directorate of the National Economic Council and National Security Council staffs at the White House. Sullivan advised the President of the United States – then George W. Bush – along with the National Security Advisor and NEC chairman. Sullivan left the White House in 2004.In 2006, Sullivan was appointed by President Bush to the post of United States Assistant Secretary of State for Economic, Energy, and Business Affairs. The United States Senate unanimously confirmed Sullivan in May of that year. Sullivan served in this capacity until January 2009. While serving as Assistant Secretary of State he owned a house in Anchorage and continued to vote in Alaska elections by absentee ballot, claiming Bethesda, Maryland as his primary residence for tax purposes.Alaska Attorney General Alaska Attorney General Talis Colberg resigned in February 2009 over the Alaska Public Safety Commissioner dismissal scandal. Governor Sarah Palin nominated Wayne Anthony Ross to be Attorney General, but the Alaska Legislature rejected the appointment. Palin then nominated Sullivan instead. He was sworn into office in June 2009, while the Alaska Legislature was out of session. The Alaska Legislature unanimously confirmed Sullivan's appointment on April 9, 2010.Sullivan, who had been retained by Governor Sean Parnell, stepped down as Alaska's Attorney General on December 5, 2010, to be replaced by John J. Burns (Alaska politician), who was nominated by Parnell on November 31, 2010.Alaska DNR Commissioner On November 18, 2010, shortly after being elected, Alaska Governor Sean Parnell appointed Sullivan as Commissioner of the Alaska Department of Natural Resources, replacing former Commissioner Thomas E. Irwin. In 2013, during his term in office, Sullivan was deployed to Afghanistan for six weeks, in his role as the executive officer of the 4th Marine Division's Anti-Terrorism Battalion. He supported the proposed Pebble Mine, and opposed Native subsistence priorities.", 'United States Senate': "2014 election On October 15, 2013, he announced that he was running for the United States Senate seat held by Democrat Mark Begich in the 2014 election. Sullivan was endorsed by the Club for Growth. His 2013 year-end campaign finance report showed that of $1.2 million total campaign contributions, more than $400,000 came from Ohio. Donors included individuals with close ties to a corporation founded by his grandfather and managed by his brother, RPM International.Despite a late-race endorsement of 2010 party nominee Joe Miller by Sarah Palin, Sullivan won the Republican primary on August 19, 2014, with 40% of the vote, and 32% and 25% for Miller and Treadwell respectively.On November 12, 2014, the Associated Press and CNN declared that Sullivan defeated Begich in the general election by about 8,000 votes—48.6 to 45.4 percent. At the time of the Associated Press call, there were approximately 31,000 votes left to count and Begich refused to concede. On November 17, 2014, Begich conceded the election to Sullivan.Alaska Agreement On June 10, 2014, Sullivan offered his opponent, Mark Begich, the Alaska Agreement. This was a modified version of the People’s Pledge. This tactic had previously been used in the Massachusetts 2012 U.S. Senate race between Elizabeth Warren and Scott Brown to drastically limit outside, third party spending.Begich refused the Alaska Agreement. According to Ballotpedia, outside spending in the race went on to hit nearly $40 million.Tenure Sullivan was sworn into office on January 6, 2015, by Vice President Joe Biden.Committee assignments Committee on Armed ServicesSubcommittee on AirlandSubcommittee on PersonnelSubcommittee on SeapowerCommittee on Commerce, Science, and TransportationSubcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Oceans, Atmosphere, Fisheries, and Coast GuardSubcommittee ON Space, Science and CompetitivenessSubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on Environment and Public WorksSubcommittee on Fisheries, Water and Wildlife (Chairman)Subcommittee on Superfund, Waste Management, and Regulatory OversightCommittee on Veterans' Affairs", 'Political positions': 'Sullivan opposes abortion, except in cases of rape, incest, or threat to the life of the mother; he also has voiced his opposition to same-sex marriage. He opposes the Affordable Care Act and believes it should be repealed and replaced. Sullivan is against granting "amnesty" for undocumented immigrants, and is a proponent of an "all-of-the-above" energy policy, including increased drilling for oil. He also opposed then presidential candidate Donald J. Trump during the 2016 presidential race, releasing a statement that said, "We need national leaders who can lead by example on this critical issue. The reprehensible revelations about Donald Trump have shown that he can\'t. Therefore, I am withdrawing my support for his candidacy."  However, despite his lack of support for Trump as a candidate, Sullivan has voted "yes" for every nominee of President Trump\'s cabinet.Domestic issues Gun law Sullivan has an A-Q rating[clarification needed] from the National Rifle Association. In one of his 2014 commercials, Sullivan discussed the Second Amendment to the United States Constitution,[clarification needed] and the commercial ended with him showing one of his daughters how to aim a rifle.Cannabis Sullivan has cosponsored the bipartisan STATES Act proposed in the 115th U.S. Congress by Massachusetts Senator Elizabeth Warren and Colorado Senator Cory Gardner that would exempt individuals or corporations in compliance with state cannabis laws from federal enforcement of the Controlled Substances Act.International issues Missile defense In the summer of 2017, North Korean leader Kim Jong Un launched an intercontinental ballistic missile (ICBM) that landed about 200 miles (320\xa0km) off the coast of Japan. He also threatened the United States with an ICBM strike. Sullivan said, "In fact, for over a year, the experts have been saying it’s not a matter of if, but when North Korea will develop an [ICBM] that could hit not only Alaska and Hawaii, but the entire continental United States." Sullivan supports improving the United States\' missile defense system (MDS). The U.S. Department of Defense, as of 2017, was conducting a missile defense review targeted at strengthening the nation’s defensive abilities, studying whether to place missile interceptor sites on the east coast or in the Midwest, and recommending funding priorities. The report was due to Congress at the end of 2018.', 'Personal life': 'While at Georgetown, he met fellow law student Julie Fate, the daughter of retired dentist and former Alaska State Representative Hugh "Bud" Fate. The two eventually married and have three daughters. When they met, Julie was a staffer for U.S. Sen. Ted Stevens. Julie grew up in a traditional Athabaskan family. Sullivan\'s mother-in-law is Mary Jane Fate, who was once the co-chair of the Alaska Federation of Natives.', 'Electoral history': 'Alaska U.S. Senate Republican Primary – 2014PartyCandidatesVotes%RepublicanDan Sullivan44,74040.05RepublicanJoe Miller35,90432.14RepublicanMead Treadwell27,80724.90RepublicanJohn Jaramillo3,2462.91Alaska U.S. Senate Election – 2014PartyCandidateVotes%RepublicanDan Sullivan135,44547.96DemocratMark Begich129,43145.83LibertarianMark Fish10,5123.72IndependentTed Gianoutsos5,6362.00Write-insWrite-ins1,3760.49', 'introduction': 'Daniel Scott Sullivan (born November 13, 1964) is an American politician, lawyer and member of  the Republican Party serving as the junior United States Senator from Alaska since 2015.\nBorn in Fairview Park, Ohio, Sullivan earned degrees from Harvard University and Georgetown University, interning at the United States Court of Appeals for the District of Columbia Circuit. After graduating in 1993, he joined the United States Marine Corps, leaving active duty in 1997. He has since served in the United States Marine Corps Reserve and was recalled to active duty from 2004 to 2006 and in 2009 and 2013.\nBetween 1997 and 1999, he clerked for judges on the United States Court of Appeals for the Ninth Circuit and the Alaska Supreme Court. He worked in private practice in Anchorage, Alaska from 2000 to 2002, then moved to Maryland to work for the federal government, first with the National Economic Council and National Security Council, then as Assistant Secretary of State for Economic and Business Affairs.\nSullivan then returned to Alaska, serving first as Alaska Attorney General from 2009 to 2010, then as Commissioner of the Alaska Department of Natural Resources from 2010 to 2013. He resigned from office in September of that year to run for the United States Senate seat held by Democrat Mark Begich in the 2014 election. In August 2014, Sullivan won the Republican primary, defeating Alaska Lieutenant Governor Mead Treadwell and 2010 Senate nominee Joe Miller. After a close race, he defeated Begich in the general election by 47.96% to 45.83%, a margin of 6,014 votes out of 282,400 cast.\n\n'}, 'personal': {'date': 'BornDaniel Scott Sullivan (1964-11-13) November 13, 1964 (age53)Fairview Park, Ohio, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Julie Fate', 'Children': '3', 'Education': 'Harvard University (B.A.)Georgetown University (M.S., J.D.)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Alaska': {'date': 'Assumed office January 3, 2015Serving with Lisa Murkowski', 'Preceded by': 'Mark Begich'}, 'Commissioner of the Alaska Department of Natural Resources': {'date': 'In officeDecember 6, 2010– September 24, 2013', 'Governor': 'Sean Parnell', 'Preceded by': 'Thomas E. Irwin', 'Succeeded by': 'Joseph Balash'}, '27th Attorney General of Alaska': {'date': 'In officeJune 17, 2009– November 30, 2010', 'Governor': 'Sarah PalinSean Parnell', 'Preceded by': 'Talis J. Colberg', 'Succeeded by': 'John J. Burns'}, 'Assistant Secretary of State for Economic and Business Affairs': {'date': 'In officeJune 6, 2006– January 1, 2009', 'President': 'George W. Bush', 'Preceded by': 'Earl Anthony Wayne', 'Succeeded by': 'Jose W. Fernandez'}, 'Military service': {'Allegiance': 'United States', 'Service/branch': 'United States Marine Corps', 'Years of service': '1993–1997 (Active)1997–present (Reserve)', 'Rank': '  Colonel', 'Unit': 'United States Marine Corps Reserve', 'Commands': '6th Air Naval Gunfire Liaison Company', 'Battles/wars': 'War in Afghanistan', 'Awards': ' Defense Meritorious Service Medal'}}, 'code': 'S001198'}