{'name': 'David.Perdue', 'picture': 'P000612.jpg', 'detail': {'Early life and education': "David Perdue was born in Macon, Georgia, the son of David Alfred Perdue, Sr., and the former Gervaise Wynn, both schoolteachers. He was raised in Warner Robins, Georgia.Perdue has a bachelor's degree in industrial engineering (1972) and a master's degree in operations research (1975), both from Georgia Tech. At Georgia Tech, Perdue was a brother of the Delta Sigma Phi Fraternity.He married Bonnie Dunn. The couple now lives in the resort town of Sea Island. The couple have two sons, David A. Perdue III and Blake Perdue, and three grandchildren. David Perdue, Jr.  is the first cousin of former Georgia governor and current United States Secretary of Agriculture Sonny Perdue.", 'Business career': 'Perdue began his career at Kurt Salmon Associates, an international consulting firm, where he worked for twelve years as a management consultant. His first major corporate job was as senior vice president of Asia operations for Sara Lee Corporation, a position he took in 1992. His time at Sara Lee was followed by a stint at Haggar Clothing, where he became senior vice president of operations in 1994.In 1998, Perdue joined Reebok as a senior vice president, eventually rising to president and CEO. Perdue is credited with significantly reducing the company\'s debt and reviving its sneaker line. Perdue negotiated a contract with the National Football League that a former Reebok executive referred to as "revolutionary" for repositioning the company\'s shoe brand.In 2002, Perdue left Reebok for Pillowtex, a North Carolina textile company. The company had recently emerged from bankruptcy with a heavy debt load and an underfunded pension liability. Perdue was unable to obtain additional funding from the company\'s investors and later was unsuccessful in finding a buyer for the company. He left the company in 2003 after nine months on the job and $1.7\xa0million in compensation. Pillowtex closed several months later, leaving 7,650 workers out of work nationwide. With more than 4,000 jobs lost statewide, the closing of Pillowtex resulted in the largest single-day job loss in North Carolina history at the time.After leaving Pillowtex, Perdue became CEO of Dollar General. Prior to his joining the company, it had recently overstated profits by $100\xa0million and paid $162\xa0million to settle shareholder lawsuits. Perdue overhauled the company\'s inventory line and logistics network, and updated its marketing strategy. After initially closing hundreds of stores, the company doubled its stock price and opened 2,600 new stores before being sold in 2007 to private equity investors.From 2007 to 2009, Perdue worked as a senior consultant for Indian chemical and textile conglomerate Gujarat Heavy Chemicals Ltd. In April 2011, Perdue started an Atlanta-based global trading firm with Trey Childress, Heidi Green, and former Georgia governor, Sonny Perdue.According to the Atlanta Journal-Constitution, Perdue is "known on Wall Street as a turnaround specialist who helps revive brands and reap rewards for investors."', 'US Senate': '2014 Senate campaign Perdue touted his business experience, and particularly his experience at Dollar General, in running for political office as a Republican candidate. According to Perdue: "We added about 2,200 stores, created almost 20,000 jobs and doubled the value of that company in a very short period of time. Not because of me, but because we listened to our customers and employees.” He received the endorsement of the National Federation of Independent Business.Perdue\'s political opponents targeted his business career during the campaign, specifically for outsourcing work offshore. Perdue said he was "proud of" finding lower cost labor for some companies.  Critics noted that he had contributed to a total of thousands of jobs lost following the final closure of Pillowtex, while Perdue left the company after nine months with a nearly $2\xa0million buyout. After being elected, Perdue stated that he wanted to bring the perspective of "a working person" to Washington, D.C.The race was considered to be competitive. Perdue won the general election, defeating the Democratic nominee Michelle Nunn 52.89% to 45.21%.Committee assignments Committee on Agriculture, Nutrition and ForestrySubcommittee on Commodities, Markets, Trade and Risk ManagementSubcommittee on Conservation, Forestry and Natural Resources (Chair)Subcommittee on Jobs, Rural Economic Growth and Energy InnovationCommittee on the BudgetCommittee on Foreign RelationsSubcommittee on Near East, South Asia, Central Asia and CounterterrorismSubcommittee on Western Hemisphere, Transnational Crime, Civilian Security, Democracy, Human Rights and Global Women\'s IssuesSubcommittee on State Department and USAID Management, International Operations and Bilateral International DevelopmentSubcommittee on International Development, Multilateral Institutions and International Economic, Energy and Environmental PolicySpecial Committee on Aging', 'Political positions': 'Perdue supports policies to achieve energy independence, as well as \'revitalizing\' American manufacturing and increasing exports to \'create quality jobs\' and for \'long-term economic growth\'. Additionally, he supports actions to \'strictly enforce\' laws to secure the border; opposes gun control; is a supporter of the State of Israel; opposes Common Core; and opposes same-sex marriage.In a June 2016 speech to a conference of the Faith and Freedom Coalition, Perdue urged the audience to pray for President Obama\'s "days to be short".Perdue\'s first cousin is the 31st Secretary of Agriculture.Health care He supports repealing and replacing the Patient Protection and Affordable Care Act. He opposes abortion, except in cases of rape, incest or the life of the mother.Term limits Perdue has pledged to limit himself to two terms in the Senate (12 years).Security In October 2015, Perdue voted in favor of the CISA (Cybersecurity Information Sharing Act), despite strong opposition from major companies such as Google, Apple, Facebook and Twitter. This is consistent with his record of a "Common Defense," as he also supported the NDAA (National Defense Authorization Act).Climate change Perdue was one of 22 senators to sign a letter to President Donald Trump urging him to have the United States withdraw from the Paris Agreement. According to the Center for Responsive Politics, Perdue has received over $180,000 from oil, gas and coal interests since 2012.Immigration In 2017, Perdue co-sponsored the RAISE Act, which would reduce legal immigration by 50% and cap refugee admissions to 50,000 individuals per year.Trump Perdue is a close ally of Trump. Perdue fought to prevent the Senate from blocking the Chinese telecom firm ZTE from purchasing American components. The Commerce Department had barred ZTE from doing so for seven years after it accused the firm of having deceived US regulators and violated sanctions on Iran and North Korea. In July 2018, Perdue said that he opposed tariffs but that he would support Trump on his tariff increases.On January 11, 2018, Senator Perdue attended a meeting at the White House where, according to people with direct knowledge of the conversation, President Trump stated that Haiti, El Salvador and African countries were "shithole nations" and that the United States should not take in immigrants from these countries. Senator Perdue stated that he did not recall these statements by the President. Perdue was criticized by veteran journalist Tom Brokaw who suggested that the senator should get a hearing aid at Costco. Then on Sunday, January 14, 2018, Senator Perdue stated on ABC’s “This Week” that he now remembered that President Trump did not use those words just days after he said he did not recall them.Economy Perdue stated in October 2017 that the national debt was the greatest threat to the security of the United States. In December 2017, Perdue voted in favor of the Republican tax plan called the Tax Cuts and Jobs Act that was estimated to increase the national debt one trillion dollars in ten years by slashing individual and corporate tax rates. Perdue voted in favor of the 2017 budget, which was estimated to add as much as $1.5 trillion to deficits over ten years. Perdue said he voted for the budget, because "the $1.5 trillion is an investment to grow the economy."He supports a constitutional balanced budget amendment and comprehensive tax reform.In September 2018, Perdue was among six Republican senators, Jeff Flake, Mike Lee, Rand Paul, Ben Sasse, and Pat Toomey, as well as Bernie Sanders, that voted against a $854 billion spending bill, meant to avoid a government shutdown. Said bill included funding for the departments of Defense, Health and Human Services, Labor and Education.', 'Electoral history': 'U.S. Senate Republican Primary election in Georgia, 2014PartyCandidateVotes%+%RepublicanDavid Perdue185,46630.64%RepublicanJack Kingston156,15725.80%RepublicanKaren Handel132,94421.96%RepublicanPhil Gingrey60,73510.03%RepublicanPaul Broun58,2979.63%RepublicanDerrick Grayson6,0451.00%RepublicanArthur "Art" Gardner5,7110.94%U.S. Senate Republican Primary Runoff election in Georgia, 2014PartyCandidateVotes%+%RepublicanDavid Perdue245,95150.88%RepublicanJack Kingston237,44849.12%U.S. Senate election in Georgia, 2014PartyCandidateVotes%+%RepublicanDavid Perdue1,358,08852.89%DemocraticMichelle Nunn1,160,81145.21%LibertarianAmanda Swafford48,8621.90%Write-inAnantha Reddy Muscu210.00%Write-inMary Schroder140.00%Write-inBrian Russell Brown90.00%', 'introduction': 'David Alfred Perdue Jr. (/pərˈduː/; born December 10, 1949) is an American businessman and politician serving as the junior United States Senator from Georgia since 2015. He was elected in 2014 to the seat previously held by Saxby Chambliss, who retired. Perdue won the Republican primary and defeated Democratic nominee Michelle Nunn. He is a first cousin of Sonny Perdue, former Governor of Georgia and current United States Secretary of Agriculture.\nDavid Perdue started his business career with more than a decade as a management consultant. In 1992 he became a VP at Sara Lee Corporation. During the next decade, he worked with Haggar Clothing, and Reebok. He was unable to correct problems at Pillowtex, which he joined in 2002, leaving after nine months with a large buyout. Perdue next worked for Dollar General, where he did achieve a turnaround, and later for the Gujarat Heavy Chemicals Ltd., whose interests in India included textile mills. Before entering politics, Perdue set up a global trading firm in Atlanta, Georgia.\n\n'}, 'personal': {'Born': 'David Alfred Perdue Jr. (1949-12-10) December 10, 1949 (age68)Macon, Georgia, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Bonnie Perdue', 'Children': '2', 'Relatives': 'Sonny Perdue (cousin)', 'Residence': 'Sea Island, Georgia', 'Education': 'Georgia Institute of Technology(BS, MS)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Georgia': {'date': 'Assumed office January 3, 2015Serving with Johnny Isakson', 'Preceded by': 'Saxby Chambliss'}}, 'code': 'P000612'}