{'name': 'Dean.Heller', 'picture': 'H001041.jpg', 'detail': {'Early life, education, and business career': 'Heller was born in Castro Valley, California, to Janet (née MacNelly) and Charles Alfred "Jack" Heller, a mechanic and stock car driver. He is a longtime resident of Carson City, having moved there with his family at the age of 9 months. He has five siblings.He graduated from Carson High School in 1978, and was accepted into the University of Southern California, he earned his bachelor of business administration, specializing in finance and securities analysis, from the USC Marshall School of Business in 1985. At USC, Heller joined the Sigma Nu social fraternity.Prior to entering politics, Heller worked as an stockbroker, and as a broker/trader on the Pacific Stock Exchange, from 1983–88. He then served as the Chief Deputy State Treasurer in the Nevada Office of the State Treasurer, from 1988-90.[citation needed]', 'Nevada Assembly': 'Heller served two terms in the Nevada Assembly from 1990-94. While in this legislature, he authored a bill to reform state retirement pensions.[citation needed] He represented the capital, Carson City. During his time in the Nevada Assembly, he worked as a senior commercial banking consultant for Bank of America, from 1990–95.', 'Nevada Secretary of State': 'Heller was elected Secretary of State of Nevada in 1994, and was re-elected in 1998 and 2002, served in this capacity from 1995 to 2007; when he was elected to the United States House of Representatives. As secretary, Heller made Nevada the first state in the nation to implement an auditable paper trail to electronic voting machines.', 'US House of Representatives': "Elections 2006Heller decided to run for Congress in 2005 for Nevada's 2nd congressional district after ten-year incumbent Republican U.S. Congressman Jim Gibbons decided to run for governor. On August 15, 2006, he won the Republican primary with 36% of the vote. He narrowly defeated state Assemblywoman Sharron Angle by 421 votes. Angle received 35% of the vote and former state Assemblywoman Dawn Gibbons (wife of the incumbent) received 25% of the vote.In the general election, Heller defeated Democratic nominee and University of Nevada Regent Jill Derby 50–45%. Heller lost Washoe County, home to Reno and by far the largest county in the district (it casts more than 70 percent of the district's vote). However, he won most of the rural areas of the district by margins of 2-to-1 or more, allowing him to win the district by 12,600 votes.[not in citation given]2008Heller won the Republican primary again, this time defeating James W. Smack 86%-14%. In a rematch, Heller defeated Derby in the general election, 52%-41%. This time he won every county in the district, except Clark County.2010In 2009, Heller was rumored to be a candidate to challenge embattled Republican incumbent Governor Jim Gibbons or Democratic United States Senator Harry Reid in 2010. He declined to run for governor or senator, and instead chose to run for re-election.[citation needed]He was challenged in the Republican primary again. He defeated Patrick J. Colletti 84–16%. He won re-election to a third term, defeating Nancy Price 63–36%.Tenure During his tenure in the House, Heller was vice chairman of the Western Caucus, playing a leading role in advocating for issues that impact western U.S. states. He opposed the Troubled Asset Relief Program (TARP).Committee assignments Committee on Ways and MeansSubcommittee on Income Security and Family SupportSubcommittee on Select Revenue Measures", 'US Senate': '2012 election In March 2011, Heller announced that he would run for the United States Senate to succeed John Ensign after Ensign announced his resignation. He ran as the incumbent following his appointment to the seat on May 3, 2011 by Nevada Governor Brian Sandoval. He faced First District Congresswoman Shelley Berkley in the November election. In one of the closest races of the cycle,[citation needed] he won by 12,100 votes out of almost 900,000 cast. A 21,000-vote margin in Washoe County supported Heller\'s win.[citation needed]2018 election In August 2017, Las Vegas businessman Danny Tarkanian, a strong Trump supporter, announced that he would mount a primary challenge to Heller. “We\'re never going to make America great again unless we have senators in office that fully support President Trump and his America-First agenda,” Tarkanian said, explaining that he wanted to “repeal Obamacare and end illegal immigration.”In September 2017, NBC News stated that Heller was “widely considered the most endangered senator up for re-election in next year\'s midterm cycle,” He was described as facing “substantial opposition from both conservatives within his own party and a general electorate trending Democratic,” and as having “a difficult relationship with President Donald Trump.” At a fundraiser, Nevada Republicans were supportive of Trump but critical of Heller.On February 1, 2018, President Trump told Republican National Committee members that he would travel to Nevada to campaign for Heller in a competitive GOP primary. In March 2018, Trump persuaded Tarkanian to drop his challenge to Heller. Tarkanian said that he would instead run for House district NV-03, with Trump\'s full support.Tenure Heller was appointed by Nevada Governor Brian Sandoval to the vacant seat created by the resignation of John Ensign. He assumed office upon his resignation from the U.S. House on May 9, 2011.On May 23, 2013, he introduced S. 1049 into the Senate. The bill is an official companion measure to the Good Samaritan Search and Recovery Act of 2013 (H.R. 2166; 113th Congress), introduced in the House by Nevada Representative Joe Heck. The bills would require the federal government to issue permits within 48 hours to volunteer search and rescue groups that would allow them to search federal lands. Heller argued that "the last thing families who have lost loved ones need is the federal government to stand in the way of recovering their remains."Heller campaigned to be elected Chairman of the National Republican Senatorial Committee for the 114th U.S. Congress, but was defeated by Mississippi Senator Roger Wicker on November 13, 2014.Government shutdownIn 2013, Heller was one of 18 Senators who voted against the bill to reopen the government during the United States government shutdown of 2013. Regarding the vote, Heller said: "I wanted to be able to support a deal, but this proposal makes no underlying structural changes that will prevent this exact same crisis from happening again in the very near future. Considering this legislation does nothing to place our nation on sound fiscal footing or cultivate a growth economy that will produce jobs in the long term, I cannot support it."Committee assignments Heller is a member of the following committees:Committee on Banking, Housing, and Urban AffairsSubcommittee on Economic Policy (Chair)Subcommittee on Housing, Transportation, and Community DevelopmentSubcommittee on Financial Institutions and Consumer ProtectionCommittee on Commerce, Science, and TransportationSubcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Consumer Protection, Product Safety, Insurance and Data SecuritySubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on FinanceSubcommittee on Taxation and IRS OversightSubcommittee on Health CareSubcommittee on Social Security, Pensions, and Family Policy (Chair)Committee on Veterans\' Affairs', 'Political positions': 'A moderate Republican, Heller was ranked as the 5th most bipartisan member of the U.S. Senate during the first session of the 115th United States Congress by the Bipartisan Index, a metric created by The Lugar Center and Georgetown\'s McCourt School of Public Policy to better gauge congressional bipartisanship.During the Obama administration, there was a degree of friction between Heller and the president. In 2010, Heller criticized Obama for using Las Vegas as a synonym for wasting money. Heller said: “Nevada has one of the most distressed economies in the country, and the President has done little to focus on job creation over the past year.” Heller\'s relationship with President Trump has undergone considerable evolution. During the 2016 campaign, Heller said Trump "denigrates human beings" and suggested that he wouldn\'t vote for him, although he later said that he did. In February 2018, the AP noted that Heller, who “had been publicly chided by President Donald Trump months earlier” was now “working closely with the White House.” A “steady rapprochement” had taken place “between the swing-state senator and loyalty-loving president,” stated the AP.Abortion Heller voted against federal funding for abortion. He supported abortion access in cases of rape, incest, or life-endangering harm to the mother.Heller came under “heavy criticism” in spring 2017 after he told a Reno audience that he had “no problem” funding Planned Parenthood.Cuba Heller supported the initiative by President Barack Obama to normalize relations with Cuba, and was part of a bipartisan delegation to Havana.Economy Heller opposed the Emergency Economic Stabilization Act of 2008 that created the Troubled Asset Relief Program characterizing the bill as "a massive bailout of Wall Street". He also opposed the Auto Industry Financing and Restructuring Act of 2008.Energy and environment Heller has voted in support of the development of domestic oil, gas and coal. He has also supported tax incentives for renewable energy.Heller has confronted the Trump administration "over its plans to reopen" the Yucca Mountain facility, a large nuclear waste repository near Las Vegas, Nevada. Specifically, Heller is against Trump seeking $47.7 billion in his administration\'s budget request for fiscal year 2019 "to restart the licensing process for Yucca Mountain". In a letter to the Senate\'s Energy and Water panel, he called the idea a "breach of state sovereignty", citing "health and safety risks and potentially catastrophic financial risks" involved with the project\'s approval.Gun policy The National Rifle Association endorsed Heller during his 2012 U.S. Senate run. From 1998 through 2016, the NRA donated $122,802 to Heller\'s political campaigns.Heller voted in 2011 to allow veterans to register guns bought overseas in the U.S. During his 2012 campaign, he hosted a campaign rally at a gun store in Las Vegas.In 2013, Heller voted against legislation to limit gun magazine capacity, ban assault weapons and to expand background checks on gun sales at gun shows and made on the internet. In the past he has supported more restrictive background checks but voted against them due to fear that a national gun registry could be created.Relationship with Donald Trump During the 2016 presidential election campaign, Heller said that he was "vehemently opposed" to Donald Trump. By May 2018, The New York Times wrote that Heller had come to recently embrace Trump. CNN noted that Heller had "aligned himself closely" with Trump after the President in 2017 threatened to support a primary challenge against him. Following the threat, Heller flip-flopped on health care (ultimately supporting a conservative bill to repeal the Affordable Care Act), supported Trump\'s immigration reform proposal, and avoided direct criticism of Trump for several months. In March 2018, Trump endorsed Heller in his Senate bid, convincing primary challenger Danny Tarkanian to drop out of the race.In 2018, Heller repeatedly confronted the Trump administration over its plans to reopen the Yucca Mountain nuclear waste repository.In April 2018, Heller said that he did not support legislation to protect Special Counsel Robert Mueller from being fired by Trump, saying "I don\'t think that\'s going to happen so I don\'t think there\'s a need for legislation." Heller said that he did not want the President to fire Mueller but that Mueller should quickly wrap up the investigation into Russian interference in the 2016 United States elections.Health care Heller voted against the Patient Protection and Affordable Care Act of 2010 (Obamacare), citing the bill\'s potential impact on taxes, health care costs and the national debt.During the debate prior to the federal healthcare law\'s passage, Heller led efforts to require two provisions be added to the federal health care law that would require:The use of citizenship verification tools to determine eligibility for taxpayer-funded healthcare benefitsMembers of Congress to join any government-run healthcare plan proposed in early versions of the healthcare law.Heller questioned the constitutionality of the law following its passage, and called on Nevada Attorney General Catherine Cortez Masto to join a multi-state lawsuit challenging it.On January 19, 2011, Heller voted to repeal the Affordable Care Act (Obamacare).In May 2013, Heller introduced a bill to suspend $440 million in IRS funding to enforce Obamacare. In a statement, Heller said, "With the recent events related to the Internal Revenue Service, I feel it is necessary that both Congress and the Department of Health and Human Services look closely at the money given to the IRS through the health care law."In June 2013, Heller called Obamacare a “colossal monstrosity,” but in April 2014, The Hill named him as one of several “anxious Senate Republicans” who were worried that Republican leaders were “focusing too much this election year on Obamacare.”In June 2017, Heller held a joint press conference with Nevada Governor Brian Sandoval, where Heller fervently opposed the American Health Care Act, the Republican Party\'s repeal and replacement bill for the Affordable Care Act (ACA). Heller said that he could not support a bill "that takes away insurance from tens of millions of Americans and hundreds of thousands of Nevadans." In July 2017, Heller voted yes to allow debate on legislation to repeal and replace the ACA. Heller was one of seven Republicans who voted \'no\' to repealing the ACA without a replacement. Two days later, he voted in favor of "skinny" repeal of the Affordable Care Act. The July 2017 attempt to repeal failed when Republican Senators John McCain, Susan Collins, and Lisa Murkowski voted against the "skinny" repeal proposal. In August 2017, Heller said that he was "real pleased at the way this thing turned out", referring to having voted in favor of legislation that ultimately failed.Immigration and refugees In 2010, Heller voted against the DREAM Act, which would have provided a path to citizenship for unauthorized immigrant minors provided that they join the military or go to university. He voted for the comprehensive immigration reform bill created by the "Gang of Eight" in 2013. By February 2018, Heller had moved further to the right on immigration. Heller suggested that he was supportive of Trump\'s proposed immigration reforms, saying "I have a tendency to support what the president’s trying to do, and that’s probably the position that’s closest to where I am." Trump\'s proposed immigration reforms would cut legal immigration, increase border security spending, and offer a pathway to citizenship for 1.8 million undocumented immigrants (a far lower number than in the Gang of Eight bill). Politico wrote that Heller has "often projected a moderate stance on immigration" but that supporting President Trump\'s immigration policies could be "useful heading into a primary challenge" from Danny Tarkanian.Heller opposed Trump\'s 2017 executive order to impose a temporary ban on entry to the U.S. to citizens of seven Muslim-majority countries, saying: "I agree that better vetting and border protection measures are necessary to our current immigration system. That\'s why I support the thorough vetting of individuals entering our country. However, I am deeply troubled by the appearance of a religious ban. The use of an overly broad executive order is not the way to strengthen national security. I encourage the Administration to partner with Congress to find a solution."In a February 2018 interview, Heller said he was optimistic that the two parties would eventually agree on a solution to the DACA issue. In April 2018, Heller said he wanted Congress to find "relief for DACA recipients."Human trafficking In 2015, Heller authored an amendment which provided training for airport security and border patrol personnel to identify victims of human trafficking. The amendment was successfully added to a bill to combat human trafficking.Israel Part of Heller\'s 2012 campaign platform revolved around his stance on Israel and the nation\'s relationship with the United States. Heller advocates for American assistance to Israel so that the country will have the ability to defend itself and supports punishments for Iran\'s pursuit of weapons of mass destruction.In 2011 Heller introduced the Jerusalem Embassy and Recognition Act of 2011, legislation that reaffirms the United States’ commitment to Israel to relocate the U.S. embassy from Tel Aviv to Jerusalem.On January 3, 2017, he joined fellow GOP U.S. Senators Ted Cruz (R-TX) and Marco Rubio (R-FL) in introducing a new Jerusalem Embassy and Recognition Act shortly after being sworn into the new 115th Congress. The legislation was intended to eliminate a waiver loophole in the 1995 law to move the Embassy to Jerusalem, and recognize Jerusalem as Israel\'s official capital.Labor unions Heller opposes the Employee Free Choice Act, proposed legislation that would effectively eliminate secret ballots in union organizing elections and subject employers and employees to mandatory arbitration when negotiating union contracts. Heller objected, saying it could cause the loss of 600,000 jobs within two years of enactment.[citation needed]LGBT rights Heller voted against the Don\'t Ask, Don\'t Tell Repeal Act of 2010 in the House of Representatives. In 2013, Heller announced that he supported the Employment Non-Discrimination Act (ENDA), which would prohibit employment discrimination on the basis of sexual orientation. He opposes same sex marriage. In 2015, Heller voted to endorse Social Security and veterans benefits for married gay couples.Minimum wage Heller voted against the Fair Minimum Wage Act of 2007. In April 2014, the United States Senate debated the Minimum Wage Fairness Act (S. 1737; 113th Congress). The bill would amend the Fair Labor Standards Act of 1938 (FLSA) to increase the federal minimum wage for employees to $10.10 per hour over the course of a two-year period. The bill was strongly supported by President Barack Obama and many of the Democratic Senators, but strongly opposed by Republicans in the Senate and House. Heller opposed the bill, arguing that Nevada already had a minimum wage higher than the federally mandated level and that he thought the minimum wage should be left up to the states. Heller said "I think there is a difference between North and South, East and West on what those minimum wages ought to be."Unemployment insurance In April 2014, Heller led a successful effort to pass legislation in the Senate extending emergency unemployment benefits to 2 million Americans.Violence Against Women Act Heller voted for reauthorization of the Violence Against Women Act in 2012.School safety In March 2018, Heller and 20 other senators introduced the Students, Teachers, and Officers Preventing (STOP) School Violence Act of 2018, which would allocate funding with the goal of improving school security.Supreme Court After the death of Justice Antonin Scalia, Heller was the first Republican senator to break with party leader Mitch McConnell and say that President Barack Obama should nominate a replacement. He said Nevadans “should have a voice” in replacing Scalia.In April 2017, he voted to invoke cloture (end debate) on the nomination of Supreme Court nominee Neil Gorsuch, putting an end to the Democratic filibuster. Heller also voted for the "nuclear option", ending the three-fifths (60-vote threshold) for Supreme Court nominees.In October 2018, Heller voted in favor of Brett Kavanaugh\'s nomination to become to a Supreme Court justice. Kavanaugh had been accused by several women of sexual assault; Heller referred to these allegations as a "hiccup", and later clarified that sexual assault allegations should not be considered to be a hiccup.', 'Personal life': "A member of The Church of Jesus Christ of Latter-day Saints, he and his wife Lynne have four children and two grandchildren. His son-in-law, Ed Ableser, served for nearly ten years as a Democratic member of the Arizona Legislature.Heller was a founding board member of the Boys and Girls Club of Western Nevada and the Western Nevada Community College Foundation. He is an advisory board member for Nevada's Foster Grandparent program.", 'Electoral history': 'United States Senate election in Nevada, 2012PartyCandidateVotes%±RepublicanDean Heller (incumbent)457,65645.87%−9.53%DemocraticShelley Berkley446,08044.71%+3.71%Independent American David Lory VanDerBeek48,7924.89%+3.56%None of These Candidates44,2774.54%+3.13%Majority12,0341.20%Turnout997,805Republican holdUnited States Senate Republican primary election in Nevada, 2012PartyCandidateVotes%+%RepublicanDean Heller (incumbent)88,95886.28%RepublicanSherry Brooks5,3565.19%None of These Candidates3,3583.26%RepublicanEddie "In Liberty" Hamilton2,6282.55%RepublicanRichard Charles2,2952.23%RepublicanCarlo "Nakusa" Poliak5120.50%Nevada\'s 2nd congressional district election, 2010PartyCandidateVotes%+%RepublicanDean Heller (incumbent)169,45863.30%DemocraticNancy Price87,42132.66%Independent AmericanRussell Best10,8294.05%Nevada\'s 2nd congressional district Republican primary election, 2010PartyCandidateVotes%+%RepublicanDean Heller (incumbent)72,72883.70%RepublicanPatrick Colletti14,16216.30%Nevada\'s 2nd congressional district election, 2008PartyCandidateVotes%+%RepublicanDean Heller (incumbent)170,62051.84%DemocraticJill Derby136,32041.42%Independent AmericanJohn Everhart11,1653.39%LibertarianSean Patrick Morse5,7301.74%GreenCraig Bergland5,2691.60%Nevada\'s 2nd congressional district Republican primary election, 2008PartyCandidateVotes%+%RepublicanDean Heller (incumbent)43,11286.02%RepublicanJames Smack7,00913.98%Nevada\'s 2nd congressional district election, 2006PartyCandidateVotes%+%RepublicanDean Heller117,16850.35%DemocraticJill Derby104,59344.94%IndependentDaniel Rosen5,5242.37%Independent AmericanJames Kroshus5,4392.34%Nevada\'s 2nd congressional district Republican primary election, 2006PartyCandidateVotes%+%RepublicanDean Heller24,77035.90%RepublicanSharron Angle24,34935.29%RepublicanDawn Gibbons17,31725.10%RepublicanGlenn Thomas1,8352.66%RepublicanRichard Gilster7211.05%Nevada Secretary of State election, 2002PartyCandidateVotes%+%RepublicanDean Heller (incumbent)298,12560.33%DemocraticWilliam Hamma124,65525.23%None of These Candidates29,5615.98%Independent AmericanChristopher Hansen17,9873.64%Natural LawLois Avery14,5522.94%GreenPaul Lenart7,6021.54%Nevada Secretary of State election, 1998PartyCandidateVotes%+%RepublicanDean Heller (incumbent)270,02465.61%None of These Candidates51,76312.58%Independent AmericanMary Ann Dickens42,89310.42%Natural LawLois Avery24,0805.85%LibertarianRobert Brost22,7985.54%Nevada Secretary of State election, 1994PartyCandidateVotes%+%RepublicanDean Heller204,04154.60%DemocraticTom Hickey113,42130.35%Independent AmericanTeresia Avila31,1318.33%None of These Candidates25,2796.76%Nevada Secretary of State Republican Primary election, 1994PartyCandidateVotes%+%RepublicanDean Heller53,47849.31%RepublicanPatrick Matthew Fitzpatrick28,96726.71%None of the above26,01123.98%Nevada State Assembly District 40 election, 1992PartyCandidateVotes%+%RepublicanDean Heller (incumbent)8,14666.58%DemocraticJoe McKnight3,46328.24%LibertarianPerry Nixdorf6535.33%Nevada State Assembly District 40 election, 1990PartyCandidateVotes%+%RepublicanDean Heller5,02257.82%DemocraticRobin Williams-Auer3,66342.18%Nevada State Assembly District 40 Republican Primary election, 1990PartyCandidateVotes%+%RepublicanDean Heller2,19667.30%RepublicanKay Bennett1,06732.70%', 'introduction': "Dean Arthur Heller (born May 10, 1960) is an American businessman and politician serving as the senior United States Senator for Nevada. A Republican, he was appointed by Governor Brian Sandoval and then elected in 2012. He is the dean of Nevada's congressional delegation.\nHeller served in the United States House of Representatives for Nevada's 2nd congressional district from 2007 to 2011. He is a former Secretary of State of Nevada (1995–2007) and member of the Nevada Assembly (1990–1994). \n\n"}, 'personal': {'Born': 'Dean Arthur Heller (1960-05-10) May 10, 1960 (age58)Castro Valley, California, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Lynne Heller', 'Children': '4', 'Education': 'University of Southern California (BBA)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Nevada': {'date': 'Assumed office May 9, 2011Serving with Catherine Cortez Masto', 'Appointed by': 'Brian Sandoval', 'Preceded by': 'John Ensign'}, "Member of the US House of Representativesfrom Nevada's 2nd district": {'date': 'In officeJanuary 3, 2007– May 9, 2011', 'Preceded by': 'Jim Gibbons', 'Succeeded by': 'Mark Amodei'}, '15th Secretary of State of Nevada': {'date': 'In officeJanuary 3, 1995– January 3, 2007', 'Governor': 'Bob MillerKenny GuinnJim Gibbons', 'Preceded by': 'Cheryl Lau', 'Succeeded by': 'Ross Miller'}}, 'code': 'H001041'}