{"name": "Debbie.Stabenow", "picture": "S000770.jpg", "detail": {"Early life, education, and early career": "Stabenow was born in Gladwin, Michigan, the daughter of Anna Merle (née Hallmark) and Robert Lee Greer. She grew up in Clare, Michigan. She graduated from Clare High School, and received a Bachelor of Arts from Michigan State University in 1972 and a Master of Social Work magna cum laude from Michigan State University in 1975.", "Early political career": "Ingham County politics While in graduate school, Stabenow won her first election to public office: the Ingham County Board of Commissioners, a position in which she served from 1975 to 1978.State legislature She served in the Michigan House of Representatives from 1979 to 1990, where she became the first woman to preside over the House. She also served in the Michigan Senate from 1991 to 1994.1994 gubernatorial election In 1994, she ran in Michigan's Democratic gubernatorial primary for the opportunity to challenge incumbent Republican John Engler. U.S. Congressman Howard Wolpe defeated her in the primary, however, with a plurality of 35% to Stabenow's 30%. After the primary, Wolpe chose Stabenow as his running mate, and she appeared on the general election ballot as the Democratic candidate for Lieutenant Governor.  Stabenow failed to become Lieutenant Governor of Michigan as Engler defeated Wolpe 61%-38%.U.S. House of Representatives In 1996, Stabenow ran for a seat in the United States House of Representatives, challenging incumbent Republican U.S. Congressman Dick Chrysler for the opportunity to represent Michigan's 8th congressional district. She defeated Chrysler 54%-44%. In 1998, she won re-election to a second term with 57% of the vote.", "US Senate": "Elections 2000She did not seek re-election in 2000, choosing instead to challenge incumbent Republican U.S. Senator Spencer Abraham. She won the Democratic primary unopposed. She defeated him 49.5%-48%, a difference of 67,259 votes.2006Stabenow was challenged by Republican Michael Bouchard, Oakland County sheriff and former State Senate Majority Leader. Stabenow defeated him 57%-41%.2012Stabenow was unopposed in the Democratic primary and defeated Republican nominee Pete Hoekstra, former U.S. representative. Stabenow won 59% to Hoekstra's 38%.Tenure Before her current committee assignments, Stabenow also served on the Banking, Housing and Urban Affairs Committee and the Special Committee on Aging.Stabenow is only the second person from Michigan to have served in both houses of the Michigan State Legislature and in both houses of the United States Congress. Stabenow is also the first person to have served as a Michigan state legislator to be popularly elected to the U.S. Senate (until enactment of the Seventeenth amendment to the United States Constitution in 1913, U.S. Senators were selected by the state legislature). No former Michigan state legislator had served in the U.S. Senate since 1894, when Francis B. Stockbridge died.[citation needed]Stabenow became the third-ranking Democratic Party member in the U.S. Senate on November 16, 2004, when she was elected as secretary of the Democratic caucus. As caucus secretary, she assisted Senate Minority Leader Harry Reid (D-NV) to set the Democratic agenda and priorities. Senator Dick Durbin (D-IL) was elected Minority Whip, the second-ranking Democratic spot. In November 2006, Majority Leader Harry Reid announced that Stabenow would leave the caucus secretary position to succeed Hillary Clinton as chair of the Democratic Steering and Outreach Committee, charged with \"engag[ing] Democratic Senators and community leaders across the country in an active dialogue\".After Tom Daschle, President Barack Obama's nominee for United States Secretary of Health and Human Services, withdrew his name, the National Organization for Women urged the president to appoint Stabenow, citing her focus on health care and \"her background as a social worker\".Stabenow became the Chairwoman of the Senate Agriculture Committee in 2011, following the defeat of Chairwoman Blanche Lincoln.  A controversial item during Stabenow's tenure, has been the renewal and reform of the 2012 U.S. Farm Bill. Senate Majority Leader Harry Reid (D-NV) reintroduced 2012's Senate Farm Bill in the new 113th Congress in January 2013, saying that the Farm Bill was on his top priority list, and Stabenow voiced support for Reid’s move, stating \"Majority Leader Reid has demonstrated that the Senate will once again make supporting our nation’s agriculture economy while cutting spending a top priority.\"On October 29, 2014, Stabenow introduced the Gun Lake Trust Land Reaffirmation Act (S. 1603; 113th Congress), a bill that would reaffirm the status of lands taken into trust by the Department of the Interior (DOI) for the benefit of the Match-E-Be-Nash-She-Wish Band. The bill would clarify that the Match-E-Be-Nash-She-Wish Band's land trust could not be challenged in court under the Supreme Court decision of Carcieri v. Salazar.Committee assignments Committee on Agriculture, Nutrition, and Forestry (Ranking member)As ranking member, Senator Stabenow is an ex-officio member of all subcommitteesCommittee on the BudgetCommittee on Energy and Natural ResourcesSubcommittee on EnergySubcommittee on National ParksSubcommittee on Water and PowerCommittee on FinanceSubcommittee on Health CareSubcommittee on International Trade, Customs, and Global CompetitivenessSubcommittee on Energy, Natural Resources, and InfrastructureCaucus memberships Afterschool CaucusesCongressional NextGen 9-1-1 Caucus", "Political positions": "Along with eight other Senators, Stabenow tied for \"Most Liberal Senator\" in 2011, in the view of The National Journal.Economic issues Stabenow has generally received low scores from free-market groups (Competitive Enterprise Institute, 2013, 0%; American Conservative Union, 2016, 0%; Americans for Prosperity, 2015–16, 0%) and high scores from fiscally liberal groups (Progressive Punch, 2015, 92%; NETWORK, A National Catholic Social Justice Lobby, 2012, 91%).In 2009, Stabenow voted for President Obama's $787 billion stimulus plan. In 2008, however, she voted against the bailout proposed by President Bush.In 2010, she introduced the China Fair Trade Act, saying it would \"prevent federal taxpayer dollars from being used to purchase Chinese products and services until they sign on to and abide by the WTO Agreement on Government Procurement.\" The bill would also require a report on Chinese industrial policies and require the Department of Energy to monitor the development of China's renewable energy sector.In October 2011, Stabenow called for tax breaks for firms developing bio-based products, using crops like soybeans and corn to create prescriptions drugs, plastics, and soaps.In August 2012, Stabenow expressed support for \"strategic partnerships between farmers and industry\" and for a recent Obama directive to boost federal purchases of bio-based products.In 2013, Greg Kaufmann of The Nation wrote an article stating that Stabenow was prepared to cut $8 to $9 billion from the food stamp (SNAP) program. This marked \"the first time in history that a Democratic-controlled Senate had even proposed cutting the SNAP program,\" charged Joel Berg of the New York City Coalition Against Hunger. In a lengthy statement, Stabenow's office rejected these accusations, maintaining that Stabenow \"strongly opposes any changes to food assistance that make cuts in benefits for people who need help putting food on the table\" and that she \"has been the number one defender against the House Republican proposal to cut food assistance by $40 billion.\" Kaufmann and Berg both doubled down on their charges and challenged in detail the claims made by Stabenow's office.In 2015, she introduced the Stabenow-Portman Amendment (SA 1299) to address currency manipulation in the Trans-Pacific Partnership.In 2015, the International Economic Development Council gave Stabenow the Congressional Leadership Award \"for her significant contributions in the area of economic development.\" The IEDC cited her work on the 2014 Farm Bill, her sponsorship in 2013 of the New Skills for New Jobs Act, and her role in the federal bridge loan program.\"In 2017, Stabenow introduced her American Jobs Agenda, which included two acts: the Make It In America Act and the Bring Jobs Home Act. The former \"would close loopholes in a 1933 law designed to give American companies priority when the federal government purchases goods.\" She said the act would require that the U.S. government \"buy American...If the federal agency says they need a waiver, they need to measure how many American jobs will be impacted by purchasing that product made overseas.\" The latter \"would create a tax cut for companies bringing jobs and business activities back to America from another country.\"In May 2017, she and fellow U.S. Senator Gary Peters announced a $210,000 EDA grant to the West Michigan Shoreline Regional Development Commission \"to help spur economic development in West Michigan.\" In the same month, she said that owing to a major change in farmers' margins since the 2014 Farm Bill, the farm safety net needed to be strengthened, especially for dairy farmers.At a July 13, 2017, economics roundtable, she said that the \"#1 request she gets in Michigan\" is for \"Professional technical jobs, building construction jobs — folks that can actually make things and do things.\" She said that Democrats can succeed in elections by \"going to our core. We are the party that are willing to take risks to make things better...We believe in our core in an economy that actually works for everybody. That is how you grow America.\"The Biotechnology Industry Organization thanked Stabenow in 2017 for supporting development of a \"biobased economy,\" specifically for Stabenow's introduction of the Renewable Chemicals Act of 2017, which would \"allow taxpayers to claim a production tax credit of 15 cents per pound of biobased content of each renewable chemical produced during the taxable year.\"On October 3, 2017, Stabenow and U.S. Senator Gary Peters introduced the Small Business Access to Capital Act, designed to \"reauthorize and improve the State Small Business Credit Initiative (SSBCI) to help small businesses grow and create jobs.\" It built \"on the successful SSBCI initiative that both lawmakers championed in the Small Business Jobs Act of 2010\" and that \"funds the Michigan Economic Development Corporation and other state-led lending programs that leverage private financing to help small businesses access the capital they need.\"Immigration Stabenow has received high marks from groups supporting increased immigration and amnesty (American Immigration Lawyers Association, 2013–14, 100%; National Hispanic Leadership Agenda, 2013–14, 100%) and low marks from groups opposed to illegal immigration: Federation for American Immigration Reform, 2014, 0%; Numbers USA, 2017, 0%.During the brief 2018 government shutdown, Stabenow was among 81 Senators that effectively ended the shutdown by approving a three-week stopgap spending bill that \"included reauthorizing the Children's Health Insurance Program for six years\". This agreement was obtained after the Republican leadership \"pledged to soon take up immigration legislation\". She stated they had \"reached a bipartisan agreement that funds children's health insurance and moves us closer to a solution that provides long-term certainty for Michigan families and our national defense,\".In January 2017, she opposed Trump's executive order temporarily limiting immigration from several Muslim majority countries, saying it \"is ruining America's reputation in the world, undermining our relationships with our most critical allies, and most heartbreakingly, destroying the lives of good and law-abiding people.\"International Relations Stabenow supported Obama's Iran deal that prevented Iran from developing nuclear weapons for 10 years and halted their uranium production. Income inequality Recounting a 2014 Senate hearing on income inequality, George Packer singled out Stabenow as the only committee member who pushed back on the idea that it was caused largely by the withdrawal from the workforce of middle-aged people who preferred to collect welfare. Stabenow \"pointed out that almost all the voters she heard from in high-unemployment Michigan still wanted to work.\"Government spending She has received low scores from low-spending advocates (Club for Growth, 2016, 8%; Council for Citizens against Government Waste, 2015, 0%; National Taxpayers Union, 2015, 9%).Her 2012 GOP opponent Pete Hoekstra accused her of supporting wasteful government spending. \"It's wasteful government spending versus American jobs,\" he said, dubbing her \"Debbie Spenditnow\" and claiming that Obama's stimulus cost the country 2.6 million jobs. \"Her big-spending policies,\" Hoekstra said, \"have shackled job creators, increased our reliance on China, threatened our national security, and put America on the path to bankruptcy.\" Hoekstra noted that Citizens Against Government Waste rated Stabenow as \"hostile\", while it called Hoekstra a \"superhero.\" Her campaign replied with a web commercial critiquing some of Hoekstra's votes while serving nine terms in Congress.Education In 2011, she introduced the Reengaging Americans in Serious Education Act (RAISE UP Act), whereby the Labor Department would fund programs to help \"disconnected youth\" get diplomas, degrees, and job certifications. In 2012, she co-sponsored a bill to freeze student loan interest rates at 3.4 percent and make additional funds available for Pell Grants.In 2016, Stabenow and others introduced the Reducing Educational Debt Act, which she promoted with the #InTheRed hashtag.She expressed \"strong concerns\" about Trump's nomination of Betsy DeVos as Education Secretary, saying that \"DeVos and her family have a long record of pushing policies that I believe have seriously undermined public education in Michigan and failed our children.\"Gun law After the Orlando nightclub shooting, Stabenow participated in the Chris Murphy gun control filibuster. One month later, she supported Democrat proposed bills to ban people on the terrorist watchlist from buying guns and to expand background checks. Neither bill passed the Senate. Stabenow blamed the NRA for the bills' failure to pass.In 2017, Stabenow and Debbie Dingell, introduced a law that would make it illegal for people charged with misdemeanor stalking to buy guns.Stabenow has an \"A+\" rating from the Brady Campaign to Prevent Gun Violence and an \"F\" rating from both the National Rifle Association and the Gun Owners of America.Health care She has received high scores from Planned Parenthood (2017, 100%) and low scores from National Right to Life Committee, (2013, 0%).In the 2000 campaign she \"promised to make the pharmaceutical industry lower prescription drug prices, to maintain Social Security benefits and to give Medicare a new prescription drug plan.\" She pledged to \"fight the pharmaceutical and insurance industries – the two industries that spend the most money lobbying federal officials\" and accused the pharmaceutical industry of \"making up to 20 percent net profit each year...on the backs of families, seniors and businesses,\" Her spokesperson said: \"In the last election, I think the pharmaceutical industry spent more campaigning against her than any other candidate...She was enemy number one.\"Stabenow voted for the Patient Protection and Affordable Care Act in December 2009, and she voted for the Health Care and Education Reconciliation Act of 2010. She also sponsored S. 2257, the Excellence in Mental Health Act.On September 1, 2016, she said that approving money to combat Zika was a top congressional priority.Defense In December 2011, Stabenow voted in favor of the National Defense Authorization Act for Fiscal Year 2012. The bill included highly controversial provisions, drafted by Senators Carl Levin and John McCain in closed session, that would allow for the indefinite military detention without trial of American citizens deemed potential terrorists and enemies of the state.Environment Global warming On August 10, 2009, Stabenow was reported by The Detroit News as saying \"Global warming creates volatility. I feel it when I'm flying. The storms are more volatile. We are paying the price in more hurricanes and tornadoes.\" She has, however, opposed regulation of greenhouse gases, enhanced fuel efficiency standards in California, and greenhouse gas emission reporting standards.Stabenow voted for the SBIR/STTR Reauthorization Act of 2011 (S.493). In March 2011, the Think Progress website accused her of joining \"the pro-polluter frenzy sweeping the U.S. Senate,\" saying that the legislation was \"being used as a vehicle for senators who wish to prevent regulation of greenhouse pollution from oil refineries, coal-fired power plants, heavy industry, and other major emitters. Stabenow has added her amendment to three others intended to hamstring the Environmental Protection Agency on behalf of carbon polluters.\"Stabenow's proposed amendment to keep the Environmental Protection Agency from regulating greenhouse gas emissions for two years also drew criticism. The amendment would have given “coal-fired power plants, oil refineries and other industrial sources a two year exemption” from rules requiring them to report greenhouse gas emissions. Stabenow defended her position by calling her amendment \"a common-sense approach that allows protections from carbon pollution, determined by scientists and public health experts, to continue being developed while providing businesses the support and incentives they need as they reduce pollution, generate new clean energy technologies and create jobs.\"Drilling in the Great Lakes In 2010, Stabenow called for a total ban on drilling in the Great Lakes. Critics noted that \"a U.S. federal ban on all oil and natural gas offshore drilling in the Great Lakes\" had already \"been in place since 2005,\" and that Canada banned offshore oil drilling but had \"roughly 500 offshore gas wells in Lake Erie,\" plus 23 \"slant wells\" that \"drill for oil on shore but extend under Lake Erie.\" In 2015, Stabenow and Gary Peters introduced the Pipeline Improvement and Preventing Spills Act \"to ban shipping of crude oil by vessel on the Great Lakes and require a comprehensive, top-to-bottom review of hazardous pipelines in the region.\"In May 2017, Stabenow expressed support for the bipartisan effort to retain funding for The Great Lakes Restoration Initiative.In September 2016, Stabenow and Gary Peters led an effort to link an aid package for the Flint water crisis to flood relief funds for Louisiana.Canadian waste disposal On August 31, 2006, Stabenow, along with Senator Carl Levin and Rep. John Dingell, announced an agreement that would completely cease Ontario's dumping of solid waste in Michigan within four years. This had been an issue in Michigan for the past several years. Stabenow had previously introduced legislation in the Senate that was intended to reduce the dumping of Canadian trash in Michigan. In July 2006, the Senate unanimously passed a law sponsored by Stabenow requiring the payment of a $420 inspection fee for every truckload of Canadian trash being brought into Michigan.Fairness doctrine Asked in 2009 by Bill Press whether she would support a return of the Fairness Doctrine, under which the federal government enforced an ideological \"balance\" on the airwaves, Stabenow said yes: \"I absolutely think it's time to be bringing accountability to the airwaves.\" Asked whether she would push for Senate hearings on the subject, she said, \"I have already had some discussions with colleagues and, you know, I feel like that's gonna happen. Yep.\" It has been noted that Stabenow's then husband was Tom Athans, an executive in left-wing radio (Air America, Democracy Radio), whose career would have benefited from such legislation.Stabenow is probably the most prominent politician to seriously support a new Fairness Doctrine.Trump nominations She opposed Trump's nomination of Jeff Sessions as AG: \"Because of his record on civil rights and his votes against anti-domestic violence legislation, I cannot support him to be our nation's highest law enforcement officer...Families in Michigan and across the country deserve an attorney general who will enforce the nation's laws fairly and equally.\"She opposed Trump's nomination of Neil Gorsuch to the Supreme Court: \"After reviewing Judge Gorsuch's rulings, it is clear that he has a long record of siding with special interests and institutions instead of hard-working Americans. And, therefore, in my judgment, he does not meet this standard of balance and impartiality.\"", "Personal life": "Stabenow was first married to Dennis Stabenow; the couple divorced in 1990. They have two children, Michelle and Todd.In 2003, Stabenow married Tom Athans, co-founder of Democracy Radio and former executive vice president of Air America. She and Athans have a stepdaughter, Gina. On May 28, 2010, approximately two years after Athans was detained in Troy, Michigan, as part of a prostitution sting, he and Stabenow divorced.Stabenow belongs to Grace United Methodist Church in Lansing, Michigan.Stabenow made a cameo in the 2016 Zack Snyder film Batman v Superman: Dawn of Justice as the Governor of New Jersey, the state in which Gotham City is located in the DC Extended Universe.", "Controversies": "GMOs Stabenow has been targeted in her state for her role, as Senate Agriculture Committee Chair, in adding an amendment to the 2013-14 Farm Bill that prohibited state laws requiring labeling for foods containing GMOs. She has been called a \"Monsanto mouthpiece\" because this amendment aided Monsanto and other agribusinesses, which donated over three-quarters of a million dollars to her campaign during that election cycle.In 2016 she was criticized again for her role in the passage of a law that overruled state laws mandating GMO labeling. \"The legislation is a gift to the pesticide and food industries who make and sell GMOs,\" wrote David Bronner in the Huffington Post.Her enthusiasm for this legislation was tied to her acceptance of campaign contributions from Michigan-based Kellogg's and Dow Chemical.Tom Athans In 2008, Stabenow's then husband, Thomas Athans, co-founder of the liberal TalkUSA Radio network, \"was implicated in a prostitution sting.\" He \"admitted to police he paid a prostitute for sex.\" He went online and arranged a $150 tryst at a Detroit hotel. Stabenow and Athans were divorced a year and a half later.", "Electoral history": "Michigan's 8th Congressional District election, 1996PartyCandidateVotes%+%DemocraticDebbie Stabenow141,08653.76%RepublicanDick Chrysler115,83644.14%LibertarianDoug MacDonald3,8111.45%Natural LawPatricia Allen1,6790.64%Write-insWrite-ins90.00%Michigan's 8th Congressional District election, 1998PartyCandidateVotes%+%DemocraticDebbie Stabenow (incumbent)125,16957.41%RepublicanSusan Grimes Munsell84,25438.64%ReformJohn Mangopoulos4,6542.13%LibertarianBen Steele, III2,7501.26%Natural LawPatricia Rayfield Allen1,2130.56%Michigan U.S. Senate Election 2000PartyCandidateVotes%±DemocraticDebbie Stabenow2,061,95249.47RepublicanSpencer Abraham (Incumbent)1,994,69347.86GreenMatthew Abel37,5420.90LibertarianMichael Corliss29,9660.72ReformMark Forton26,2740.63ConstitutionJohn Mangopoulos11,6280.28Natural LawWilliam Quarton5,6300.14Majority67,2591.61Turnout4,165,685Democratic gain from RepublicanSwing-4.02Michigan U.S. Senate Election 2006PartyCandidateVotes%±DemocraticDebbie Stabenow (incumbent)2,151,27856.9+7.4RepublicanMichael Bouchard1,559,59741.3-6.6LibertarianLeonard Schwartz27,0120.70GreenDavid Sole23,8900.6-0.3ConstitutionDennis FitzSimons18,3410.5+0.2Majority591,68115.6Turnout3,780,142Democratic holdSwing7%Michigan U.S. Senate Election 2012PartyCandidateVotes%±DemocraticDebbie Stabenow (incumbent)2,735,82658.8%+1.9RepublicanPete Hoekstra1,767,38638.0%-3.3LibertarianScotty Boman84,4801.8%+1.1GreenHarley Mikkelson27,8900.6%-ConstitutionRichard Matkin26,0380.6%+0.1Natural LawJohn Litle11,2290.2%+0.1OthersWrite-in690.0%-Majority968,44020.8%Turnout4,652,918Democratic holdSwing2%", "introduction": "Deborah Ann Greer Stabenow /ˈstæbəˌnaʊ/ (born April 29, 1950) is an American politician who is the senior United States Senator from Michigan and a member of the Democratic Party. First elected to the Senate in 2000, she is Michigan's first female U.S. Senator. Before her election to the Senate, she was a member of the House of Representatives, representing Michigan's 8th congressional district. Previously she served on the Ingham County Board of Commissioners and in the Michigan State Legislature.\nStabenow served as Chair of the Senate Agriculture Committee from 2011 to 2015. She was re-elected to the Senate for a third term in November 2012. She became the state's senior U.S. Senator upon the retirement of Carl Levin on January 3, 2015. She became Chair of the Senate Democratic Policy Committee in 2017.\n\n"}, "personal": {"Born": "Deborah Ann Greer (1950-04-29) April 29, 1950 (age68)Gladwin, Michigan, U.S.", "Political party": "Democratic", "Spouse(s)": "Dennis Stabenow (Before 1990)Tom Athans (2003–2010)", "Children": "21 stepchild", "Education": "Michigan State University (BA, MSW)", "Signature": ""}, "timeline": {"United States Senatorfrom Michigan": {"date": "Assumed office January 3, 2001Serving with Gary Peters", "Preceded by": "Spencer Abraham"}, "Chair of the Senate Democratic Policy Committee": {"date": "Assumed office January 3, 2017", "Leader": "Chuck Schumer", "Preceded by": "Chuck Schumer"}, "Ranking Member of the Senate Agriculture Committee": {"date": "Assumed office January 3, 2015", "Preceded by": "Thad Cochran"}, "Chair of the Senate Agriculture Committee": {"date": "In officeJanuary 3, 2011– January 3, 2015", "Preceded by": "Blanche Lincoln", "Succeeded by": "Pat Roberts"}, "Secretary of the Senate Democratic Conference": {"date": "In officeJanuary 3, 2005– January 3, 2007", "Leader": "Harry Reid", "Preceded by": "Barbara Mikulski", "Succeeded by": "Patty Murray"}, "Member of the US House of Representativesfrom Michigan's 8th district": {"date": "In officeJanuary 3, 1997– January 3, 2001", "Preceded by": "Dick Chrysler", "Succeeded by": "Mike Rogers"}, "Member of the Michigan Senatefrom the 24th district": {"date": "In officeJanuary 12, 1991– January 14, 1994", "Preceded by": "William A. Sederburg", "Succeeded by": "Joe Schwarz"}, "Member of the Michigan House of Representativesfrom the 58th district": {"date": "In officeJanuary 6, 1979– January 12, 1991", "Preceded by": "Thomas Holcomb", "Succeeded by": "Dianne Byrum"}}, "code": "S000770", "type": "3", "party": "Democrat", "description": "rank-and-file Democrat", "economic": "-0.33", "social": "0.03", "leadership": "0.48"}