{'name': 'Dick.Durbin', 'picture': 'D000563.jpg', 'detail': {'Early life, education and career': "Durbin was born in East St. Louis, Illinois, to an Irish-American father, William Durbin, and a Lithuanian-born mother, Anna (née Kutkin; Lithuanian: Ona Kutkaitė). He graduated from Assumption High School in East St. Louis in 1962. During his high school years he worked at a meatpacking plant. He earned a B.S. from the School of Foreign Service at Georgetown University in 1966. He was an intern in the office of Senator Paul Douglas of Illinois during his senior year in college. Durbin earned his J.D. from Georgetown University Law Center in 1969 and was admitted to the Illinois bar later that year.After graduating from law school, Durbin started a law practice in Springfield. He was legal counsel to Lieutenant Governor Paul Simon from 1969 to 1972, and then legal counsel to the Illinois State Senate Judiciary Committee from 1972 to 1982. Durbin was an unsuccessful Democratic candidate for a seat in the Illinois State Senate in 1976. He ran for Lieutenant Governor in 1978 as the running mate of State Superintendent of Schools Michael Bakalis. They were defeated by Republican incumbents Jim Thompson and Dave O'Neal. Durbin then worked as an adjunct professor at the Southern Illinois University School of Medicine for five years while maintaining his law practice.", 'US House of Representatives': 'In 1982, Durbin won the Democratic nomination for the now-eliminated 20th congressional district, which included Macon and most of Springfield. He scored a 1,400 vote victory, defeating 22-year incumbent Paul Findley, a U.S. Navy veteran, whose district lines had been substantially redrawn to remove rural farms and add economically depressed Macon, replacing 35-percent of the voters and include more Democrats as part of the decennial redistricting.  Durbin\'s campaign emphasized unemployment and financial difficulties facing farmers, and told voters that electing him would send "a message to Washington and to President Reagan that our economic policies are not working." Durbin benefited from donations by pro-Israel groups from around the United States, in particular, concentrated support from AIPAC supporters, that were opposed to Findley\'s advocacy on behalf of the Palestine Liberation Organization in the year prior to the election. Durbin was re-elected six times, rarely facing serious opposition, and winning more than 55% of the vote in each election except 1994.', 'US Senate': "In 1996, Durbin defeated Pat Quinn to become the Democratic Party's nominee to replace the retiring Democratic incumbent, Senator Paul Simon, a long-time friend. He faced Republican State Representative Al Salvi in the November general election. Although the election had been expected to be competitive, Durbin benefited from Bill Clinton's 18-point win in Illinois that year and was able to capture a 15-point margin over his opponent.  He has since been re-elected in 2002, 2008 and 2014, each time by at least 10%.Committees Committee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related AgenciesSubcommittee on Defense (Ranking Member)Subcommittee on Financial Services and General GovernmentSubcommittee on Labor, Health and Human Services, Education, and Related AgenciesSubcommittee on State, Foreign Operations, and Related ProgramsSubcommittee on Transportation, Housing and Urban Development, and Related AgenciesCommittee on the JudiciarySubcommittee on the Constitution (Ranking Member)Subcommittee on Crime and DrugsSubcommittee on Immigration, Refugees and Border SecuritySubcommittee on Terrorism, Technology and Homeland SecuritySubcommittee on Human Rights and the LawCommittee on Rules and AdministrationCaucus memberships Bi-Cameral High-Speed & Intercity Passenger Rail CaucusCaucus on International Narcotics Control (Co-Chair)International Conservation CaucusSenate Diabetes CaucusSenate Hunger Caucus (Co-Chair)Senate Science, Technology, Engineering, and Math Education Caucus (Co-Chair)Sportsmen's CaucusCongressional COPD Caucus (Co-Chair)Senate Ukraine Caucus (Co-Chair)Afterschool CaucusesCongressional NextGen 9-1-1 CaucusLeadership In November 1998, Senate Minority Leader Tom Daschle appointed Durbin as his Assistant Democratic Whip. Following the 2004 election, Durbin became the Democratic Whip in the 109th Congress. He became the first senator from Illinois to serve as a Senate Whip since Everett Dirksen did so in the late 1950s, and the fifth to serve in Senate Leadership. Durbin served as Assistant Minority Leader from 2005 until 2007, when the Democrats became the Majority Party in the Senate. He then assumed the role of Assistant Majority Leader, or Majority Whip.In addition to his caucus duties, Durbin is Chairman of the Subcommittee on Human Rights and the Subcommittee on Financial Services and General Government.In 2000, Democratic presidential nominee Al Gore reportedly considered asking Durbin to be his running mate and candidate for Vice President of the United States. Gore ultimately selected Connecticut Senator Joe Lieberman.When Majority Leader Harry Reid faced a difficult re-election fight in 2010, some pundits predicted a possibly heated fight to succeed him between his assistant Durbin and Senator Chuck Schumer, who is well known for his fund-raising prowess. Reid's re-election victory, however, rendered such speculation moot.", 'Political positions': 'Durbin is one of the most liberal members of Congress. Mother Jones has called him a "top Senate liberal." His voting record is very similar to the Democratic caucus position, consistent with his leadership position as Whip, which has the duty of persuading senators to follow the party line in their votes.As a trial lawyer, Durbin has excellent debating abilities, so much so that majority leader Harry Reid called him "the best debater" in the U.S. senate.[citation needed]Abortion As a congressman, Durbin voted consistently to uphold existing restrictions on abortion or impose new limitations, including supporting a Constitutional amendment that would have nullified Roe v. Wade. He reversed his position in 1989 and has since voted to maintain access to abortion, including support for Medicaid funding of it, and opposition to any limitation he considers a practical or potential encroachment upon Roe. Durbin has maintained that this reversal came about due to personal reflection and his growing awareness of potentially harmful implications of his previous policy with respect to women facing dangerous pregnancies. While visiting a home for abused children in Quincy, Illinois, the director, a friend, asked him to speak with two girls who were about to turn 18 and be turned out of state care. Talking with those girls, victims of gang rape and incest, made him reconsider his position on the subject. He says, "I still oppose abortion and would try my best to convince any woman in my family to carry the baby to term. But I believe that ultimately the decision must be made by the woman, her doctor, her family, and her conscience."Darfur On March 2, 2005, then-Senator Jon Corzine presented the Darfur Peace and Accountability Act (S. 495) to the Senate. Durbin was one of 40 senators who co-sponsored that bill. The Darfur Accountability Act is noted as the premier legislative attempt to instill peace in Darfur. The bill also asks that all people involved in or deemed in some way responsible for the genocide in Darfur to be denied visas and entrance to the U.S.In 2006, Durbin co-sponsored the Durbin-Leahy Amendment to the Supplemental Appropriations bill for emergency funding to instill peace in Darfur. In 2006, he also co-sponsored the Lieberman Resolution, and the Clinton Amendment.On June 7, 2007, Durbin introduced the Sudan Disclosure Enforcement Act, which as "[a]imed at enhancing the U.S. Government\'s ability to impose penalties on violators of U.S. sanctions against Sudan." The bill called for the U.S. Security Council to vote on sanctions against the Sudanese Government for the genocide in Darfur.Durbin has voted in favor of all Darfur-related legislation. In addition to the Darfur Peace and Accountability Act, he also supported the Civilian Protection No-Fly Zone Act, the Hybrid Force Resolution, and the Sudan Divestment Authorization Act.Guantanamo Bay Durbin has openly compared the U.S. treatment of prisoners at Guantanamo Bay Naval Base to the atrocities committed by "Nazis, Soviets in their gulags, or some mad regime -- Pol Pot or others -- that had no concern for human beings." Demands that he apologize were initially rebuffed, however Durbin later apologized to the military for the 2005 remarks, which he admitted were "a very poor choice of words."Gun law Durbin received an "F" grade from the National Rifle Association for his consistent support for gun control.Durbin sent a letter to Attorney General Jeff Sessions in May 2017 asking for support in expanding the Chicago Police Department\'s violence prevention programs by expanding access to the Strategic Decision Support Centers and the National Integrated Ballistic Information Network. He also asked the Justice Department to support the Stop Illegal Trafficking in Firearms Act, which would stop illegal state-to-state gun trafficking.In response to mass shootings, such as the Orlando nightclub shooting and Las Vegas shooting, Durbin has repeatedly called for expanded gun control laws, stating that Congress would be "complicit" in the shooting deaths of people if they did not act.HIV/AIDS In March 2007, Durbin introduced the African Health Capacity Investment Act of 2007 to the Senate. The bill was designed so that over a three-year period, the U.S. would supply over $600 million to help create safer medical facilities and working conditions, and the recruitment and training of doctors from all over North America.In December 2007, Durbin and two other senators co-sponsored Senator John Kerry\'s Nondiscrimination in Travel and Immigration Act. Also, in March 2007, he joined thirty-two other senators to co-sponsor the Early Treatment for HIV Act of 2007.2001 Invasion of Afghanistan Durbin voted to approve the Authorization for Use of Military Force Against Terrorists. This act granted the executive broad military powers, and was used to justify the US\' invasion of Afghanistan in 2001, along with many subsequent military interventions.Iraq War On September 9, 2002, Durbin was the first of four Democratic senators (the others being Bob Graham, Feinstein, and Levin) on the Select Committee on Intelligence (SSCI), responding to the Bush administration\'s request for a joint resolution authorizing a preemptive war on Iraq without having prepared a National Intelligence Estimate (NIE), to ask Central Intelligence Director George Tenet to prepare a NIE on the status of Iraq\'s Weapon of mass destruction programs. Durbin was also one of few senators who read the resulting prepared October 1, 2002 NIE, Iraq\'s Continuing Programs for Weapons of Mass Destruction.On September 29, 2002, Durbin held a news conference in Chicago to announce that "absent dramatic changes" in the resolution, he would vote against the resolution authorizing war on Iraq. On October 2, 2002, at the first high-profile Chicago anti-Iraq War rally in Federal Plaza, he repeated his promise to oppose the resolution in a letter read during the rally.On October 10, 2002, the U.S. Senate failed to pass Durbin\'s amendment to the resolution to strike "the continuing threat posed by Iraq" and insert "an imminent threat posed by Iraq\'s weapons of mass destruction", by a 30-70 vote, with most Democratic senators voting for the amendment, but with 21 joining all 49 Republican senators voting against it. On October 11, 2002, Durbin was one of 23 senators to vote against the joint resolution authorizing the Iraq War.On April 25, 2007, Durbin said that as an intelligence committee member he knew in 2002 from classified information that the American people were being misled by the Bush Administration into a war on Iraq, but he could not reveal this because, as an intelligence committee member, he was sworn to secrecy. This revelation prompted an online attack ad against Durbin by the National Republican Senatorial Committee.Fair Sentencing Act Durbin authored the Fair Sentencing Act of 2010, a legislation that corrected some of the imbalance in cocaine sentencing.Immigration Durbin is the chief proponent for the Development, Relief and Education for Alien Minors (DREAM) Act, a piece of proposed federal legislation. This bill would provide certain students who entered or were brought to the nation illegally with the opportunity to earn conditional permanent residency if they arrived in the US as children, graduated from a US high school, have been in the country continuously for at least five years prior to the bill\'s enactment, submit biometric data, pass a criminal background check, and complete two years toward a four-year degree from an accredited university or complete at least two years in the military within a five-year period. Durbin\'s leadership on this issue was recognized in 2013, when the Immigrant Legal Resource Center presented him with the inaugural Nancy Pelosi Award for Immigration & Civil Rights Policy.On January 28, 2013, Durbin was a member of a bi-partisan group of eight Senators which announced principles for comprehensive immigration reform (CIR).In July 2018, Durbin said Homeland Security Secretary Kirstjen Nielsen should resign over the Trump administration family separation policy. He argued it "is and was a cruel policy inconsistent with the bedrock values of the nation," adding someone "in this administration has to accept responsibility." Tyler Houlton, a DHS spokesman, replied through Twitter that "obstructionists in Congress should get to work".Tobacco regulation In 1987, Durbin introduced major tobacco regulation legislation in the House. This bill was to ban cigarette smoking on airline flights of two hours or less. He was joined by Rep. C.W. Bill Young (R-FL), in saying that the rights of smokers to smoke end where their smoking affects the health and safety of others, such as on airplanes. The bill went on to pass as part of the 1988 transportation spending bill. In 1989, Congress banned cigarette smoking on all domestic airline flights.In March 1994, Durbin proposed an amendment to the Improving America\'s Schools Act that required schools receiving Federal drug prevention money to teach elementary and secondary students about the dangers of tobacco, drugs, and alcohol. The amendment also required schools to warn students against tobacco and teach them how to resist peer pressure to smoke.In February 2008, Durbin called on Congress to support a measure that would allow the Food and Drug Administration to oversee the tobacco industry. This measure would require companies to disclose the contents of tobacco products, restrict advertising and promotions, and it would mandate the removal of harmful ingredients in tobacco products. The measure would also prohibit tobacco companies from using terms like "low risk," "light," and "mild" on packaging.Durbin attributes his stance against tobacco smoking to his father, who smoked two packs of Camel cigarettes a day and died of lung cancer.Russia Durbin spearheaded a nonbinding resolution in July 2018 "warning President Trump not to let the Russian government question diplomats and other officials". The resolution states the United States "should refuse to make available any current or former diplomat, civil servant, political appointee, law enforcement official or member of the Armed Forces of the United States for questioning by the government of Vladimir Putin". It passed 98-0.Freedom of expression In 2007, speaking as Senate Majority Whip, Durbin went on record as stating that "It’s time to reinstitute the Fairness Doctrine."In 2010, Durbin cosponsored and passed from committee the Combating Online Infringement and Counterfeits Act, a bill aiming to combat media piracy by blacklisting websites though many opposed to the bill argue that it violates First Amendment rights and promotes censorship. The announcement of the bill was followed by a wave of protest from digital rights activists, including the Electronic Frontier Foundation calling it censorship and stating that action may be taken against all users of sites in which only some users are uploading infringing material.Durbin was a sponsor of the PROTECT IP Act.Financial crisis of 2007–2010 On April 27, 2009, in an interview with WJJG talk radio host Ray Hanania, Durbin accused banks of creating the financial crisis of 2007–2010. Durbin expressed a belief that many of the banks responsible for creating the crisis "own the place," referring to the power wielded by the banking lobby on Capitol Hill.On September 18, 2008, Durbin attended a closed meeting with congressional leaders, then-Treasury Secretary Henry Paulson and Federal Reserve Chairman Ben Bernanke, and was urged to craft legislation to help financially troubled banks. That same day (trade effective the next day), Durbin sold mutual-fund shares worth $42,696, and reinvested it all with Warren Buffett.On February 26, 2009, Durbin introduced the Protecting Consumers from Unreasonable Credit Rates Act of 2009, calling for a maximum annual interest rate cap of 36%, including all interest and fees. This bill was intended to put an end to predatory lending activities.Rod Blagojevich Shortly after Governor Rod Blagojevich\'s arrest on federal corruption charges on December 9, 2008, Durbin called for the Illinois legislature to quickly pass legislation for a special election to fill then President-elect Barack Obama\'s vacant Senate seat. He stated that no United States Senate appointment of Blagojevich\'s could produce a credible replacement under the circumstances.Durbin and Senate Majority Leader Harry Reid led all 50 members of the Senate Democratic Caucus in writing Illinois Governor Blagojevich to urge him to resign and not name a successor to Obama following Blagojevich\'s arrest.Trade In January 2005, Durbin changed his longstanding position on sugar tariffs and price supports. After several years of voting to keep sugar quotas and price supports, Durbin now favors abolishing the program. "The sugar program depended on congressmen like me from states that grew corn," Durbin said, referring to the fact that, though they were formerly a single entity, the sugar market and the corn syrup market are now largely separate.In May 2006, Durbin campaigned to maintain a $0.54 per gallon tariff on imported ethanol. Durbin justified the tariff by joining Barack Obama in stating that "ethanol imports are neither necessary nor a practical response to current gasoline prices," arguing instead that domestic ethanol production is sufficient and expanding. The American Coalition for Ethanol gave him a rating of 100%.[citation needed]American Airlines praised him for arguing for the need to lower rising oil prices.Environment Among Durbin\'s legislative causes are environmental protection, particularly the protection of the Arctic National Wildlife Refuge. League of Conservation Voters gives him a rating of 89%. Sierra Club gives him a 90% rating.[citation needed]Other positions Durbin has also been a major proponent of expanded Amtrak funding and support. In October 2007, he opposed a bill in the Illinois General Assembly that would allow three casinos to be built, saying, "I really, really think we ought to stop and catch our breath and say, \'Is this the future of Illinois? That every time we want to do something we\'ll just build more casinos?\'"Durbin reintroduced the Fair Elections Now Act during the 112th Congress. The bill would provide public funds to candidates who do not take political donations larger than $100 from any donor.In April 2013, Durbin chaired a hearing in the Senate Judiciary Subcommittee on the Constitution, Civil Rights and Human Rights concerning the moral, legal and constitutional issues surrounding targeted killings and the use of drones. Durbin stated, "Many in the national security community are concerned that we may undermine our counter-terrorism efforts if we do not carefully measure the benefits and costs of targeted killing."In June 2015, Durbin sent a letter to the prime minister of Ukraine, Arseniy Yatsinuk, about fully supporting of Yatsinuk\'s efforts of governing.Guantanamo interrogation criticism Durbin received media attention on June 14, 2005, when in the U.S. Senate chambers he compared interrogation techniques used at Camp X-Ray, Guantanamo Bay, as reported by the Federal Bureau of Investigation, to those utilized by such regimes as Nazi Germany, the Soviet Union, and the Khmer Rouge:.mw-parser-output .templatequote{overflow:hidden;margin:1em 0;padding:0 40px}.mw-parser-output .templatequote .templatequotecite{line-height:1.5em;text-align:left;padding-left:1.6em;margin-top:0}When you read some of the graphic descriptions of what has occurred here\xa0–  I almost hesitate to put them in the record, and yet they have to be added to this debate. Let me read to you what one FBI agent saw. And I quote from his report:On a couple of occasions, I entered interview rooms to find a detainee chained hand and foot in a fetal position to the floor, with no chair, food or water. Most times they urinated or defecated on themselves, and had been left there for 18–24 hours or more. On one occasion, the air conditioning had been turned down so far and the temperature was so cold in the room, that the barefooted detainee was shaking with cold.... On another occasion, the [air conditioner] had been turned off, making the temperature in the unventilated room well over 100 degrees. The detainee was almost unconscious on the floor, with a pile of hair next to him. He had apparently been literally pulling his hair out throughout the night. On another occasion, not only was the temperature unbearably hot, but extremely loud rap music was being played in the room, and had been since the day before, with the detainee chained hand and foot in the fetal position on the tile floor.If I read this to you and did not tell you that it was an FBI agent describing what Americans had done to prisoners in their control, you would most certainly believe this must have been done by Nazis, Soviets in their gulags, or some mad regime\xa0–  Pol Pot or others\xa0–  that had no concern for human beings. Sadly, that is not the case. This was the action of Americans in the treatment of their prisoners.Durbin\'s comments drew widespread criticism that comparing U.S. actions to such regimes insulted the United States and victims of genocide. Radio host Rush Limbaugh and White House deputy chief of staff Karl Rove accused Durbin of treason, while former Speaker of the House Newt Gingrich called on the Senate to censure Durbin. Chicago Mayor Richard Daley, whose son Patrick was serving in U.S. Army, also called on Durbin to apologize for his remarks, saying that he thought it was a "disgrace to say that any man or woman in the military would act like that." John Wertheim, Democratic state party chairman of New Mexico, and Jim Pederson, Arizona Democratic party chairman, also criticized Durbin\'s remarks. The leader of the Veterans of Foreign Wars also demanded an apology, as did the Anti-Defamation LeagueDurbin initially did not apologize, but on June 21, 2005, he went before the Senate, saying, "More than most people, a senator lives by his words ... occasionally words fail us, occasionally we will fail words."Andrew Sullivan, former editor of The New Republic, praised Durbin for raising serious moral issues about U.S. policy. Other commentators, including liberal commentator Markos Moulitsas Zúniga of Daily Kos, condemned Durbin for apologizing to his critics, arguing Durbin made a mistake in making himself, rather than detention and torture concerns at Guantanamo Bay, the focus of media coverage.Attempts to remove PAC radio advertisements In July 2014, Americas PAC, a Political Action Committee designed to elect conservative Republicans, released a radio advertisement attacking Durbin on his staff salaries. This was based upon a Washington Times article that stated Durbin\'s female staff members made $11,000 less annually than his male staffers. In response, lawyers representing Durbin submitted a letter claiming the information in the ad was false and that the radio stations would be liable for airing the ad, with the possibility of losing their FCC license. The radio station stated the sources provided to back up the information provided by Americas PAC were checked and proved to be in line and that they would keep the radio advertisement on air.', 'Electoral history': "Illinois's 20th congressional district: Results 1982–1994YearDemocraticVotesPctRepublicanVotesPct1982Richard J. Durbin100,7587001504000000000000♠50.4%Paul Findley (inc.)99,3487001496000000000000♠49.6%1984Richard J. Durbin (inc.)145,0927001613000000000000♠61.3%Richard Austin91,7287001387000000000000♠38.7%1986Richard J. Durbin (inc.)126,5567001681009999900000♠68.1%Kevin McCarthey59,2917001319000000000000♠31.9%1988Richard J. Durbin (inc.)153,3417001689000000000000♠68.9%Paul Jurgens69,3037001311000000000000♠31.1%1990Richard J. Durbin (inc.)130,1147001662000000000000♠66.2%Paul Jurgens66,4337001338009999900000♠33.8%1992Richard J. Durbin (inc.)154,8697001565000000000000♠56.5%John M. Shimkus119,2197001435000000000000♠43.5%1994Richard J. Durbin (inc.)108,0347001548000000000000♠54.8%Bill Owens88,9647001452000000000000♠45.2%United States Senator (Class II): Results 1996–2014YearDemocraticVotesPctRepublicanVotesPct1996Richard J. Durbin2,384,02856%Al Salvi1,728,82441%2002Richard J. Durbin2,103,76660%Jim Durkin1,325,70338%2008Richard J. Durbin3,516,84668%Steve Sauerberg1,479,98429%2014Richard J. Durbin1,929,63753.5%Jim Oberweis1,538,52242.7%", 'Personal life': 'This section needs expansion. You can help by adding to it. (August 2012)Family Durbin and his wife Loretta have had three children, Christine, Jennifer and Paul. After several weeks in the hospital with complications due to a congenital heart condition, Christine died on November 1, 2008.Conflict of Interest Issues Durbin\'s wife Loretta was a lobbyist, and it was reported by the Chicago Tribune in 2014 that some of her "clients have received federal funding promoted by [Durbin]". In addition to announcing the award of monies to ten clients of his wife\'s lobbying firm, these conflicts included her lobbying firm receiving a one-year contract with a housing nonprofit group around the time the senator went to bat for the organization; a state university receiving funds through an earmark by Durbin when his wife was its lobbyist; and Durbin arranging federal money for a public health nonprofit when his wife was seeking state support for the same group. The Durbins maintain that they try to avoid conflicts of interest, however.Religion Dick Durbin is Roman Catholic. In 2004, the Roman Catholic Diocese of Springfield in Illinois barred him from receiving communion because he voted against the Partial-Birth Abortion Ban Act. The current bishop of the Diocese said Durbin stays away from his Springfield parish because "he doesn\'t want to make a scene."  Durbin responded to the communion ban in 2004 saying that he is accountable to his constituents, even if it means defying Church teachings. In 2018, the decision to deny Durbin communion in the Springfield Diocese was affirmed by Bishop Thomas John Paprocki after Durbin\'s vote against the Pain-Capable Unborn Child Protection Act. Durbin continues to practice his faith, attending mass and receiving communion at Old Saint Patrick\'s church in Chicago.In 2017, Durbin was criticized by the editorial board at his alma mater, Georgetown, a Catholic university, for his requesting a clarification of then-judicial nominee Amy Coney Barrett during her Judiciary Committee confirmation hearing, regarding her self-descriptive terminology, "orthodox Catholic." He contended that might unfairly characterize Catholics who may not agree with the church\'s positions about abortion or the death penalty. She contended, "litigants and the general public are entitled to impartial justice, and that may be something that a judge who is heedful of ecclesiastical pronouncements cannot dispense."  Barrett opined that judges aren\'t bound by precedent conflicting with the Constitution. Barrett wrote that judges could recuse themselves from hearing matters if their faith conflicted with issues to be decided in cases they might otherwise hear. A article in the conservative National Review contended, "Senators must inquire about these issues when considering lifetime appointments because ensuring impartiality and fidelity to precedent are critical for the rule of law." The issue prompted questions regarding the application of Article VI, Section 3 of the Constitution which mandates: "No religious test shall ever be required as a qualification to any office or public trust under the United States."Film and television appearances FilmYearTitleRoleNotes2010Pricele$$HimselfDocumentary2015The Gettysburg AddressHimselfDocumentary', 'Further reading': 'Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of Congress', 'introduction': 'Richard Joseph Durbin (born November 21, 1944) is an American politician serving as the senior United States Senator from Illinois since 1997. He has been the Assistant Democratic Leader, the second-highest position in the Democratic Party leadership in the Senate, since 2005, serving as Minority Whip from 2005 to 2007, Majority Whip from 2007 to 2015, and Minority Whip again since 2015.\nDurbin was born in East St. Louis, Illinois. He graduated from the Georgetown University School of Foreign Service and Georgetown University Law Center. Working in state legal counsel throughout the 1970s, he made an unsuccessful run for Lieutenant Governor of Illinois in 1978. He was elected to the U.S. House of Representatives in 1982, representing the Springfield-based 20th congressional district. In 1996, he won election to the U.S. Senate by an unexpected 15-point margin. He has served as Senate Democratic Whip since 2005, and for a period of eight years (2007–2015) served as the Senate Majority Whip. He is currently dean of the Illinois congressional delegation, as he has served in Congress since 1983 as a U.S. Representative from Illinois 20th Congressional District, and from 1997 as a U.S. Senator from Illinois.\nDurbin now serves as the Senate Minority Whip following the 2014 midterm election, where the Republicans gained a majority in the U.S. Senate and when he won reelection, beating his Republican opponent, Jim Oberweis, by a margin of 53.55% to 42.69%.\n\n'}, 'personal': {'Born': 'Richard Joseph Durbin (1944-11-21) November 21, 1944 (age73)East St. Louis, Illinois, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Loretta Schaefer', 'Children': '3', 'date': 'EducationGeorgetown University (BS, JD)', 'Website': 'Senate website'}, 'timeline': {'Senate Minority Whip': {'date': 'In officeJanuary 3, 2005– January 3, 2007', 'Leader': 'Harry Reid', 'Preceded by': 'Harry Reid', 'Succeeded by': 'Trent Lott'}, 'United States Senatorfrom Illinois': {'date': 'Assumed office January 3, 1997Serving with Tammy Duckworth', 'Preceded by': 'Paul Simon'}, 'Senate Majority Whip': {'date': 'In officeJanuary 3, 2007– January 3, 2015', 'Leader': 'Harry Reid', 'Preceded by': 'Mitch McConnell', 'Succeeded by': 'John Cornyn'}, "Member of the US House of Representativesfrom Illinois's 20th district": {'date': 'In officeJanuary 3, 1983– January 3, 1997', 'Preceded by': 'Paul Findley', 'Succeeded by': 'John Shimkus'}}, 'code': 'D000563'}