{"name": "Doris.Matsui", "picture": "M001163.jpg", "detail": {"Early life and career": "Matsui was born Doris Okada in the Poston War Relocation Center internment camp in Poston, Arizona, and grew up in Dinuba, in California's Central Valley. While attending the University of California, Berkeley, where she earned a B.A. in psychology, she met her husband. They had one child, Brian.Matsui was a housewife and socialite and was active in the group \"Lawyers' Wives\", now called the Legal Auxiliary of Sacramento, while her husband was a local attorney and served on the Sacramento city council before his election to congress in 1979. The Matsuis moved to Washington DC shortly thereafter where they raised their son Brian.Doris Matsui was a volunteer on Bill Clinton's 1992 presidential campaign. When he was elected, Matsui served on his transition team. Following the inauguration, she was appointed deputy special assistant to the president and deputy director of public liaison, working under Alexis Herman. One of her duties was to work with the Asian American community.[citation needed] The President appointed her to the board of the Woodrow Wilson International Center for Scholars in September 2000.She served in the White House from 1993 to 1998. Later she became a lobbyist in Washington where she represented corporate clients until 2005 when she returned to California to run for Congress against a field of local Democrats.", "US House of Representatives": "Tenure Matsui's husband, Congressman Bob Matsui, died from complications of myelodysplastic syndrome on January 1, 2005. On January 9, 2005, the day after his funeral, Matsui told supporters she was running for his open seat. In the special election she garnered 68% of the vote. Press reports said that Matsui won the election before the polls opened as most votes in the election were absentee ballots, which she won overwhelmingly.[citation needed] Congresswoman Matsui was elected to a full term in 2006 and has been reelected four more times without serious difficulty. The 6th is the most Democratic district in interior California; it and its predecessors have been in Democratic hands without interruption since 1953.In her inaugural speech, she spoke of the many people who encouraged her to run and her family. She pledged to continue the work of her husband, especially regarding flood control projects in Sacramento, the main city in the district.Matsui is a member of the House Committee on Energy and Commerce. As a member, she has been focused on making the Sacramento area a hub clean technology.In 2007, Speaker Nancy Pelosi appointed Matsui to the Smithsonian Institution's Board of Regents, where she served until 2011. Matsui was one of only three House Members to sit on the board. In 2007, Matsui was instrumental in developing an overhaul of the oversight and accountability practices of the Smithsonian.Matsui served as convention parliamentarian of the 2008 Democratic National Convention in Denver, Colorado.She supports full disclosure of campaign finances for politicians and desires more fair elections, as well as extending election periods to grab more of the population. She has also expressed support for whistle-blowers' protection to promote transparency in both business and government.Budget Matsui has been a supporter of earmarks, which have been a controversial topic. She defended her position, saying \"members of Congress know their districts pretty well and know what they need.\"Matsui has supported raising the debt limit by 2.4 trillion dollars for federal spending and has supported numerous bailouts and federal funds injections. In 2008 she supported a 15 billion dollar bailout for GM and another 60 billion dollar stimulus in the hopes to stimulate the US economy. She supported the initial TARP bailout funds and the 825 billion dollar continuation of 2009 in the hopes of avoiding recession. She later supported an additional 198 billion dollar stimulus package. She supports expanding agencies to meet the needs of citizens, rather than cutting spending and reform.Matsui voted to raise Senator's salary in 2009. She also voted to raise the minimum wage in 2007 and extend unemployment benefits from 39 to 59 weeks.Taxes Matsui supports a progressive tax system and seeks to shut down off-shore loopholes for business. She voted against continuing capital gains and dividend tax breaks. She supports extending AMT exemptions which benefit higher-income taxpayers in states like California with high state income taxes.Corporations Matsui is a pro-labor politician and supports an initiative to have shareholders vote for executive compensation at companies.Social security Matsui is strongly in favor of continuing social security as it is now, and opposes any move to privatize it or allow citizens the option to have alternative retirement funds. She also opposes raising the retirement age, despite the significantly increased longevity of the average American since the establishment of social security.Healthcare In a discussion about the Patient Protection and Affordable Care Act, Matsui said that as \"more Americans get to know and understand the law, and feel its effects in their lives, the less the public will want to see us take steps back to the broken health care system we have experienced for decades in this country.\" She has opposed many attempts to repeal, reduce, or privatize medicare or medicaid. In addition she has sought to expand medical coverage to children and mental patients. She voted against patients being denied treatment for non-emergency issues without a medicare copay.She seeks to establish databases for childhood cancer and diabetes to better meet the needs of patients and diffuse information for better treatment. She supports tobacco being regulated as a drug.Drugs She voted to increase funding to Mexico to fight against the drug cartels. Her rating by NORML indicates that she is 'hard on drugs'. Matsui supports the distribution of clean and sterile syringes to reduce spread of HIV and Hepatitis.Abortion Matsui is pro-choice and received an endorsement from NARAL She supports federal health funding that includes abortion funding. She has a focus on preventing unwanted pregnancies all together, through funding contraception programs and make them readily available. She supports emergency contraceptive capabilities in hospitals for rape victims. Matsui opposes the restriction of minors traveling across states for abortion procedure.She has voted to continue human embryonic stem cell research.Gay rights Matsui is a strong supporter of gay rights and was given a rating of 100% by the HRC. Her definition of marriage does not prohibit same-sex partners. She opposes discrimination in the workplace and in schools based on sexual orientation. She has also voted to enforce laws against anti-gay crimes. She supported the repeal of Don't-Ask-Don't-Tell and sought the reinstatement of gay soldiers who had been discharged from the military.Energy Matsui supports American energy independence and desires that the US will be running on at least 25% renewable energy by the year 2025. She opposes the expansion of oil production and has voted against building new refineries, off-shore drilling, and subsidies for oil and gas exploration. She voted to provide tax subsidies for investment in renewable, alternative sources of energy.Environment Matsui supports an initiative to develop green public schools across the nation. She endorses cash-for-clunkers and voted to provide 2 billion dollars more for the program. She is a pro-animal supporter and seeks to regulate dog kennels and hold tighter prohibition against animal fighting. She has voted to increase wildlife protection from endangerment. Matsui was a supporter of the Clean Water Act and thus seeks cleaner beaches, lakes, and other bodies of water. She voted to allow the EPA to regulate greenhouse gases and promotes strict limits to pollution levels for industries.  She supports individual states creating even stricter emission standards than the federal government.She has supported the expansion of Amtrak to provide a better public transportation option for the public.Gun control Matsui seeks to expand gun control and supports stricter regulations on gun purchases and sales. She supports banning large-scale purchases of ammunition and seeks to end the gun show loophole. Matsui supports firearms manufacturers being held responsible for product misuse cases and lawsuits.Committee assignments Committee on Energy and CommerceSubcommittee on Communications and TechnologySubcommittee on EnvironmentSubcommittee on HealthSubcommittee on Digital Commerce & Consumer ProtectionCaucuses and other memberships Congressional Asian Pacific American CaucusNational Service Caucus (Co-Chair)Smithsonian Institution’s Board of RegentsSmithsonian Regents’ Governance CommitteeCongressional High-Tech CaucusCongressional Arts CaucusCongressional NextGen 9-1-1 CaucusAfterschool CaucusesCo-chair, Congressional Caucus on Women's Issues", "Electoral history": "Special Election for California's 5th Congressional District, March 8, 2005PartyCandidateVotes%DemocraticDoris Matsui56,17568.2DemocraticJulie Padilla7,1588.7RepublicanJohn Thomas Flynn6,5598.0RepublicanSerge A. Chernay3,7424.5RepublicanMichael O'Brien2,5913.1RepublicanShane Singh1,7532.1RepublicanBruce Robert Stevens1,1241.4GreenPat Driscoll9761.2IndependentLeonard Padilla9161.1DemocraticCharles \"Carlos\" Pineda, Jr.6590.8LibertarianGale Morgan4510.6Peace and FreedomJohn C. Reiger2860.3IndependentLara Shapiro6 (write-in)0.0Total votes82,396100Turnout Democratic holdUnited States House of Representatives elections, 2006PartyCandidateVotes%DemocraticDoris Matsui (incumbent)105,67670.8RepublicanClaire Yan35,10623.6GreenJeff Kravitz6,4664.3Peace and FreedomJohn C. Reiger2,0181.3Total votes149,266100Turnout Democratic holdUnited States House of Representatives elections, 2008PartyCandidateVotes%DemocraticDoris Matsui (incumbent)164,24274.3RepublicanPaul A. Smith46,00220.9Peace and FreedomL. R. Roberts10,7314.8IndependentDavid B.Lynch180 (write-in)0.0Total votes221,155100Turnout Democratic holdUnited States House of Representatives elections, 2010PartyCandidateVotes%DemocraticDoris Matsui (incumbent)124,22072.1RepublicanPaul A. Smith43,55725.3Peace and FreedomGerald Allen Frink4,5942.6RepublicanTony Lacy (write-in)190Total votes172,410100Turnout Democratic holdUnited States House of Representatives primary election, 2012PartyCandidateVotes%DemocraticDoris Matsui (incumbent)67,17471.4RepublicanJoseph McCray, Sr.15,64716.6RepublicanErik Smitt11,25412.0Total votes94,075100United States House of Representatives elections, 2012PartyCandidateVotes%DemocraticDoris Matsui (incumbent)160,66775.1RepublicanJoseph McCray Sr.53,40624.9Total votes214,073100Turnout Democratic holdUnited States House of Representatives elections, 2014PartyCandidateVotes%DemocraticDoris Matsui (incumbent)97,00872.7RepublicanJoseph McCray Sr.36,44827.3Total votes133,456100Turnout Democratic holdUnited States House of Representatives primary election, 2016PartyCandidateVotes%DemocraticDoris Matsui (incumbent)99,59970.4RepublicanRobert \"Bob\" Evans26,00018.4DemocraticJmar Jefferson7,6315.4IndependentMario Galván6,3544.5IndependentYuriy Seretskiy1,9301.4", "Personal life": "A widow, Matsui has one son, Brian. She has two grandchildren, Anna and Robby.She is a Methodist.", "introduction": "Doris Okada Matsui (/ˌmætˈsuːi/; born September 25, 1944) is the U.S. Representative for California's 6th congressional district. She is a member of the Democratic Party. The district, numbered as the 5th District from 2005 to 2013 consists of the city of Sacramento and the surrounding area. Following the death on January 1, 2005, of her husband, Bob Matsui, she was elected as his replacement in a special election on March 8, 2005, and took the oath on March 10, 2005.\n\n", "code": "06"}, "personal": {"Born": "Doris Okada (1944-09-25) September 25, 1944 (age74)Poston, Arizona, U.S.", "Political party": "Democratic", "Spouse(s)": "Bob Matsui(m.1966; d.2005)", "Children": "1 son", "Education": "University of California, Berkeley (BA)"}, "timeline": {"Member of theUS House of Representativesfrom California": {"date": "Assumed office March 10, 2005", "Preceded by": "Bob Matsui", "Constituency": "5th district (2005–2013)6th district (2013–present)"}, "code": "06"}, "code": "M001163", "type": "4", "party": "Democrat", "description": "rank-and-file Democrat", "economic": "-0.43", "social": "-0.17", "leadership": "0.4"}