{'name': 'Doug.LaMalfa', 'picture': 'L000578.jpg', 'detail': {'Early life, education and career': "LaMalfa is a fourth-generation rice farmer and a lifelong Northern California resident.  He graduated from Cal Poly San Luis Obispo with a Bachelor's degree in Ag/Business.   He and his wife, Jill, along with their four children, make their home on the family rice farm in Richvale, an unincorporated suburban community south of Chico, that was founded by his great-grandfather in 1931.LaMalfa is an owner and manager of the Dsl Lamalfa Family Partnership, which owns and operates the family farm.", 'California Assembly': 'Elections In 2002, LaMalfa ran for the California Assembly in the 2nd District. He won the Republican primary with 59% of the vote, and the general election with 67%. He won re-election in 2004 (68%) and 2006 (68%).Tenure LaMalfa worked with Bernie Richter as an early supporter of Proposition 209, which ended affirmative action in California. He worked for passage of the Protection of Marriage Act, Proposition 22, which banned Same-sex marriage in California, and after that initiative was overturned by the courts, he was an early supporter and active in the Proposition 8 campaign.LaMalfa opposed Mike Feuer\'s microstamping bill, AB 1471, which was signed into law by Governor Arnold Schwarzenegger on October 13, 2007.LaMalfa was a co-author of ACA 20, which, similar to Arizona\'s new law, would empower law enforcement to act as Immigration, Customs Enforcement Agents and would have cracked down on illegal immigration. ACA 20 failed to pass the first hearing by a 3-to-6 vote.[citation needed]In 2007, he successfully passed AB 1645, a law that would prevent seizures of firearms in the event of an emergency or natural disaster. This was the first pro-gun legislation passed and signed into law in a decade. When LaMalfa was named the California Rifle and Pistol Association\'s "Legislator of the Year" for 2007, he said "Receiving this award today from the California Rifle and Pistol Association is a truly humbling honor."Committee assignments Joint Committee on Legislative AuditPublic SafetyWest Nile virus', 'California Senate': '2010 election In 2010, he ran for the California State Senate in the 4th District. In the Republican primary, he defeated State Representative Rick Keene 58%–42%. In the general election, he defeated Lathe Gill 68%–32%.Tenure In November 2011, LaMalfa opposed a proposed bullet train. He did so, saying "In light of the High Speed Rail plan that was submitted and that the numbers still do not work, California in this dire fiscal crisis that we\'re in, we\'re going to introduce legislation to repeal the HSR Authority and the funding for that the state was going to put forward".LaMalfa gave Democratic Governor Jerry Brown a "C" for his fiscal policies in 2011.LaMalfa opposed a bill that would require history teachers in all California public schools to teach history of homosexuality and gay civil rights. LaMalfa stated the Governor Brown was "out of touch with what I think are still mainstream American values. That\'s not the kind of stuff I want my kids learning about in public school. They\'ve really crossed a line into a new frontier."LaMalfa strongly opposed the National Popular Vote Interstate Compact, which would eliminate the Electoral College. He argued "I think this is dangerous. It flies in the face of 220 years of election law. We have an electoral college; it was put there for a reason."Committee assignments AgricultureBudget and Fiscal ReviewElections and Constitutional Amendments (Vice Chair)Governance and FinanceNatural Resources and Water (Vice Chair)Veterans AffairsJoint Committee on Legislative AuditJoint Committee on Fairs, Allocation, and Classification (Chair)Joint Committee on Fisheries and Aquaculture', 'US House of Representatives': "Elections 2012 In January 2012, 2nd district Congressman Wally Herger announced that he was retiring after thirteen terms. Hours after Herger announced his retirement, Republican consultant Dave Gilliard told Flash Report that Herger had endorsed LaMalfa as his successor in the district, which was renumbered as the 1st District in the 2010 round of redistricting. LaMalfa finished first in the June 2012 primary election with 38% of the vote in an eight-person race, winning 10 out of the district's 11 counties.On November 6, 2012, LaMalfa defeated Democratic Party candidate Jim Reed 57%–43%.2014 LaMalfa defeated Democrat Heidi Hall in the general election with 61% of the vote.2016 In the 2016 general election, LaMalfa defeated Democratic nominee Jim Reed with 59.1% of the vote.2018 LaMalfa is running for re-election. He will face Democrat Audrey Denney in the general election.Committee assignments Committee on AgricultureSubcommittee on General Farm Commodities and Risk ManagementSubcommittee on Horticulture, Research, Biotechnology, and Foreign AgricultureCommittee on Natural ResourcesSubcommittee on Indian and Alaska Native AffairsSubcommittee on Public Lands and Environmental RegulationSubcommittee on Water and PowerCaucus memberships Congressional Western CaucusRepublican Study Committee", 'Political positions': 'Farming From 1995 to 2016, LaMalfa was the recipient of the largest amount of money from agricultural subsidies: over $1.7 million. As a member of the House Agricultural Committee, he oversees farm subsidies. In 2017, his spokesman, Parker Williams, stated that LaMalfa "voted to end direct farm subsidy payments in the very first farm bill he worked on" and that a new farm bill proposed does not provide subsidies for rice grown in California, a crop that LaMalfa farms.Immigration LaMalfa has an A+ rating from NumbersUSA, an organization that opposes illegal immigration.LGBT rights In 2014, LaMalfa was named one of the most "anti-LGBT" politicians in congress by the Human Rights Campaign. He does not believe in same-sex marriage and feared that legalizing it would "open the floodgates" for polygamy to be legalized. He believes marriage is "an institution created by God and supposed to be held up and respected by men. And women." He endorsed the First Amendment Defense Act.Voter fraud He stated that "California is just a sieve on its voter security" but does not think his own district had "illegal votes" because it does not "have the demographics that would be a really big push of that."Gun policy LaMalfa\'s website states that he is "proud to have earned an A rating and the endorsements of the NRA and Gun Owners of America." He has received $13,500 from the NRA.Taxes LaMalfa voted in favor of the Tax Cuts and Jobs Act of 2017. According to LaMalfa, the bill will enable his constituents to save more money and provide them tax relief. He says that the tax bill will give a "booster shot to the U.S. economy". He believes that the bill enable businesses to hire more workers and that there will be more products made in the USA as a result, especially in Redding.', 'Electoral history': 'California Assembly 2nd District Republican Primary Election, 2002PartyCandidateVotes%RepublicanDoug LaMalfa32,00458.80RepublicanPat Kight12,46722.90RepublicanJohn Byrne8,13114.90RepublicanDan Ryhal1,8633.40California Assembly 2nd District Election, 2002PartyCandidateVotes%RepublicanDoug LaMalfa79,36167.40DemocraticDoug Kinyon34,52429.30LibertarianPete Bret3,9963.30California Assembly 2nd District Election, 2004PartyCandidateVotes%RepublicanDoug LaMalfa (inc.)115,65164.90DemocraticBarbara McIver62,64335.10California Assembly 2nd District Election, 2006PartyCandidateVotes%RepublicanDoug LaMalfa (inc.)95,72368.10DemocraticMel Smith41,42529.50Peace and FreedomPhil Dynan3,4742.40California Senate 4th District Republican Primary Election, 2010PartyCandidateVotes%RepublicanDoug LaMalfa72,74257.80RepublicanRick Keene53,12942.20California Senate 4th District Election, 2010PartyCandidateVotes%RepublicanDoug LaMalfa226,23968.30DemocraticLathe Gill105,46031.70California 1st Congressional District Primary Election, 2012PartyCandidateVotes%RepublicanDoug LaMalfa66,52737.90DemocraticJim Reed43,40924.80RepublicanSam Aanestad25,22414.40RepublicanMichael Dacquisto10,5306.00RepublicanPete Stiglich10,2585.80DemocraticNathan Arrowsmith8,5984.90IndependentGary Allen Oxley5,9013.40RepublicanGregory Cheadle4,9392.80California 1st Congressional District Election, 2012PartyCandidateVotes%RepublicanDoug LaMalfa168,82757.40DemocraticJim Reed125,38642.60California 1st Congressional District Primary Election, 2014PartyCandidateVotes%RepublicanDoug LaMalfa (inc.)75,31753.40DemocraticHeidi Hall42,48130.10RepublicanGregory Cheadle13,9099.90DemocraticDan Levine9,2136.50California 1st Congressional District Election, 2014PartyCandidateVotes%RepublicanDoug LaMalfa (inc.)132,05261.00DemocraticHeidi Hall84,32039.00California 1st Congressional District Primary Election, 2016PartyCandidateVotes%RepublicanDoug LaMalfa (inc.)86,13640.80DemocraticJim Reed59,66528.30RepublicanJoe Montes35,87517.00DemocraticDavid Peterson13,4306.40RepublicanGary Allen Oxley6,8853.30IndependentJeff Gerlach4,9582.30RepublicanGregory Cheadle4,2172.00California 1st Congressional District Election, 2016PartyCandidateVotes%RepublicanDoug LaMalfa (inc.)185,44859.05DemocraticJim Reed128,58840.95California 1st Congressional District Primary Election, 2018PartyCandidateVotes%RepublicanDoug LaMalfa (inc.)98,35451.7DemocraticAudrey Denney34,12117.9DemocraticJessica Jones Holcombe22,30611.7DemocraticMarty Walters16,0328.4RepublicanGregory Edward Cheadle11,6606.1DemocraticDavid Peterson5,7073.0GreenLewis Elbinger2,1911.2', 'introduction': "Douglas L. LaMalfa (born July 2, 1960) is an American politician. A Republican, he has been the U.S. Representative for California's 1st congressional district, located in Northern California, since 2013. LaMalfa previously served in the California State Assembly, representing the 2nd district, from 2002 to 2008, and he served in the California State Senate, representing the 4th district, from 2010 to 2012.\n\n", 'code': '01'}, 'personal': {'Born': ' (1960-07-02) July 2, 1960 (age58)Oroville, California, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Jill LaMalfa', 'Children': '4', 'Education': 'Butte CollegeCalifornia Polytechnic State University, San Luis Obispo (BS)', 'Website': 'House website'}, 'timeline': {"Member of the US House of Representativesfrom California's 1st district": {'date': 'Assumed office January 3, 2013', 'Preceded by': 'Mike Thompson'}, 'Member of the California State Senatefrom the 4th district': {'date': 'In officeDecember 6, 2010– August 31, 2012', 'Preceded by': 'Sam Aanestad', 'Succeeded by': 'Jim Nielsen'}, 'Member of the California State Assemblyfrom the 2nd district': {'date': 'In officeDecember 2, 2002– December 1, 2008', 'Preceded by': 'Richard Dickerson', 'Succeeded by': 'Jim Nielsen'}, 'code': '01'}, 'code': 'L000578'}