{'name': 'Doug.Jones', 'picture': 'P000449.jpg', 'detail': {'Early life and education': 'Doug Jones was born in Fairfield, Alabama, to Gordon and Gloria Jones. His father worked at U.S. Steel, and his mother was a homemaker. Jones graduated from the University of Alabama with a Bachelor of Science in Political Science in 1976, and earned his Juris Doctor from Cumberland School of Law at Samford University in 1979. He is a member of Beta Theta Pi.He began his career by working as staff counsel to the U.S. Senate Judiciary Committee for Democratic Senator Howell Heflin from Alabama. Jones then worked as an Assistant U.S. Attorney from 1980 to 1984 before resigning to work at a private law firm in Birmingham, Alabama, from 1984 to 1997.', 'US Attorney': "President Bill Clinton announced on August 18, 1997, his intent to appoint Jones as U.S. Attorney for the Northern District of Alabama, and formally nominated Jones to the post on September 2, 1997. On September 8, 1997, the U.S. District Court for the Northern District of Alabama appointed Jones as interim U.S. Attorney. The Senate confirmed Jones' nomination on November 8, 1997, by voice vote.In January 1998, Eric Rudolph bombed the New Woman All Women Health Care Center in Birmingham. Jones became responsible for coordinating the state and federal task force in the aftermath, and advocated for Rudolph to be tried first in Birmingham before being extradited and tried in Georgia for his crimes in that state, such as the Centennial Olympic Park bombing.16th Street Baptist Church bombing case Jones prosecuted Thomas Edwin Blanton Jr. and Bobby Frank Cherry, two members of the Ku Klux Klan, for their roles in the 1963 16th Street Baptist Church bombing. The case was reopened the year before Jones was appointed, but did not pick up traction until his appointment. A federal grand jury was called in 1998 which piqued the attention of Cherry's ex-wife, Willadean Cherry, and led her to call the FBI to report her testimony. Willadean then introduced Jones to family and friends who reported their own experiences from the time of the bombing. A key piece of evidence was a tape from the time of the bombing in which Blanton stated that he had plotted with others to make the bomb. Jones was deputized in order to argue in state court and was able to indict Blanton and Cherry in 2000. Blanton was found guilty in 2001, and Cherry was found guilty in 2002. Both Blanton and Cherry were sentenced to life in prison. Blanton was up for parole in 2016, at which Jones spoke in opposition to his potential release. Blanton's parole was denied. Cherry died in prison in 2004.", 'Later legal career': "Jones left office in 2001 and returned to private practice. In 2004, he was court-appointed General Special Master in an environmental clean-up case involving Monsanto in Anniston, Alabama. In 2007 Jones was honored with the 15th Anniversary Civil Rights Distinguished Service Award from the Birmingham Civil Rights Institute. Also in 2007, Jones testified before the United States House Committee on the Judiciary about the importance of re-examining crimes of the Civil Rights Era. He created the Birmingham firm Jones & Hawley, PC with longtime friend Greg Hawley in 2013. He was named one of B-Metro Magazine's Fusion Award winners in 2015. In 2017 he received the Lifetime Achievement Award from the Alabama chapter of the Young Democrats of America.", 'US Senate': "2017 election On May 11, 2017, Jones announced his candidacy for that year's U.S. Senate special election, running for the seat left open when Jeff Sessions was appointed as Attorney General. Sessions, a Republican, had held the Senate seat since being elected in 1996, when Democrat Howell Heflin chose not to run for re-election, and had kept it through three re-elections. Jones won the Democratic nomination in August, and became the Senator-elect for Alabama after defeating Republican former Alabama Supreme Court judge Roy Moore in the general election on December 12, 2017, which was also Jones' 25th wedding anniversary. Jones received 673,896 votes (50.0%) to Moore's 651,972 votes (48.3%) with 22,852 write-in votes (1.7%). After the election, Moore refused to concede. He filed a lawsuit attempting to block the state from certifying the election and calling for an investigation into voter fraud, as well as a new election. On December 28, 2017, a judge dismissed this lawsuit and state officials certified the election results, officially declaring Jones the winner.Tenure Jones was sworn in on January 3, 2018, and his term will run through January 3, 2021, the remaining balance of Sessions' term. He is the first Democrat to represent the state in the U.S. Senate in 21 years, and the first elected in 25. Jones was one of five Democratic senators who voted for the continuing resolution that failed to pass and consequently led to the United States federal government shutdown of 2018.According to Morning Consult, which polls approval ratings of senators, as of  July\xa025, 2018[update], Jones sits with a 45% approval rating, with 28% disapproving. This is close to Jones' fellow senator, Republican Richard Shelby, who sits with a 48% approval rating with 30% disapproving.Committee assignments Committee on Banking, Housing, and Urban AffairsSubcommittee on Economic PolicySubcommittee on Housing, Transportation, and Community DevelopmentSubcommittee on Securities, Insurance, and InvestmentCommittee on Health, Education, Labor and PensionsSubcommittee on Employment and Workplace SafetySubcommittee on Primary Health and Retirement SecurityCommittee on Homeland Security and Governmental AffairsSubcommittee on Federal Spending Oversight and Emergency ManagementSpecial Committee on Aging", 'Political positions': 'The editorial board of The Birmingham News has described Jones as a "moderate Democrat." Former Alabama Democratic Party chair Giles Perkins described Jones as "a moderate, middle-of-the-road guy." Describing his own views, Jones said that “If you look at the positions I\'ve got on health care, if you look at the positions I [have] got on jobs, you should look at the support I have from the business community; I think I’m pretty mainstream." Jones\' campaign has emphasized "kitchen table" issues such as healthcare and the economy. He has called for bipartisan solutions to those issues, and pledged to "find common ground" between both sides of the aisle. Senator Jones said that people should not "expect [him] to vote solidly for Republicans or Democrats".  During his election campaign, Jones received bipartisan support including from Republican Senator Jeff Flake (Arizona). According to FiveThirtyEight, which tracks Congressional votes, Senator Jones has voted with President Trump\'s position 50% of the time as of  July\xa02018[update].Social issues Jones supports the reversal of mandatory three-strikes laws for non-violent offenses to give judges flexibility in giving sentences. Jones opposed both immigration bills that were proposed in the Senate since he entered office.Abortion Doug Jones is pro-choice on the issue of abortion. However, in 2017 Jones was endorsed by the Campaign for Working Families which is a pro-life PAC. In 2018, Planned Parenthood, which is pro-choice, gave Jones a 100% rating while the anti-abortion National Right to Life Committee gave him a 0% rating. Jones voted against the Pain-Capable Unborn Child Protection Act, which prohibits abortion after 20 weeks, except in cases of rape, incest, and danger to the pregnant woman\'s health. He also pledged to support Planned Parenthood as a Senator.Gun control Jones supports some gun control measures including "tighter background checks for gun sales and to raise the age requirement to purchase a gun from 18 to 21." However, Jones said that he does not support an assault weapons ban and that such a ban could not pass Congress. Jones is himself a gun owner.LGBT rights Jones is supportive of same-sex marriage and said that his son Carson, who is gay, helped to change his views. In 2017, he was endorsed by the Human Rights Campaign which supports LGBT rights. Jones supports protections for transgender students and transgender troops.Defense In an interview with The Birmingham News, Jones said he favored increasing defense spending, saying it would boost Alabama\'s local economy, particularly in the areas around NASA\'s Marshall Space Flight Center and the U.S. Army\'s Redstone Arsenal, and would protect the United States from foreign threats.Jones voted in favor of Mike Pompeo\'s confirmation as Secretary of State, joining with Republicans and five other Democratic Senators. However, he opposed Gina Haspel\'s nomination to be CIA director.Economy Jones has been described as an economic populist by Newsweek. Jones was one of five Democrats who voted for the Republican budget deal in January 2018. He also was one of 17 Democrats to break with the majority of their party and vote with Republicans in favor of a bill to ease banking regulations. Jones opposes the tariffs imposed by the Trump administration.Healthcare On health care, Jones opposes the repeal of the Affordable Care Act, but has called for changes to the U.S. health-care system, which he calls broken. He supports the re-authorization of the Children\'s Health Insurance Program (CHIP), and, during his senatorial campaign, he repeatedly criticized his opponent for his lack of a clear stance on the program. Jones says he is open to the idea of a public option, but that he is "not there yet" on single-payer healthcare. In January 2018, Jones was one of six Democrats to join with most Republicans in voting to confirm Alex Azar, Trump\'s nominee for HHS Secretary.Taxes Jones has not called for tax increases; he has called for reductions in corporate taxes "to try to get reinvestment back into this country". Jones opposed the Tax Cuts and Jobs Act of 2017, the GOP\'s tax plan, calling it fiscally irresponsible, and skewed to the wealthy while ignoring or hurting the middle class.', 'Personal life': 'Jones married Louise New on December 12, 1992, and they have three children. He has been a member of the Canterbury United Methodist Church in Mountain Brook for more than 33 years.  Jones also serves on the Advisory Board of the Blackburn Institute, a leadership development and civic engagement program at The University of Alabama.', 'Electoral history': '2017 United States Senate special primary election in Alabama, 2017PartyCandidateVotes%DemocraticDoug Jones109,10566.1DemocraticRobert Kennedy Jr.29,21517.7DemocraticMichael Hansen11,1056.7DemocraticWill Boyd8,0104.9DemocraticJason Fisher3,4782.1DemocraticBrian McGee1,4500.9DemocraticCharles Nana1,4040.9DemocraticVann Caldwell1,2390.8Total votes165,006100.0%General election resultsPartyCandidateVotes%DemocraticDoug Jones673,89650.0%RepublicanRoy Moore651,97248.3%Write-inWrite-ins22,8521.7%Total votes1,348,720100.0%Democratic gain from Republican', 'introduction': 'Gordon Douglas Jones (born May 4, 1954) is an American attorney and politician serving as the junior United States Senator from Alabama since 2018. A member of the Democratic Party, he previously was a United States Attorney for the Northern District of Alabama from 1997 to 2001.\nJones was born in Fairfield, Alabama and is a graduate of the University of Alabama and Cumberland School of Law at Samford University.  In 1997, Jones was appointed U.S. Attorney for the Northern District of Alabama by President Bill Clinton.  During his tenure, Jones prosecuted two Ku Klux Klan members for the 1963 Birmingham church bombing that killed four African-American girls.  Additionally, he secured an indictment against Eric Rudolph, a domestic terrorist responsible for four politically motivated attacks, including the Atlanta Olympic Park bombing.\nJones was elected to the United States Senate in a 2017 special election following the resignation of Jeff Sessions to become U.S. Attorney General.  After winning the Democratic primary in August, Jones went on to face former Alabama Supreme Court Justice Roy Moore in the general election.  Claiming to represent a "New Alabama", Jones subsequently defeated Moore with roughly 50% of the vote on December 12, 2017, in what was described as an upset victory.  At the time of the election, Moore was facing numerous sexual misconduct allegations, and some of the victims claimed that they were underage when Moore approached them. Jones will serve the remainder of Sessions\' term, which expires in 2021.\nJones is the first Democrat to be elected to the United States Senate from Alabama since Richard Shelby in 1992, who then subsequently switched to the Republican Party in 1994.  Upon his election, Jones became the first Democrat to represent Alabama in the United States Senate since Howell Heflin in 1997 and the first Democrat to win statewide office in Alabama since Lucy Baxley was elected President of the Alabama Public Service Commission in 2008.\n\n'}, 'personal': {'Born': 'Gordon Douglas Jones (1954-05-04) May 4, 1954 (age64)Fairfield, Alabama, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Louise New (m.1992)', 'Children': '3', 'Education': 'University of Alabama (BS)Samford University (JD)', 'Signature': '', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Alabama': {'date': 'Assumed office January 3, 2018Serving with Richard Shelby', 'Preceded by': 'Luther Strange'}, 'United States Attorney for the Northern District of Alabama': {'date': 'In officeSeptember 8, 1997– January 20, 2001', 'President': 'Bill Clinton', 'Preceded by': 'Claude Harris Jr.', 'Succeeded by': 'Alice Martin'}}, 'code': 'P000449'}