{'name': 'Heidi.Heitkamp', 'picture': 'H001069.jpg', 'detail': {'Early life, education, and early career': 'Heitkamp was born in Breckenridge, Minnesota, the fourth of seven children of Doreen LaVonne (née Berg), a school cook, and Raymond Bernard Heitkamp, a janitor and construction worker. Her father was of German descent, while her mother has half Norwegian and half German ancestry. Heitkamp was raised in Mantador, North Dakota, attending local public schools. She earned a B.A. from the University of North Dakota in 1977 and a J.D. from Lewis and Clark Law School in 1980. Heitkamp interned for the U.S. Congress in 1976 and in the state legislature in 1977.', 'Practicing attorney and politics': 'In 1980-81, Heitkamp worked as an attorney for the United States Environmental Protection Agency. She next worked as an attorney for North Dakota State Tax Commissioner Kent Conrad.She also became active in politics, joining the North Dakota Democratic-Nonpartisan League Party. In 1984, Heitkamp ran for North Dakota State Auditor but was defeated by incumbent Republican Robert W. Peterson. In 1986, Conrad decided to resign as Tax Commissioner in order to run for the U.S. Senate. Heitkamp ran for State Tax Commissioner and won the election with 66% of the vote against Republican Marshall Moore. She served in that position until 1992. ', 'Attorney General': "In 1992, the incumbent North Dakota Attorney General, Democrat Nick Spaeth, decided to retire in order to run for governor. Heitkamp ran for Attorney General and won with 62% of the vote. In 1996, she won reelection with 64% of the vote.As Attorney General of North Dakota, Heitkamp became known for leading the state's legal efforts to seek damages from tobacco companies, eventually resulting in the Tobacco Master Settlement Agreement.", '2000 gubernatorial election': "In 2000, incumbent Republican Governor Ed Schafer decided not to seek a third term. Heitkamp ran unopposed in the Democratic primary. On the Republican side, John Hoeven, CEO of the Bank of North Dakota, also ran unopposed. During her campaign for governor, it was announced that Heitkamp had been diagnosed with breast cancer, which later went into remission. Hoeven defeated her 55% to 45%. Heitkamp won 12 of the state's 53 counties.", 'Business career (2001–2012)': "From 2001 to 2012, Heitkamp served as the director of Dakota Gasification Company's Great Plains Synfuels Plant.Heitkamp's brother, Joel, is a radio talk-show host and former North Dakota state senator. Heitkamp has occasionally filled in as host of his program, News and Views, which is broadcast on Clear Channel stations in North Dakota.", 'US Senate': '2012 election In January 2011, incumbent Democratic U.S. Senator Kent Conrad announced his intent to retire instead of seeking a fourth full term in 2012. On November 8, 2011, Heitkamp announced that she would seek the open seat. She vowed to be "an independent voice."Heitkamp won the November 6, 2012, Senate election by 2,994 votes, less than 1% of the ballots cast. Berg conceded the race the next day though he could have asked for a "demand recount" under North Dakota law.In 2014, the Daily Beast suggested that she might be a presidential contender in 2020, saying that she had come to Washington "personifying traditional values of the Old West: candor, consistency, hard work, and a sense of good faith and fair play."In December 2016, it was reported that President-elect Trump was considering Heitkamp for Secretary of Agriculture. In response, Heitkamp said on the radio that she would likely refuse any such offer. "I’m not saying \'never, never,\' but I will tell you that I\'m very, very honored to serve the people of North Dakota and I hope that no matter what I do, that will always be my first priority...The job that I have right now is incredibly challenging. I love it." Trump eventually nominated former Georgia Governor Sonny Perdue for Secretary of Agriculture. Heitkamp represents the state in the Senate alongside Republican John Hoeven, her former opponent in the governor\'s race.Committee assignments Committee on Agriculture, Nutrition and ForestrySubcommittee on Commodities, Markets, Trade and Risk Management (Ranking Member)Subcommittee on Livestock, Marketing and Agriculture SecuritySubcommittee on Jobs, Rural Economic Growth and Energy InnovationCommittee on Banking, Housing, and Urban AffairsSubcommittee on Economic Policy (Ranking Member)Subcommittee on Housing, Transportation, and Community DevelopmentSubcommittee on National Security and International Trade and FinanceCommittee on Homeland Security and Governmental AffairsPermanent Subcommittee on InvestigationsSubcommittee on Regulatory Affairs and Federal Management (Ranking Member)Committee on Indian AffairsCommittee on Small Business and EntrepreneurshipCaucus memberships Afterschool CaucusesCongressional NextGen 9-1-1 Caucus2018 election On September 13, 2017, a day after dining at the White House with several other senators and President Trump, Heitkamp announced she would seek a second term. She spoke of the importance of legislation regarding infrastructure, tax reform, and energy and farm policy. U.S. Representative Kevin Cramer won the Republican primary to challenge Heitkamp.', 'Political positions': 'Heitkamp has been described as a moderate Democrat. She is considered a centrist and often supports bipartisan legislation. The National Journal has given her a composite rating of 53% liberal and 47% conservative. The American Conservative Union gives her a lifetime 13.67% conservative rating. The fiscally conservative group Americans for Prosperity gives Heitkamp a lifetime score of 26% and a higher score of 70% in 2016. Americans for Democratic Action, which supports liberal positions, gave Heitkamp a score of 45% liberal in 2016 and 60% liberal in 2015. According to FiveThirtyEight, Heitkamp voted in line with President Trump\'s positions 54% of the time. Congressional Quarterly published a study finding that Heitkamp voted with Trump\'s position 67% of the time. The Associated Press found that she voted with his positions more than 68% of the time. GovTrack places Heitkamp near the center of the Senate as the third most moderate Democrat, to the right of Republican Senator Susan Collins. In June 2018, Americans for Prosperity, which is backed by the Koch brothers, ran digital advertisements thanking Heitkamp for her vote to pass legislation loosening financial regulations on banks.Health care Heitkamp has said that the Patient Protection and Affordable Care Act contains "good and bad" elements and that "it needs to be fixed." She criticized her Senate opponent Rick Berg for wanting to repeal the law, citing concerns about insurance companies denying coverage to children with preexisting conditions.During the United States federal government shutdown of 2013, Heitkamp criticized Republican attempts to use the Continuing Appropriations Resolution as "a vehicle to legislate other issues," such as the defunding of the Patient Protection and Affordable Care Act and a delay of its individual mandate. Heitkamp was one of 14 members of the bipartisan Senate group that negotiated the compromise that was the basis of the eventual deal to end the shutdown. During the government shutdown in 2013, Heitkamp donated about $8,000 of her salary to North Dakota charities that support veterans, provide healthcare supplies to those that cannot afford them, and raise breast cancer awareness.In January 2018, Heitkamp was one of six Democrats to join Republican senators in voting to confirm Trump\'s nominee for Health Secretary, Alex Azar.Economic issues She has sought to get the Trump Administration "to get the Export-Import Bank in high gear to help North Dakota\'s economy."Heitkamp said she would support a balanced budget amendment to the Constitution "with exceptions" if elected. Heitkamp said such exceptions would include wartime spending, Social Security, Medicare, and a ban on tax cuts for those making more than $1 million per year.Heitkamp announced in a campaign press release in 2012 that she supports the Buffett Rule. Heitkamp supports implementing the Buffett Rule via the Paying a Fair Share Act, which would require those making a gross income of $1,000,000 or more to pay at least a 30% federal tax rate.After Trump\'s inauguration, Heitkamp was described as being "under intense pressure from the president to defect to the tax reform cause." On December 1, 2017, she joined every Democrat and 14 House and Senate Republicans in voting against the Tax Cuts and Jobs Act of 2017.Heitkamp was described in 2017 as wanting "to use her White House connections to prod Trump to take a softer view on trade."Politico wrote in 2017 that Heitkamp "hates the White House\'s budget\'s agriculture cuts and believes they\'d devastate North Dakota."Heitkamp was one of the chief architects of a bank deregulation bill that rolled back provisions of Dodd-Frank. Many progressives, most notably Elizabeth Warren, have urged her colleagues to oppose the bill. She was one of 17 Democrats who broke with the majority of their party and voted with Republicans to ease bank regulations. Heitkamp was later invited by Trump to be a part of the signing ceremony after the bill\'s passage.Same-sex marriage On April 5, 2013, Heitkamp announced her support of same-sex marriage, along with fellow red state Democratic Senator Joe Donnelly (D-Indiana), who entered the Senate at the same time Heitkamp did.Abortion When running for Senate in 2012, Heitkamp said she opposed public funding of abortions and believed that "late term abortions should be illegal except when necessary to save the life of the mother." After her election, however, she voted to filibuster a bill that would have made abortions illegal after the fifth month of pregnancy except when the mother\'s life is endangered. Heitkamp\'s apparent shift led to criticism by Marjorie Dannenfelser of the pro-life Susan B. Anthony List.Planned Parenthood, which supports legal abortion and reproductive rights, has given Heitkamp a 100% lifetime rating. She received a 100% rating from NARAL Pro-Choice America, a 20% rating from the anti-abortion, or pro-life, organization National Right to Life, and a 20% rating from Democrats for Life, a group of pro-life Democrats.Filibuster reform Heitkamp said she supports reforming the filibuster in the United States Senate, but did not specifically endorse the Merkley/Udall/Harkin proposal for doing so.Support for Hillary Clinton Heitkamp was described in 2014 as a "Hillary Clinton fan" who believed Clinton would "run, win, and be \'an excellent president.\'" Heitkamp said of Clinton, "I think she transcends gender. When people look at her, they don\'t see male or female. They see a very accomplished, qualified candidate. She\'s very collaborative, very open to a different way of looking at things, uber smart. She digs down and understands an issue."Heitkamp was less enthusiastic about Clinton by 2016, in light of her email controversy and what Heitkamp perceived as Clinton\'s turn to the left. In 2018, when asked when Clinton would "ride off into the sunset," Heitkamp replied, "Not soon enough."Relationship with Donald Trump After the presidential election, in which Donald Trump won North Dakota overwhelmingly, Heitkamp stated that she did not have to change her views in order to appeal to Trump supporters. Speaking to Bloomberg News in December 2016, she said, "Many of the people who voted for Donald Trump are the same voters from rural communities who I know, grew up with and work with every day." According to Bloomberg, Heitkamp "hinted at a preference for Trump politicos over Washington ones because the former don\'t \'come as establishment Republicans,\' but have a \'willingness to listen to a different perspective.\'"In a June 2017 profile, Politico wrote, "Washington is a surprisingly cozy place right now for Heitkamp. She met with Trump about a Cabinet position in December, visited the White House three times since and speaks regularly to Trump\'s chief of staff Reince Priebus and top economic adviser Gary Cohn...Heitkamp is plainly chummier with Trump than she was to President Barack Obama." Politico quoted Senate Minority Whip Dick Durbin as saying that it is "a complete waste of time" to try to get Heitkamp to vote with her party when she is determined to do otherwise. "Her independence, and her closeness to Trump, will be a boon if she does run again," noted Politico. "Republicans respect Heitkamp, and Sen. John Hoeven (R-N.D.) said she will enter as the favorite."On September 6, 2017, President Trump gave a speech in North Dakota and, in addition to inviting Republican officials onstage, also asked Heitkamp to join him, explaining: "Everyone\'s saying: What\'s she doing up here? But I\'ll tell you what: Good woman, and I think we\'ll have your support — I hope we\'ll have your support. And thank you very much, senator. Thank you for coming up." The Post noted that given Trump\'s popularity in North Dakota, his remarks had amounted to "a potentially massive boost" for Heitkamp as she sought "to remain the state\'s lone statewide elected Democrat." Heitkamp had flown with Trump to North Dakota on Air Force One.Heitkamp heard from approximately 1,400 North Dakotans about Trump\'s nomination of Betsy DeVos for Secretary of Education. About 1,330 of them opposed it. Heitkamp then announced her opposition to DeVos, attributing her decision to this overwhelming public reaction. "Need an education secretary who puts students 1st & will work to strengthen public school education, not privatize it as Betsy DeVos would," Heitkamp tweeted.Heitkamp was the first Democrat to support and one of the handful of Democrats to vote to confirm Trump\'s nominee, Mike Pompeo, as Secretary of State.Supreme Court Heitkamp voted to confirm Neil Gorsuch to the Supreme Court, telling CNBC that she had made this decision "based on an interview and a review of his record." She said: "Would he be the judge I\'d pick? No, never...But he is the judge that the duly elected president picked."In October 2018, Heitkamp voted against confirming Supreme Court nominee Brett Kavanaugh, amid allegations that Kavanaugh had sexually assaulted women. Her vote against Kavanaugh was considered politically risky, given North Dakota\'s Republican leanings. In an emotional interview, Heitkamp explained that the "better part of my career in public life has been working with victims" and that her own mother had been sexually assaulted as a teenager.Gun laws Heitkamp has an A rating from the National Rifle Association (NRA) for her consistent support of pro-gun legislation. In 2012, the NRA gave her an 86% score for supporting their positions; Gun Owners of America, another gun rights organization, gave her a 30% rating. Bloomberg News has commented that "on guns, it will be hard to find room to the right of her."In an April 11, 2013, interview, Heitkamp said that she intended to vote against the Manchin-Toomey amendment, which was introduced in the Senate after the Sandy Hook Elementary School shooting. It would have amended the Brady Handgun Violence Prevention Act to expand background checks to gun shows and internet purchases. Heitkamp said, "I\'m going to represent my state. ... in the end it\'s not what any other senator believes. It\'s about what the people of North Dakota believe."Polling suggested that the majority of North Dakotans approve of prohibiting individuals on the No-Fly list from buying firearms and ammunition, but in June 2016, after the Orlando nightclub shooting, Heitkamp voted against such a prohibition. She was the only Democratic Senator to do so. She instead expressed support for a "compromise gun bill" proposed by Susan Collins.Her vote against expanded background checks for gun buyers angered many, including former White House chief of staff William M. Daley, who "was so enraged he wrote a blistering attack in the Washington Post asking for his $2,500 campaign donation back."In June 2016, Mary Buffett wrote in the Huffington Post that Heitkamp was "perhaps the worst of the worst" when it came to "refus[ing] to close basic background check loopholes" for gun purchases. The "odious" Heitkamp, wrote Buffett, "came up with a series of sorry excuses of why she could not vote for the legislation." Buffett recalled that when Heitkamp ran for Senate, her fundraising letters emphasize how "imperative" it was "to retain a Democratic Senate seat in North Dakota." But Heitkamp had turned out to lack courage "by the gallon", Buffett wrote. In 2013, Heitkamp explained her refusal to support closing loopholes by saying that "at the end of the day my duty is to listen to and represent the people of North Dakota." Yet, Buffett pointed out, "90% of North Dakotan voters supported tightening of the loopholes."Heitkamp declined to participate in the Democratic filibuster on gun control in June 2016, leading to harsh criticism by gun-control groups such as the Brady Campaign and Center to Prevent Gun Violence and Everytown for Gun Safety.Energy and environment According to Reuters, Heitkamp "has been a supporter of domestic energy development, both in fossil fuels and renewable resources." She has said that she supports the Keystone XL pipeline because it will create jobs, decrease America\'s dependence on foreign oil from the Middle East, and help drive down the national debt. She has also said that many who oppose hydraulic fracturing have been exposed to "junk science" and do not know what it really is. She was Climate Hawks Vote\'s lowest-rated Democratic senator on climate leadership in the 113th Congress and remains among the lowest in 2015.In December 2016, Heitkamp told CNBC that although the Army Corps of Engineers had refused to approve permits needed to complete the Dakota Access pipeline, that would change under President-elect Trump. She said that she understood those who opposed the construction of the pipeline through Native American land, but added: "I just think that this fight is not winnable."In February 2017, Heitkamp was one of two Democratic senators to vote to confirm Scott Pruitt as Administrator of the Environmental Protection Agency. In March 2017, she issued a statement supporting Trump\'s approval of Keystone XL, calling it "commonsense." She also voted against the Stream Protection Rule.', 'Personal life': 'Heitkamp is married to Darwin Lange, a family practitioner. They reside in Mandan and are the parents of two adult children, Ali and Nathan. Heitkamp survived a bout with breast cancer in 2000.Praised for her "forthright manner," Heitkamp has said, "I think certain people in my party know me pretty well and I\'m too old to change. I would have a hard time figuring out how I would not say what I really thought at this point in my life. I always say, don\'t ever get between a post-menopausal woman and [what she thinks is] a good idea."', 'Electoral history': 'North Dakota State Auditor election, 1984PartyCandidateVotes%RepublicanRobert W. Peterson (incumbent)161,90854.06Democratic-NPLHeidi Heitkamp137,57045.94North Dakota Tax Commissioner election, 1988PartyCandidateVotes%Democratic-NPLHeidi Heitkamp (appointed incumbent)192,91465.80RepublicanMarshall Moore100,27934.20North Dakota Attorney General election, 1992PartyCandidateVotes%Democratic-NPLHeidi Heitkamp186,60662.37RepublicanWarren "Duke" Albrecht112,56237.63North Dakota Attorney General election, 1996PartyCandidateVotes%Democratic-NPLHeidi Heitkamp (incumbent)167,86363.82RepublicanWard Johnson95,16436.18North Dakota Gubernatorial Election 2000PartyCandidateVotes%RepublicanJohn Hoeven159,25555.03Democratic-NPLHeidi Heitkamp130,14444.97North Dakota U.S. Senate Election 2012PartyCandidateVotes%Democratic-NPLHeidi Heitkamp161,33750.24RepublicanRick Berg158,40149.32', 'introduction': 'Mary Kathryn "Heidi" Heitkamp (/ˈhaɪtˌkæmp/; born October 30, 1955) is an American businesswoman, lawyer, and politician serving as the junior United States Senator from North Dakota since 2013. A member of the North Dakota Democratic-Nonpartisan League Party, she is the first woman elected to the U.S. Senate from North Dakota. She served as the 28th North Dakota Attorney General from 1993 to 2001 and as State Tax Commissioner from 1986 to 1992.\nHeitkamp ran for governor of North Dakota in 2000 and lost to Republican John Hoeven. She considered a bid for the Democratic nomination in the 2010 U.S. Senate election to replace retiring Senator Byron Dorgan, but on March 3, 2010, she declined to run against Hoeven, who was ultimately elected.\nIn November 2011, Heitkamp declared her candidacy to replace Kent Conrad as U.S. Senator from North Dakota in the 2012 election. She narrowly defeated Republican Congressman Rick Berg on November 6, 2012, in that year\'s closest Senate race. Heitkamp is North Dakota\'s second female Senator, after Jocelyn Burdick, and was the first woman to be elected to the Senate from that state.\n\n'}, 'personal': {'Born': 'Mary Kathryn Heitkamp (1955-10-30) October 30, 1955 (age62)Breckenridge, Minnesota, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Darwin Lange', 'Children': '2', 'Education': 'University of North Dakota (BA)Lewis and Clark College (JD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom North Dakota': {'date': 'Assumed office January 3, 2013Serving with John Hoeven', 'Preceded by': 'Kent Conrad'}, '28th Attorney General of North Dakota': {'date': 'In officeDecember 15, 1992– December 15, 2000', 'Governor': 'Ed Schafer', 'Preceded by': 'Nicholas Spaeth', 'Succeeded by': 'Wayne Stenehjem'}, '20th Tax Commissioner of North Dakota': {'date': 'In officeDecember 2, 1986– December 15, 1992', 'Governor': 'George Sinner', 'Preceded by': 'Kent Conrad', 'Succeeded by': 'Robert Hanson'}}, 'code': 'H001069'}