{"name": "Jack.Reed", "picture": "R000122.jpg", "detail": {"Early life, education and career": "Reed was born in Cranston, Rhode Island, the son of Mary Louise (née Monahan) and Joseph Anthony Reed. Reed graduated from La Salle Academy and the United States Military Academy at West Point, where he received a Bachelor of Science degree in 1971. Following graduation, he spent several years in active duty military service. Reed earned the Ranger Tab and was a paratrooper. He served as a paratrooper in the 2nd Battalion, 504th Parachute Infantry Regiment, 82nd Airborne Division where he was a Platoon Leader, Company Commander and Battalion Staff Officer.Reed attended the John F. Kennedy School of Government at Harvard University, where he received a Master of Public Policy. He returned to West Point in 1978 as an associate professor in the Department of Social Sciences. He left active duty in 1979 after earning the rank of Captain. However, he would remain a member of the United States Army Reserve until 1991. After leaving active duty, Reed enrolled in Harvard Law School, where he became a member of the Board of Student Advisers. In 1982, he graduated with his Juris Doctor and worked as an associate at the Washington, D.C. office of law firm of Sutherland Asbill & Brennan. Afterwards, he returned to Rhode Island and joined Edwards and Angell, a Providence law firm. He worked with this group until 1990.Reed was elected as a state senator in 1984 and served three terms.Reed married professional Senate staffer Julia Hart in a Roman Catholic ceremony in the Catholic chapel on the United States Military Academy campus on April 16, 2005. On January 5, 2007, Mrs. Reed gave birth to a daughter, Emily.", "US House of Representatives": "In 1990, Reed was elected to the United States House of Representatives, receiving 59% of the vote in the general election. For the next six years, Reed focused on education and health care.", "US Senate": "Elections 1996When Senator Claiborne Pell, the longest-serving senator in Rhode Island's history and the 13th longest-serving senator in US history, announced his retirement in 1996, Reed declared his candidacy. Reed won the Democratic primary with 86% of the vote and beat the Republican nominee, Rhode Island General Treasurer Nancy Mayer, in the general election by 63% to 35%.2002Reed ran for re-election to a second term. He was unopposed in the Democratic primary and his Republican opponent was Robert Tingle, a casino pit manager and the unsuccessful Republican nominee for the state's 2nd congressional district in 2000. Reed won by 78% to 22%.2008In 2008, ran for re-election to a third term. He faced a primary challenge which he easily turned aside, winning with 87% of the vote. In the general election, he faced a rematch with Robert Tingle. Reed again won a landslide victory, by 73% to 27%.2014Reed announced in May 2014 that he would run for re-election to a fourth term in office. Polling showed him leading prospective Republican opponents by margins of between 29% and 65%. Reed, who was unopposed in the Democratic primary, faced only former Congressional nominee and former Rhode Island Republican Party Chairman Mark Zaccaria in the general election. Reed defeated him in another landslide win, by 71% to 29%.Political future In 2008, Reed was mentioned as a potential Vice Presidential running mate for Barack Obama. On 14 July 2008, Reed announced that he was \"not interested\" in becoming Obama's running mate.Reed has consistently been speculated as a possible Secretary of Defense. In late 2010, he turned down an offer from President Obama to succeed Robert Gates as Secretary of Defense. The position was ultimately filled by Leon Panetta.After President Obama was re-elected in 2012 and Panetta announced his decision to retire, Reed was again mentioned as a possible nominee for Secretary of Defense, as well as for Director of the Central Intelligence Agency. Once again, he denied interest in either position.When Panetta's successor Chuck Hagel announced his resignation in December 2014, Reed was again said to be on President Obama's shortlist. Despite the Republican takeover of the Senate in the 2014 elections, it was said that Reed's confirmation would be a \"foregone conclusion\". He again denied interest, with a spokesman saying that \"Senator Reed loves his job and wants to continue serving the people of Rhode Island in the United States Senate. He has made it very clear that he does not wish to be considered for Secretary of Defense or any other cabinet position. He just asked the people of Rhode Island to hire him for another six year term and plans on honoring that commitment.\"On November 24, 2014, Ted Nesi of WPRI-TV noted the reasons that Reed continues to turn down the job, citing his \"safe seat\", his status as one of the most popular politicians in the state, his fondness for working in the Senate and his passion for housing policy. He concluded that \"no matter how many times Reed's aides privately groan about another flareup of defense secretary speculation, they surely appreciate that each recurrence is a sign of the senator's positive reputation in Washington and Obama's esteem for him.\"Committee assignments Committee on Armed Services (Ranking Member)Subcommittee on Emerging Threats and CapabilitiesSubcommittee on SeapowerSubcommittee on Strategic ForcesCommittee on AppropriationsSubcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on DefenseSubcommittee on Interior, Environment, and Related AgenciesSubcommittee on Labor, Health and Human Services, Education, and Related AgenciesSubcommittee on Military Construction, Veterans Affairs, and Related AgenciesSubcommittee on Transportation, Housing and Urban Development, and Related Agencies (Ranking Member)Committee on Banking, Housing, and Urban AffairsSubcommittee on Financial Institutions and Consumer ProtectionSubcommittee on Housing, Transportation, and Community DevelopmentSubcommittee on Securities, Insurance, and InvestmentSelect Committee on Intelligence (ex officio)Caucus memberships Afterschool Caucuses", "Political positions": "Since his election to Congress, Reed has consistently voted in a similar manner to other New England Democrats, holding generally liberal positions on social and economic issues. Reed has voted with his party 94.7% of the time.Healthcare Reed has been an advocate of preventive healthcare. Consistent with other Democrats, he supports increasing Medicare funding, enrolling more Americans into programs that help the uninsured, allowing prescription drugs to be imported from Canada, and negotiating bulk medication purchases for Medicare in order to lower costs.Economy and jobs Reed has generally supported fair trade policies over similar ones advocating free trade. He voted against renewing presidential authority for 'fast tracking' normalized trade relations. Reed opposed CAFTA and similar free trade proposals for Chile, Singapore, Peru, and Oman. However, Reed voted in favor of normalizing trade relations with China. He has also been a strong supporter of unionizing workers, and has criticized government and business interference with these groups. Reed supports increasing the minimum wage and unemployment compensation.Reed serves on the Senate Banking Committee which has held hearings into JP Morgan Chase bank's activities. Reed has accepted campaign contributions from bank CEO Jamie Dimon.Civil rights Reed supports affirmative action. He has voted to expand such policies and to set aside money for women and minorities from the highway fund. Reed also has supported gay rights, voting against a proposed constitutional amendment to ban gay marriage, while voting in favor of measures that prevent job discrimination and hate crimes against LGBT.Abortion He is strongly in favor of abortion rights, and he has rejected proposals to limit late-term abortion, such procedures from occurring on military installations, and the ability of minors to cross state lines to obtain abortions.Energy Reed supports limiting American oil use and expanding alternative energy. He opposes Arctic National Wildlife Refuge drilling and federal subsidies for oil exploration, while favoring a 40 percent reduction in oil use by 2025 and funding for hydrogen automobiles. Reed has voted to end discussions on Corporate Average Fuel Economy standards. He has also been an outspoken proponent of stronger restrictions of mercury use, as well as an end to commercial whaling.Gun laws Reed has voted against limiting lawsuits on gun manufacturers and has favored expanding gun control. He voted against loosening background checks at gun shows.Immigration Although he voted for the 1996 Immigration Reform Bill, Reed has generally supported allowing illegal immigrants and foreign workers to enter the path to citizenship. He supports Guest Worker programs and allowing immigrants to have access to Social Security. He rejected the idea of establishing English as the nation's official language and has been critical of the effort to fence the US-Mexican border. He is the author of the Reed Amendment, which permits former U.S. citizens to be denied entry to the country if they are believed to have renounced their citizenship for tax reasons. On February 23, 2010, Reed co-sponsored the DREAM Act, a piece of legislation that would allow undocumented students living in the United States from a very young age to gain legal status.When asked about voting against Social Security benefits going to illegal immigrants, Reed said that he supported this interim measure and \"any such agreement must be fully examined so that it does not adversely impact benefits earned by American citizens.\"Veteran affairs Reed has made it a point to maintain liaisons within his office specifically to interact with discharged veterans of the Armed Services. These liaisons often help veterans enter the Department of Veteran Affairs, ensuring that these former servicemen and servicewomen can receive medical care.War in Iraq Reed was one of 23 US senators to vote against H.J. Resolution 114, which authorized President George W. Bush to use force against Iraq in 2002. In 2007, Reed elaborated on his sentiments, saying \"It was a flawed strategy that diverted attention and resources away from hunting down Osama bin Laden's terrorist network.\" Like General Petraeus, Reed said that he believed the real problems in Iraq were political and unrelated to the military.", "Electoral history": "United States House of Representatives 2nd District Democratic primary election in Rhode Island, 1990√ Jack Reed 49.0%Edward Beard, Sr. 27.4%Charles Gifford, III 14.7%Rodney Driver 8.9%United States House of Representatives 2nd District election in Rhode Island, 1990√ Jack Reed (D) (Incumbent) 59.2%Gertrude Coxe (R) 40.8%United States House of Representatives 2nd District Democratic primary election in Rhode Island, 1992√ Jack Reed (Incumbent) 76.4%Spencer Dickinson 23.6%United States House of Representatives 2nd District election in Rhode Island, 1992√ Jack Reed (D) (Incumbent) 70.7%James Bell (R) 24.5%Thomas Ricci (I) 3.3%John Turnbull (IT) 1.6%United States House of Representative 2nd District election in Rhode Island, 1994√ Jack Reed (D) (Incumbent) 68.0%John Elliot (R) 32.0%United States Senate Democratic primary election in Rhode Island, 1996√ Jack Reed 86.1%Don Gil 13.9%United States Senate election in Rhode Island, 1996√ Jack Reed (D) 63.3%Nancy Mayer (R) 35.0%Donald W. Lovejoy (I) 1.7%United States Senate election in Rhode Island, 2002√ Jack Reed (D) (Incumbent) 78.4%Robert G. Tingle (R) 21.6%United States Senate Democratic primary election in Rhode Island, 2008√ Jack Reed 86.8%Christopher Young 13.2%United States Senate election in Rhode Island, 2008√ Jack Reed (D) (Incumbent) 73.4%Robert G. Tingle (R) 27.6%United States Senate election in Rhode Island, 2014√ Jack Reed (D) (Incumbent) 71%Mark Zaccaria (R) 29%", "Further reading": "Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of Congress", "introduction": "John Francis Reed (born November 12, 1949) is an American politician serving as the senior United States Senator from Rhode Island, a seat he was first elected to in 1996. A member of the Democratic Party, he previously was the U.S. Representative for Rhode Island's 2nd congressional district from 1991 to 1997. Reed graduated from the United States Military Academy and Harvard University, serving in the U.S. Army as an active officer from 1971 to 1979.\n\n"}, "personal": {"date": "BornJohn Francis Reed (1949-11-12) November 12, 1949 (age68)Cranston, Rhode Island, U.S.", "Political party": "Democratic", "Education": "United States Military Academy (B.S.)Harvard University (M.P.P., J.D.)"}, "timeline": {"United States Senatorfrom Rhode Island": {"date": "Assumed office January 3, 1997Serving with Sheldon Whitehouse", "Preceded by": "Claiborne Pell"}, "Ranking Member of the Senate Armed Services Committee": {"date": "Assumed office January 3, 2015", "Preceded by": "Jim Inhofe"}, "Member of the US House of Representativesfrom Rhode Island's 2nd district": {"date": "In officeJanuary 3, 1991– January 3, 1997", "Preceded by": "Claudine Schneider", "Succeeded by": "Robert Weygand"}, "Military service": {"Allegiance": "United States", "Service/branch": "United States Army", "Years of service": "1971–1979 (active)1979–1991 (reserve)", "Rank": " Major", "Unit": "82nd Airborne Division• 504 Infantry"}}, "code": "R000122", "type": "3", "party": "Democrat", "description": "progressive Democrat", "economic": "-0.38", "social": "-0.23", "leadership": "0.55"}