{'name': 'Jeff.Merkley', 'picture': 'M001176.jpg', 'detail': {'Early life, education and early career': 'Merkley was born in Myrtle Creek, Oregon, the son of Betty Lou (née Collins) and Darrell Philip Merkley. His paternal grandmother was born in Calliope, Queensland, Australia. He attended first grade in Roseburg, Oregon before moving to Portland with his family.He graduated from David Douglas High School, obtained a bachelor of arts degree in International Relations from Stanford University in 1979, and earned a Master of Public Affairs degree from the Woodrow Wilson School at Princeton University in 1982. After completing his master\'s degree, Merkley was selected as a Presidential Management Fellow, working at the Office of the Secretary of Defense on the security of American military technology. After his fellowship, he worked in the Congressional Budget Office, where he analyzed nuclear weapons policies and programs.In 1991, Merkley returned to Portland, where he served as executive director of Portland Habitat for Humanity until 1994.He started the Walk for Humanity, initiated the Journey for Mankind, launched development of the Habitat Home Building Center, and initiated a pilot project for "YouthBuild" in which gang-affected youth built homes in their own neighborhoods.He served as Director of Housing Development at Human Solutions, where he worked to make available affordable housing complexes and launching Oregon\'s first Individual Development Account (IDA) program that helps low-income families save money to buy homes, attend college, or start businesses.Merkley was President of the World Affairs Council of Oregon for seven years and continues to serve on the Board of Trustees.', 'Oregon legislature': 'In 1998, Merkley was elected as a Democrat to the Oregon House of Representatives from a district in east Portland (now District 47). He succeeded Frank Shields, who moved from the House to the Oregon State Senate due to term limits. In its endorsement, The Oregonian predicted that Merkley was the most likely of several Democrats to "accomplish something positive in the Legislature." Following the 2003 session, he was elected Democratic leader, and after Democrats gained a majority in the Oregon House in the 2006 Oregon statewide elections, he was chosen (in a unanimous vote of the 31 incoming Democrats) to serve as Speaker of the House in the 74th Oregon Legislative Assembly.During Merkley\'s tenure as Speaker, the Oregon House passed several pieces of legislation: it created a state "rainy day fund" (a savings account to protect public schools against an unstable economy); increased funding in Oregon public schools by 14 percent ($1\xa0billion) and by 18 percent ($1.4\xa0billion) in state universities; banned junk food in schools (effective 2009); expanded the Oregon indoor smoking ban; revised the Oregon Bottle Bill; outlawed discrimination by sexual orientation and gender identity in housing and in the workplace; and gave same-sex couples state-granted rights, immunities, and benefits.', 'US Senate': '2008 election On August 13, 2007, Merkley received the endorsements of Democratic Governor Ted Kulongoski and former Democratic Governor Barbara Roberts. He was endorsed in December 2007 by the Oregon AFL-CIO, the state\'s largest labor federation. The union federation\'s leaders cited Merkley\'s 97% record of voting in the interests of working families, and his electability in a general election against the incumbent senator Gordon Smith. Merkley was the first federal candidate to be cross-nominated by the Independent Party of Oregon.Merkley won the Democratic nomination to challenge Smith in 2008, narrowly defeating activist Steve Novick and four others in the Democratic primary. Given the difficulty of running against an incumbent senator, Merkley was initially thought to have only a moderate chance of unseating Smith. But in July 2008, a Rasmussen poll showed Merkley with a lead over Smith, albeit within the margin of error. By August, after strongly negative campaigning on both sides, Rasmussen reported that Merkley\'s support had deteriorated, with Smith taking a strong lead in the polls. Merkley\'s favorable rating was at 42%, while his unfavorable rating had risen to 45%.Polls taken shortly before the election indicated that Merkley\'s standing had once again improved, with Merkley\'s 12-point deficit turning into a slight lead.On election night, the Merkley-Smith race was too close to call, but media outlets including The Oregonian called the race for Merkley on the morning of November 6, and Smith conceded later that morning. Ultimately, Merkley defeated Smith by three percentage points, 49% to 46%.  While Merkley only carried eight counties, one of them was his home county of Multnomah County, which he won by a staggering 142,000-vote margin—a deficit which proved too much for Smith to overcome.  Merkley thus became the first person to unseat an incumbent Oregon senator since Bob Packwood\'s defeat of Wayne Morse in 1968.Merkley formally resigned his seat in the Oregon House in a letter to Secretary of State Bill Bradbury on January 2, 2009. He was sworn as a Senator on January 6, 2009.  Upon his swearing-in, Oregon was represented in the Senate by two Democrats for the first time since Maurine Brown Neuberger served alongside Morse from 1960 to 1967.Tenure Merkley has accumulated a progressive record during his Senate career to date. Merkley became the first Democratic member of the Senate to announce that he\'d vote against the confirmation of Federal Reserve Chairman Ben Bernanke, citing Bernanke\'s failure to "recognize or remedy the factors that paved the road to this dark and difficult recession." As a member of the Senate Banking Committee, Merkley became a leading force in the effort to pass the Wall Street reform bill. Along with Michigan Senator Carl Levin, he successfully added an amendment, usually called the Volcker Rule, to the Dodd–Frank Wall Street reform bill, which banned high-risk trading inside commercial banking and lending institutions. Merkley also championed an amendment that banned liar loans, a predatory mortgage practice that played a role in the housing bubble and subsequent financial collapse.He was a founding signatory of a mid-February 2010 petition to use reconciliation to pass legislation providing for a government-run health insurance program in the Senate. Merkley also championed legislation that provides new mothers with a private space and flexible break times to pump breast milk once they return to work. Merkley\'s breastfeeding amendment was included in the health care reform law and signed into law by President Obama in 2010.In late February 2010, Merkley again made headlines when he unsuccessfully tried to persuade Republican colleague Jim Bunning of Kentucky to drop his objection to passing a 30-day extension of unemployment benefits for jobless Americans. Bunning replied, "Tough shit." A spokesman for Merkley said that the Oregon senator did not hear Bunning\'s remark at the time.In late 2010, Merkley began circulating a proposal to his fellow Senate colleagues about the need to force Senators to filibuster in order to block legislation. In 2011, Merkley introduced a bill to reform the filibuster and help end gridlock in the Senate. He was joined by Senator Tom Udall of New Mexico and Senator Tom Harkin of Iowa.Merkley was the only member of the Senate to endorse fellow Senator Bernie Sanders in his bid for the Democratic nomination for President.On April 4, 2017, Merkley held the senate floor for 15 hours 28 minutes in protest of the confirmation of Neil Gorsuch to the Supreme Court.In early June 2018, Merkley received national attention when he attempted to visit a facility holding the children of jailed adults who had attempted to illegally cross the border to seek asylum.  Children were removed from their parents and placed in the custody the Office of Refugee Resettlement. Merkley filmed his attempt to visit a facility located in a former Walmart in Brownsville, Texas.  He was refused entrance and the police were called and arrived as he continued to try to speak with the facility administrator.  He commented in the film, "I think it\'s unacceptable that a member of Congress is not being admitted to see what is happening to children whose families are applying for asylum. I decided to come out here, go up to the door and ask to be let in."  By midday the video had garnered more than one million viewers.Committee assignments Committee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related Agencies (Ranking Member)Subcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on Interior, Environment, and Related AgenciesSubcommittee on Labor, Health and Human Services, Education, and Related AgenciesSubcommittee on Legislative BranchCommittee on Foreign RelationsCommittee on the BudgetCommittee on Environment and Public WorksSubcommittee on Green Jobs and the New EconomySubcommittee on Superfund, Toxics and Environmental HealthSubcommittee on Water and WildlifeSource: 2009\xa0Congressional Record, Vol.\xa0155, Page\xa0S729 ', 'Political positions': 'Asylum and immigration Merkley has been noted for his opposition to the Trump administration\'s immigration policies.  In June 2018, he attempted to enter the Casa Padre processing facility in Brownsville, Texas, where children separated from their parents were being detained as a result of the Trump administration\'s "zero tolerance" policy.  Merkley was not permitted to enter the facility, and eventually the police were called and he was asked to leave the premises.  Video of the event went viral on social media, drawing greater attention to the policy in traditional media and among the public.  Speaking about the policy in an interview with Time magazine, Merkley stated his belief that "[a] part of this is the dehumanization of people seeking asylum in the U.S."  By the end of June, Trump had signed an executive order modifying the policy to replace family separation with family detention.  Merkley has continued to oppose the administration\'s policy, dubbing it "handcuffs for all." As of July 2018, many children who had been separated under the policy still have not been reunited with their parents.Defense and foreign policy AfghanistanMerkley led an effort in November 2011 to urge President Barack Obama to expedite transition of responsibility for military and security operations to the government of Afghanistan. The Senate passed an amendment to the defense authorization bill by voice vote that required the President to deliver to Congress a timeline for an accelerated transition of all military and security operations to the Government of Afghanistan within 90 days of the law\'s enactment. The measure had bipartisan support.  Co-sponsors included Republicans Mike Lee of Utah and Rand Paul of Kentucky.Iraq warMerkley supports the Reid-Feingold Amendment, a plan for removing troops from Iraq, and has his own five-point plan for stability in Iraq:Removing all combat troops starting right away and completing the redeployment in six to 12 monthsEliminating permanent U.S. military bases in IraqEngaging Iraq\'s neighbors in a diplomatic effort to secure the peace, particularly Turkey, Iran and SyriaRemoving all American contractors from the country and replacing them with Iraqi contractors, andDirecting our attention toward stronger engagement with the Iraqi Parliament and CourtsIn March 2008, Merkley endorsed the Responsible Plan to End the War In Iraq.Banking regulation Merkley has focused on Wall Street reform in his position on the Senate Banking Committee. Merkley and Carl Levin have led an effort to crack down on proprietary trading at depository banks and other critical financial firms. The Dodd-Frank Act included the Merkley-Levin amendment to implement the Volcker Rule. The rule is premised on the notion that banks should not make risky, speculative bets while enjoying government deposit insurance. It is intended to prevent high-risk trading that jeopardizes the banking system. A $2 billion trading loss at JPMorgan Chase & Co. in May 2012 prompted Merkley and Levin to push regulators to stiffen their draft language on the Volcker Rule provisions.Health care Merkley voted yes on the Patient Protection and Affordable Care Act.  He was a founding signatory of a mid-February 2010 petition to use reconciliation to pass legislation providing for a government-run health insurance program in the Senate. Merkley also championed legislation that provides nursing mothers with flexible break times and private space to pump breast milk at work. Merkley\'s breastfeeding amendment was included in the health care reform law and signed into law by President Obama in 2010.Housing As a member of the United States Senate Committee on Banking, Housing, and Urban Affairs, Merkley has contributed legislation towards fixing the subprime mortgage crisis.The Dodd–Frank Wall Street Reform and Consumer Protection Act contained an amendment by Merkley and Senator Amy Klobuchar protecting consumers from deceptive mortgage lending practices. The amendment prohibits mortgage lenders from receiving hidden payments when they sell high-cost loans and prohibits brokers from receiving higher pay for selling riskier or higher-fee loans. The amendment also bolsters underwriting standards.To speed the recovery of the housing market, Senator Merkley supports aggressive efforts to create refinancing alternatives to costly and time-consuming foreclosures, including allowing federal bankruptcy judges to modify existing mortgages so they can keep their home under new terms. In July 2012, Merkley proposed a broad new refinancing plan for homeowners who owe more than their houses are worth and therefore cannot refinance. Under Merkley\'s plan, any homeowner who is current on his or her mortgage could refinance into a 4% mortgage for 15 years or a 5% mortgage for 30 years.Energy Merkley has consistently supported policies that promote American energy independence and investment in alternative energy sources. In 2010, Merkley and Senators Tom Carper, Tom Udall, and Michael Bennet introduced the Oil Independence for a Stronger America Act, which set a goal for achieving complete independence from overseas oil by 2030.A similar piece of legislation was put forward by the same senators again in 2011. Merkley supports increasing national fuel economy standards, and advocates for a 6 to 7 percent annual improvement for vehicles over current mileage standards. Merkley has also been a strong supporter of electric vehicles. In 2011, Merkley and Senator Lamar Alexander introduced the Promoting Electric Vehicles Act. The bill was designed to provide short-term incentives for the rapid development and production of electric vehicles.Campaign finance Merkley supports increased transparency in campaign financing and limits on independent political spending by corporations. Merkley has been critical of both the 2010 Supreme Court case Citizens United v. Federal Election Commission, and of the court\'s decision in 2012 not to revisit this case. Merkley called the 2012 decision "disturbing and damaging." In response to the Supreme Court decision, in July 2012 Merkley and six other senators sponsored the Disclose Act. Among other provisions, the legislation would require public disclosure of political donors that give $10,000 or more.Senate reform Merkley has been a leader in trying to reform the rules of the Senate itself, including those concerning the filibuster. On January 5, 2011, Merkley and Senators Tom Udall and Tom Harkin introduced a resolution intended to increase genuine debate and accountability in the Senate. The resolution proposed to eliminate the filibuster on motions to proceed, eliminate secret holds, guarantee consideration of amendments for both majority and minority, require a "talking filibuster" in which senators opposed to holding a straight up-or-down vote must continuously debate on the Senate floor, and expedite the nominations process. Upon introducing the resolution, Merkley stated: "The Senate is broken. We are failing to fulfill our legislative responsibilities." On January 27, Merkley\'s "talking filibuster" proposal received 46 votes in the Senate.Supreme Court To protest the nomination of Judge Neil Gorsuch to the U.S. Supreme Court, Merkley in April 2017 staged an all-night protest on the Senate floor. He ended his filibuster speech after 15 hours. "This is a stolen seat," he said in a statement, referring to Senate Republicans successful attempt to block Democrats from appointing Merrick Garland to the Supreme Court. "This is the first time in American history that one party has blockaded a nominee for almost a year in order to deliver a seat to a President of their own party."Postal reform During the Postal Reform Act debate in the Senate in April 2012, Merkley led the effort to pass an amendment that would impose a one-year moratorium on the closure of most rural post offices. After that, the bill would prohibit the closure of post offices more than 10 miles from another post office and impose conditions limiting the closure of others. Twenty rural post offices in Oregon face closure because of the postal service\'s financial problems.Social issues Merkley has publicly announced support for same-sex marriage and introduced the Employment Non-Discrimination Act (ENDA) in the Senate during the 111th United States Congress as S. 1584. BlueOregon, a progressive Oregon blog, commented on the suitability of Sen. Merkley to be lead sponsor of ENDA, noting that as Speaker of the Oregon House of Representatives Merkley had successfully guided Oregon\'s state version of ENDA, the Oregon Equality Act, to become law.In 2010,  Merkley cosponsored legislation to repeal Don\'t Ask Don\'t Tell (DADT), and allow gay Americans to serve in the military openly. In March 2011, Merkley cosponsored the Respect for Marriage Act (RFMA) to repeal the Defense of Marriage Act (DOMA), legislation that bars the federal government from recognizing same-sex marriages. With eleven other RFMA cosponsors, including fellow Oregon Senator Ron Wyden, Senator Merkley released a video as part of the It Gets Better Project, the antibullying initiative aimed at inspiring at-risk LGBT youth.', 'Personal life': 'Merkley and his wife, Mary, have two children, Jonathan and Brynne. Brynne appeared with Merkley in several campaign ads in the 2008 campaign. He lives in Portland, Oregon.One of his cousins, Rebecka Ann Carnes, was killed alongside eight others in the 2015 Umpqua Community College shooting.', 'Electoral history': 'Oregon House of Representatives 47th district election, 2004PartyCandidateVotes%±DemocraticJeff Merkley (incumbent) 14,670 64.11%  RepublicanFrank Cleys8,02335.06%Write-ins1880.82%Oregon House of Representatives 47th district election, 2006PartyCandidateVotes%±DemocraticJeff Merkley (incumbent) 11,106 63.96% –0.15 RepublicanBruce McCain6,19235.66%+0.60Write-ins650.37%–0.45U.S. Senate Democratic primary election in Oregon, 2008PartyCandidateVotes%DemocraticJeff Merkley246,48245.10%DemocraticSteve Novick230,88942.24%DemocraticCandy Neville38,3677.02%DemocraticRoger Obrist12,6472.31%DemocraticPavel Goberman12,0562.21%DemocraticDavid Loera6,1271.12%U.S. Senate election in Oregon, 2008PartyCandidateVotes%±DemocraticJeff Merkley 864,392 48.90% +9.29 RepublicanGordon H. Smith (incumbent)805,15945.55%–10.66ConstitutionDave Brownlow92,5655.24%+3.53Write-ins5,3880.30%+0.19Democratic gain from RepublicanSwingU.S. Senate Democratic primary election in Oregon, 2014PartyCandidateVotes%±DemocraticJeff Merkley (incumbent) 277,120 93.34% +48.24 DemocraticWilliam Bryk11,3303.82%N/ADemocraticPavel Goberman8,4362.84%+0.63U.S. Senate election in Oregon, 2014PartyCandidateVotes%±DemocraticJeff Merkley (incumbent 814,537 57.50% +8.60 RepublicanMonica Wehby538,84736.87%–8.68LibertarianMike Montchalin44,9163.07%N/APacific GreenChristina Jean Lugo32,4342.22%N/AConstitutionJames Leuenberger24,2121.66%–3.58Write-ins6,6720.46%+0.16', 'Further reading': 'Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of Congress', 'introduction': "Jeffrey Alan Merkley (born October 24, 1956) is an American politician serving as the junior United States Senator from Oregon since 2009. He is a member of the Democratic Party. Prior to his election to the Senate, Merkley was a five-term member of the Oregon House of Representatives representing the state's 47th district, located in eastern Multnomah County within the city limits of Portland. From 2007 to 2009, he served as Speaker of the Oregon House of Representatives.\nMerkley defeated two-term Republican incumbent Gordon Smith in 2008 and went on to defeat Republican challenger Monica Wehby in his bid for reelection in 2014. Throughout his tenure, Merkley has been a leading progressive voice in the Senate and was the only other U.S. Senator to endorse Bernie Sanders in the 2016 Democratic presidential primaries.  \n\n"}, 'personal': {'Born': 'Jeffrey Alan Merkley (1956-10-24) October 24, 1956 (age61)Myrtle Creek, Oregon, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Mary Sorteberg', 'Education': 'Stanford University (BA)Princeton University (MPP)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Oregon': {'date': 'Assumed office January 3, 2009Serving with Ron Wyden', 'Preceded by': 'Gordon Smith'}, '64th Speaker of the Oregon House of Representatives': {'date': 'In officeJanuary 3, 2007– January 2, 2009', 'Preceded by': 'Karen Minnis', 'Succeeded by': 'Dave Hunt'}, 'Member of the Oregon House of Representativesfrom the 47th district': {'date': 'In officeJanuary 3, 1999– January 2, 2009', 'Preceded by': 'Frank Shields', 'Succeeded by': 'Jefferson Smith'}}, 'code': 'M001176'}