{'name': 'Jerry.Moran', 'picture': 'M000934.jpg', 'detail': {'Early life, education and career': 'Moran was born in Great Bend, Kansas, the son of Madeline Eleanor (née Fletcher) and Raymond Edwin "Ray" Moran. He was raised in Plainville. He attended Fort Hays State University before enrolling at the University of Kansas in Lawrence, where he earned a Bachelor of Science degree in economics in 1976. While attending the University of Kansas, he worked as a summer intern for U.S. Representative Keith Sebelius in 1974, when impeachment proceedings were being prepared against President Richard Nixon.Moran worked as a banker before receiving his Juris Doctor from the University of Kansas School of Law in 1982. He practiced law at Stinson, Mag & Fizzell in Kansas City, and later joined Jeter & Larson Law Firm in Hays, where he practiced law for fifteen years. In addition to his law practice, he served as the state special assistant attorney general (1982–85) and deputy county attorney of Rooks County (1987–95). He also served as an adjunct professor of political science at Fort Hays State University.', 'Kansas Senate': 'Moran served for eight years (1989–1997) in the Kansas Senate. He served two years as the Vice President and his last two years as majority leader.', 'US House of Representatives': 'Elections Moran was elected to Congress in 1996 and reelected five times, never facing serious opposition in the conservative 1st district. In 2006, his opponent for the 2006 midterm election was John Doll, against whom he received almost 79 percent of the vote—one of the highest totals for a Republican congressional incumbent in that election.Tenure During his time in the House of Representatives, Jerry Moran conducted an annual town hall meeting in each of the 69 counties in Kansas\' "Big First" Congressional District. He continues the tradition in the U.S. Senate for all 105 counties.As a senior member of the House Agriculture Committee in the U.S. House of Representatives, then-Congressman Moran worked with colleagues to craft legislation to aid Kansas farms and ranches. Moran was also an active member of the House Transportation and Infrastructure Committee and the House Veterans\' Affairs Committee, where he served as chairman of the Subcommittee on Health.Slate\'s David Weigel pointed out that, despite his insistence that earmarks are a way that get members of Congress to vote for spending "that we can\'t afford," Moran requested $19.4\xa0million in earmarks in the 2010 budget.', 'US Senate': "Elections Moran became the 2010 Republican nominee for U.S. Senate in Kansas after defeating fellow Congressman Todd Tiahrt in the Republican primary, 50–45%. In the general election, Moran took 70 percent of the vote, defeating Democrat Lisa Johnston, Libertarian Michael Dann, and Reform Party candidate Joe Bellis.NRSC Chairmanship Moran was elected Chairman of the National Republican Senatorial Committee for the 113th U.S. Congress on November 14, 2012. Moran oversaw the Republican gain of nine Senate seats in United States Senate elections, 2014, resulting in the first Republican Senate majority since 2006.Committee assignments United States Senate Committee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related AgenciesSubcommittee on Department of DefenseSubcommittee on Financial Services and General GovernmentSubcommittee on Labor, Health and Human Services, Education, and Related AgenciesSubcommittee on Military Construction and Veterans Affairs, and Related Agencies (Chairman)Subcommittee on State, Foreign Operations, and Related ProgramsUnited States Senate Committee on Commerce, Science, and TransportationUnited States Senate Commerce Subcommittee on Aviation Operations, Safety, and SecurityUnited States Senate Commerce Subcommittee on Communications, Technology, Innovation, and the InternetUnited States Senate Commerce Subcommittee on Consumer Protection, Product Safety, Insurance and Data Security (Chairman)United States Senate Commerce Subcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityUnited States Senate Environment and Public Works CommitteeSubcommittee on Clean Air and Nuclear SafetySubcommittee on Superfund, Waste Management, and Regulatory OversightSubcommittee on Transportation and InfrastructureUnited States Senate Committee on Veterans' AffairsUnited States Senate Committee on Indian AffairsCaucus memberships Afterschool Caucuses", 'Political positions': 'Moran\'s voting record is highly conservative. He has a lifetime rating of 92 from the American Conservative Union.The Southwest Daily Times once quoted him as saying, "I will always put Kansans ahead of the pressures in Washington"—a quote he posted on his House Web site.Agriculture Health care Moran opposed the Medicare reform package of 2003, unlike most congressmen from rural districts. He also opposed the Affordable Care Act of 2010, the health care reform bill championed by President Obama.In May 2011, Moran sponsored S. 1058, the Pharmacy Competition and Consumer Choice Act of 2011. In the House, he served as Co-Chairman of the House Rural Health Care Coalition and co-founder of the Congressional Community Pharmacy Coalition.Moran announced that he was voting \'no\' on the July 2017 Senate health care bill. Moran criticized the closed-door process for developing the bill and criticized the legislation for not repealing the entire 2010 health law.National security and military Since 2014, Moran has served on the United States Air Force Academy Board of Visitors.In the early 2000s, Moran opposed a timetable for military withdrawal from Iraq.Since entering Congress, Moran has traveled to Afghanistan, Iraq, and Pakistan to visit deployed American forces and meet with foreign leaders.  His most recent trip to the region was in August 2017 to the Northern regions of Afghanistan.Immigration and refugees Moran critiqued President Donald Trump\'s 2017 executive order imposing a temporary ban on entry to the U.S. to citizens of seven Muslim-majority countries, stating: "While I support thorough vetting, I do not support restricting the rights of U.S. citizens and lawful permanent residents. Furthermore, far-reaching national security policy should always be devised in consultation with Congress and relevant government agencies."Education Moran supports accountability metrics for public schools, but believes federal initiatives need to provide flexibility to states. In 2001, Moran voted against passage of the No Child Left Behind Act (NCLB) because he felt it did not afford sufficient flexibility to schools.  In 2017, Moran voted to confirm Betsy DeVos as United States Secretary of Education.Gun policy Moran has an "A" rating from the National Rifle Association (NRA) for his consistent support of pro-gun policies. The NRA endorsed him for his 2010 Senate run. He was described as a "steadfast supporter of our freedom," by NRA-Political Victory Fund chairman Chris W. Cox. Since 1998, the NRA has donated $23,850 to Moran\'s political efforts.In 2013, Moran joined other Republicans in saying they would filibuster any Democrat\'s proposals that Republican\'s considered a threat to the Second Amendment. In April, Moran voted against the Manchin-Toomey proposal for universal background checks for gun purchases.Moran supports the concept of eliminating gun-free zones on military installations and recruitment centers. He stated that they are an "infringement on the constitutional rights of our service members" and that gun-free zones make military sites "increasingly vulnerable to those who wish to do harm."In 2016, Moran voted against the Feinstein Amendment, which would have banned suspected terrorists from acquiring guns.Moran responded to the 2017 Olathe, Kansas shooting stating "I strongly condemn violence of any kind, especially if it is motivated by prejudice and xenophobia." In response to the Orlando nightclub shooting and the Las Vegas shooting, Moran offered thoughts and prayers with his wife, Robba.Environment and climate change As of 2017, based on his environment-related votes, Moran had a lifetime score of 8% from the League of Conservation Voters, and a 0% score for 2016.Moran voted in 2015 against a Senate amendment acknowledging that human activity contributes to climate change. In 2016, Moran and several other Senate Republicans signed a letter calling upon the U.S. to withdraw funding from the United Nations Framework Convention on Climate Change. In 2009, Moran voted against the American Clean Energy and Security Act (Waxman-Markey), which would have established a cap-and-trade system to reduce carbon emissions and combat climate change.Moran is a strong supporter of the construction of the Keystone XL oil pipeline. During the consideration of the Keystone XL pipeline legislation, Moran introduced an amendment to remove the lesser prairie chicken from the list of threatened species. The amendment failed on a  54–44 vote, having failed to get the required 60 votes.Entrepreneurship and startups Moran is "one of the most active members of Congress when it comes to reaching out to Silicon Valley." In 2014, Consumer Electronics Association President and CEO Gary Shapiro dubbed Moran, "Mr. Innovation" and described him as "one of the biggest tech entrepreneurship leaders in the U.S. Senate." Moran is the lead sponsor of Startup Act 3.0 legislation which includes several provisions that would reform the American visa system for high-skilled, American educated, and entrepreneurial immigrants. Moran also sponsored the Jumpstart Our Business Startups Act, also known as the JOBS Act, legislation to expand crowdfunding options for startups. Since the bill\'s 2012 passage, he has criticized the U.S. Securities and Exchange Commission\'s JOBS Act rulemaking as drawn out and potentially counter productive to the legislation\'s intent. Moran is an advocate of increased engagement between Washington and the Startup community and has spoken on the issue at events like South by Southwest (SXSW) and the Consumer Electronics Show (CES).Internet issues Moran opposed the Protect Intellectual Property Act (PIPA) and Stop Online Piracy Act (SOPA). On November 2011, Moran, along with Republican Senator Rand Paul and Democratic Senators Ron Wyden and Maria Cantwell, sent a letter to Senate Leadership indicating they would place a Senate hold on PIPA, citing the threats PIPA (and SOPA) posed to liberty and innovation.In 2017, Moran voted to repeal FCC Internet privacy rules that blocked internet providers from sharing or selling data on customers\' private data (such as browsing history) without the customer\'s permission.Abortion Moran opposes abortion. He has cosponsored legislation to ban abortions after the 20th week of pregnancy.Gay rights Moran opposes same-sex marriage. The Human Rights Campaign has rated his voting record as zero in five separate scorecards.', 'Personal life': 'Moran had lived in Hays for most of his political career. However, in 2012 he moved to Manhattan. He wanted to be closer to a major airport in order to cut down on his drive time back to Kansas each weekend. The nearest airport to Hays is Wichita Dwight D. Eisenhower National Airport, some three hours south-east; in contrast Manhattan is two hours from Wichita and Kansas City. Additionally, Manhattan Regional Airport has direct jet service daily to and from Chicago and Dallas.At Kansas State University, he was initiated into Alpha Tau Omega on September 28, 2013.Moran volunteers his time with several community organizations. He is a former trustee of the Eisenhower Foundation, serves on the Board of Trustees of the Fort Hays State University Endowment Association, and serves on the Executive Committee of the Coronado Area Council of the Boy Scouts of America. He was also the 2008 Honorary Chair of the Law Enforcement Torch Run of the Kansas Special Olympics. Moran and his wife, Robba, have two daughters, Kelsey and Alex. Kelsey graduated from Kansas State University in 2010 and from Georgetown University Law Center in 2015. She is now an attorney at Hogan Lovells. Alex studied at Kansas State University and graduated from Kansas State University College of Veterinary Medicine in 2016.', 'Electoral history': 'Kansas 1st Congressional District Republican Primary election, 1996PartyCandidateVotes%+%RepublicanJerry Moran79,11983.73%RepublicanR. W. Yeager15,37616.27%Kansas 1st Congressional District election, 1996PartyCandidateVotes%+%RepublicanJerry Moran191,89973.61%DemocraticJohn Divine63,94824.52%LibertarianBill Earnest5,2982.03%Kansas 1st Congressional District election, 1998PartyCandidateVotes%+%RepublicanJerry Moran (inc.)152,77580.67%DemocraticJim Phillips36,61819.33%Kansas 1st Congressional District election, 2000PartyCandidateVotes%+%RepublicanJerry Moran (inc.)214,32889.34%LibertarianJack Warner25,58110.66%Kansas 1st Congressional District election, 2002PartyCandidateVotes%+%RepublicanJerry Moran (inc.)189,97691.09%LibertarianJack Warner18,5858.91%Kansas 1st Congressional District election, 2004PartyCandidateVotes%+%RepublicanJerry Moran (inc.)239,77690.70%LibertarianJack Warner24,5179.20%Kansas 1st Congressional District election, 2006PartyCandidateVotes%+%RepublicanJerry Moran (inc.)156,72878.60%DemocraticJohn Doll39,78119.90%ReformSylvester Cain2,8691.40%Kansas 1st Congressional District election, 2008PartyCandidateVotes%+%RepublicanJerry Moran (inc.)214,54981.80%DemocraticJames Bordonaro34,77113.20%ReformKathleen Burton7,1452.70%LibertarianJack Warner5,5622.10%U.S. Senate Republican Primary election in Kansas, 2010PartyCandidateVotes%+%RepublicanJerry Moran163,48349.70%RepublicanTodd Tiahrt146,70244.60%RepublicanTom Little10,2563.10%RepublicanRobert "Bob" Londerholm8,2782.50%U.S. Senate election in Kansas, 2010PartyCandidatesVotes%+%RepublicanJerry Moran587,17570.00%DemocraticLisa Johnston220,97126.30%LibertarianMichael Wm. Dann17,9222.10%ReformJoseph "Joe" Bellis11,6241.30%', 'introduction': "Gerald W. Moran (born May 29, 1954) is an American politician serving as the junior United States Senator from Kansas since 2011. A member of the Republican Party, he served as Chairman of the National Republican Senatorial Committee for the 113th U.S. Congress, during which he led successful Republican efforts in United States Senate elections, 2014, producing the first Republican Senate majority since 2006.   Previously, he served as a member of the United States House of Representatives, representing Kansas's 1st congressional district.\nRaised in Plainville, Kansas, Moran graduated from the University of Kansas and the University of Kansas School of Law. He worked in private law and served as the state special assistant attorney general (1982–85) and deputy attorney of Rooks County (1987–95). He served in the Kansas Senate (1989–1997), and was majority leader for his last two years. He was elected to the House of Representatives in 1996 and served six terms with little electoral opposition. He was elected to the U.S. Senate in 2010 after defeating fellow U.S. Representative Todd Tiahrt in a contentious primary. He was re-elected to the U.S. Senate in 2016.\n\n"}, 'personal': {'Born': ' (1954-05-29) May 29, 1954 (age64)Great Bend, Kansas, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Robba Moran', 'Education': 'Fort Hays State UniversityUniversity of Kansas (BA, JD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Kansas': {'date': 'Assumed office January 3, 2011Serving with Pat Roberts', 'Preceded by': 'Sam Brownback'}, 'Chair of the National Republican Senatorial Committee': {'date': 'In officeJanuary 3, 2013– January 3, 2015', 'Leader': 'Mitch McConnell', 'Preceded by': 'John Cornyn', 'Succeeded by': 'Roger Wicker'}, "Member of the US House of Representativesfrom Kansas's 1st district": {'date': 'In officeJanuary 3, 1997– January 3, 2011', 'Preceded by': 'Pat Roberts', 'Succeeded by': 'Tim Huelskamp'}}, 'code': 'M000934'}