{'name': 'Jim.Risch', 'picture': 'R000584.jpg', 'detail': {'Early life': "Born in Milwaukee, Wisconsin, Risch is the son of Helen B. (née Levi) and Elroy A. Risch, a lineman for the local telephone company. His father was of German descent, and his mother was of Irish, Scottish, and English ancestry. Risch attended the University of Wisconsin–Milwaukee from 1961 to 1963 and then transferred to the University of Idaho in Moscow, where he was a member of the Phi Delta Theta fraternity. He obtained his B.S. degree in Forestry in 1965, and continued his education at the university's College of Law. He served on Law Review and the College of Law Advisory Committee before receiving his J.D. degree in 1968.Risch entered politics in 1970 in Boise at age 27, winning election as Ada County prosecuting attorney.  While serving in this capacity, he taught undergraduate classes in criminal justice at Boise State College and served as the president of the state's prosecuting attorneys association.", 'State politics': "Idaho Senate Risch was first elected to the Idaho Senate from Ada County in 1974. He entered the state senate leadership in 1976, serving as Majority Leader and later as President Pro Tempore.In a dramatic upset, Risch was defeated for reelection in 1988 by Democratic political newcomer and Boise attorney Mike Burkett. As of mid-2006, it remains Idaho's most expensive legislative contest.In the second political defeat of his career, Risch lost the 1994 primary election for a state senate seat to Roger Madsen. Risch returned to the state senate in 1995, as an appointee of Governor Phil Batt, who had named Madsen as the state commerce department's director.First term as Lieutenant Governor In January 2001, Risch had his eye on the lieutenant governor's seat vacated by Butch Otter, who resigned to take his elected seat in Congress. However, Governor Dirk Kempthorne appointed state senator Jack Riggs of Coeur d'Alene to the post instead. The following year Risch defeated Riggs in the Republican primary and won the general election, spending $360,000 of his own money to win the $27,000 a year, part-time post.Governor On May 26, 2006, Risch became Governor of Idaho when Kempthorne resigned to become the U.S. Secretary of the Interior. Risch appointed Mark Ricks to serve as his Lt. Governor.  Risch served out the remaining seven months of Kempthorne's term, which ended in January 2007.In August 2006, Risch called a special session of the Idaho Legislature to consider his proposed property tax reform bill, entitled the Property Tax Relief Act of 2006.Second term as Lieutenant Governor Risch was expected to enter the 2006 Republican gubernatorial primary to succeed Kempthorne, who was completing his second term at this time of his federal appointment. However, U.S. Congressman Otter had announced his candidacy for the position in December 2004, and had gained a significant headstart in campaigning and fundraising. In November 2005, Risch announced his intention to seek election again as lieutenant governor.Risch was unopposed for the 2006 Republican nomination for lieutenant governor and defeated former Democratic U.S. congressman Larry LaRocco in the general election.  Risch's term as governor ended in January 2007 and he returned to the role of lieutenant governor. Risch resigned as lieutenant governor to take his seat in the Senate on January 3, 2009. Governor Otter named state Senator Brad Little of Emmett as Risch's replacement.", 'US Senate': 'Elections 2008On August 31, 2007, the Associated Press reported that Risch could possibly be appointed United States Senator by Governor Butch Otter to succeed the embattled Larry Craig. The Idaho Statesman reported on September 1, however, that Otter\'s spokesman denied Risch had been selected and that the governor "has made no decision and he is not leaning toward anybody."  On October 9, Risch announced that he would run for the now open Senate seat. In May 2008, Risch was selected as the Republican nominee for Craig\'s open seat in the U.S. Senate.  He defeated Larry LaRocco, a former Democratic congressman, with 58% of the vote. Risch defeated LaRocco in two previous elections: for a state Senate seat in 1986 and for lieutenant governor in 2006.2014Risch won the Republican primary with 79.9% of the vote.Risch defeated Nels Mitchell with 65.3% of the vote.Tenure Risch was one of four freshmen Republican Senators in the 111th Congress of 2009, with Mike Johanns of Nebraska, George LeMieux of Florida and Scott Brown of Massachusetts.Republican Senator Mike Crapo praised Risch as "results-oriented".In 2017, Risch was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement.On Aug. 11, 2017, Risch, in an interview aired on the PBS Newshour, warmly endorsed President Trump\'s rhetoric threatening North Korea with military destruction in the event that country launched missiles at Guam.On March 22, 2018, the day before a potential federal government shutdown, Risch threatened to block a government spending bill because it included changing the name of the White Clouds Wilderness protected area to honor a deceased political rival, former Idaho Governor Cecil Andrus.  Risch ultimately acquiesced.Committee assignments Committee on Energy and Natural ResourcesEnergy Subcommittee on EnergySubcommittee on Public Lands and ForestsSubcommittee on Water and PowerCommittee on Foreign RelationsSubcommittee on Western Hemisphere, Peace Corps and Narcotics AffairsSubcommittee on Near Eastern and South and Central Asian AffairsSubcommittee on African AffairsSubcommittee on European AffairsCommittee on Small Business and Entrepreneurship (Chairman)Select Committee on EthicsSelect Committee on Intelligence', 'Political positions': 'Abortion law Risch opposes abortion. In 2013, Risch co-sponsored the Child Interstate Abortion Notification Act, which would have made it illegal for a minor to travel over state lines to have an abortion to avoid parental consent laws.Gun law Risch was endorsed by the National Rifle Association (NRA) and was given an "A+" grade by the organization for his voting record on NRA-related issues. Chris W. Cox, chairman of the NRA-Political Victory Fund stated that "Jim is a battle-tested ally who will make sure billionaire gun control zealots like Michael Bloomberg are stopped from destroying our freedoms."In 2013, Risch, along with twelve other Republican Senators, threatened to filibuster any bills set forth by Democrats that the Republicans perceived would be a threat to 2nd Amendment rights, including expanded background checks. In an interview with National Public Radio, Risch stated that individuals have the right to keep and bear arms also means "a right to purchase one [a gun], to sell one, to trade in one, and you really have to have a robust market if indeed you\'re going to have a constitutional right." He also expressed that adding additional background checks would mean that gun dealers would "have to deal with the federal bureaucracy, which is very, very difficult to deal with."In response to the Orlando nightclub shooting, Risch joined fellow Senator Mike Crapo to state that the shooting should not be a reason to call for increased gun control legislation.In 2016, Risch voted against the Feinstein Amendment, which would have blocked the sale of guns to individuals on the terrorist watch list and Democrat Chris Murphy\'s proposal to expand background checks related to sales at gun shows and online sales. Risch voted in favor for both the Republican backed bills, specifically John Cornyn\'s proposal that would create a 72-hour delay for anyone on the terrorist watch list buying a gun and Charles Grassley and Ted Cruz\'s proposal to alert authorities of a terrorist tried to buy a firearm.Regarding the 2017 Las Vegas shooting, Risch and his wife, Vicki, offered thoughts and prayers to the victims and stressed the "heroic" work of the first responders.Health care access Risch supports the "repeal and replace" of the Affordable Care Act (ACA), also known as Obamacare. He voted against the ACA in 2010. He stated in 2017 that "Health care is one of – if not the most – complex and personal issues … and it is incredibly hard to resolve."', 'Electoral history': 'Idaho State Senate District 18 Republican Primary election, 1996PartyCandidateVotes%+%RepublicanJim Risch (inc.)2,29976.0%RepublicanEmil Loya, Jr.70924.0%Idaho State Senate District 18 election, 1996PartyCandidateVotes%+%RepublicanJim Risch (inc.)9,54367.5%DemocraticDonald Baumback4,58932.5%Idaho State Senate District 18 Republican Primary election, 1998PartyCandidateVotes%+%RepublicanJim Risch (inc.)2,65667.4%RepublicanSharon Ullman1,28332.6%Idaho State Senate District 18 election, 1998PartyCandidateVotes%+%RepublicanJim Risch (inc.)8,74276.0%LibertarianDaniel Adams2,75824.0%Idaho State Senate District 18 Republican Primary election, 2000PartyCandidateVotes%+%RepublicanJim Risch (inc.)3,22250.4%RepublicanJack Noble3,17149.6%Idaho State Senate District 18 election, 2000PartyCandidateVotes%+%RepublicanJim Risch (inc.)12,91780.3%LibertarianDaniel Adams3,16519.7%Idaho Lieutenant Governor Republican Primary election, 2002PartyCandidateVotes%+%RepublicanJim Risch49,60734.6%RepublicanJack Riggs39,68927.7%RepublicanCelia Gould22,13415.4%RepublicanLarry Eastland22,07915.4%RepublicanJim Pratt5,6383.9%RepublicanDarrell Babbitt4,1612.9%Idaho Lieutenant Governor election, 2002PartyCandidateVotes%+%RepublicanJim Risch226,01756.2%DemocraticBruce Perry160,43839.9%LibertarianMichael Kempf15,5623.9%Idaho Lieutenant Governor election, 2006PartyCandidateVotes%+%RepublicanJim Risch (inc.)259,64858.3%DemocraticLarry LaRocco175,31239.4%ConstitutionWilliam Charles Wellisch10,4602.4%U.S. Senate Republican Primary election in Idaho, 2008PartyCandidateVotes%+%RepublicanJim Risch80,74365.3%RepublicanScott Syme16,66013.5%RepublicanRichard Phenneger6,5325.3%RepublicanNeal Thompson5,3754.3%RepublicanFred Adams4,9874.0%RepublicanBill Hunter4,2803.5%RepublicanBrian Hefner2,9152.4%RepublicanHal James Styles, Jr.2,0821.7%U.S. Senate election in Idaho, 2008PartyCandidateVotes%+%RepublicanJim Risch371,74457.7%DemocraticLarry LaRocco219,90334.1%IndependentRex Rammell34,5105.4%LibertarianKent Marmon9,9581.5%IndependentPro-Life8,6621.3%U.S. Senate Republican Primary election in Idaho, 2014PartyCandidateVotes%+%RepublicanJim Risch (inc.)119,20979.9%RepublicanJeremy "T" Anderson29,93920.1%U.S. Senate election in Idaho, 2014PartyCandidateVotes%+%RepublicanJim Risch (inc.)285,59665.3%DemocraticNels Mitchell151,57434.7%', 'introduction': 'James Elroy Risch (born May 3, 1943) is an American politician serving as the junior United States Senator from Idaho since 2009. A member of the Republican Party, he previously served as Lieutenant Governor of Idaho from 2003 to 2006 and again from 2007 to 2009 and as Governor of Idaho from 2006 until 2007.\n\n'}, 'personal': {'Born': 'James Elroy Risch (1943-05-03) May 3, 1943 (age75)Milwaukee, Wisconsin, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Vicki Risch (m.1968)', 'Children': '3James Risch,Jason Risch,Jordan Risch', 'Education': 'University of Wisconsin–MilwaukeeUniversity of Idaho (BS, JD)', 'Signature': '', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Idaho': {'date': 'Assumed office January 3, 2009Serving with Mike Crapo', 'Preceded by': 'Larry Craig'}, 'Chair of the Senate Small Business Committee': {'date': 'Assumed office January 3, 2017', 'Preceded by': 'David Vitter'}, '31st Governor of Idaho': {'date': 'In officeMay 26, 2006– January 1, 2007', 'Lieutenant': 'Mark Ricks', 'Preceded by': 'Dirk Kempthorne', 'Succeeded by': 'Butch Otter'}, '39th and 41st Lieutenant Governor of Idaho': {'date': 'In officeJanuary 3, 2003– May 26, 2006', 'Governor': 'Dirk Kempthorne', 'Preceded by': 'Jack Riggs', 'Succeeded by': 'Mark Ricks'}, 'President pro tempore of the Idaho Senate': {'date': 'In officeDecember 1982– December 1, 1988', 'Preceded by': 'Reed Budge', 'Succeeded by': 'Mike Crapo'}, 'Member of the Idaho Senatefrom the 18th district': {'date': 'In office1995–2002', 'Preceded by': 'Roger Madsen', 'Succeeded by': 'Sheila Sorensen'}, 'Member of the Idaho Senatefrom the 21st district': {'date': 'In office1974–1988', 'Succeeded by': 'Mike Burkett'}}, 'code': 'R000584'}