{'name': 'Jimmy.Panetta', 'picture': 'P000613.jpg', 'detail': {'Early life and career': "Panetta graduated from Carmel High School in Carmel, California. He then attended Monterey Peninsula College and University of California, Davis, graduating with a bachelor's degree in international relations. He then interned at the United States Department of State. Panetta received his law degree from Santa Clara University School of Law. He joined the United States Navy Reserve as an intelligence officer and completed a tour of duty in the War in Afghanistan in 2007 while attached to Joint Special Operations Command. Panetta worked in the Alameda County, California, prosecutor's office and as a deputy district attorney for the District Attorney's office of Monterey County, California.", 'US House of Representatives': "2016 campaign After incumbent Sam Farr announced in November 2015 that he would not seek reelection to the United States House of Representatives, Panetta announced his candidacy to succeed Farr in California's 20th congressional district in the 2016 election. Panetta defeated Republican Casey Lucius in the November general election.Tenure He was sworn in on January 3, 2017. House Democrats selected Panetta to be a regional whip for Northern California, the Central Coast, Hawaii and the U.S. Pacific Islands.Committee assignments Committee on AgricultureSubcommittee on NutritionSubcommittee on Biotechnology, Horticulture, and ResearchCommittee on Armed ServicesSubcommittee on Oversight and InvestigationsSubcommittee on Tactical Air and Land ForcesSource:Caucus memberships Congressional Arts Caucus", 'Personal life': 'Panetta is the youngest of three sons born to Leon Panetta, the former United States Secretary of Defense. His wife, Carrie, is a judge on the Monterey County Superior Court. They have two daughters.', 'introduction': "James Varni Panetta /pəˈnɛtə/ (born October 1, 1969) is an American politician from the state of California. He is a member of the United States House of Representatives for California's 20th congressional district. He is the son of Leon Panetta, who represented the Monterey area in Congress for 16 years before holding such jobs as White House Chief of Staff and Secretary of Defense.\n\n", 'code': '20'}, 'personal': {'Born': 'James Varni Panetta (1969-10-01) October 1, 1969 (age49)Washington, D.C., U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Carrie Panetta', 'Children': '2', 'Parents': 'Leon PanettaSylvia Varni', 'Education': 'Monterey Peninsula CollegeUniversity of California, Davis (BA)Santa Clara University (JD)', 'Website': 'House website'}, 'timeline': {"Member of the US House of Representativesfrom California's 20th district": {'date': 'Assumed office January 3, 2017', 'Preceded by': 'Sam Farr'}, 'Military service': {'Allegiance': 'United States', 'Service/branch': 'United States Navy', 'Unit': 'United States Navy Reserve', 'Battles/wars': 'War in Afghanistan'}, 'code': '20'}, 'code': 'P000613'}