{'name': 'John.Hoeven', 'picture': 'H001061.jpg', 'detail': {'Early life': 'Hoeven was born in Bismarck, North Dakota, the son of Patricia "Trish" (née Chapman) and John Henry "Jack" Hoeven, Jr. His ancestry includes Dutch, Swedish, and English. He attended Dartmouth College, where he belonged to the Alpha Chi Alpha Fraternity and graduated with honors. He then earned an MBA from the Kellogg School of Management at Northwestern University, and was a banker in Minot, North Dakota prior to pursuing a political career. From 1993 to 2000, he was the president and CEO of the state-owned Bank of North Dakota.', 'North Dakota Governor': "2000 He sought the office of the Governor of North Dakota as a Republican in 2000, and he was elected, defeating Democrat Heidi Heitkamp by a margin of 55 to 45 percent.2004 In 2004, when up for re-election, Hoeven faced Democratic challenger Joe Satrom. Hoeven won re-election by a wide margin of 71 to 28 percent.2008 On September 25, 2007, Hoeven's deputy press secretary, Don Larson, announced that he would be taking a leave of absence from his job to manage the governor's re-election campaign. Another Hoeven staff member, Don Canton, said this was not a formal re-election announcement, but one would be coming later in the fall. On November 13, Governor Hoeven made his formal announcement and campaign kickoff with stops in Fargo, Grand Forks, Bismarck and Minot. On November 4, 2008 Hoeven won a resounding victory carrying 74% of the vote over the Democratic opponent Tim Mathern with 24% of the vote. This is the first time in North Dakota's history that any governor has won three four-year terms in office, though the record for serving is still maintained by Gov. Bill Guy who served 12 years.Tenure Hoeven's governorship included the expansion and diversification of the state's economy, which led to a 49.5 percent increase in the state's real gross domestic product. Beginning in 2000, he directed the development of a multi-resource energy program for the state with incentives in each energy sector, leading the state in becoming one of the largest energy producing and exporting states in the country. North Dakota has gained nearly 40,000 new jobs since he took office. The state's wages and personal incomes continue to grow faster than the national average. In the past few years, the state led the nation in export growth. In late 2006, the state's reserve rose past $600 million, and now is over $700 million.As of December 2009, Hoeven was the most popular governor in the nation. His approval rating stood at 87 percent with only 10 percent disapproving. In January 2007, Hoeven became the nation's most senior governor, having been inaugurated on December 15, 2000, as established by the North Dakota Constitution.", 'US Senate': "On January 11, 2010, Hoeven announced he would run in the 2010 North Dakota Senate election for the seat being vacated by Senator Byron Dorgan, Hoeven beat Democratic challenger Tracy Potter 76.08% to 22.17%. making him the first Republican Senator to represent North Dakota since 1987. Since 2013, Hoeven has been the dean—the most senior member—of North Dakota's congressional delegation. As of 2018 Hoeven was listed as one of the seven wealthiest senators in the United States Senate. Committee assignments Committee on Agriculture, Nutrition, and ForestrySubcommittee on Commodities, Markets, Trade and Risk ManagementSubcommittee on Jobs, Rural Economic Growth and Energy InnovationSubcommittee on Nutrition, Specialty Crops, Food and Agricultural Research (Chairman)Committee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related AgenciesSubcommittee on Homeland Security (Chairman)Subcommittee on Energy and Water DevelopmentSubcommittee on Interior, Environment, and Related AgenciesSubcommittee on Military Construction, Veterans Affairs, and Related AgenciesCommittee on Energy and Natural ResourcesSubcommittee on EnergySubcommittee on National ParksSubcommittee on Public Lands, Forests and MiningCommittee on Indian Affairs (Chairman)", 'Political positions': 'Hoeven briefly identified himself as a member of the Democratic-NPL Party before becoming active in the Republican Party as a District Chair and volunteer. Hoeven has walked a conservative line as a politician on some issues and a moderate one on others including increasing education funding, ethics reform, compensation for teachers, as well as increased funding on infrastructure.Crime Hoeven supports decreasing access to parole for offenders. He believes that drug control policy should be a state and not a federal issue.Economy and employment He opposed the Employee Free Choice Act, which included a card check provision.Emergency services Hoeven is a member of the Congressional NextGen 9-1-1 Caucus.Energy Hoeven believes that alternative fuels are a long-term solution but that increased oil drilling is required in the short term. Hoeven has been a vocal advocate for the Keystone Pipeline, arguing that it has never leaked and that environmental risks have been exaggerated. The Keystone Pipeline has leaked twice, once in 2010 and, after making that argument, again in 2016.Gun rights Hoeven consistently votes for pro-gun legislation and therefore has earned an "A+" rating from the National Rifle Association (NRA). The NRA has endorsed Hoeven multiple times, including during his run for governor in 2008 and senate in 2010.In June 2016, Hoeven voted in the senate on four gun control proposals that were developed as a result of the Orlando nightclub shooting. Hoeven voted in favor of senator Chuck Grassley\'s expansion of background checks and to provide funding to research the cause of mass shootings and senator John Cornyn\'s 72-hour wait period for purchases of guns by individuals on the terrorist watch list. Hoeven voted against senator Chris Murphy\'s proposal to require background checks for every gun sale, including online sales and at gun shows. He also voted against senator Dianne Feinstein\'s proposal to ban anyone from the terrorist watchlist from purchasing a gun. Hoeven voted against the latter bill due to lack of "judicial oversight or due process" in the proposal.Health care He believes that public health care should be provided only to the elderly and children.Immigration In 2013, Hoeven voted to pass Border Security, Economic Opportunity, and Immigration Modernization Act of 2013.LGBT rights In 2013, Hoeven voted against banning discrimination based on sexual orientation. He is against gay marriage. Taxes Hoeven supports investment tax credits for farm investments.Women\'s health He is pro-life and opposes abortion except for cases of rape, incest, or threat to the mother\'s life. He opposes government funding for elective abortions in accordance with the Hyde Amendment. Hoeven voted for reauthorization of the Violence Against Women Act in 2012.', 'Electoral history': 'North Dakota gubernatorial election, 2000PartyCandidateVotes%RepublicanJohn Hoeven159,25555.03Democratic-NPLHeidi Heitkamp130,14444.97Write-in130.00Total votes289,412100.00North Dakota gubernatorial election, 2004PartyCandidateVotes%RepublicanJohn Hoeven (inc.)220,80371.26Democratic-NPLJoe Satrom84,87727.39LibertarianRoland Riemers4,1931.35Total votes309,873100.00North Dakota gubernatorial election, 2008PartyCandidateVotes%RepublicanJohn Hoeven (inc.)235,00974.44Democratic-NPLTim Mathern74,27923.53IndependentDuWayne Hendrickson6,4042.03Total votes315,692100.00United States Senate election in North Dakota, 2010PartyCandidateVotes%RepublicanJohn Hoeven181,68976.08Democratic-NPLTracy Potter52,95522.17LibertarianKeith Hanson3,8901.63Total votes238,534100.00United States Senate election in North Dakota, 2016PartyCandidateVotes%RepublicanJohn Hoeven (inc.)267,96478.47Democratic-NPLEliot Glassheim57,97616.98LibertarianRobert Marquette10,5213.08IndependentJames Germalic4,6611.36Total votes341,486100.00', 'Further reading': 'Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of Congress', 'introduction': "John Henry Hoeven III (/ˈhoʊvən/; born March 13, 1957) is an American banker and politician serving as the senior United States Senator from North Dakota since 2011. A member of the Republican Party, he previously served as the 31st Governor of North Dakota from 2000 to 2010. Hoeven was elected that year to the U.S. Senate with 76.1% of the vote. He replaced junior Senator Byron L. Dorgan, who chose not to seek reelection. Hoeven became the senior Senator in 2013 after Kent Conrad retired and was replaced by Democrat Heidi Heitkamp, who was once Hoeven's opponent for the Governor's office. Hoeven was reelected in 2016 with 78.5% of the vote.\nPrior to his election to the Governor's office, Hoeven served as President of the nation's only state-owned bank, the Bank of North Dakota, from 1993 to 2000. He has an estimated net worth of around $45 million, making him one of the richest Senators.\n\n"}, 'personal': {'Born': 'John Henry Hoeven III (1957-03-13) March 13, 1957 (age61)Bismarck, North Dakota, U.S.', 'Political party': 'Republican (1998–present)', 'Other politicalaffiliations': 'Independent (before 1996)Democratic (1996–1998)', 'Spouse(s)': 'Mikey Hoeven', 'Education': 'Dartmouth College (BA)Northwestern University (MBA)', 'Signature': '', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom North Dakota': {'date': 'Assumed office January 3, 2011Serving with Heidi Heitkamp', 'Preceded by': 'Byron Dorgan'}, 'Chair of the Senate Indian Affairs Committee': {'date': 'Assumed office January 3, 2017', 'Preceded by': 'John Barrasso'}, '31st Governor of North Dakota': {'date': 'In officeDecember 15, 2000– December 7, 2010', 'Lieutenant': 'Jack Dalrymple', 'Preceded by': 'Ed Schafer', 'Succeeded by': 'Jack Dalrymple'}}, 'code': 'H001061'}