{'name': 'John.Barrasso', 'picture': 'B001261.jpg', 'detail': {'Early life, education, and medical career': 'Barrasso was born in Reading, Pennsylvania in 1952, the son of Louise M. (née DeCisco) and John Anthony Barrasso, Jr. He is of Italian descent. He is a 1970 graduate of the former Central Catholic High School, which, in 2011, combined with Holy Name High School to form Berks Catholic HS, in Reading, PA. Barrasso began his college career at Rensselaer Polytechnic Institute (where he became a member of Phi Kappa Tau Fraternity) and transferred to Georgetown University in Washington, D.C., graduating with a bachelor of science degree in 1974. He also received his M.D. degree from Georgetown University School of Medicine in 1978. He conducted his residency at Yale Medical School in New Haven, Connecticut.In 1983, following the completion of his residency at Yale, Barrasso moved to Wyoming, together with his wife at the time, Linda Nix. He joined a private orthopedic practice in Casper, Wyoming, and for a time served as chief of staff of the Wyoming Medical Center. He served as State President of the Wyoming Medical Society, President of the National Association of Physician Broadcasters, and as a member of the American Medical Association Council of Ethics and Judicial Affairs.Barrasso was also a rodeo physician for the Professional Rodeo Cowboy\'s Association (and a member of the "Cowboy Joe Club") and volunteered as a team physician for Casper College as well as several local high schools. He was named the "Wyoming Physician of the Year". In addition, he was awarded the "Medal of Excellence" by the Wyoming National Guard for his services to the National Guard, and received the "Legislative Service Award" from the Veterans of Foreign Wars (VFW) for his support of Wyoming\'s veterans.Barrasso was a board-certified orthopedic surgeon in private practice in Casper for 24 years, from 1983 until 2007.', '1996 US Senate election': 'Barrasso ran unsuccessfully for the Republican nomination for the U.S. Senate in 1996 for the seat being vacated by Republican Alan K. Simpson. Barrasso lost the primary election to State Senator Mike Enzi, 32% to 30%, in a seven-candidate election.', 'Wyoming Senate': 'Barrasso was elected to the Wyoming Senate unopposed in 2002 and won re-election unopposed in 2006.During his time in the State Senate he served as Chairman of the Transportation and Highways Committee.', 'US Senate': 'Appointment Barrasso was chosen on June 22, 2007, by Democratic Governor Dave Freudenthal to replace Senator Craig L. Thomas, who died earlier in the month. Under state law, Freudenthal was able to consider only three individuals whose names were submitted to him by the Republican State Central Committee because the seat was vacated by a Republican. The others were former State Treasurer Cynthia Lummis of Cheyenne, later Wyoming\'s only member of the United States House of Representatives, and former Republican State Chairman and lobbyist Tom Sansonetti, a former aide to Thomas. Matt Mead, grandson of former Senator Clifford P. Hansen, had also sought the nomination but was eliminated by the central committee in fourth place. So had the previous gubernatorial nominee from 2006, Ray Hunkins, a Wheatland rancher and lawyer. Mead later went on to be elected Governor of Wyoming in 2010, and Lummis was elected to Congress in 2008. When he was appointed, Barrasso indicated that he would also run in the November 2008 special election to fill the remainder of Thomas\' term.Elections 2008Barrasso announced on May 19, 2008, that he would run in the general election in 2008 to serve the remainder of Thomas\' term, though he had already stated that intention before his appointment. Tom Sansonetti, one of the three Republican candidates selected for consideration by Freudenthal, said he would not challenge Barrasso in the primary. The other candidate for selection, Cynthia Lummis, was a candidate for the Republican nomination to replace retiring U.S. Representative Barbara Cubin for the state\'s at-large seat in the U.S. House of Representatives. The filing deadline in Wyoming was May 30, 2008, and ultimately Barrasso did not face a primary opponent. The Democratic nominee was Nick Carter, a lawyer from Gillette. Pundits unanimously rated the race "Safe Republican." As expected, Barrasso won the general election in a landslide, garnering 73% of the vote.2012Barrasso ran for re-election to a first full term in 2012. He faced three opponents for the Republican nomination, which he won with 90% of the vote. In the general election, he faced Democratic nominee Tim Chestnut, a member of the Albany County Board of Commissioners. Barrasso won the election with 76% of the vote.Tenure At the time of his temporary appointment to the U.S. Senate for Wyoming in 2007, Barrasso was quoted as saying on his application: "I believe in limited government, lower taxes, less spending, traditional family values, local control and a strong national defense"; he also said that he had "voted for prayer in schools, against gay marriage and [had] sponsored legislation to protect the sanctity of life".Abortion In 1996, when Barrasso ran for the Republican nomination for U.S. Senate for Wyoming he presented himself during the primary as a candidate in favor of abortion rights. Subsequently, during his tenure in the Wyoming Legislature, he sponsored an unsuccessful bill to treat the killing of a pregnant woman as a double homicide.Gun laws In 2002, he received an "A" rating from the National Rifle Association. According to a Washington Post survey, he has voted with Republicans 94 percent of the time.[citation needed]In April 2013, Barrasso was one of 46 senators to vote against the passing of a bill which would have expanded background checks for all gun buyers. Barrasso voted with 40 Republicans and 5 Democrats to stop the bill.Health care Barrasso voted against the Patient Protection and Affordable Care Act in December 2009, and he voted against the Health Care and Education Reconciliation Act of 2010. Barrasso is part of the group of 13 Senators drafting the Senate version of the AHCA behind closed doors.Environmentalism Barrasso opposed the CIA\'s creation of its Center on Climate Change and National Security in 2009.  In 2011, Barrasso introduced a bill that would prevent the Environmental Protection Agency from limiting carbon dioxide emissions.Barrasso is an outspoken contrarian on climate change. Asked in 2014 on the C-SPAN interview program Newsmakers if human activity contributes to climate change, Barrasso said, "The climate is constantly changing. The role human activity plays is not known." As of January 2017 Barrasso has a 9% lifetime score on the National Environmental Scorecard of the League of Conservation Voters. Barrasso was a leading critic of the climate change policiesof the administration of US President Barack Obama.Paris Agreement Barrasso co-authored and was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement. According to the Center for Responsive Politics, Barrasso has received over $585,000 from the oil and gas industry since 2012.Committee assignments Committee on Energy and Natural ResourcesSubcommittee on National ParksSubcommittee on Public Lands and Forests (Chairman)Subcommittee on Water and PowerCommittee on Environment and Public Works (Chairman)Subcommittee on Clean Air and Nuclear Safety (Ex-Officio)Subcommittee on Fisheries, Water and Wildlife (Ex-Officio)Subcommittee on Superfund, Waste Management, and Regulatory Oversight (Ex-Officio)Subcommittee on Transportation and Infrastructure (Ex-Officio)Committee on Foreign RelationsSubcommittee on Africa and Global Health PolicySubcommittee on East Asia, The Pacific and International Cybersecurity PolicySubcommittee on Europe and Regional Security CooperationSubcommittee on Multilateral International Development, Multilateral Institutions, and International Economic, Energy and Environmental PolicyCommittee on Indian Affairs', 'Personal life': "Barrasso has three children: Peter, Emma, and Hadley. He is divorced from Linda Nix. Barrasso is married to his second wife, Bobbi Brown. On August 11, 2007, during Cheyenne's annual Race for the Cure, Barrasso and Brown, herself a breast cancer survivor and at the time, the state director for Barrasso's state senate offices, announced that they would marry. Once the two were engaged, Brown resigned her position in Barrasso's state Senate offices. They were married on January 1, 2008, with their children in attendance in Thermopolis.Barrasso is a member of the board of directors of Presidential Classroom, a nonprofit, nonpartisan organization that brings young people to Washington, D.C. to learn about government. Barrasso is a member of the Casper Chamber of Commerce.", 'Election history': 'United States Senate Republican primary election in Wyoming, 1996PartyCandidateVotes%±RepublicanMike Enzi27,05632.47%RepublicanJohn Barrasso24,91829.90%RepublicanCurt Meier14,73917.69%RepublicanNimi McConigley6,0057.21%RepublicanKevin Meenan6,0007.20%RepublicanKathleen Jachkowski2,2692.72%RepublicanBrian Coen9431.13%RepublicanCleveland Holloway8741.05%RepublicanRuss Hanrahan5240.63%United States Senate special election in Wyoming, 2008PartyCandidateVotes%±RepublicanJohn Barrasso183,06373.35%DemocraticNick Carter66,20226.53%United States Senate Republican primary election in Wyoming, 2012PartyCandidateVotes%±RepublicanJohn Barrasso73,51690.24%RepublicanThomas Bleming5,0806.24%RepublicanEmmett Mavy2,8733.53%United States Senate election in Wyoming, 2012PartyCandidateVotes%±RepublicanJohn Barrasso184,53175.90%+2.55%DemocraticTim Chesnut52,59621.60%-4.93%Wyoming CountryJoel Otto6,1382.60%', 'introduction': "John Anthony Barrasso III (/bəˈrɑːsoʊ/; born July 21, 1952) is the junior United States Senator from Wyoming and a member of the Republican Party. He was appointed to the Senate in June 2007, following the death of Craig L. Thomas, and won a special election in 2008 to fill the remaining four years of Thomas's term. He was re-elected to a full six-year term in 2012.\n\n"}, 'personal': {'Born': 'John Anthony Barrasso III (1952-07-21) July 21, 1952 (age66)Reading, Pennsylvania, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Linda Nix (Divorced)Bobbi Brown', 'Children': '3', 'Education': 'Rensselaer Polytechnic InstituteGeorgetown University (BS, MD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Wyoming': {'date': 'Assumed office June 25, 2007Serving with Mike Enzi', 'Preceded by': 'Craig L. Thomas'}, 'Chair of the Senate Environment Committee': {'date': 'Assumed office January 3, 2017', 'Preceded by': 'Jim Inhofe'}, 'Chair of the Senate Indian Affairs Committee': {'date': 'In officeJanuary 3, 2015– January 3, 2017', 'Preceded by': 'Jon Tester', 'Succeeded by': 'John Hoeven'}, 'Member of the Wyoming Senatefrom the 27th district': {'date': 'In officeJanuary 3, 2003– June 22, 2007', 'Preceded by': 'Bruce Hinchey', 'Succeeded by': 'Bill Landen'}}, 'code': 'B001261'}