{'name': 'John.Thune', 'picture': 'T000250.jpg', 'detail': {'Early life, education, and political career': 'Thune was born in Pierre, South Dakota, the son of Yvonne Patricia (née Bodine) and Harold Richard Thune. Harold Thune was a fighter pilot in the Pacific theater during World War II who flew the Grumman F6F Hellcat. KELO News reported that "Thune flew numerous missions for the Navy from an aircraft carrier. He received the Distinguished Flying Cross for shooting down four enemy planes in the Hellcat." Harold Thune flew his missions off the USS Intrepid. Thune\'s paternal grandfather, Nicholas Thune, was an immigrant from Norway who partnered with his brother Matt to start Thune Hardware stores in Mitchell and Murdo, South Dakota. Thune\'s maternal grandfather is from Ontario, Canada, and his mother was born in Saskatchewan. Thune\'s brother, Richard Thune, is an English teacher at Rowland High School in California. Thune was a star athlete in high school, active in basketball, track, and football. He graduated from Jones County High School in 1979. He played college basketball at Biola University in California, where he graduated in 1983 with a Bachelor of Arts degree in business. Thune received a Master of Business Administration degree from the University of South Dakota in 1984.After completing his MBA, Thune became involved in politics. He worked as a legislative aide for U.S. Senator James Abdnor from 1985 to 1987. In 1980, Abdnor had defeated U.S. Senator George McGovern.In 1989, Thune moved back to Pierre, where he served as executive director of the state Republican Party for two years. Thune was appointed Railroad Director of South Dakota by Governor George S. Mickelson, serving from 1991 to 1993. From 1993 to 1996, he was executive director of the South Dakota Municipal League.', 'US House of Representatives (1997–2003)': 'Elections In 1996, Thune decided to make his first foray into electoral politics by entering the race for South Dakota\'s lone seat in the U.S. House of Representatives. The Almanac of American Politics said that Thune "entered the 1996 race as very much an underdog." His primary opponent was sitting Lt. Governor Carole Hillard of Rapid City, who benefited from the support of the longtime South Dakota governor Bill Janklow. A May 1996 poll showed Hillard ahead of Thune 69%-15%. By relying on strong personal skills and the help of his old network of Abdnor friends, Thune won the primary, defeating Hillard 59%-41%. In the general election, Thune defeated Democrat Rick Weiland, a long-serving aide to U.S. Senator Tom Daschle, 58%-37%.Thune won his subsequent races for U.S. House by wide margins. He was reelected in 1998 with 75% of the vote and in 2000 with 73% of the vote. In 2002, after briefly considering a run for governor, Thune set his sights on a run for the U.S. Senate.', 'US Senate (2005–present)': 'Elections 2002 In 2002 Thune challenged incumbent Democratic U.S. Senator Tim Johnson. Thune lost by only 524 votes (0.15%). One study concluded: "While the margin of victory [for Johnson] was a mere 524 votes, getting into that winning position required a number of important factors, including Native American turnout, the ability of Johnson and his allies to more effectively use the ground war to get their message out, Thune\'s ineffectiveness on the air and lack of experience in winning competitive elections, low voter turnout in key Republican counties, the drought, and finally the presence of Kurt Evans. Evans, a Libertarian candidate who withdrew from the race, endorsed Thune, but remained on the ballot and siphoned away more votes from Thune than Johnson. Evans received only 3,070 votes, but that ended up being six times greater than the margin of victory." Despite the close results, Thune did not contest the election.2004 In 2004, Thune challenged Tom Daschle, the United States Senate Minority Leader and leader of the Senate Democrats. In early 2003, Daschle had unexpectedly decided not to run for president. CNN reported that the "announcement surprised even some of his closest aides, one of whom told CNN plans were being made for Daschle to announce his candidacy Saturday in his hometown of Aberdeen, South Dakota."This was the most expensive Senate race in 2004, with $30 million spent, and the most expensive race in South Dakota history. It was widely followed in the national media. Thune, along with Senate Majority Leader Bill Frist, President of the United States George W. Bush, and Vice President Dick Cheney, described Daschle as the "chief obstructionist" of Bush\'s agenda: "Thune was able to criticize \'Daschle for serving incompatible masters\' and portray him, as Frist did when he came to South Dakota to campaign for Thune, as a partisan obstructionist and political heir to liberal icon and former Senator George McGovern of South Dakota."Daschle\'s critics charged the Democrat with using filibusters to block confirmation of several of Bush\'s nominees to the federal judiciary and of being out of step with South Dakota voters on other political and social issues: "The GOP had targeted Daschle, the Senate minority leader, claiming he had been the chief obstruction to President Bush on such issues as tax cuts, judicial nominees and the war in Iraq."When the race began in early 2004, Daschle led by 7% in January and February. By May, his lead fell to just 2% and into the summer, polls showed an effective tie. Throughout September, Daschle led Thune by margins of 2–5%; from October until the November 2 election, most polls showed Thune and Daschle tied 49% to 49% among likely voters.On November 2, 2004, Thune defeated Daschle by 4,508 votes, winning 51% of the vote. Daschle\'s loss was the first ousting of an incumbent Floor Leader since 1952, when Arizona Senator Ernest McFarland lost to Barry Goldwater. The New York Times reported that the loss made "Mr. Daschle the first Senate party leader in more than five decades to be voted out of office. The race had been closely watched by both parties, with White House officials calling the senator an obstructionist for opposing the president on the war in Iraq, tax cuts and judicial nominees. Senator Daschle had fought hard, raising $16 million during the campaign as of mid-October, which he spent largely on television advertisements. Mr. Thune had raised $10 million by the same time."South Dakota native Tom Brokaw commented that Thune "ran a very strong campaign" to win the 2004 race. University of South Dakota political scientist Bill Richardson said, "motivated John Thune supporters went to the polls in large numbers, part of a massive South Dakota turnout. Unofficial results show nearly 80 percent of registered voters cast ballots."After Thune defeated Daschle, many Republicans regarded him as a "rising star with unlimited political potential."2010 Thune faced no Republican or Democratic opposition for his Senate seat in 2010 and won reelection with 100% of the vote. Scott Heidepriem, the South Dakota Senate Minority Leader and a Democratic candidate for Governor of South Dakota, said, "We just concluded that John Thune is an extremely popular senator who is going to win another term in the Senate." One political observer of South Dakota politics noted in 2010 that it was "the first time in the state\'s modern history in which a major party has failed to field a Senate candidate."2016 In 2016, Thune faced Democratic candidate Jay Williams, Chair of the Yankton County Democratic Party. On November 8, 2016, Thune defeated Williams, winning 71.8% of the vote.Tenure On December 6, 2006, Thune was chosen by Senate Republican Whip Trent Lott to be the GOP\'s Chief Deputy Whip. After briefly serving as Republican Conference Vice-Chairman, in June 2009 Thune became chairman of the Republican Policy Committee, the fourth-ranking position in the Senate.He was elected Republican Conference Chairman in 2011, taking office in January 2012. The Conference Chairman is the third-ranking position in the US Senate. In late 2011, the Mitchell Daily Republic reported that "Thune\'s elevation to the No. 3 spot makes him the highest-ranking Republican senator in South Dakota history. Thune has served as chairman of the Republican Policy Committee from 2009 until the present time and was vice chairman of the Republican Conference from 2008 to 2009 and the Republican chief deputy whip from 2006 to 2008."Thune\'s emergence as a conservative voice in the Senate gained him a lengthy profile in the conservative magazine The Weekly Standard. The American Conservative Union gave Senator Thune a rating of 100 in 2006, and again in 2010; as of 2010, Thune\'s lifetime ACU rating was 88.97. Thune was praised in a 2010 Weekly Standard profile as an exceptional politician who was, unlike many of his colleagues, able to communicate traditional conservatism, making him a popular alternative to Tea Party representatives.Russia investigation In June 2018, Thune called on Special Counsel Robert Mueller to "start winding" down his investigation into Russian interference in the 2016 presidential election.Committee assignmentsCommittee on Agriculture, Nutrition and ForestrySubcommittee on Rural Revitalization, Conservation, Forestry and CreditSubcommittee on Energy, Science and TechnologySubcommittee on Production, Income Protection and Price SupportCommittee on FinanceUnited States Senate Finance Subcommittee on International Trade, Customs, and Global CompetitivenessCommittee on Commerce, Science, and Transportation (Chairman)Subcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, and the InternetSubcommittee on Competitiveness, Innovation, and Export PromotionSubcommittee on Consumer Protection, Product Safety, and InsuranceSubcommittee on Science and SpaceSubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on BudgetCaucus membershipsAfterschool Caucuses', 'Political positions': 'Energy Since becoming a Senator, Thune has taken a leading role in formulating energy policy.[citation needed] He pushed for the final passage of a comprehensive energy bill, which overcame a series of Democratic filibusters and passed the Senate in 2005.[citation needed] Thune helped pass another energy bill in late 2007.[citation needed] Thune advocates developing alternative sources of energy such as ethanol and wind energy; South Dakota has high levels of corn production and windy prairies to produce these forms of energy.[citation needed]On March 6, 2014, Thune introduced the Reliable Home Heating Act (S. 2086; 113th Congress). The bill would require the Federal Motor Carrier Safety Administration (FMCSA) to exempt motor carriers that transport home heating oil from numerous federal safety regulations if the governor of a state declares a state of emergency caused by a shortage of residential heating fuel. The bill also would require the Energy Information Administration (EIA) to notify states if certain petroleum reserves fall below historical averages. Thune said he was "hopeful that this legislation will eliminate red tape for governors to better meet the needs of their residents and businesses during what can be very dangerous conditions."Facebook In May 2016, Thune sent Facebook a letter requesting details on how it operates its Trending Topics feature. This followed a  Gizmodo article that cited anonymous sources, claiming to be former Facebook employees, who alleged a systemic anti-conservative political bias in how material is selected for display in the list.Some commentators criticized Thune\'s letter as an example of government overreach against a private company. Facebook denied the bias allegations. Thune thanked Facebook in a statement saying, "Private companies are fully entitled to espouse their own views, so I appreciate Facebook\'s efforts to address allegations of bias raised in the media and my concern about a lack of transparency in its methodology for determining trending topics."Health care Thune was part of the group of 13 Senators drafting the Senate version of the American Health Care Act behind closed doors.Second Amendment Thune has become a strong advocate of gun rights, sponsoring legislation that would allow individuals with concealed carry permits to use such permits as a valid permit in other states.On October 3, 2017, Thune became the center of media attention for his response to the mass shooting in Las Vegas. "It sounds like [the shooter] used conversion kits and other things, you know, to make the weapons more lethal," Thune said. "We\'ll look at the facts when we get them all in here. I think a lot of us want to do everything we can to prevent tragedies like that from happening again. You know, it\'s an open society. And when somebody does what he wants to do it\'s going to be hard to prevent anything. But I think people are going to have to take steps in their own lives to take precautions. To protect themselves. And in situations like that, you know, try to stay safe. As somebody said, get small."', 'Presidential and vice-presidential speculation': 'Prior to the selection of Sarah Palin, Thune was mentioned as a possible vice presidential pick for Republican nominee John McCain in the 2008 presidential election. Thune publicly played down the speculation.Significant speculation arose regarding a potential 2012 presidential bid by Thune. He was encouraged to run by Senate Minority Leader Mitch McConnell, and South Carolina Senator Lindsey Graham, who called him "a consensus builder." One Wall Street Journal article stated that Thune had "name ID in the parts of the first caucus state of Iowa that get neighboring South Dakota media, a $6.9 million bank account he could use for a presidential run, and a national fundraising list of 100,000 names from his race against [former Senator Tom] Daschle." DNC Executive Director Jennifer O\'Malley Dillon publicly stated that "among a field of generally flawed (in one way or another) Republican presidential candidates, there is one who genuinely scares her. \'This is personal[,] but John Thune is somebody that I have nightmares about,\' she said. \'I\'ve worked for Tim Johnson and Tom Daschle and he is just a guy you can\'t ever count out.\'" According to multiple commentators, Thune\'s candidacy could be helped by his personal appearance (he "looks like a president"). On February 22, 2011, Thune announced he would not run in 2012.During the summer of 2012, the USA Today reported that "South Dakota\'s Thune is on [the] short list for vice president," but Wisconsin Congressman Paul Ryan was instead selected as the running mate of Republican nominee Mitt Romney.Despite some speculation, Thune declined to seek the White House in 2016, stating that his "window...might have closed in 2012."', 'Electoral history': "South Dakota's at-large Congressional district Republican primary election, 1996PartyCandidateVotes%RepublicanJohn R. Thune41,32259.49RepublicanCarole Hillard28,13940.51South Dakota's at-large congressional district: Results 1996–2000YearDemocraticVotesPctRepublicanVotesPct3rd PartyPartyVotesPct3rd PartyPartyVotesPct1996Rick Weiland119,54737%John R. Thune186,39358%Stacey L. NelsonIndependent10,3973%Kurt EvansIndependent6,8662%1998Jeff Moser64,43325%John R. Thune194,15775%2000Curt Hohn78,32125%John R. Thune231,08373%Brian LerohlLibertarian5,3572%Senate elections in South Dakota: Results 2002–2016YearDemocraticVotesPctRepublicanVotesPct3rd PartyPartyVotesPct2002Tim Johnson167,48150%John R. Thune166,94949%Kurt EvansLibertarian3,0711%2004Tom Daschle193,34049%John R. Thune197,84851%2010John R. Thune227,947100%2016Jay Williams104,14028.2%John R. Thune265,51671.8%", 'Personal life': 'Thune married the former Kimberley Weems of Doland, South Dakota in 1984.  They have two daughters, Brittany and Larissa.Thune is a fan of the bands Styx, Journey, Boston, and the Doobie Brothers.Thune is physically active and has frequently competed in running events.  A 2012 feature by Runner\'s World Magazine noted that Thune has "been the fastest man in Congress since 2009."', 'Further reading': 'Lauck, Jon K.  Daschle Vs. Thune: Anatomy of a High Plains Senate Race University of Oklahoma Press (September 30, 2007). ISBN\xa00-8061-3850-5.  ISBN\xa0978-0-8061-3850-3Biography at the Biographical Directory of the United States CongressProfile at Vote SmartFinancial information (federal office) at the Federal Election CommissionLegislation sponsored at the Library of CongressRepresentative-Elect John Thune (R-SD) profile from CNN, 1996', 'introduction': "John Randolph Thune (/ˈθuːn/; born January 7, 1961) is an American politician serving as the senior United States Senator from South Dakota, a seat he has held since 2005. A member of the Republican Party, he previously served as the U.S. Representative for South Dakota's at-large congressional district from 1997 to 2003.\nHe became South Dakota's senior U.S. Senator with the retirement of Tim Johnson in 2015. He served as the GOP's Chief Deputy Whip in 2006, chairman of the Republican Policy Committee in June 2009, and Republican Conference Chairman in 2011, the third-ranking position in the Senate. He has worked in politics and civic organizations since completing his MBA graduate degree. He is also the current dean of South Dakota's congressional delegation.\n\n"}, 'personal': {'Born': 'John Randolph Thune (1961-01-07) January 7, 1961 (age57)Pierre, South Dakota, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Kimberley Weems', 'Children': '2', 'Education': 'Biola University (BA)University of South Dakota (MBA)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom South Dakota': {'date': 'Assumed office January 3, 2005Serving with Mike Rounds', 'Preceded by': 'Tom Daschle'}, 'Chair of the Senate Commerce, Science, and Transportation Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Jay Rockefeller'}, 'Chair of the Senate Republican Conference': {'date': 'Assumed office January 26, 2012', 'Leader': 'Mitch McConnell', 'Preceded by': 'Lamar Alexander'}, "Member of the US House of Representativesfrom South Dakota's at-large district": {'date': 'In officeJanuary 3, 1997– January 3, 2003', 'Preceded by': 'Tim Johnson', 'Succeeded by': 'Bill Janklow'}}, 'code': 'T000250'}