{'name': 'Jon.Tester', 'picture': 'T000464.jpg', 'detail': {'Early life, education, and farming career': "Tester was born in Havre, Montana, one of three sons of Helen Marie (née Pearson) and David O. Tester. His father was of English descent and his mother was of Swedish ancestry. Tester grew up in Chouteau County, near the town of Big Sandy, Montana, on land that his grandfather homesteaded in 1912. At the age of 9, he lost the middle three fingers of his left hand in a meat-grinder accident. In 1978, he graduated from the University of Great Falls with a B.S. in music.Tester then worked for two years as a music teacher in the Big Sandy School District before returning to his family's farm and custom butcher shop. He and his wife continue to operate the farm; in the 1980s, they switched from conventional to organic farming. Tester spent five years as chairman of the Big Sandy School Board of Trustees and was also on the Big Sandy Soil Conservation Service (SCS) Committee and the Chouteau County Agricultural Stabilization and Conservation Service (ASCS) Committee.", 'Montana Senate (1999–2007)': 'Elections Tester was first elected to represent the 45th district in the Montana Senate in 1998, after his neighbor, a Republican State Senator, decided not to run for re-election. Before running for State Senate, Tester served on the Big Sandy school board for a decade. He was elected the minority whip for the 2001 session. In 2002, he was re-elected with 71% of the vote, and he became minority leader in 2003. In 2004 he moved to the 15th district as a "holdover" because of redistricting. In 2005, Tester was elected president of the Montana Senate, the chief presiding officer of the Montana Legislature\'s upper chamber.Tenure His election as President marked a transition for Montana Democrats as they moved into the majority leadership of the Senate for the first time in more than a decade. Term limits prohibited Tester from running for State Senate for a third consecutive term. Tester cited a prescription drug benefit program, reinstatement of the "Made in Montana" promotion program, a law to encourage renewable energy development, and his involvement with a bill that led to an historic increase in public school funding as accomplishments while in office.Committee assignments Senate Finance Committee (2001–2004)Senate Agriculture Committee (2000–2005)Senate Rules Committee (2003–2005)Senate Business, Labor, and Economic Affairs Committee (2005)Panthera Leo City Council of Petroleum County (2012)Council Interim Committee (2003–2004)', 'US Senate (2007–present)': 'Elections 2006Tester announced his candidacy in May 2005 for the U.S. Senate seat held by Republican incumbent Senator Conrad Burns. Tester was the second Democrat to jump into the race, after state auditor John Morrison. While Tester was seen as having a greater following among his fellow legislators, his opponent, whose grandfather was governor of Nebraska, was able to raise significantly more money and had greater statewide name recognition.Morrison had collected $1.05 million as of the start of 2006, including $409,241 in the last three months of 2005, but "Morrison\'s advantages in fundraising and name identification [did] not translate into a lead in the polls," most of which showed the race as being exceedingly tight, some calling it a "deadlock" as of late May.In the June 2006, Tester won the Democratic nomination by more than 25 percentage points in a six-way primary. Tester was described as having "gained momentum in closing weeks of the campaign through an extensive grass-roots effort."In the November 2006 election, Tester defeated Burns, receiving 198,302\tvotes (49%) to Burns\'s 195,455 (48%). The race was so close that Tester\'s victory was confirmed only the day after the election.2012Tester successfully ran for re-election to a second term against Republican U.S. Congressman Denny Rehberg.Tester\'s race was seen as a pivotal one for both parties seeking the Senate majority. Tester split with Democrats on several key issues, such as the Keystone XL oil pipeline, but has also voted with his party on issues such as health care reform and the Dodd–Frank financial services overhaul.When announcing his candidacy, Rehberg called Tester a "yes man" for President Obama, saying that he sided with the administration in 97% of his votes. Rehberg cited Tester\'s support for the healthcare legislation and the 2009 stimulus, both of which Rehberg opposed. Tester said that he stood by his votes on both, saying that the healthcare legislation contained "a lot of good stuff". The Los Angeles Times noted that Tester diverged from his party on matters such as gun rights and illegal immigration.2018Tester is running for a third term against Republican Matt Rosendale, who is the current Montana State Auditor. As of September 25, Tester leads over Rosendale by 4 points.Tenure A New York Times profile of Tester after his 2006 election described him as "truly your grandfather\'s Democrat—a pro-gun, anti-big-business prairie pragmatist whose life is defined by the treeless patch of hard Montana dirt that has been in the family since 1916."During a Billings press conference, the Tester campaign released a statement from Senate Majority Leader Harry Reid, D-Nev., pledging to give Tester a coveted seat on the Appropriations Committee "as soon as possible," regardless of whether Democrats wrested control of the Senate from Republicans. On January 13, 2009, during Tester\'s second session of Congress, he was given a seat on the Appropriations Committee. In 2013, Tester became chairman of the Banking Committee\'s Securities, Insurance, and Investment Subcommittee.In September 2013, he announced opposition to the appointment of Larry Summers as chairman of the Federal Reserve; lacking a committee majority Summers then withdrew his name from consideration.Committee assignments Committee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related AgenciesSubcommittee on Energy and Water DevelopmentSubcommittee on Financial Services and General GovernmentSubcommittee on Homeland Security (Ranking Member)Subcommittee on Interior, Environment, and Related AgenciesSubcommittee on Labor, Health and Human Services, Education, and Related AgenciesSubcommittee on Military Construction, Veterans Affairs, and Related AgenciesCommittee on Banking, Housing, and Urban AffairsSubcommittee on Economic PolicySubcommittee on Financial InstitutionsSubcommittee on Securities, Insurance, and InvestmentCommittee on Commerce, Science, and TransportationCommittee on Indian AffairsCommittee on Veterans\' Affairs (Ranking Member)Caucus memberships Congressional Sportsmen\'s Caucus (Co-Chair)International Conservation Caucus', 'Political positions': 'Senator Jon Tester presents himself as a moderate Democrat. Like other red-state Democrats, Tester is often forced to choose between voting with his constituents and voting with his party. In 2012, USA Today noted that Tester had sometimes "split with Democrats — most recently in his support of construction of the Keystone XL oil pipeline from Canada to the Gulf Coast — but he has voted with Obama on the most critical issues of his presidency: the stimulus, the health care legislation and the Dodd-Frank financial services overhaul." Five ThirtyEight, which tracks votes in Congress, has found that Senator Tester votes with Trump\'s position about 37% of the time as of July 2018. CQ Roll Call reported that, in its analysis of votes, Senator Tester voted with Trump\'s position approximately half of the time in 2017 and 2018.Interest group ratings Jon Tester is often considered to be a moderate or centrist Democrat. According to GovTrack, Jon Tester is the Senate\'s fourth most moderate Democrat being placed by GovTrack\'s 2017 analysis to the right of most of his Democratic colleagues and even just to the right of Republican Senator Susan Collins. Tester has generally received high ratings from liberal groups and low scores from conservative groups. In 2012, he was given a 90% rating by Americans for Democratic Action and 86% by the League of Conservation Voters. Conversely, he received scores of 11% from the National Taxpayers Union and 4% from the American Conservative Union. The non-partisan National Journal rated his votes overall as 55% liberal and 45% conservative.In 2013, National Journal gave him a score of 51% on "Liberal on Economic Policy" and 48% on "Conservative on Economic Policy." In 2015-16, the conservative Center for Security Policy gave him a 13% rating.CrowdPac, which rates politicians based on donations they receive and give, gave Senator Tester a score of 5.3L with 10L being the most liberal and 10C being the most conservative.LGBT rights On December 18, 2010, Tester voted in favor of the Don\'t Ask, Don\'t Tell Repeal Act of 2010. While he originally was an opponent of same-sex marriage, and opposed it during both his 2006 and 2012 campaigns, Tester announced his support for the institution in March 2013, citing concerns of federal government overreach. After the Obergefell v. Hodges ruling mandating that all U.S. states recognize gay marriage, Tester praised the ruling as protecting gays\' "rights and freedoms."Abortion and embryonic stem cell research He supports abortion rights and embryonic stem cell research.Economy and jobs On Meet the Press in 2006, he asserted that "there\'s no more middle class" because of Bush administration policies.In 2011, Tester was one of two Democratic Senators to filibuster the American Jobs Act. It was reported that he wasn\'t concerned about the surtax on some families to pay for the plan, but was unsure that the new spending would actually create jobs. "I\'ve got more of a concern about a state aid package...and how the money is going to be spent and whether it’s really going to create jobs," he explained.In January 2018, Tester was the only Democratic Senator from a Republican-leaning state to oppose a stopgap funding measure to end a three-day government shutdown and reopen the federal government.In 2018, Tester became one of the few Democrats in the Senate supporting a bill that would relax "key banking regulations". As part of at least 11 other Democrats, Tester argued that the bill would "right-size post-crisis rules imposed on small and regional lenders and help make it easier for them to provide credit". Chuck Schumer and Elizabeth Warren vehemently oppose the legislation. Tester became the first Democrat endorsed by Friends of Traditional Banking, a political action committee that had previously endorsed Republicans.Immigration In December 2010, Tester voted against the DREAM Act, which would have created a pathway to citizenship for the foreign-born children of illegal immigrants. He has said, "Illegal immigration is a critical problem facing our country, but amnesty is not the solution. I do not support legislation that provides a path for citizenship for anyone in this country illegally."In 2017, he criticized President Donald Trump for saying that he would cancel DACA in six months. "I don\'t support what the president did," Tester said. "I think it\'s ill-informed, I think it rips families apart, and it\'s not what this country stands for." Asked if he would now commit to voting for the DREAM Act, he said, "I support comprehensive immigration reform."Health care Tester supported the Patient Protection and Affordable Care Act, also known as ObamaCare, voting for it in December 2009. Tester voted for the Health Care and Education Reconciliation Act of 2010.In 2017, he said that Democrats should consider a single-payer health care system. In July that year, Tester said that health care needed reform but that the latest GOP attempt at reform was a "train wreck" that would "strip health care away from millions of Americans." He said that Democrats should "work to fix what\'s wrong with the current health care system in a bipartisan way. And that means going through committee process, not doing it in a dark room with a select few, but going through the committee process and getting good ideas from everybody." Reminded that some Democrats "believe that compromise on this issue is not only unprincipled but unnecessary," Tester said the issue was "too important...not to try to help remedy the problems."Supreme Court votes Tester voted to confirm Supreme Court nominees Sonia Sotomayor and Elena Kagan. He refused, however, to support Donald Trump\'s nomination of Neil Gorsuch, writing that "Judge Gorsuch is a smart man but that doesn’t make him right for a lifetime appointment to the Supreme Court." He explained that he could not "support a nominee who refuses to answer important questions," and said he feared that under Gorsuch "dark money [would] continue to drown out the voices and votes of citizens, the Court [would] stand between women and their doctors, and the government [would] reach into the private lives of law-abiding Americans." He criticized Gorsuch\'s rulings in Sebelius v. Hobby Lobby, in which Gorsuch "ruled that a corporation can have religious beliefs just like people," and in Riddle v. Hickenlooper, which showed that "Gorsuch believes campaign contributions deserve First Amendment protections." He feared that a Justice Gorsuch "would threaten our access to a doctor and endanger the Constitutional rights of law-abiding citizens" and charged that while Gorsuch "is good on the Second Amendment, his views on the Fourth Amendment — guaranteeing the right to privacy — should be concerning to everyone."Citizens United Supreme Court ruling Tester opposed the Supreme Court\'s Citizens United ruling. The ruling allowed corporations and unions to donate unlimited amounts of money to third party political groups. He proposed a constitutional amendment to reverse the decision, and argued that the ruling had a bad impact on American democracyEnvironment Tester promoted the use of carbon-capture and sequestration technology to cleanly exploit Montana\'s coal reserves.In May 2011, a Newsweek reporter who traveled with Tester in Montana said that the "desire to wrest control of wolves from D.C....was the only topic that came up everywhere he went: hotels, coffee shops, art auctions. \'What do you think about wolves?\' a sixth grader asked during an assembly in Miles City. \'I think we should start hunting them again!\' Tester said. The kids let out their loudest cheer of the afternoon."Tester tried to revive a bill that was meant to be a compromise between the conservationists and the timber industry. The bill would put 700,000 acres of wilderness aside for "light-on-the-land logging projects" with the intention of creating jobs in the flagging industry. It was noted that Tester was not "winning admirers on his side", with some liberal environmentalists saying that gives lumber mills control of the national forests.Guns Tester is a gun owner. On gun rights, the National Rifle Association has given him an A- rating, but another group, Gun Owners of America, has given Tester a rating of F.Tester supports efforts to loosen restrictions on gun exports, stating such an action would help U.S. gun manufacturers expand their business and would create more jobs.In 2016, Tester voted against a Democrat-sponsored proposal that would have required background checks for purchases at gun shows and for purchases of guns online nationwide. Tester argued that the bill would "have blocked family members and neighbors from buying and selling guns to one another without a background check." Tester voted for a second Democrat-sponsored proposal to ban gun sales to individuals on the terrorist watch list. Both proposals failed to pass.Torture In May 2018, Tester said that he would not support Gina Haspel\'s nomination to become CIA Director. Tester, the first Democrat from a red state to express opposition to her, cited her role in Bush administration interrogation and detention programs, and said that he was "not a fan of waterboarding."Veterans affairs As ranking member of the Senate Veterans\' Affairs Committee, Tester raised concerns about the nomination of Ronny Jackson to head the U.S. Department of Veterans Affairs. There were allegations against Jackson that he dispensed medications in a medically unethical fashion, was drunk on an overseas trip and drunkenly banged on the hotel door of a female colleague. Jackson denied the allegations but withdrew his nomination. Trump in response called for the resignation of Tester and said that the allegations against Jackson were false. According to CNN, four sources familiar with the allegation that Jackson drunkenly banged on the door of a female colleague confirmed that it did happen.The Secret Service said that they could not verify any of these allegations that Tester said about Jackson. Sen. Johnny Isakson, the Republican chairman of the Senate Veterans Affairs Committee, defended Tester, saying he had no problem with Tester\'s handling of the Jackson nomination.', 'Controversies': 'Campaign contributions In June 2010, after giving a brief talk to a few attorneys at the offices of Thornton Law Firm in Boston, Tester received a total of $26,400 in campaign contributions from attendees. The firm later paid some of the partners a "bonus" exactly equal the contributions they had made out to Tester’s campaign.The Hill reported in April 2011 that Tester had "reaped a windfall in contributions from banks and lobbyists since introducing legislation to delay new regulations on debit-card swipe fees. Tester collected nearly $60,000 in contributions from credit card companies and other opponents of the proposed caps on swipe fees in the 17 days following the introduction of his bill." Much of the money came from executives at TCF Financial Corporation, the lead plaintiff in a federal lawsuit to block the "Durbin rule," which would lower the fees that banks could charge retailers for debit-card transactions.A 2012 GOP ad claimed that Tester had "received more lobbyist money than any other DC politician." In response, Tester ran an ad in which "several Montanans prais[ed] Tester for cracking down on lobbyists." The Weekly Standard reported that despite the ad\'s claims, and despite Tester\'s 2006 promises to "clean up the K Street lobbyist culture," Tester was indeed the Senate\'s top recipient of lobbyist money.In March 2012, the Montana GOP filed a complaint with the Senate Ethics Committee requesting an investigation into the actions of Tester and Max Baucus. The complaint cited a Politico report suggesting that Baucus\' K Street connections were "warning clients against giving campaign contributions to Tester\'s Republican challenger Rep. Denny Rehberg". Tester denied any wrongdoing.', 'Personal life': 'During Tester\'s senior year in college, he married Sharla Bitz. Like Tester, she comes from an agricultural family and grew up in north-central Montana. They have two children: a daughter, Christine, born in 1980; and a son, Shon, born in 1985.Before his election to the Senate, Tester had never lived more than two hours away from his north-central Montana farm. In addition to his Montana farm, Tester owns a home in Washington D.C.A January 2012 profile of Tester focused on the fact that he butchers and brings his own meat with him to Washington. He said "Taking meat with us is just something that we do.... We like our own meat."', 'introduction': "Jon Tester (born August 21, 1956) is an American politician serving as the senior United States Senator from Montana, in office since 2007. He is a member of the Democrat Party.\nTester was first elected to the Senate in 2006, defeating Republican incumbent Conrad Burns in one of the closest Senate races of that year. He won reelection in 2012 against U.S. Representative Denny Rehberg in another close race. Tester was previously the president of the Montana Senate and worked as a music teacher and farmer. He became the senior Senator in 2014 following Max Baucus's departure. He is currently the dean of the Montana congressional delegation.\n\n"}, 'personal': {'Born': ' (1956-08-21) August 21, 1956 (age62)Havre, Montana, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Sharla Bitz', 'Education': 'University of Great Falls (BA)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Montana': {'date': 'Assumed office January 3, 2007Serving with Steve Daines', 'Preceded by': 'Conrad Burns'}, "Ranking Member of the Senate Veterans' Affairs Committee": {'date': 'Assumed office January 3, 2017', 'Preceded by': 'Richard Blumenthal'}, 'Chair of the Democratic Senatorial Campaign Committee': {'date': 'In officeJanuary 3, 2015– January 3, 2017', 'Leader': 'Harry Reid', 'Preceded by': 'Michael Bennet', 'Succeeded by': 'Chris Van Hollen'}, 'Chair of the Senate Committee on Indian Affairs': {'date': 'In officeFebruary 12, 2014– January 3, 2015', 'Preceded by': 'Maria Cantwell', 'Succeeded by': 'John Barrasso'}, 'President of the Montana Senate': {'date': 'In officeJanuary 3, 2005– January 3, 2007', 'Deputy': 'Dan Harrington', 'Preceded by': 'Bob Keenan', 'Succeeded by': 'Mike Cooney'}, 'Member of the Montana Senatefrom the 15th district': {'date': 'In officeJanuary 3, 2005– January 3, 2007', 'Succeeded by': 'Jim Peterson'}, 'Member of the Montana Senatefrom the 45th district': {'date': 'In officeJanuary 4, 1999– January 3, 2005', 'Succeeded by': 'Jim Shockley'}}, 'code': 'T000464'}