{'name': 'Juan.Vargas', 'picture': 'V000130.jpg', 'detail': {'Early life and education': 'Juan Vargas was born on an chicken ranch in National City, California, where he grew up very poor. He is the third of ten children of Tomas and Celina Vargas, who immigrated to the United States from Mexico in the late 1940s as part of the Bracero program. Vargas graduated Magna Cum Laude with a BA from University of San Diego and earned an MA in Humanities from Fordham University in New York City.After college, Vargas joined the Jesuit Novitiate (introduction) in Santa Barbara. In the Jesuits, Vargas served in an orphanage in the civil-war-torn jungles of El Salvador. After leaving the Jesuits, he decided on law school and graduated in 1991 with a JD from Harvard Law School, making him a classmate of President Barack Obama.', 'Early political career (1992–2000)': '1992 congressional election In 1992, he decided to run for the newly created 50th Congressional District, which was based in San Diego. He lost the Democratic primary, ranking fourth with 19% of the vote. Bob Filner won the primary with a plurality of just 26% and went on to win the election.San Diego City Council Vargas served on the San Diego City Council from 1993–2000. While on the Council, he created "Operation Restore" to employ homeless individuals to remove graffiti and to rehabilitate homes.1996 congressional election In 1996, Vargas decided to challenge Filner in the Democratic primary. Vargas wouldn\'t debate Filner, so the incumbent instead sparred with a life-sized Vargas cardboard cutout. Vargas said he agrees with Filner on "99 percent" of issues. Filner defeated him 55%–45%.', 'California State Assembly (2000–2007)': "Elections In 2000, Vargas decided to run for California's 79th State Assembly district. He defeated Republican Jon Parungao 77%–19%. In 2002, he defeated Republican Mark Fast 66%–30%. In 2004, he defeated Libertarian Eli Wallace Conroe 85%–15%.Tenure In his first year in the Assembly, he was appointed Assistant Majority Leader. He authored AB 188, which was legislation that bans smoking in children's playgrounds. He also introduced legislation aimed at protecting children from arcade video games. Vargas also authored legislation to mandate life sentences for people who commit violent sex crimes against children, which served as a model for Chelsea's Law.Committee assignments Business and ProfessionsInsurance (Chair)2006 congressional election In 2006 Vargas decided to challenge Filner for a third time, this time in California's 51st congressional district. Vargas accused Filner of being a part of the culture of corruption of Washington, pointing out that Filner had paid his wife more than $500,000 in campaign funds for consulting services performed from their condominium in Washington. Filner in return argued that Vargas had controversial payments to his brother-in-law, who was a lobbyist for realtors. Filner defeated Vargas 51%–43%, with Danny Ramirez getting 6% of the vote.", 'Business career (2007–2009)': "After leaving the State Assembly in 2006 due to term limits, Vargas took a job with a home, auto and small business insurance company, where he was tasked with creating jobs and outreach in diverse San Diego Communities as part of the company's diversity initiative.[citation needed] Vargas left that job at the end of 2009 to run as a Democratic candidate for the California State Senate.", 'California State Senate (2010–2013)': '2010 election In 2010 Vargas narrowly won a seat in the California State Senate, 40th District.  He defeated Assemblywoman Mary Salas by 22 votes, after recounts in San Diego and Riverside counties. He resigned from the Senate effective January 2, 2013 so that he could take his seat as a Congressman. A special election to fill his seat was held in March 2013.Committee assignments Standing CommitteesBanking & Financial Institutions (Chair)AgricultureBusiness, Professions, and Economic DevelopmentEducationPublic Employment and RetirementSubcommitteeEducation: Sustainable School FacilitiesJoint CommitteeRulesSelect CommitteeRecovery, Reform, and Re-Alignment', 'US House of Representatives (2012–present)': "2012 election In 2012 when Filner announced he would retire from Congress to run for Mayor of San Diego, Vargas endorsed him despite their history of bitter rivalry. Vargas then ran for Filner's seat in the 51st district. In the open primary, he ranked first with 46% of the vote. Republican Michael Crimmins ranked second with 20%, Democratic State Senator Denise Moreno Ducheny came in third with 15%, and four other candidates received single digit percentages. In November, he defeated Crimmins 71%–29%.Tenure He was sworn in on January 3, 2013.Committee assignments Committee on AgricultureSubcommittee on General Farm Commodities and Risk ManagementSubcommittee on Horticulture, Research, Biotechnology, and Foreign AgricultureCommittee on Foreign AffairsSubcommittee on the Middle East and South AsiaSubcommittee on Terrorism, Nonproliferation, and TradeCommittee on House AdministrationCaucus memberships New Democrat CoalitionCongressional Hispanic Caucus", 'Personal life': "He and his wife, Adrienne, live in the Golden Hill area of San Diego and have two daughters, Rosa Celina and Helena Jeanne. During the 1999 armed conflict in Kosovo, Vargas welcomed a Kosovar refugee family into his family's home for nearly two years.", 'introduction': "Juan Carlos Vargas (born March 7, 1961) is an American politician who has been the U.S. Representative for California's 51st congressional district since 2013. The district includes all of Imperial County as well as the southernmost portions of San Diego County.  He is a Democrat.\nVargas previously served in the California State Senate representing the 40th District, the California State Assembly representing the 79th district, and the San Diego City Council.\n\n", 'code': '51'}, 'personal': {'Born': 'Juan Carlos Vargas (1961-03-07) March 7, 1961 (age57)National City, California, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Adrienne Vargas', 'Children': '2', 'Education': 'University of San Diego (BA)Fordham University (MA)Harvard University (JD)', 'Website': 'House website'}, 'timeline': {"Member of the US House of Representativesfrom California's 51st district": {'date': 'Assumed office January 3, 2013', 'Preceded by': 'Bob Filner'}, 'Member of the California State Senatefrom the 40th district': {'date': 'In officeDecember 6, 2010– January 2, 2013', 'Preceded by': 'Denise Moreno Ducheny', 'Succeeded by': 'Ben Hueso'}, 'Member of the California State Assemblyfrom the 79th district': {'date': 'In officeDecember 4, 2000– December 4, 2006', 'Preceded by': 'Denise Moreno Ducheny', 'Succeeded by': 'Mary Salas'}, 'Member of San Diego City Councilfrom the 8th district': {'date': 'In officeFebruary 22, 1993– December 4, 2000', 'Preceded by': 'Bob Filner', 'Succeeded by': 'Ralph Inzunza'}, 'code': '51'}, 'code': 'V000130'}