{'name': 'Kamala.Harris', 'picture': 'H001075.jpg', 'detail': {'Early life and education': "Harris was born on October 20, 1964, in Oakland, California, to a Tamil Indian mother, Shyamala Gopalan Harris (1938–2009), and a Jamaican father, Donald Harris. Her mother was a breast cancer researcher, who emigrated from Chennai (then Madras), Tamil Nadu, India, in 1960, and her father a Stanford University economics professor who emigrated from Jamaica in 1961 for graduate study in economics at University of California, Berkeley. Her name, Kamala, comes from the Sanskrit word for lotus. She was extremely close to her maternal grandfather, P. V. Gopalan, an Indian diplomat, and as a child, she frequently visited her family in Besant Nagar, in Chennai, Tamil Nadu. She has one younger sister, Maya.The family lived in Berkeley, California, where both of Harris' parents attended graduate school. Harris' parents divorced when she was 7 and her mother was granted custody of the children by court-ordered settlement. After the divorce, her mother moved with the children to Montreal, Québec, Canada, where Shyamala took a position doing research at the Jewish General Hospital and teaching at McGill University.After graduating from Montreal's Westmount High School in Quebec, Harris attended Howard University in Washington, D.C., where she majored in political science and economics. At Howard, Harris was elected to the liberal arts student council as freshman class representative, was a member of the debate team, and joined the Alpha Chapter of Alpha Kappa Alpha sorority.Harris then returned to California, earning her Juris Doctor (J.D.) from the University of California, Hastings College of the Law, in 1989. She was admitted to the State Bar of California in 1990.", 'Early career': 'Harris served as a deputy district attorney in Alameda County, California, from 1990 to 1998. Harris says she sought a career in law enforcement because she wanted to be "at the table where decisions are made." In 1993, she started dating California Speaker of the Assembly Willie Brown, who introduced her to many powerful individuals in the California and Sacramento political and campaign management establishment. In 2000, San Francisco\'s elected City Attorney, Louise Renne, recruited Harris to join her office, where she was chief of the Community and Neighborhood Division, which oversees civil code enforcement matters.District Attorney of the City and County of San Francisco After the Fajitagate scandal, Harris defeated two-term incumbent Terence Hallinan in the 2003 election to become District Attorney of the City and County of San Francisco.In April 2004, San Francisco Police Department Officer Isaac Espinoza was shot and killed in the line of duty.  Three days later D.A. Harris announced she would not seek the death penalty, infuriating the San Francisco Police Officers Association.  During Officer Espinoza\'s funeral at St. Mary\'s Cathedral, U.S. Senator and former San Francisco mayor Dianne Feinstein rose to the pulpit and called on Harris, who was sitting in the front pew, to secure the death penalty, prompting a standing ovation from the 2,000 uniformed police officers in attendance.  Harris still refused. Officer Espinoza\'s killer was convicted of the murder and sentenced to life in prison. Shortly thereafter, Harris demoted veteran career prosecutor Paul Cummins, the chief assistant to her predecessor who former officer Joe O\'Sullivan described as "the most ethical prosecutor I\'ve met", from the 80-person felony prosecution unit to Harris\'s former position in the DA\'s office.As D.A., Harris started a program that gives first-time drug dealers the chance to earn a high school diploma and find employment.  Over eight years, the program produced fewer than 300 graduates, but achieved a very low recidivism rate.  Harris was re-elected in 2007 when she ran unopposed.In 2009, Harris wrote Smart on Crime: A Career Prosecutor\'s Plan to Make Us Safer, in which she looked at criminal justice from an economic perspective and attempted to reduce temptation and access for criminals. The book discusses a series of "myths" surrounding the criminal justice system and presents proposals to reduce and prevent crime. Recognized by The Los Angeles Daily Journal as one of the top 100 lawyers in California, Harris served on the board of the California District Attorney\'s Association and was vice president of the National District Attorneys Association.She has been outspoken on the need for innovation in public safety, particularly with respect to reducing the recidivism rate in San Francisco. One such program, "Back on Track", was signed into law by Governor Arnold Schwarzenegger as a model program for the state. Initially, there were issues with removing illegal immigrants from the program, such as an incident involving Alexander Izaguirre, who was later arrested for assault. The program was revised to address that concern, barring anyone who could not legally be employed in the United States. Harris also protected informants with the Nuestra Familia prison gang who were engaged in illegal activities including drug trafficking and weapon possession.Violent crimes, felons, incarceration, and conviction rate While Harris was the San Francisco District Attorney, the overall felony conviction rate rose from 52% in 2003 to 67% in 2006, the highest in a decade; there was an 85% conviction rate for homicides, and convictions of drug dealers increased from 56% in 2003 to 74% in 2006. While these statistics represent only trial convictions, Harris also closed many cases via plea bargains. When she took office, she took a special interest in clearing part of the murder caseload from the previous administration. Harris claimed that the records from that administration were less than optimal, and worked to get convictions on what she could. That meant that out of the 73 homicide cases backlogged, 32 cases took deals for lesser charges such as manslaughter or took pleas to other crimes such as assault or burglary while the murder charges were dismissed.However, the San Francisco DA\'s incarceration rates were among the lowest in the entire state of California—fully ten times lower than in San Diego County, for example. According to the San Francisco Chronicle, "roughly 4 of every 100 arrests resulted in prison terms in San Francisco, compared with 12.8 out of 100 in Alameda County, 14.4 of 100 in Sacramento County, 21 of 100 in San Mateo and Santa Clara counties, 26.6 of 100 in Fresno County, 38.7 of 100 in Los Angeles County and 41 of 100 in San Diego County." Police also noted that lenient sentencing from San Francisco judges also played a role in this.While officers within the SFPD credited Harris with tightening loopholes in bail and drug programs that defendants had exploited in the past, they also accused her of being too deliberate in her prosecution of murder suspects. Additionally, in 2009, San Francisco prosecutors won a lower percentage of their felony jury trials than their counterparts at district attorneys\' offices covering the 10 largest cities in California, according to data on case outcomes compiled by officials at the San Francisco Superior Court as well as by other county courts and prosecutors. (Officials in Sacramento, the sixth-largest city in California, did not provide data.) Harris\'s at-trial felony conviction rate that year was 76%, down 12 points from the previous year. By contrast, the then-most recent recorded statewide average was 83%, according to statistics from the California Judicial Council. In a small sample, a report computed that the conviction rate for felony trials in San Francisco County in the first three months of 2010 was just 53%. San Francisco has historically had one of the lowest conviction rates in the state; the county is known for a defendant-friendly jury pool.In 2012, Superior Court Judge Anne-Christine Massullo ruled that San Francisco District Attorney Harris\' office violated defendants\' rights by hiding damaging information about a police crime lab technician, and was indifferent to demands that it account for its failings.Hate crimes and civil rights As San Francisco District Attorney, Harris created a special Hate Crimes Unit, focusing on hate crimes against LGBT children and teens in schools. She convened a national conference to confront the "gay-transgender panic defense", which has been used to justify violent hate crimes. Harris supports same-sex marriage in California and opposed both Proposition 22 and Proposition 8.In 2004, The National Urban League honored Harris as a "Woman of Power"; in 2005, she received the Thurgood Marshall Award from the National Black Prosecutors Association. In her campaign for California Attorney General, she received the endorsements of numerous groups, including EMILY\'s List; California Legislative Black Caucus; Asian American Action Fund; Black Women Organized for Political Action; the National Women\'s Political Caucus; Mexican American Bar Association; and South Asians for Opportunity.', 'Attorney General of California': '2010 election On November 12, 2008, Harris announced her candidacy for California Attorney General.  Both of California\'s United States Senators, Dianne Feinstein and Barbara Boxer, as well as House Speaker Nancy Pelosi, endorsed Harris during the Democratic Party primary.  In the June 8, 2010, primary, she was nominated with 33.6% of the vote. Her closest competitors had 15.6% and 15.5% respectively.In her campaign for California Attorney General, Harris received the endorsements of United Farm Workers cofounder Dolores Huerta, United Educators of San Francisco, and San Francisco Firefighters Local 798. She also received the endorsement of Antonio Villaraigosa, Mayor of Los Angeles. In the general election, she faced Los Angeles County District Attorney Steve Cooley. On election night, November 2, 2010, Cooley prematurely declared victory, but many ballots remained uncounted. On November 24, as the count advanced, Harris was leading by more than 55,000 votes, and Cooley conceded. On January 3, 2011, Harris became the first female, Jamaican American, and Indian American attorney general in California.In 2012, she sent a letter to 100 mobile-app developers, asking them to comply with California law with respect to privacy issues. If any developer of an application that could be used by a Californian does not display a privacy policy statement when the application is installed, California law is broken, with a possible fine $2500 for every download. The law affects any developer anywhere in the world if the app is used by a Californian.At the 2012 Democratic National Convention Harris gave a prime-time speech attacking Mitt Romney.  During the second Obama administration, Harris was mentioned as a possible nominee for a seat on the United States Supreme Court if a seat on that court became vacant. In February 2016, The New York Times identified her as a potential US Supreme Court nominee to replace Justice Antonin Scalia.2014 election Harris announced her intention to run for re-election in February 2014 and filed paperwork to run on February 12. According to the office of California Secretary of State Debra Bowen, Harris had raised the money for her campaign during the previous year in 2013. On August 13, 2014, Harris announced her endorsement of Betty Yee for California State Controller, calling her one of the state\'s "most knowledgeable and responsible money managers," and said she was proud to endorse her. Yee, in return, sang Harris\'s praises and called her an "outstanding elected leader." Harris also endorsed Bonnie Dumanis and Sandra Fluke. Harris herself was endorsed by The Sacramento Bee, Los Angeles Daily News, and The Los Angeles Times.On November 4, 2014, Harris was re-elected against Republican Ronald Gold.In September 2014, when US Attorney General Eric Holder announced his intention to step down, it was speculated that Harris might be a potential candidate as the next US Attorney General. Days after Holder\'s resignation, Harris addressed the speculation in a statement declining any intent to take the office and asserting that she was staying in her position as Attorney General of California. Two months later, in November 2014, President Barack Obama nominated Loretta Lynch to succeed Holder. On November 10, Harris issued a statement regarding the nomination that approved of Obama\'s decision, praised Lynch, and reaffirmed her choice to remain working with the California Department of Justice.Tenure as California Attorney General Housing When Harris took office, California was still reeling from the effects of the subprime mortgage crisis. Harris participated in the National Mortgage Settlement against five banks: Ally Financial, Wells Fargo, Bank of America, Citibank, and Chase. She originally walked off the talks because she believed the deal was too lenient. She later rejoined the talks, securing $12 billion of debt reduction for the state\'s homeowners and $26 billion overall. Other parts of the funding would go to state housing counseling services and legal help for struggling homeowners and forgiving the debt of over 23,000 homeowners who agreed to sell their homes for less than the mortgage loan.Later, she introduced the California Homeowner\'s Bill of Rights in the California State Legislature, a package of several bills that would give homeowners more "options when fighting to keep their home". The Bill, which took effect on January 1, 2013, banned the practices of "dual-tracking" (processing a modification and foreclosure at the same time) and robo-signing, and provided homeowners with a single point of contact at their lending institution. It also gave the California Attorney General more power to investigate and prosecute financial fraud and to convene special grand juries to prosecute multi-county crimes instead of prosecuting a single crime county-by-county. The Sacramento Bee reported on one of the first cases of a homeowner using the bill to stop Bank of America from foreclosing on his home.Prison conditions and sentencing reform After the United States Supreme Court in Brown v. Plata (2011) declared California\'s prisons so overcrowded they inflicted cruel and unusual punishment, Harris fought federal court supervision, explaining "I have a client, and I don\'t get to choose my client." After California failed to fully implement the court\'s order to reduce crowding, and was ordered to implement new parole programs, lawyers for Harris appealed the decision on grounds that if forced to release these inmates early, prisons would lose an important labor pool.Harris refused to take any position on criminal sentencing-reform initiatives Proposition 36 (2012) and Proposition 47 (2014), arguing it would be improper because her office prepares the ballot booklets. Former California Attorney General John Van de Kamp considered her explanation "baloney."Daniel Larsen case On August 24, 2012, the Los Angeles Times published an editorial calling on Harris to release Daniel Larsen from prison. Larsen, who was sentenced to 28 years to life under California\'s three strikes laws for possession of a concealed weapon in 1999, was declared "actually innocent" by a federal judge in 2009 and ordered released. Evidence in favor of Larsen included that of a former chief of police and the actual owner of the knife. Larsen\'s original lawyer, who failed to call a single witness, has since been disbarred. Larsen remained in prison because Harris\'s office objected to his release on the grounds that he missed the deadline to file his writ of habeas corpus. The California Innocence Project, which had taken up Larsen\'s case, said this amounted to a paperwork technicality. The Times editorial stated that if Harris was not willing to release Larsen, Governor Jerry Brown should pardon him. In March 2013, Larsen was released on bond with the case on appeal by order of Attorney General Harris "on technical grounds". In September 2013, the Ninth Circuit U.S. Court of Appeals upheld the ruling, and on January 27, 2014, the Los Angeles County District Attorney\'s Office dismissed the charge.Michelle-Lael Norsworthy case In February 2014, Michelle-Lael Norsworthy, a transgender woman incarcerated at California\'s Mule Creek State Prison, filed a federal lawsuit based on the state\'s failure to provide her with what she argued was medically necessary sex reassignment surgery (SRS). In April 2015, a federal judge ordered the California Department of Corrections and Rehabilitation (CDCR) to provide Norsworthy with SRS, finding that prison officials had been "deliberately indifferent to her serious medical need." California Attorney General Harris, representing CDCR, challenged the order in the 9th Circuit Court of Appeals. Harris argued that "Norsworthy has been receiving hormone therapy for her gender dysphoria since 2000, and continues to receive hormone therapy and other forms of treatment" and that "there is no evidence that Norsworthy is in serious, immediate physical or emotional danger."In August 2015, while the state\'s appeal was pending, Norsworthy was released on parole, obviating the state\'s duty to provide her with inmate medical care. AG Harris maintained that the parole review process was independent of Norsworthy\'s legal case against CDCR. The appeals court, though, was unconvinced. "Before Norsworthy filed this suit", the court commented, "a panel of the parole board had on several prior occasions denied her parole. Four months after Norsworthy filed this suit in February 2014, however, the parole board decided to advance the date of her next parole hearing. … [On May 21] Norsworthy finally had a parole hearing, at which point a parole board panel approved her application." The court concluded that "these coincidences indicate that there is at least some chance that defendants influenced the parole process."Financial crimes Harris has prosecuted numerous financial crimes, such as predatory lending. In 2011, while serving as Attorney General of California, she created the Mortgage Fraud Strike Force which had a mandate to eliminate mortgage foreclosure fraud. The task force has been criticized for not filing as many foreclosure cases as in states with smaller populations.In 2013, Harris did not prosecute Steve Mnuchin\'s bank OneWest despite evidence "suggestive of widespread misconduct" according to a leaked memo from the Department of Justice. In 2017, Harris said that her office\'s decision to not prosecute Mnuchin was based on "following the facts and the evidence...like any other case." In 2016, Mnuchin donated $2,000 to Harris\'s campaign, making her the only 2016 Senate Democratic candidate to get cash from Mnuchin, but as senator, Harris voted against the confirmation of Mnuchin as Secretary of the Treasury. As a result of the donation, she has faced criticism for not prosecuting Mnuchin and OneWest Bank when she was Attorney General.County prosecutors\' misconduct In 2015, Harris defended convictions obtained by county prosecutors who had inserted a false confession into an interrogation transcript, committed perjury, and withheld evidence. Federal appeals court Judge Alex Kozinski threw out the convictions, telling Harris\'s lawyers, "Talk to the attorney general and make sure she understands the gravity of the situation."In March 2015, a California superior courts judge ordered Harris to take over a criminal case after Orange County District Attorney Tony Rackauckas was revealed to have illegally employed jailhouse informants and concealed evidence.  Harris refused, appealing the order and defending Rackauckas.Harris appealed the dismissal of an indictment when it was discovered a Kern County prosecutor perjured in submitting a falsified confession as court evidence. Harris asserted that prosecutorial perjury was not sufficient to demonstrate prosecutorial misconduct. In the case, Harris argued that only abject physical brutality would warrant a finding of prosecutorial misconduct and the dismissal of an indictment, and that perjury was not sufficient.Bureau of Children\'s Justice On February 12, 2015, Harris announced that she would start a new agency called the Bureau of Children\'s Justice. The bureau would work on issues such as foster care, the juvenile justice system, school truancy, and childhood trauma. Harris appointed special assistant attorney general Jill Habig to head the agency.Mitrice Richardson case In February 2016, it was revealed that the Attorney General would open a criminal investigation into the Los Angeles County Sheriff\'s Department\'s handling of the Mitrice Richardson case. The decision by Harris came about after her initial refusal to look into the case resulted in public outcry and the Richardson\'s family and supporters submitting over 500 pages of evidence. Mitrice Richardson was a 24-year-old African American woman who was released from the Los Angeles County Sheriff Department in the middle of the night without any means of fending for herself. Her body was later found in an isolated canyon, leaving the family with many unanswered questions. On December 30, 2016, results of the criminal investigation into the Los Angeles County Sheriff\'s Department handling of the Richardson case concluded that there was insufficient evidence to support criminal prosecution of anyone involved in the handling of the case.Backpage cases On October 6, 2016, Harris announced the arrest of Backpage CEO Carl Ferrer on felony charges of pimping a minor, pimping, and conspiracy to commit pimping. The arrest warrant alleged that 99% of Backpage\'s revenue was directly attributable to prostitution-related ads, many of which involved victims of sex trafficking, including children under the age of 18.On December 9, 2016, a superior court judge dismissed all charges in the complaint. On December 23, 2016, Harris filed new charges against Ferrer and former Backpage owners Mike Lacey and Jim Larkin for pimping and money laundering. In January 2017, Backpage announced that it was removing its adult section from all of its sites in the United States due what it claimed were many years of harassment and extralegal tactics.  The investigations continued after Harris became a senator, and On April 6, 2018 Backpage and affiliated sites were seized in an enforcement action by the Federal Bureau of Investigation, U.S. Postal Inspection Service, United States Department of Justice, and Internal Revenue Service.  Ferrer subsequently pleaded guilty to charges of facilitating prostitution and money laundering.', 'US Senate': '2016 election After Democratic United States Senator Barbara Boxer announced her intention to retire from the United States Senate at the end of her term in 2016, after which she would have been California\'s junior senator for 24 years, Harris was the first candidate to declare her intention to run for Boxer\'s Senate seat. Media outlets reported that Harris would run for Senate on the same day that Gavin Newsom, California\'s Lieutenant Governor and a close political ally of Harris, announced he would not seek to succeed Boxer. Harris officially announced the launch of her campaign on January 13, 2015.After holding a flurry of fundraisers in both California and Washington, D.C., Harris was reported to have raised $2.5 million for her campaign. In December, the National Journal released a story describing Harris\' use of funds on hotels, the laying off of campaign staff and the inordinate totals, which had contributed to her money on hand being closer to that of another candidate, Loretta Sanchez, who had $1.6 million.Harris was a frontrunner from the beginning of her campaign. In January 2015, weeks after Harris announced her campaign, a survey by Public Policy Polling showed Harris leading by 41% to former Los Angeles Mayor Antonio Villaraigosa\'s 16%, who was seen as a potential candidate. In May, a Field Poll was released, showing that although 58% of likely voters did not have a favored candidate, Harris was most preferred out of the field, with 19%. October saw the release of a Field Poll with Harris at 30%, fellow Democratic candidate Loretta Sanchez in second place at 17%, the former having increased her support by 11% since the Field Poll in May despite being noted by The Sacramento Bee as not being active in campaigning since appearing at the California Democratic Party\'s convention.In late February 2016, the California Democratic Party voted at its state convention to endorse Harris, who received 78% of the vote, 18% more than the 60% needed to secure the endorsement. The party endorsement did not secure any candidate a place in the general election, as all candidates would participate in one primary election in June, after which the top 2 candidates from any party would advance to the general election. Harris participated in debates with the other major candidates for the seat, her front-runner status causing her to be at the center of discussion. Governor Jerry Brown endorsed Harris on May 23. Harris came in first place on primary day, June 7, with 40% of the votes, entering a runoff with fellow Democratic candidate Loretta Sanchez. On July 19, President Barack Obama and Vice President Joe Biden endorsed Harris.In the June 2016 primary election, with results detailed at the county level, Harris won 48 of 58 counties. Harris won seven counties with more than 50% of the vote: Alameda, Contra Costa, Marin, San Francisco, San Mateo, Santa Cruz, and Sonoma. The highest percentage was San Francisco, with 70.4% of the vote. She faced Congresswoman Loretta Sanchez, also a Democrat, in the general election. This assured that the seat would stay in Democratic hands; it was the first time a Republican did not appear in a general election for the Senate since California began directly electing Senators in 1914.In the November 2016 election, Harris defeated Sanchez with 62 percent of the vote, carrying all but four counties. Following her victory, Harris promised to protect immigrants from the policies of President-elect Donald Trump.Following her election to the United States Senate, Harris announced her intention to remain California\'s Attorney General through the end of 2016 and resign shortly before being sworn in as Senator on January 3, 2017. Governor Jerry Brown announced his intention to nominate Congressman Xavier Becerra as her successor.Tenure On January 21, 2017, a day after President Trump was sworn into office, Harris called the message of Trump\'s inaugural address "dark" when speaking during the Women\'s March on Washington. On January 28, following Trump signing the Protecting the Nation from Foreign Terrorist Entry into the United States executive order, which saw citizens from several countries with Muslim majorities barred from entering the US for 90 days, Harris was one of many to describe it as a "Muslim ban". In early February, Harris spoke in opposition to Trump\'s cabinet picks Betsy DeVos, for Secretary of Education, and Jeff Sessions, for United States Attorney General. Later that month, in her first speech on the senate floor, Harris spent 12 minutes critiquing Trump\'s immigration policies. In early March, Harris called on Attorney General Sessions to resign, after it was reported that Sessions spoke twice with Russian Ambassador to the United States Sergey Kislyak. On March 14, Harris claimed repealing the Affordable Care Act would send the message of health care\'s being a "privilege" rather than a "civil right".In a May 2017 interview, Harris criticized Republican representative Raul Labrador for saying that no one dies due to lack of access to health care.On June 7, 2017, Harris garnered media attention for her questioning of Rod Rosenstein, the Deputy Attorney General, over the role he played in the May 2017 firing of James Comey, the Director of the Federal Bureau of Investigation.  The prosecutorial nature of her questioning caused Senator John McCain, an ex officio member of the Intelligence Committee, and Senator Richard Burr, the committee chairman, to interrupt Harris and request that she be more respectful of the witness; other Democrats on the committee pointed out that they had asked similarly tough questions, but had not been interrupted. On June 13, Harris questioned Jeff Sessions, the Attorney General, on the same topic; Harris was again interrupted by McCain and Burr. Sessions stated that Harris\' mode of questioning "makes me nervous"; other Democratic members of the committee again pointed out that Harris was the only senator whose questioning was interrupted with an admonishment from the chairman. Burr\'s singling out of Harris sparked suggestion in the news media that his behavior was sexist, with commentators arguing that Burr would not treat a male Senate colleague in a similar manner. The website True Pundit suggested that treating Harris differently than other members of the Intelligence Committee is evidence of racism. In addition, when CNN pundit Jason Miller described Harris as "hysterical", Kirsten Powers, who was taking part in the same on-air segment, told Miller that his use of the term to describe Harris was sexist, and that he would not describe male Senators in the same manner.2020 Presidential speculation Kamala Harris has been considered a top contender for the 2020 Democratic nomination for President.  She has publicly stated that she is "not ruling it out". Her spending on Facebook advertising is unusually high, and targeted to reach voters outside California.. In July 2018, it was announced that she would publish a memoir, another sign of a possible run.Kamala Harris was named as part of the "Hell-No Caucus" by Politico in 2018, along with Senators Cory Booker, Kirsten Gillibrand, Elizabeth Warren, and Bernie Sanders, all of whom overwhelmingly voted to reject Trump\'s nominees for administration jobs, including Rex Tillerson, Betsy De Vos, and Mike Pompeo; all were considered potential 2020 presidential contenders at this point in time.Committee assignments Committee on the BudgetCommittee on Homeland Security and Governmental AffairsSubcommittee on Federal Spending Oversight and Emergency ManagementSubcommittee on Regulatory Affairs and Federal ManagementSelect Committee on IntelligenceCommittee on the JudiciarySubcommittee on the ConstitutionSubcommittee on Oversight, Agency Action, Federal Rights and Federal CourtsSubcommittee on Privacy, Technology and the LawSource: Los Angeles TimesCaucus memberships Congressional Black CaucusCongressional Asian Pacific American CaucusCongressional Caucus for Women\'s Issues', 'Political positions': 'Abortion Since her election to the senate, Harris has maintained a 100% rating by the pro-choice Planned Parenthood Action Fund and a 0% rating by the pro-life National Right to Life Committee.Cannabis In May of 2018, Harris announced she would co-sponsor the Marijuana Justice Act, which Sen. Cory Booker introduced in August 2017. The legislation would eliminate marijuana\'s status as a Schedule I drug under the Controlled Substance Act. The move would also require federal courts to expunge the records of Americans who have prior marijuana convictions related to use or possession. She believes the move to decriminalize marijuana will prevent the Justice Department from enforcing laws that are “unjust and unfair.” Death penalty Harris is opposed to the death penalty, but has said that she would review each case individually. Her position was tested in April 2004, when SFPD Officer Isaac Espinoza was murdered in the Bayview district. Harris announced that she would not seek the death penalty for the man accused of his killing. The decision evoked protests from the San Francisco Police Officers Association, Senator Dianne Feinstein, and others.  Those who supported her decision not to seek the death penalty included San Francisco Supervisors Tom Ammiano and Sophie Maxwell, in whose district the murder occurred. The jury found the convicted killer, David Hill, guilty of second-degree murder, although the prosecutor, Harry Dorfman, had sought a first-degree murder conviction. The defense had argued that Hill thought Espinoza was a member of a rival gang, and that the murder was not premeditated. Hill was given the maximum sentence for the conviction, life without the possibility of parole.Harris\'s position against the death penalty was tested again in the case of Edwin Ramos, an illegal immigrant and alleged MS-13 gang member who was accused of murdering Tony Bologna and his sons Michael and Matthew. On September 10, 2009, Harris announced she would seek life in prison without the possibility of parole rather than the death penalty in the Ramos case.Harris has expressed the belief that life without possibility of parole is a better, and more cost-effective, punishment. According to the California Commission on the Fair Administration of Justice, the death penalty costs $137 million per year. If the system were changed to life without possibility of parole, the annual costs would be approximately $12 million per year. Harris noted that the resulting surplus could put 1,000 more police officers into service in San Francisco alone.When in 2014, U.S. District Judge Cormac J. Carney declared capital punishment in California unconstitutional, Harris reviewed the case.Education In interviews with Matt Lauer on The Today Show and local KGO-TV, Harris argued for treating "habitual and chronic truancy" among children in elementary school as a crime committed by the parents of truant children. She argues that there is a direct connection between habitual truancy in elementary school and crime later in life. She has received the endorsement of the California Federation of Teachers.Environment During her time as San Francisco District Attorney, Harris created the Environmental Justice Unit in the San Francisco District Attorney\'s Office and prosecuted several industries and individuals for pollution, most notably U-Haul, Alameda Publishing Corporation, and the Cosco Busan oil spill. She also advocated for strong enforcement of environmental protection laws.Gun law Harris has an F rating from the National Rifle Association for her consistent efforts supporting gun control.While serving as district attorney in San Francisco, Harris, along with other district attorneys, filed an amicus brief in District of Columbia v. Heller, arguing that the Washington, D.C., gun law at issue did not violate the Second Amendment. In her second term as district attorney, she said that getting guns off the streets was a priority.During her run for Senate, she was endorsed by former U.S. Representative Gabrielle Giffords, shot in Tucson in 2011. She was also endorsed by the Brady Campaign to Prevent Gun Violence.In response to the 2017 Las Vegas shooting, Harris supported the call for more gun control. Believing that thoughts and prayers are inadequate answers to the shooting, she stated that "...we must also commit ourselves to action. Another moment of silence won\'t suffice."Health care On August 30, 2017, Harris announced at a town hall in Oakland that she would co-sponsor fellow Senator Bernie Sanders\' "Medicare for All" bill, supporting single-payer healthcare.Immigration Harris has expressed support for San Francisco\'s immigration policy of not inquiring about immigration status in the process of a criminal investigation. Harris argues that it is important that immigrants be able to talk with law enforcement without fear.On October 25, 2017, during a news conference, Harris stated she would not support a spending bill until Congress addressed the Deferred Action for Childhood Arrivals program in a way that clarified "what we are going to do to protect and take care of our DACA young people in this country."In a January 2018 interview, when asked by Hiram Soto about her ideal version of a bipartisan deal on the Deferred Action for Childhood Arrivals program, Harris stated the need to focus on comprehensive immigration reform and "pass a clean Dream Act."In July 2018, the Trump administration falsely accused Harris of "supporting the animals of MS-13." Harris responded, "As a career prosecutor, I actually went after gangs and transnational criminal organizations. That\'s being a leader on public safety. What is not, is ripping babies from their mothers." PolitiFact concluded, "We found no information showing Harris has supported or sympathized with MS-13. When asked, the White House provided no evidence to back up its reckless attack, which fits with a pattern of other baseless claims on the subject."Foreign policy In an April 6, 2017 statement, in response to the Khan Shaykhun chemical attack, Harris charged President of Syria Bashar al-Assad with attacking Syrian children and the attack supported "the clear fact that President Assad is not only a ruthless dictator brutalizing his own people-he is a war criminal the international community cannot ignore." She called on President Trump to interact with Congress regarding his administration\'s "lack of clear objectives in Syria and articulate a detailed strategy and path forward in partnership with our allies."In February 2018, Harris was one of seventeen senators to sign a letter arguing against President Trump\'s having the legal authority to launch a preemptive strike against North Korea.On May 8, 2018, after President Trump announced the United States was withdrawing from the Joint Comprehensive Plan of Action, Harris released a statement saying the decision "jeopardizes our national security and isolates us from our closest allies" while calling the Joint Comprehensive Plan of Action "the best existing tool we have to prevent Iran from developing nuclear weapons and avoid a disastrous military conflict in the Middle East."', 'Personal life': "Harris is married to California attorney Douglas Emhoff, who was at one time partner-in-charge at Venable LLP's Los Angeles office. They married on August 22, 2014, in Santa Barbara, California. Harris's sister is Maya Harris, MSNBC political analyst, and her brother-in-law is Tony West, General Counsel of Uber and a former U.S. Justice Department senior official.  Harris has one niece, as well as two stepchildren, one in college and one in high school.", 'introduction': "Kamala Devi Harris (/ˈkɑːmələ/, KAH-mə-lə; born October 20, 1964) is an American attorney and politician. She is a member of the Democratic Party. Harris has served as the junior United States Senator from California since 2017. She had previously served as the 32nd Attorney General of California from 2011 to 2017.\nBorn in Oakland, California, Harris is a graduate of Howard University and University of California, Hastings College of the Law.  In the 1990s, Harris worked in the San Francisco District Attorney's Office and the City Attorney of San Francisco's office. In 2004, Harris was elected District Attorney of San Francisco. \nHarris was elected California's Attorney General in 2010 and reelected in 2014. On November 8, 2016, she defeated Loretta Sanchez in the 2016 Senate election to succeed outgoing Senator Barbara Boxer, becoming California's third female U.S. Senator and the first of Jamaican or Indian descent.\n\n"}, 'personal': {'Born': 'Kamala Devi Harris (1964-10-20) October 20, 1964 (age53)Oakland, California, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Douglas Emhoff (m.2014)', 'Relatives': 'Maya Harris (sister)', 'Education': 'Howard University (BA)University of California, Hastings (JD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom California': {'date': 'Assumed office January 3, 2017Serving with Dianne Feinstein', 'Preceded by': 'Barbara Boxer'}, '32nd Attorney General of California': {'date': 'In officeJanuary 3, 2011– January 3, 2017', 'Governor': 'Jerry Brown', 'Preceded by': 'Jerry Brown', 'Succeeded by': 'Xavier Becerra'}, '27th District Attorney of San Francisco': {'date': 'In officeJanuary 8, 2004– January 3, 2011', 'Preceded by': 'Terence Hallinan', 'Succeeded by': 'George Gascón'}}, 'code': 'H001075'}