{'name': 'Kirsten.Gillibrand', 'picture': 'G000555.jpg', 'detail': {'Early life and education': 'Kirsten Elizabeth Rutnik was born in Albany, New York, on December 9, 1966, the daughter of Douglas Paul Rutnik and Polly Edwina Noonan. Both her parents are attorneys, and her father has also worked as a lobbyist. Her parents divorced in the late 1980s. Gillibrand has an older brother, Douglas Rutnik, and a younger sister, Erin Rutnik Tschantret. Her maternal grandmother is Dorothea "Polly" Noonan, a founder of the Albany Democratic Women\'s Club, as well as a leader in Albany Mayor Erastus Corning\'s powerful political machine, which lasted for more than 40 years.[Note 1] She has English, Austrian, Scottish, German, and Irish ancestry.During her childhood and college years, Gillibrand used the nickname "Tina." She began using her birth name of Kirsten a few years after law school. In 1984, she graduated from Emma Willard School, an all women\'s private school located in Troy, New York, and then enrolled at Dartmouth College. Gillibrand majored in Asian Studies, studying in both Beijing and Taiwan. While in Beijing, she studied and lived with Connie Britton. Gillibrand graduated magna cum laude in 1988. While at Dartmouth, she was a member of the  Kappa Kappa Gamma sorority. During college, Gillibrand interned at Republican U.S. Senator Alfonse D\'Amato\'s Albany office. Gillibrand received her J.D. from UCLA School of Law and passed the bar exam in 1991.', 'Law career': 'In 1991, Gillibrand joined the Manhattan-based law firm of Davis Polk & Wardwell as an associate. In 1992, she took a leave from Davis Polk to serve as a law clerk to Judge Roger Miner on the United States Court of Appeals for the Second Circuit in Albany.Gillibrand\'s tenure at Davis Polk is best known for her work as a defense attorney for Philip Morris during major litigation, including both civil lawsuits and U.S. Justice Department criminal and civil racketeering probes. She became a senior associate while working on Philip Morris litigation. While this time in her career has proven controversial, Gillibrand said her work for Philip Morris allowed her to take on multiple pro bono cases defending abused women and their children, as well as other cases defending tenants seeking safe housing after lead paint and unsafe conditions were found in their homes.While working at Davis Polk, Gillibrand became involved in—and later the leader of—the Women\'s Leadership Forum, a program of the Democratic National Committee. Gillibrand states that a speech to the group by First Lady Hillary Clinton inspired her:"[Clinton] was trying to encourage us to become more active in politics and she said, \'If you leave all the decision-making to others, you might not like what they do, and you will have no one but yourself to blame.\' It was such a challenge to the women in the room. And it really hit me: She\'s talking to me."Following her time at Davis Polk, Gillibrand served as Special Counsel to Secretary of Housing and Urban Development (HUD) Andrew Cuomo during the last year of the Clinton administration. Gillibrand worked on HUD\'s Labor Initiative and its New Markets Initiative, as well as on TAP\'s Young Leaders of the American Democracy, and strengthening Davis–Bacon Act enforcement.In 1999, Gillibrand began working on Hillary Clinton\'s 2000 U.S. Senate campaign, focusing on campaigning to young women and encouraging them to join the effort. Many of those women later worked on Gillibrand\'s campaigns. Gillibrand and Clinton became close during the election, with Clinton becoming something of a mentor to the young attorney. Gillibrand donated more than $12,000 to Clinton\'s senate campaigns.In 2001, Gillibrand became a partner in the Manhattan office of Boies, Schiller & Flexner, where a client was the Philip Morris parent company Altria Group. In 2002 she informed Boies of interest in running for office and was allowed to transfer to the firm\'s Albany office. She left Boies in 2005 to begin her 2006 campaign for Congress.', 'US House of Representatives': 'Elections2006Gillibrand considered running for office in 2004, in New York\'s 20th congressional district, against the three-term Republican incumbent John E. Sweeney. However, Hillary Clinton believed circumstances would be more favorable in 2006 and advised her to wait until then. Traditionally conservative, the district and its electoral offices had been in Republican hands for all but four years since 1913, and as of November 2006, 197,473 voters in the district were registered Republicans while 82,737 were registered Democrats. Sweeney said in 2006 that no Republican could ever lose [the district]. Using New York\'s electoral fusion election laws, Gillibrand ran in 2006 on both the Democratic and Working Families lines; in addition to having the Republican nomination, Sweeney was endorsed by the Conservative and Independence parties.During the campaign, Gillibrand got support from other Democratic Party politicians. Mike McNulty, a Democratic Congressman from the neighboring 21st congressional district, campaigned for her, as did both Hillary and Bill Clinton; the former president appeared twice at campaign events. Both parties poured millions of dollars into the respective campaigns.Many saw Gillibrand as moderate or conservative. The American Conservative stated after her eventual victory, "Gillibrand won her upstate New York district by running to the right: she campaigned against amnesty for illegal immigrants, promised to restore fiscal responsibility to Washington, and pledged to protect gun rights."Gillibrand\'s legal representation of Philip Morris was an issue during the campaign. Her campaign finance records showed that she received $23,200 in contributions from the company\'s employees during her 2006 campaign for Congress.The probable turning point in the election was the November 1 release of a December 2005 police report detailing a 9-1-1 call by Sweeney\'s wife, in which she claimed Sweeney was "knocking her around the house." The Sweeney campaign claimed the police report was false and promised to have the official report released by State Police, but did not do so. The Sweeney campaign did release an ad in which Sweeney\'s wife described Gillibrand\'s campaign as "a disgrace."By November 5, a Siena poll showed Gillibrand ahead of Sweeney 46% to 43%. She won with 53% of the vote.2008Following Gillibrand\'s win, Republicans quickly began speculating about possible 2008 candidates. Len Cutler, director of the Center for the Study of Government and Politics at Siena College, said that the seat would be difficult for Gillibrand to hold in 2008, noting Republicans substantially outnumbered Democrats in the district.Gillibrand won her bid for reelection in 2008 over former New York Secretary of State Sandy Treadwell by a 62% to 38% margin.  Treadwell lost by that margin despite significantly outspending Gillibrand and promising never to vote to raise taxes, not to accept a federal salary, and to limit himself to three terms in office. Campaign expenditures were the second highest in the nation for a House race. Democrats generally saw major successes during the 2008 congressional elections, credited in part to a coattail effect from Barack Obama\'s presidential campaign.Gillibrand\'s legal representation of Philip Morris was again an issue. Her campaign finance records showed that she received $18,200 from Philip Morris employees for her 2008 campaign, putting her among the top dozen Democrats in such contributions. Questioned during the campaign about her work on behalf of Philip Morris, Gillibrand stated that she had voted in favor of all three anti-tobacco bills in that session of Congress. She said that she never hid her work for Philip Morris, and she added that as an associate at her law firm, she had had no control over which clients she worked for. The New York Times, reporting on this issue, said that Davis Polk\'s official policy was that associates were allowed to withdraw from representing clients about whom they had moral qualms.House tenureUpon taking office, Gillibrand joined the Blue Dog Coalition, a group of moderate to conservative Democrats. She was noted for voting against the Emergency Economic Stabilization Act of 2008, citing concerns regarding insufficient oversight and excessive earmarks. She opposed New York\'s plans to issue driver\'s licenses to illegal immigrants, and voted in favor of legislation that would withhold federal funds from immigrant sanctuary cities. Gillibrand supported civil unions for same-sex couples, voted for a bill that limited information-sharing between federal agencies about firearm purchasers, and received a 100 percent rating from the NRA.After taking office, Gillibrand became the first member of Congress to publish her official schedule, listing everyone she met with on a given day. She also published earmark requests she received and her personal financial statement. This "Sunlight Report", as her office termed it, was praised by a New York Times editorial in December 2006 as being a "quiet touch of revolution" in a non-transparent system. Regarding the earmarking process, Gillibrand stated that she wanted whatever was best for her district and would require every project to pass a "greatest-need, greatest-good" test.Committee assignmentsWhile in the House of Representatives, Gillibrand served on the following committees:Committee on AgricultureSubcommittee on Conservation, Credit, Energy, and ResearchSubcommittee on Horticulture and Organic AgricultureSubcommittee on Livestock, Dairy, and Poultry (Chair)Committee on Armed ServicesSubcommittee on Seapower and Expeditionary ForcesSubcommittee on Terrorism and Unconventional Threats', 'US Senate': 'On December 1, 2008, President-elect Barack Obama announced his choice of Hillary Clinton, the junior U.S. Senator from New York, as Secretary of State. Clinton was confirmed by a vote of 94-2 on January 21, 2009. Just hours before being sworn in as Secretary of State, Clinton resigned her senate seat, effective immediately. Obama\'s December announcement began a two-month search process to fill her vacant Senate seat. Under New York law, the governor appoints a replacement. A special election would then be held in November 2010 for the remainder of the full term, which ended in January 2013.Governor David Paterson\'s selection process began with a number of prominent names and high-ranking New York Democrats, including Andrew Cuomo, Fran Drescher and Caroline Kennedy, vying for the spot. Gillibrand quietly campaigned for the position, meeting secretly with Paterson on at least one occasion. She said that she made an effort to underscore her successful House elections in a largely conservative district, adding that she could be a good complement to Chuck Schumer. Gillibrand was presumed a likely choice in the days before the official announcement. On January 23, 2009, Paterson held a press conference to announce Gillibrand as his choice.The response within New York to the appointment was mixed. The upstate New York media was generally optimistic about the appointment of an upstate Senator, as one had not been elected since Charles Goodell left office in 1971. Many downstaters were disappointed with the selection, with some media outlets stating that Paterson had ignored the electoral influence of populous New York City and downstate on state politics. One questioned whether Paterson\'s administration was aware of "[where] statewide elections are won and lost".  Gillibrand was relatively unknown statewide, and many voters found the choice surprising. One source stated, "With every Democrat in New York ... angling for the appointment, there was a sense of bafflement, belittlement, and bruised egos when Paterson tapped the junior legislator unknown outside of Albany."Shortly before her appointment to the U.S. Senate was announced, Gillibrand reportedly contacted the Empire State Pride Agenda (an LGBT lobbying organization in New York) to express her full support for same-sex marriage, the repeal of the Defense of Marriage Act, the repeal of the Don\'t Ask, Don\'t Tell policy regarding gay and lesbian servicemembers, and the passage of legislation banning discrimination against transgendered persons. Gillibrand had previously supported civil unions, not same-sex marriage, for same-sex couples.Gillibrand was sworn in on January 26, 2009; at 42, she entered the chamber as the youngest senator in the 111th Congress. In February she endorsed Scott Murphy, who had been chosen by the New York Democrats as their nominee for her now vacant seat in the House of Representatives. In April, Murphy won the seat against Republican Jim Tedisco by 399 votes and succeeded Gillibrand in the House until 2011.Elections2010Gillibrand had numerous potential challengers in the September 14, 2010, Democratic primary election. Some were obvious at the time of her appointment. Most notably, Long Island Congresswoman Carolyn McCarthy was unhappy with Gillibrand\'s stance on gun control,[Note 2] but McCarthy ultimately decided not to run. Harold Ford, Jr., a former Congressman from Tennessee, considered a run but ultimately decided against it in March 2009. Congressman Steve Israel was also a potential contender but was talked out of it by President Obama.Concerned about a possible schism in the party that could lead to a heated primary, split electorate, and weakened stance, high-ranking members of the party backed Gillibrand and requested major opponents not to run. In the end, Gillibrand faced Gail Goode, a lawyer from New York City, and won the primary with 76% of the vote.Despite what was initially expected to be a heated race, Gillibrand easily prevailed against former Republican congressman Joseph DioGuardi in her first statewide election. By the end of October, a Quinnipiac University Polling Institute poll showed Gillibrand winning 57-34%. Gillibrand won the November election 63–35%, carrying 54 of New York\'s 62 counties; the counties that supported DioGuardi did so by a margin no greater than 10%.2012Gillibrand\'s special election victory in 2010 gave her the right to serve the rest of Clinton\'s second term, which ended in January 2013. Gillibrand ran for a full six-year term in November 2012. In the general election, Gillibrand faced challenger Wendy E. Long, an attorney running on both the Republican Party and Conservative Party lines. Gillibrand was endorsed by The New York Times and the Democrat and Chronicle. She won the election with 72.2% of the vote; in so doing, she surpassed Schumer\'s 71.2% victory in 2004 and achieved the largest victory margin for a statewide candidate in New York history. She carried all counties except for two in western New York.2018Senate tenureA member of the Democratic Party\'s relatively conservative Blue Dog faction while in the House, Gillibrand has moved her political positions and ideology toward a liberal, progressive position since her appointment to the Senate. In both cases, her views were significantly defined by the respective constituencies she served—a conservative congressional district versus the generally liberal state of New York, especially as defined by New York City. For example, although she had been quiet on the U.S. military\'s "Don\'t Ask, Don\'t Tell" policy when she was in the House, during her first 18 months in the Senate, Gillibrand was an important part of the successful campaign to repeal it.On April 9, 2009, a combined Schumer–Gillibrand press release said that the two strongly supported a  Latino being nominated to the Supreme Court at the time of the next vacancy. Their first choice was Sonia Sotomayor. The two introduced her at Sotomayor\'s Senate confirmation hearing in July 2009.During the lame duck session of the 111th Congress, Gillibrand scored two substantial legislative victories: the repeal of Don\'t Ask, Don\'t Tell and the passage of the James Zadroga 9/11 Health and Compensation Act. Both were issues she had advocated for during that session. In the aftermath of these victories, many commentators opined that these victories marked her emergence on the national stage.In March 2011, Gillibrand co-sponsored the PROTECT IP Act, which would restrict access to web sites judged to be infringing copyrights,  but ultimately announced she would not support the bill as-is due to wide critical public response.In 2012, Gillibrand authored a portion of the STOCK Act, which extended limitations on insider trading by members of Congress. A version of the bill, merged by Senator Joe Lieberman with content from another bill authored by Senator Scott Brown, was passed by Congress and signed into law by President Obama in April.In 2013, Gillibrand proposed legislation that would remove sexual assault cases from the military chain of command; the bill was cosponsored by Republican senators Rand Paul and Ted Cruz. Gillibrand\'s bill failed to gain enough votes to break a filibuster in March 2014; however, her efforts likely improved her standing as a lawmaker in the Senate.In 2014, Gillibrand was included in the annual Time 100, Time magazine\'s list of the 100 most influential people in the world.In 2015, Gillibrand invited campus activist Emma Sulkowicz to attend the State of the Union Address. Her invitation was intended to promote the Campus Accountability and Safety Act, a bill Gillibrand co-sponsored.Gillibrand has been less deferential to Senate seniority protocols and more uncompromising in her positions – such as repeal of "don\'t ask, don\'t tell" and combating sexual assault in the military – than most freshman senators, traits which have sometimes caused friction with her Democratic colleagues. Republican Charles Grassley of Iowa has contrasted her approach with other New Yorkers of both parties, saying she is distinguished by "her determination and knowledge and willingness to sit down one on one with senators and explain what she is up to". Her fund-raising ability – almost $30 million from 2009 through 2013 – helped her become a mentor for female candidates nationwide during that period.In November 2017, Gillibrand made national news when she stated that President Bill Clinton ought to have resigned from office when his affair with Monica Lewinsky was revealed. In 2018, Clinton expressed disagreement with Gillibrand\'s view.Gillibrand once supported legislation that would criminalize \'boycotts\' by individuals or groups seeking to express a disapproval of the actions taken by the government of Israel. Gillibrand\'s advocacy against protests and \'boycotts\' prominently included her co-sponsoring S.720, coined the "Israel Anti-Boycott Act." This legislation would federally criminalize, punishable by a maximum sentence of 20 years in prison, any political \'boycotts\' intended to protest actions by the Israeli government. The American Civil Liberties Union (ACLU) denounced S.720, claiming its provisions seeking to "punish U.S. persons based solely on their expressed political beliefs" are "inconsistent" with First Amendment constitutional protections. In July 2017, Gillibrand stated that she no longer supported the bill in its then-current form, adding that she would advocate for changes to it. Gillibrand argued that the bill did not "...have any relevance to individuals at all," and insists she plans to "...urge them to rewrite it to make sure it says...\'This is only applying to companies.\'"In a February 2018 60 Minutes profile, Gillibrand stated that she was "\'embarrassed and ashamed\'" of the positions on immigration and guns that she held during her tenure in the House of Representatives.Gillibrand was named as part of the "Hell-No Caucus" by Politico in 2018, along with Senators Kamala Harris, Cory Booker, Elizabeth Warren, and Bernie Sanders, given she voted "overwhelmingly to thwart his [Trump\'s] nominees for administration jobs", such as with Rex Tillerson, Betsy De Vos, and Mike Pompeo; all were considered potential 2020 presidential contenders at this point in time.Committee assignmentsWhile in the Senate, Gillibrand has served on the following committees:Committee on Agriculture, Nutrition and ForestrySubcommittee on Domestic and Foreign Marketing, Inspection, and Plant and Animal Health (Ranking Member)Subcommittee on Energy, Science and TechnologySubcommittee on Hunger, Nutrition and Family FarmsCommittee on Armed ServicesSubcommittee on Personnel (Ranking Member)Subcommittee on AirlandSubcommittee on Emerging Threats and CapabilitiesSubcommittee on Strategic ForcesCommittee on Environment and Public WorksSubcommittee on Green Jobs and the New EconomySubcommittee on OversightSubcommittee on Superfund, Toxics and Environmental HealthSpecial Committee on AgingCaucus membershipsHealthy Kids CaucusInternational Conservation CaucusSenate Women\'s CaucusSportsmen\'s CaucusAfterschool Caucuses', 'Future campaigns': 'In 2017, Gillibrand said that she would be running for re-election to the Senate in 2018.  She had been mentioned as a possible Democratic nominee for President in 2020, but, when asked about the race, she said she was "ruling it out."', 'Political positions': 'During her tenure in the House of Representatives, Gillibrand was known as a conservative Democrat or centrist. In January 2009, Salon.com described her as "an ordinary upstate politician, largely defined by poll-driven issues that fit the right-wing rural district she represented in Congress" and as "a hybrid politician who has remained conservative enough to keep her seat while appearing progressive enough to raise money downstate." While serving in the House, Gillibrand was a member of the Blue Dog Coalition, a caucus of fiscally conservative Democrats.Since she became a Member of the U.S. Senate, Gillibrand\'s political positions have moved in a liberal direction. In July 2018, Newsday stated that Gillibrand "formerly held more conservative views on guns and immigration, but, in her nine years as New York\'s junior senator, [has] swung steadily to the left on those and other issues". Although a supporter of gun rights while in the House, Gillibrand has since moved in the direction of gun control. Gillibrand has said that a conversation with a family who had lost a daughter to gun violence made her realize that she was "wrong" to oppose gun control measures; having once received an "A" rating from the National Rifle Association, she received an "F" rating as of 2018. In June 2018, Gillibrand "became the first sitting senator to call for abolishment of U.S. Immigration and Customs Enforcement, or ICE, calling the agency a \'deportation force\'". In May 2018, City & State reported that she had "moved sharply leftward on economic issues, embracing a number of proposals to expand the social safety net and bolster lower-income families". In July 2018, The New York Times stated that Gillibrand had "spent recent months injecting her portfolio with a dose of the kind of economic populism that infused Senator Bernie Sanders’s campaign in the 2016 presidential primary".On social issues, Gillibrand is generally liberal, supporting abortion rights and legalization of same-sex marriage. A vocal supporter of a healthcare public option since her first house run, she came out in favor of single-payer healthcare in 2017 and co-sponsored a Medicare-for-all bill introduced by Senator Bernie Sanders of Vermont. She is a strong advocate for government transparency, being one of a few members of Congress who release much personal and scheduling information. She is also a strong supporter of female equality and involvement, having begun the website offthesidelines.org in 2011. Gillibrand was the first in her caucus to call on Senator Al Franken (D-MN) to resign following allegations of sexual misconduct.Gillibrand received an 8% rating from the American Conservative Union in 2007, a 70% rating from Americans for Democratic Action in 2008, and 90% from the American Civil Liberties Union. OnTheIssues.org rated Gillibrand as a "hard-core liberal" in 2009.', 'Personal life': "Gillibrand met her husband, Jonathan Gillibrand, a venture capitalist and British national, on a blind date. Jonathan planned to be in the United States for only a year while studying for his Master of Business Administration at Columbia University, but he stayed in the country because of his relationship with her. The two were married in a Catholic church in Manhattan in 2001.The Gillibrands had their first child, Theodore, in 2003, and their second son, Henry, in 2008.  She continued to work until the day of Henry's delivery, for which she received a standing ovation from her colleagues in the House the next day.Gillibrand lives in the town of Brunswick with her husband and their two sons. Because of the requirements of her office, the family spends most of its time in Washington, D.C. In 2011, the Gillibrands sold their house in Hudson and purchased their home in Brunswick to be closer to Kirsten's family in Albany.", 'Published works': 'In 2014, Gillibrand published her first book, Off the Sidelines: Raise Your Voice, Change the World. The candid memoir was notable in the media upon release due to whisperings of a future presidential run as well as revealing a culture of sexism in the Senate, including specific comments made to her by other members of Congress about her weight and appearance. Off the Sidelines debuted at number 8 on the New York Times Best Seller list for hardcover nonfiction.', 'Electoral history': "New York's 20th Congressional district election, 2006PartyCandidateVotes%+%Democratic*Kirsten Gillibrand125,16853.10%Republican*John Sweeney (inc.)110,55446.90%*Gillibrand was also nominated on the Working Families line and Sweeney was also nominated on the Independence and Conservative lines.New York's 20th Congressional district election, 2008PartyCandidateVotes%+%Democratic*Kirsten Gillibrand (inc.)193,65162.13%Republican*Sandy Treadwell118,03137.87%*Gillibrand was also nominated on the Working Families line and Treadwell was also nominated on the Independence and Conservative lines.U.S. Senate special Democratic primary election in New York, 2010PartyCandidateVotes%+%DemocraticKirsten Gillibrand (inc.)464,51276.15%DemocraticGail Goode145,49123.85%U.S. Senate special election in New York, 2010PartyCandidateVotes%+%Democratic*Kirsten Gillibrand (inc.)2,837,58962.95%Republican*Joseph DioGuardi1,582,60335.11%GreenCecile Lawrence35,4870.79%LibertarianJohn Clifton18,4140.41%Rent is Too Damn HighJoseph Huff17,0180.38%Anti-ProhibitionVivia Morgan11,7850.26%Tax RevoltBruce Blakeman4,5160.10%*Gillibrand was also nominated on the Working Families and Independence lines and DioGuardi was also nominated on the Conservative line.U.S. Senate election in New York, 2012PartyCandidateVotes%+%Democratic*Kirsten Gillibrand (inc.)4,822,33072.22%Republican*Wendy Long1,758,70226.34%GreenColia Clark42,5910.64%LibertarianChris Edes32,0020.48%IndependentJohn Mangelli22,0410.33%*Gillibrand was also nominated on the Working Families and Independence lines and Long was also nominated on the Conservative line.", 'introduction': "Kirsten Elizabeth Gillibrand (née Rutnik; /ˈkɪərstən ˈdʒɪlɪbrænd/\xa0(\xa0listen) KEER-stən JIL-i-brand; born December 9, 1966) is an American attorney and politician serving as the junior United States Senator from New York since January 2009. She previously held the position of U.S. Representative for New York's 20th congressional district from 2007 until her Senate appointment. Gillibrand is a member of the Democratic Party.\nIn December 2008, President-elect Barack Obama nominated second-term incumbent U.S. Senator Hillary Clinton as United States Secretary of State, leaving an empty seat in the Senate. New York Governor David Paterson appointed Gillibrand to fill the vacancy, and she was sworn in as a U.S. Senator on January 26, 2009. Gillibrand was required to run in a special election in 2010 to keep her seat, and she won the election with 63% of the vote. She was reelected to a full six-year term in 2012 with 72% of the vote, receiving a higher percentage of the vote than any other statewide candidate in New York.\nDuring her Senate tenure, Gillibrand has been outspoken on issues like sexual assault in the military and sexual harassment. She has been mentioned as a potential future Democratic presidential candidate.\n\n"}, 'personal': {'Born': 'Kirsten Elizabeth Rutnik (1966-12-09) December 9, 1966 (age51)Albany, New York, U.S.', 'Nationality': 'American', 'Political party': 'Democratic', 'Spouse(s)': 'Jonathan Gillibrand (m.2001)', 'Children': '2', 'Education': 'Dartmouth College (BA)University of California, Los Angeles (JD)', 'Signature': '', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom New York': {'date': 'Assumed office January 26, 2009Serving with Chuck Schumer', 'Preceded by': 'Hillary Clinton'}, "Member of the US House of Representativesfrom New York's 20th district": {'date': 'In officeJanuary 3, 2007– January 26, 2009', 'Preceded by': 'John E. Sweeney', 'Succeeded by': 'Scott Murphy'}}, 'code': 'G000555'}