{'name': 'Lou.Correa', 'picture': 'C001110.jpg', 'detail': {'Early career': "Correa's political career began in 1996 when he ran for the California State Assembly as the Democratic nominee in the 69th Assembly District. In a very close race, he lost to Republican incumbent Jim Morrissey by just 93 votes. In a 1998 rematch, Correa was elected to the Assembly when he defeated Morrissey 54% to 43%.While a member of the Assembly, Correa served on several committees and was the chair of the Committee on Business and Professions, the Public Employees, Retirement and Social Security Committee; the Select Committee on Mobile Homes; and the Select Committee on MCAS El Toro Reuse.Correa was re-elected to the Assembly twice but was forced from office by California's term limits law, which restricts members from serving more than three two-year terms.In 2004, he campaigned for and was elected to the Orange County Board of Supervisors, becoming the first Democrat to serve on the board since 1987. He represented the First District, which includes the cities of Garden Grove, Santa Ana, and Westminster as well as unincorporated areas of the county including Midway City.", 'State Senate': 'In January 2006, Correa entered the race for the Democratic Party nomination for the California State Senate 34th District, a seat vacated by termed out Democratic State Senator Joe Dunn.After defeating Assemblyman Tom Umberg in the contested June primary, Correa faced off against Republican Assemblywoman Lynn Daucher in the November general election. In yet another close race, Correa won the election with a margin of victory of 1,392 votes.  As of 2016, he is the last Democrat to serve on the Orange County Board of Supervisors.Correa was sworn into the California State Senate on December 4, 2006.In 2010, Correa was reelected against Anaheim City Councilwoman Lucille Kring.In 2014, he ran for the Orange County Board of Supervisors but was defeated.In a January 27, 2015 special election, he again ran for the Orange County Board of Supervisors, but was narrowly defeated by Garden Grove City Councilman Andrew Do.', 'US House of Representatives': "Correa ran for the United States Congress for the 46th District in 2016.  He came in first in the June 7 primary with 43.7% of the vote, and won the general election against Democrat Bao Nguyen, who earned 14.6% of the vote in the top-two primary, with 69.9% of the vote. He is a member of the Blue Dog Coalition.Committee assignments Committee on Homeland SecuritySubcommittee on Border and Maritime SecuritySubcommittee on Oversight and Management Efficiency (Ranking Member)Committee on Veterans' AffairsSubcommittee on Economic OpportunitySubcommittee on HealthCaucus memberships New Democrat CoalitionHouse Baltic CaucusCongressional Hispanic CaucusCongressional Asian Pacific American Caucus", 'introduction': "Jose Luis Correa /kəˈreɪə/ (born January 24, 1958 in Anaheim, California) is an American politician who is the U.S. Representative for California's 46th congressional district. A Democrat, he served as a member of the California State Senate, representing the 34th Senate District.\nA graduate of Anaheim High School, Correa earned a Bachelor of Arts in Economics from Cal State Fullerton as well as a Juris Doctor and Master of Business Administration from UCLA. He was an investment banker, a real estate broker, and a college instructor.\n\n", 'code': '46'}, 'personal': {'Born': ' (1958-01-24) January 24, 1958 (age60)Anaheim, California, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Esther Correa', 'Children': '4', 'Education': 'California State University, Fullerton (BA)University of California, Los Angeles (JD, MBA)', 'Website': 'House website'}, 'timeline': {"Member of the US House of Representativesfrom California's 46th district": {'date': 'Assumed office January 3, 2017', 'Preceded by': 'Loretta Sánchez'}, 'Member of the California Senatefrom the 34th district': {'date': 'In officeDecember 4, 2006– November 30, 2014', 'Preceded by': 'Joe Dunn', 'Succeeded by': 'Janet Nguyen'}, 'Member of the Orange County Board of Supervisorsfrom the 1st district': {'date': 'In officeJanuary 3, 2005– December 4, 2006', 'Preceded by': 'Charles V. Smith', 'Succeeded by': 'Janet Nguyen'}, 'Member of the California State Assemblyfrom the 69th district': {'date': 'In officeDecember 7, 1998– November 30, 2004', 'Preceded by': 'Jim Morrissey', 'Succeeded by': 'Tom Umberg'}, 'code': '46'}, 'code': 'C001110'}