{"name": "Marc.Veasey", "picture": "V000131.jpg", "detail": {"Early life, education, and early career": "Veasey was born on January 3, 1971 to Connie and Joseph Veasey. With his parents and brother, Ryan, Veasey and his family lived in numerous rental houses in the Stop Six neighborhood of Fort Worth, Texas. When he was ten years old, his parents divorced, and Marc, Ryan and their mother moved in with their maternal grandmother in the Como neighborhood of Fort Worth.Veasey attended Arlington Heights High School in Fort Worth, Texas. He graduated from Texas Wesleyan University with a bachelor of science degree in mass communications.Veasey worked as a substitute teacher and sportswriter, as well as writing scripts for an advertising agency. One summer, he volunteered for United States Representative Martin Frost, and was hired as a field representative. Veasey worked for Frost for five years.", "Texas House of Representatives": "Elections As a result of the 2003 Texas redistricting, Frost lost his reelection effort in 2004 to Pete Sessions. In the 2004 elections, Veasey challenged Democratic State Representative Glenn Lewis for Texas's 95th House district. He defeated the incumbent 54%-46% in the Democratic primary. He won the general election unopposed. He was re-elected in 2006 (91%), 2008 (96%), and 2010 (100%).Tenure Veasey represented Texas House District 95 from 2005 to 2013. He was the Chair Pro Tempore of the House Democratic Caucus. He has sponsored measures to create career and technology training in high schools. He authored HB 62 which honored Tim Cole, a Texas Tech University student wrongly convicted of raping a fellow student in 1985. Marc also authored a bill requiring a study to lead to greater enforcement of the James Byrd Jr. hate crime bill.Committee assignments Elections CommitteeEnvironmental Regulation CommitteePensions, Investments, and Financial Services CommitteeRedistricting CommitteeVoter Identification & Voter Fraud Select Committee (Vice Chair)", "US House of Representatives": "2012 election Veasey declared his candidacy for Texas's 33rd congressional district, a new congressional district for the United States House of Representatives that was created by reapportionment following the 2010 United States census. The district is based in Tarrant and Dallas counties. It is a heavily Democratic district: the Cook Partisan Voting Index (PVI) was D+14. The district is also highly diverse: 66% Hispanic and 17% African American.Eleven candidates filed to run in the Democratic primary. Veasey finished first, but failed to reach the 50% threshold needed to win the primary outright. He received 37% of the vote. State Representative Domingo García ranked second with 25% of the vote, qualifying for the run-off election. Veasey won Tarrant with 49% of the vote, while Garcia won Dallas with 44% of the vote. In the run-off primary election, Veasey defeated Garcia 53%-47%. He carried Tarrant with a 68% of the vote, as opposed to Garcia's 70% in Dallas. In the general election, he defeated Republican Chuck Bradley 73%-26%. He won Tarrant with 78% of the vote and Dallas with 66% of the vote.  Veasey is the first African American representative elected from Tarrant County.2014 election Veasey won re-nomination in the March 4 primary election by defeating Tom Sanchez, 13,285 votes (73.5 percent) to 4,797 (26.5 percent). He faced no Republican opponent in the general election but Jason Reeves qualified for the ballot as a Libertarian.Committee assignments Committee on Armed ServicesSubcommittee on Strategic ForcesSubcommittee on Tactical Air and Land ForcesCommittee on Science, Space and TechnologySubcommittee on EnergySubcommittee on SpaceCaucus memberships Congressional Black CaucusLGBT Equality CaucusCongressional Arts CaucusBlue Collar CaucusCongressional NextGen 9-1-1 Caucus", "Personal life": "Veasey is married to Tonya Jackson, a former Texas Senate aide. The couple have a son, named Adam Clayton. Veasey's uncle, Robert James English, was a television reporter and worked for Jim Wright, the former Speaker of the United States House of Representatives.", "Electoral history": "Election resultsYearOfficeElectionSubjectPartyVotes%OpponentPartyVotes%OpponentPartyVotes%2004State RepresentativePrimaryMarc VeaseyDemocratic4,88054.29%Glenn Lewis (i)Democratic4,10945.71%2004State RepresentativeGeneralMarc VeaseyDemocratic33,769100.00%2006State RepresentativeGeneralMarc Veasey (i)Democratic18,25990.53%John Paul RobinsonLibertarian1,9099.47%2008State RepresentativeGeneralMarc Veasey (i)Democratic39,15095.52%Hy SiegelLibertarian1,8384.48%2010State RepresentativeGeneralMarc Veasey (i)Democratic19,835100.00%2012U.S. RepresentativePrimaryMarc VeaseyDemocratic6,93836.77%Domingo GarciaDemocratic4,71524.99%Kathleen HicksDemocratic2,37212.57%David AlameelDemocratic2,06410.94%Manuel ValdezDemocratic8844.69%Steve SalazarDemocratic4822.56%Chrysta CastanedaDemocratic3952.09%Jason E. RobertsDemocratic3421.81%Carlos QuintanillaDemocratic2861.52%Kyev P. Tatum, Sr.Democratic2011.07%J. R. MolinaDemocratic1891.00%2012U.S. RepresentativePrimary RunoffMarc VeaseyDemocratic10,76652.73%Domingo GarciaDemocratic9,65347.27%2012U.S. RepresentativeGeneralMarc VeaseyDemocratic85,11472.51%Chuck BradleyRepublican30,25225.77%Ed LindsayGreen2,0091.71%2014U.S. RepresentativePrimaryMarc Veasey (i)Democratic13,29273.48%Tom SanchezDemocratic4,79826.52%2014U.S. RepresentativeGeneralMarc Veasey (i)Democratic43,76986.51%Jason ReevesLibertarian6,82313.49%2016U.S. RepresentativePrimaryMarc Veasey (i)Democratic20,52663.41%Carlos QuintanillaDemocratic11,84636.59%2016U.S. RepresentativeGeneralMarc Veasey (i)Democratic93,14773.71%M. Mark MitchellRepublican33,22226.29%2018U.S. RepresentativePrimaryMarc Veasey (i)Democratic15,17570.32%Carlos QuintanillaDemocratic6,40529.68%", "introduction": "Marc Allison Veasey /ˈviːsi/ (born January 3, 1971) is an American politician from Fort Worth, Texas. Veasey is currently the United States Representative for Texas's 33rd congressional district, winning the office in November 2012. Previously he was a member of the Texas House of Representatives from 2005 to 2013, where he served as Chair Pro Tempore of the House Democratic Caucus. He is a member of the Democratic Party.\n\n", "code": "33"}, "personal": {"Born": "Marc Allison Veasey (1971-01-03) January 3, 1971 (age47)Fort Worth, Texas, U.S.", "Political party": "Democratic", "Spouse(s)": "Tonya Jackson", "Children": "1", "Education": "Texas Wesleyan University (BA)"}, "timeline": {"Member of the US House of Representativesfrom Texas's 33rd district": {"date": "Assumed office January 3, 2013", "Preceded by": "Constituency established"}, "Member of the Texas House of Representativesfrom the 95th district": {"date": "In officeJanuary 11, 2005– January 3, 2013", "Preceded by": "Glenn Lewis", "Succeeded by": "Nicole Collier"}, "code": "33"}, "code": "V000131", "type": "4", "party": "Democrat", "description": "rank-and-file Democrat", "economic": "-0.4", "social": "0.29", "leadership": "0.39"}