{'name': 'Mark.Warner', 'picture': 'W000805.jpg', 'detail': {'Early life, education, and business career': 'Warner was born in Indianapolis, Indiana, the son of Marjorie (née Johnston) and Robert F. Warner. He has a younger sister, Lisa. He grew up in Illinois, and later in Vernon, Connecticut, where he graduated from Rockville High School, a public secondary school. He has credited his interest in politics to his eighth grade social studies teacher, Jim Tyler, who "inspired him to work for social and political change during the tumultuous year of 1968." He was class president for three years at Rockville High School and hosted a weekly pick-up basketball game at his house, "a tradition that continues today."Warner graduated from George Washington University, (GW), earning his B.A. in 1977 with a 4.0 GPA and a minor in political science. He was valedictorian of his class at GW and the first in his family to graduate from college. At GW he worked on Capitol Hill to pay for his tuition, riding his bike early mornings to the office of U.S. Senator Abraham Ribicoff (D-CT). When his parents visited him at college, he obtained two tickets for them to tour the White House; when his father asked him why he didn\'t get a ticket for himself, he replied, "I\'ll see the White House when I\'m president."Warner then graduated from Harvard Law School with a Juris Doctor in 1980 and coached the law school\'s first intramural women\'s basketball team. Warner has never practiced law. In the early 1980s, he served as a staffer to U.S. Senator Christopher Dodd (D-CT). He later used his knowledge of federal telecommunication law and policies as a broker of mobile phone franchise licenses, making a significant fortune. As founder and managing director of Columbia Capital, a venture capital firm, he helped found or was an early investor in a number of technology companies, including Nextel. He co-founded Capital Cellular Corporation, and built up an estimated net worth of more than $200 million. As of 2012, he was the wealthiest U.S. Senator.State activism Warner involved himself in public efforts related to health care, telecommunications, information technology and education. He managed Douglas Wilder\'s successful 1989 gubernatorial campaign and served as chairman of the state Democratic Party from 1993-95.1996 U.S. Senate election He unsuccessfully ran for the U.S. Senate in 1996 against incumbent Republican John Warner (no relation) in a "Warner versus Warner" election. Mark Warner performed strongly in the state\'s rural areas, making the contest much closer than many pundits expected. He lost to the incumbent, 52%-47%, losing most parts of the state including the north.', 'Governor of Virginia': '2001 election In 2001 Warner campaigned for governor as a moderate Democrat after years of slowly building up a power base in rural Virginia, particularly Southwest Virginia. He defeated Republican candidate Mark Earley, the state attorney general, in a "Mark versus Mark" election, with 52.16 percent, a margin of 96,943 votes, and also Libertarian candidate William B. Redpath. Warner had a significant funding advantage, spending $20 million compared with Earley\'s $10 million.Warner also benefited from dissension in Republican ranks after a heated battle for the nomination between Earley, backed by religious conservatives, and then-lieutenant governor John H. Hager, some of whose supporters later openly backed Warner. In the same election, Republican Jerry Kilgore was elected attorney general, and Democrat Tim Kaine was elected lieutenant governor. In his campaign for governor in 2001, Warner said that he would not raise taxes.[citation needed]Tenure After he was elected in 2002, Warner drew upon a $900 million "rainy day fund" left by his predecessor, James S. Gilmore, III. Warner campaigned in favor of two regional sales tax increases (Northern Virginia and Hampton Roads) to fund transportation. Virginians rejected both regional referendums to raise the sales tax.In 2004, Warner worked with Democratic and moderate Republican legislators and the business community to reform the tax code, lowering food and some income taxes while increasing the sales and cigarette taxes. His tax package effected a net tax increase of approximately $1.5 billion annually. Warner credited the additional revenues with saving the state\'s AAA bond rating, held at the time by only five other states, and allowing the single largest investment in K-12 education in Virginia history. Warner also entered into an agreement with Democrats and moderate Republicans in the Virginia Senate to cap state car tax reimbursements to local governments.During his tenure as governor, Warner influenced the world of college athletics. "Warner used his power as Virginia\'s governor in 2003 to pressure the Atlantic Coast Conference into revoking an invitation it had already extended to Syracuse University. Warner wanted the conference, which already included the University of Virginia, to add Virginia Tech instead — and he got his way."Warner\'s popularity may have helped Democrats gain seats in the Virginia House of Delegates in 2003 and again in 2005, reducing the majorities built up by Republicans in the 1990s. Warner chaired the National Governors Association in 2004-05 and led a national high school reform movement. He chaired the Southern Governors\' Association and was a member of the Democratic Governors Association. In January 2005, a two-year study, the Government Performance Project, in conjunction with Governing magazine and the Pew Charitable Trust graded each state in four management categories: money, people, infrastructure and information. Virginia and Utah received the highest ratings average with both states receiving an A- rating overall, prompting Warner to dub Virginia "the best managed state in the nation."[citation needed]Kaine and Kilgore both sought to succeed Warner as governor of Virginia. (The Virginia Constitution forbids any governor from serving consecutive terms; so Warner could not have run for a second term in 2005.) On November 8, 2005, Kaine, the former mayor of Richmond, won with 52% of the vote. Kilgore, who had resigned as attorney general in February 2005 to campaign full-time and who had previously served as Virginia secretary of public safety, received 46% of the vote. Russ Potts, a Republican state senator, also ran for governor as an independent, receiving 2% of the vote. Warner had supported and campaigned for Kaine, and many national pundits considered Kaine\'s victory to be further evidence of Warner\'s political clout in Virginia.[citation needed]On November 29, 2005, Warner commuted the death sentence of Robin Lovitt to life imprisonment without the possibility of parole. Lovitt was convicted of murdering Clayton Dicks at an Arlington pool hall in 1999. After his trial in 2001, Lovitt\'s lawyers stated that a court clerk illegally destroyed evidence that was used against Lovitt during his trial, but that could have possibly exonerated him upon further DNA testing. Lovitt\'s death sentence would have been the 1,000th carried out in the United States since the Supreme Court reinstated capital punishment as permissible under the Eighth Amendment to the Constitution in 1976. In a statement, Warner said, "The actions of an agent of the commonwealth, in a manner contrary to the express direction of the law, comes at the expense of a defendant facing society\'s most severe and final sanction." Warner denied clemency in 11 other death penalty cases that came before him as governor.Warner also arranged for DNA tests of evidence left from the case of Roger Keith Coleman, who was put to death by the state in 1992. Coleman was convicted in the 1981 rape and stabbing death of his 19-year-old sister-in-law, Wanda McCoy. Coleman drew national attention, even making the cover of Time, by repeatedly claiming innocence and protesting the unfairness of the death penalty. DNA results announced on January 12, 2006 confirmed Coleman\'s guilt.In July 2005, his approval ratings were at 74% and in some polls reached 80%. Warner left office with a 71% approval rating in one poll.', 'US Senate': '2008 election Warner was believed to be preparing to run for the Democratic nomination for president in 2008, and had "done everything but announce his candidacy" before suddenly stating in October 2006 he would not run for president, citing family reasons. Warner declared on September 13, 2007 that he would run for the U.S. Senate being vacated by the retiring John Warner (no relation) in 2008.Warner immediately gained the endorsement of most national Democrats. He held a wide lead over his Republican opponent, fellow former Virginia governor Jim Gilmore, for virtually the entire campaign. Warner delivered the keynote address at the 2008 Democratic National Convention.In a Washington Post/ABC News Poll dated September 24, 2008, Warner held a 30-point lead over Gilmore.In the November election, Warner defeated Gilmore, taking 65 percent of the vote to Gilmore\'s 34 percent. Warner carried all but four counties in the state—Rockingham, Augusta, Powhatan and Hanover. In many cases, he ran up huge margins in areas of the state that have traditionally voted Republican. This was the most lopsided margin for a contested Senate race in Virginia since Chuck Robb took 72 percent of the vote in 1988. As a result of Warner\'s victory, Virginia had two Democratic U.S. Senators for the first time since Harry Byrd, Jr. left the Democrats to become an independent (while still caucusing with the Democrats) in 1970.[citation needed]2014 election In 2014, Warner faced Ed Gillespie, who had previously served as Counselor to the President under George W. Bush and chairman of the Republican National Committee. Gillespie criticized him for using tax payer money to fly in a luxury airplane. Warner\'s margin of victory—only 17,000 votes—was much narrower than expected.Tenure Upon arriving in the U.S. Senate in 2009, Warner was appointed to the Senate\'s Banking, Budget, and Commerce committees. Warner was later named to the Senate Intelligence Committee in 2011.In 2009, Warner voted for the American Recovery and Reinvestment Act, the stimulus bill. As a member of the Budget Committee, he submitted an amendment designed to help the government track how the stimulus dollars were being spent.When offered the chair of the Democratic Senatorial Campaign Committee in preparation for the 2012 election cycle, Warner declined because he wanted to keep a distance from the partisanship of the role.In the fall of 2012, Warner was approached by supporters about possibly leaving the Senate to seek a second four-year term as Virginia\'s governor. After considering the prospect, Warner announced shortly after the November 2012 elections that he had chosen to remain in the Senate because he was "all in" on finding a bipartisan solution to the country\'s fiscal challenges.Warner became the senior senator on January 3, 2013 when Jim Webb left the Senate and was replaced by Tim Kaine, who was lieutenant governor while Warner was governor.[citation needed]Warner has been identified as a radical centrist, working to foster compromise in the Senate. Warner was ranked the 10th most bipartisan member of the U.S. Senate during the 114th United States Congress in the Bipartisan Index, created by The Lugar Center and the McCourt School of Public Policy to assess congressional bipartisanship. According to the same methodology, Senator Warner was the second most bipartisan Democrat in the 115th United States Congress.  Health care On a video in his senate office, Warner promised Virginians, "I would not vote for a health-care plan that doesn\'t let you keep health insurance you like."He voted for the 2010 Affordable Care Act (commonly called Obamacare), helping the Senate reach the required sixty votes to prevent it from going to a filibuster. (As there were exactly 60 Democratic Senators at the time, each Democrat can be said to have cast the deciding vote.) He and 11 Senate freshmen discussed adding an amendment package aimed at addressing health care costs by expanding health IT and wellness prevention.Finance From the start of his Senate term, Warner attempted to replicate in Washington, D.C. the bipartisan partnerships that he used effectively during his tenure as Virginia governor. In 2010, Warner worked with a Republican colleague on the Banking Committee, Sen. Bob Corker (R-TN), to write a key portion of the Dodd-Frank Act that seeks to end taxpayer bailouts of failing Wall Street financial firms by requiring "advance funeral plans" for large financial firms.In 2013, the Center for the Study of the Presidency and Congress gave Sens. Warner and Corker its Publius Award for their bipartisan work on financial reform legislation.In 2018, Warner became one of the few Democrats in the Senate supporting a bill that would relax "key banking regulations". As part of at least 11 other Democrats, Warner argued that the bill would "right-size post-crisis rules imposed on small and regional lenders and help make it easier for them to provide credit". Chuck Schumer and Elizabeth Warren have stated their opposition to the legislation.Defense In 2011, Warner voted for the four-year extension of the USA PATRIOT Act.In 2011, he engaged Northern Virginia\'s high-tech community in a pro-bono effort to correct burial mistakes and other U.S. Army management deficiencies at Arlington National Cemetery. In 2012, he successfully pushed the Navy to improve the substandard military housing in Hampton Roads.In 2012, he pushed the Office of Personnel Management to address chronic backlogs in processing retirement benefits for federal workers, many of whom live in Washington\'s northern Virginia suburbs. Warner was successful in pushing the Department of Veterans Affairs to expand access to PTSD treatment for female military veterans returning from service in Iraq and Afghanistan.Warner was awarded the Distinguished Public Service Medal by U.S. Secretary of the Navy Ray Mabus, the Navy\'s highest honor for a civilian, for his consistent support of Virginia\'s military families and veterans.Economy Between 2010 and 2013, Warner invested considerable time and effort in leading the Senate\'s Gang of Six, along with Sen. Saxby Chambliss (R-GA). Together, Chambliss and Warner sought to craft a bipartisan plan along the lines of the Simpson-Bowles Commission to address U.S. deficits and debt.Although the Gang of Six ultimately failed to produce a legislative "grand bargain", they did agree on the broad outlines of a plan that included spending cuts, tax reforms that produced more revenue, and reforms to entitlement programs like Medicare and Social Security—entitlement reforms that are opposed by most Democrats. Although President Obama showed interest in the plan, leaders in Congress from both parties kept a deal from being made. In 2011, the bipartisan Concord Coalition awarded Warner and Chambliss its "Economic Patriots Award" for their work with the Gang of Six.Gun laws On April 17, 2013, Warner voted to expand background checks for gun purchases as part of the Manchin-Toomey Amendment.Transparency On the Senate Budget Committee, Warner was appointed chairman of a bipartisan task force on government performance in 2009. Warner was a lead sponsor of the 2010 Government Performance and Results Act (GPRA), which imposed specific program performance goals across all federal agencies and set up a more transparent agency performance review process.On May 21, 2013, Warner introduced the Digital Accountability and Transparency Act of 2014 (S. 994; 113th Congress). "The legislation requires standardized reporting of federal spending to be posted to a single website, allowing citizens to track spending in their communities and agencies to more easily identify improper payments, waste and fraud." On November 6, 2013, the Senate Homeland Security and Government Affairs committee unanimously passed DATA.On January 27, 2014, a version of the White House OMB\'s marked up version of the bill was leaked. This White House version "move[s] away from standards and toward open data structures to publish information" and "requir[es] OMB in consultation with Treasury to \'review and, if necessary, revise standards to ensure accuracy and consistency through methods such as establishing linkages between data in agency financial systems...\'" Senator Warner\'s responded with the following statement: "The Obama administration talks a lot about transparency, but these comments reflect a clear attempt to gut the DATA Act. DATA reflects years of bipartisan, bicameral work, and to propose substantial, unproductive changes this late in the game is unacceptable. We look forward to passing the DATA Act, which had near universal support in its House passage and passed unanimously out of its Senate committee. I will not back down from a bill that holds the government accountable and provides taxpayers the transparency they deserve."On April 10, 2014, the Senate voted by unanimous consent to pass the bill, which was then passed by the House in a voice vote on April 28, 2014.Minimum wage In April 2014, the United States Senate debated the Minimum Wage Fairness Act (S. 1737; 113th Congress). The bill would amend the Fair Labor Standards Act of 1938 (FLSA) to increase the federal minimum wage for employees to $10.10 per hour over the course of a two-year period. The bill was strongly supported by President Barack Obama and many Democratic Senators, but strongly opposed by Republicans in the Senate and House. Warner expressed a willingness to negotiate with Republicans about some of the provisions of the bill, such as the timeline for the phase-in. Warner said that any increase needs to be done "in a responsible way."Other issues Warner was the original Democratic sponsor of the Startup Act legislation and has partnered with the bill\'s original author Sen. Jerry Moran (R-KS) to introduce three iterations of the bill: Startup Act in 2011, Startup Act 2.0 in 2012 and Startup Act 3.0 in early 2013. Warner describes the legislation as the \'logical next step\' following enactment of the bipartisan JOBS Act."In 2015, Warner criticized the Saudi Arabian-led intervention in Yemen, saying: "I\'m concerned in particular with some of the indiscriminate bombing in Yemen ... [Gulf states] need to step up and they need to step up with more focus than the kind of indiscriminate bombing."In June 2017, Warner voted to support Trump\'s $350 billion arms deal with Saudi Arabia.In May 2018, Warner voted for Gina Haspel to be the next CIA director.In 2016, American foreign policy scholar Stefan Halper served as an FBI operative and contacted members of the 2016 Donald Trump Presidential campaign. In May 2018, Warner, the top Democrat on the Senate Intelligence Committee, warned Republican lawmakers that it would be "potentially illegal" to reveal the identity of Stefan Halper.Controversies In October 2014, Warner was implicated in a federal investigation of the 2014 resignation of Virginia State Senator Phillip Puckett, a Democrat. He is alleged to have "discussed the possibility of several jobs, including a federal judgeship, for the senator\'s daughter in an effort to dissuade him from quitting the evenly divided state Senate." A Warner spokesman acknowledged that the conversation occurred, but said Warner made no "explicit" job offer and that he and Puckett were simply "brainstorming".In January 2015, the Republican Party of Virginia filed a formal complaint against Warner with the United States Senate Select Committee on Ethics, alleging Warner\'s interactions with Puckett violated the Honest Leadership and Open Government Act.Campaign contributions From 2008-14, some of his top ten campaign contributors were JP Morgan Chase, the Blackstone Group and Columbia Capital. BlackRock had never contributed until Warner bought shares in the BlackRock Equity Dividend Fund in 2011.Committee assignments Committee on Banking, Housing, and Urban AffairsSubcommittee on Housing, Transportation, and Community DevelopmentSubcommittee on Security and International Trade and FinanceSubcommittee on Securities, Insurance, and Investment (Ranking Member)Committee on the BudgetCommittee on FinanceSubcommittee on Fiscal Responsibility and Economic Growth (Ranking Member)Subcommittee on International Trade, Customs, and Global CompetitivenessSubcommittee on Taxation and IRS OversightCommittee on Rules and AdministrationSelect Committee on Intelligence (Ranking Member)Joint Economic Committee', 'Electoral history': 'United States Senate election in Virginia, 1996PartyCandidateVotes%±RepublicanJohn Warner (Incumbent) 1,235,744 52.48% -28.43% DemocraticMark Warner1,115,98247.39%Write-ins2,9890.13%Majority119,7625.09%-57.67%Turnout2,354,715Republican holdSwingVirginia gubernatorial election, 2001PartyCandidateVotes%±DemocraticMark Warner 984,177 52.16% +9.60% RepublicanMark Earley887,23447.03%-8.79%LibertarianBill Redpath14,4970.77%Write-ins8130.04%Majority96,9435.14%-8.11%Turnout1,886,721Democratic gain from RepublicanSwingUnited States Senate election in Virginia, 2008PartyCandidateVotes%±DemocraticMark Warner 2,369,327 65.03% +65.03% RepublicanJim Gilmore1,228,83033.72%-48.85%Independent GreensGlenda Parker21,6900.60%LibertarianBill Redpath20,2690.56%Write-ins3,1780.09%Majority1,140,49731.30%-41.53%Turnout3,643,294Democratic gain from RepublicanSwingUnited States Senate election in Virginia, 2014PartyCandidateVotes%±DemocraticMark Warner (Incumbent) 1,073,667 49.15% -15.88% RepublicanEd Gillespie1,055,94048.34%+14.62%LibertarianRobert Sarvis53,1022.43%+1.87%OtherWrite-ins1,7640.08%-0.01%Plurality17,7270.81%-30.49%Turnout2,184,473Democratic holdSwing', 'Personal life': "Warner is married to Lisa Collis, whom he had met in 1984 at a fraternity keg party in Washington, D.C..[not in citation given] While on their honeymoon in 1989 in Egypt and Greece, Warner became ill; when he returned home, doctors discovered he had suffered a near-fatal burst appendix. Warner spent two months in the hospital recovering from the illness.  During her husband's tenure as governor, Collis was the first Virginia first lady to use her maiden name. Warner and Collis have three daughters: Madison, Gillian, and Eliza.Warner is involved in farming and winemaking at his Rappahannock Bend farm. There, he grows 15 acres (61,000\xa0m2) of grapes for Ingleside Vineyards; Ingleside bottles a private label that Warner offers at charity auctions.Warner has an estimated net worth of $257 million as of 2014.", 'Honorary degrees': 'Mark Warner has been awarded several honorary degrees, these include:Honorary degreesLocationDateSchoolDegree\xa0Virginia2002College of William and MaryDoctor of Laws (LL.D) \xa0District of Columbia2003George Washington UniversityDoctor of Public Service (DPS)  \xa0North Carolina15 May 2006Wake Forest UniversityDoctor of Laws (LL.D)  \xa0Virginia2007Lord Fairfax Community CollegeAssociate of Humane Letters\xa0Virginia20 May 2007Eastern Virginia Medical SchoolDoctorate  \xa0Virginia25 May 2013George Mason UniversityDoctorate  \xa0Virginia19 May 2018Virginia State UniversityDoctorate  ', 'introduction': 'Mark Robert Warner (born December 15, 1954) is an American businessman and politician serving as the senior United States Senator from Virginia, a seat he was first elected to in 2008. He is a member of the Democratic Party and currently a Vice Chair of the Senate Democratic Caucus and the Vice Chair of the Senate Intelligence Committee.\nPrior to his congressional career, Warner was the 69th Governor of Virginia holding the office from 2002 to 2006, and is the honorary chairman of the Forward Together PAC. Warner delivered the keynote address at the 2008 Democratic National Convention. Apart from politics, Warner is also known for his involvement in telecommunications-related venture capital during the 1980s; he founded the firm Columbia Capital.\nIn 2006, he was widely expected to pursue the Democratic nomination in the 2008 U.S. presidential election; however, he announced in October 2006 that he would not run, citing a desire not to disrupt his family life. Warner was considered to be a potential vice presidential candidate, until he took himself out of consideration after winning the Democratic nomination for the U.S. Senate.\nContested by his gubernatorial predecessor, Jim Gilmore, Warner won his first election to the Senate in 2008 with 65% of the vote. Warner won reelection in 2014, narrowly defeating Ed Gillespie.\n\n'}, 'personal': {'Born': 'Mark Robert Warner (1954-12-15) December 15, 1954 (age63)Indianapolis, Indiana, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Lisa Collis', 'Children': '3', 'Residence': 'Alexandria, Virginia', 'date': 'EducationGeorge Washington University (BA)Harvard University (JD)', 'Signature': '', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Virginia': {'date': 'Assumed office January 3, 2009Serving with Tim Kaine', 'Preceded by': 'John Warner'}, 'Vice Chair of the Senate Intelligence Committee': {'date': 'Assumed office January 3, 2017', 'Preceded by': 'Dianne Feinstein'}, 'Vice Chair of the Senate Democratic Caucus': {'date': 'Assumed office January 3, 2017Serving with Elizabeth Warren', 'Leader': 'Chuck Schumer', 'Preceded by': 'Chuck Schumer'}, '69th Governor of Virginia': {'date': 'In officeJanuary 12, 2002– January 14, 2006', 'Lieutenant': 'Tim Kaine', 'Preceded by': 'Jim Gilmore', 'Succeeded by': 'Tim Kaine'}, 'Chair of the National Governors Association': {'date': 'In officeJuly 20, 2004– July 18, 2005', 'Preceded by': 'Dirk Kempthorne', 'Succeeded by': 'Mike Huckabee'}, 'Chair of the Democratic Party of Virginia': {'date': 'In office1993–1995', 'Preceded by': 'Paul Goldman', 'Succeeded by': 'Suzie Wrenn'}}, 'code': 'W000805'}