{'name': 'Michael.Bennet', 'picture': 'B001267.jpg', 'detail': {'Early life and education': "He was born in New Delhi while his father, Douglas J. Bennet, was serving as an aide to Chester Bowles, then the U.S. ambassador to India. Douglas Bennet ran the United States Agency for International Development under President Jimmy Carter, served as President and CEO of National Public Radio (1983–93), and Assistant Secretary of State for International Organization Affairs in the Clinton Administration (1993–95).His grandfather, Douglas Bennet, had been an economic adviser in Franklin D. Roosevelt's administration. Bennet's mother, Susanne Christine (née Klejman), immigrated to the United States with her family in 1950. Her parents were Polish Jews and survived imprisonment in the Warsaw Ghetto. Bennet's mother is a retired elementary school librarian.Bennet grew up in Washington, D.C. as his father served as an aide to Vice President Hubert Humphrey, among others. Bennet was held back in second grade because of his struggle with dyslexia. He was enrolled at St. Albans School, an elite all-boys preparatory school, and served as a page on Capitol Hill.In 1987, Bennet earned his B.A. degree in history from Wesleyan University, the alma mater of his father and grandfather. At Wesleyan, Bennet was a member of Beta Theta Pi. Bennet earned his J.D. degree from Yale Law School, where he was the Editor-in-Chief of the Yale Law Journal.", 'Career before US Senate': 'From 1988 until 1990, when he left to attend Yale, he served as an aide to Ohio Governor Richard Celeste. After law school he served as a law clerk for the 4th Circuit Court of Appeals[dead link] and as an associate to Washington attorney Lloyd Cutler. He then served as Counsel to the Deputy Attorney General during Bill Clinton\'s administration. Douglas Bennet worked in the Clinton White House as well, as Assistant Secretary of State for International Organization Affairs. Following a stint as an assistant to the U.S. attorney in Connecticut, Bennet left the legal world and moved West. After briefly living in Montana, Bennet moved with his fiancé to Colorado in 1997. Bennett worked for six years in Denver as Managing Director for the Anschutz Investment Company, where he led the reorganization of an oil company and helped consolidate three movie theater chains into the Regal Entertainment Group.While working for Anschutz, Bennet befriended fellow Wesleyan alumnus John Hickenlooper, informally advising the latter\'s successful campaign for Mayor of Denver. Moving back into public service, Bennet served for two years as Hickenlooper\'s Chief of Staff.Bennet was appointed superintendent of Denver Public Schools on June 27, 2005, taking office on the following July 1. Bennet had no experience as a school administrator. In 2008, Bennet persuaded the Denver Board of Education to enter into a 30-year, $750 million financial bond transaction with variable interest rates designed to fluctuate as economic conditions changed. The New York Times wrote that "In short order, the transaction went awry because of stress in the credit markets, problems with the bond insurer and plummeting interest rates." As of 2010, the school system had paid $115 million in interest and other fees, at least $25 million more than it originally anticipated.Bennet was among the many officials whose names were circulated for United States Secretary of Education in the Obama Administration, which was eventually filled by Arne Duncan. Bennet and his wife were early supporters of Barack Obama\'s presidential bid during the 2008 Democratic primaries and he was among those who advised Barack Obama on education issues.', 'US Senate': 'Appointment On January 3, 2009, he was named by Colorado Governor Bill Ritter to fill the seat in the United States Senate vacated by United States Secretary of the Interior Ken Salazar on January 20. Ritter chose Bennet after interviewing several prominent Colorado Democrats, and Bennet took the job with the blessing of Hickenlooper. Upon taking office on January 21, 2009, he stated that he would seek election at the end of his term in 2010.[not in citation given]In a January 2011 article in Time entitled "Shaking Schools Up in an Already Tumultuous Year," the author of the article, Andrew J. Rotherham, said of Bennet: "If the federal No Child Left Behind Act is modified this year, or if anything else of significance happens in Washington on education policy, this Colorado Democrat will be at the center of it."2010 election Bennet ran for election for a full term as Senator from Colorado in the 2010 election.[dead link] On September 16, 2009, former Colorado House Speaker Andrew Romanoff announced his campaign to challenge Bennet for the Democratic nomination.Bennet received endorsements from President Barack Obama, U.S. Senator Mark Udall, and U.S. Representatives Betsy Markey, Jared Polis, and John Salazar of the Colorado congressional delegation. Bennet raised $7 million and had a four-to-one cash advantage over his opponent, Andrew Romanoff.On August 10, 2010, Bennet defeated Romanoff in the primary and won his party\'s nomination, facing Republican candidate Ken Buck. The campaign became one of the most expensive in the country, with the candidates spending a reported $15 million combined, and outside groups another $30 million. Bennet portrayed Buck as an extremist conservative opposed to abortion and direct election of Senators, while Buck and the groups supporting him characterized Bennet as a big-spending liberal.After Bennet won election, President Obama said Bennet "perfectly reflects the qualities of the ruggedly independent state he has been chosen to serve."On November 3, the day after polls closed, Bennet was declared the winner and Buck conceded. Bennet won by 851,590 votes (48.1%) to 822,731 (46.4%). He subsequently returned to Washington in January 2011 to start a full six-year term.2016 election Bennet was re-elected to a second term on November 8, 2016. He defeated Republican Candidate and El Paso County Commissioner Darryl Glenn. Bennet received 1.36 million votes, 156,248 more than Glenn. He received 31,780 more votes than Democratic presidential candidate Hillary Clinton, who also won the state in the general election. Bennet received more votes than any other Democrat in a statewide race in Colorado history. He also won more votes in Colorado\'s rural counties than any other statewide Democrat in state history.Following the election President Obama said Bennet was one of the "gifted Democratic politicians" that could lead the party in the future.Committee assignments Bennet sits on the following committees and subcommittees in the 115th United States Congress (2017–2019).Committee on Agriculture, Nutrition and ForestrySubcommittee on Commodities, Markets, Trade and Risk ManagementSubcommittee on Conservation, Forestry and Natural Resources (Ranking Member)Subcommittee on Nutrition, Agricultural Research and Specialty CropsSubcommittee on Rural Development and EnergyCommittee on FinanceSubcommittee on Energy, Natural Resources, and Infrastructure (Ranking Member)Subcommittee on Taxation and IRS OversightCommittee on Health, Education, Labor, and PensionsSubcommittee on Children and FamiliesSubcommittee on Primary Health and Retirement SecuritySource: United States Senate', 'Political positions': 'Gun law As of 2010, Bennet had earned a "C+" rating from the National Rifle Association for a mixed record regarding his votes for gun rights. In 2012, Bennet joined then Colorado Senator Mark Udall in asking for stricter gun control, in response to the Sandy Hook Elementary School shooting. In response to the shooting, Bennet stated that "In Colorado, we support the 2nd Amendment right to bear arms, we support the ability of people to hunt and recreate and to protect their families and homes, and we want to keep the wrong weapons out of the hands of the wrong people."Bennet participated in the Chris Murphy gun control filibuster, demanding that gun laws be changed in the wake of the Orlando nightclub shooting. During his participation in the filibuster, Bennet talked about the 2012 Aurora shooting, citing that as a response to the shooting, the state of Colorado closed gun sale loopholes and now requires background checks for any gun purchase.In response to the 2017 Las Vegas shooting, Bennet demanded universal background checks regarding gun sales and described the shooting as domestic terrorism.Health care policy Bennet voted in support of the Patient Protection and Affordable Care Act signed by President Barack Obama on March 23, 2010. In November 2009, when the bill was still working its way through Congress, Bennet said that he would support health care reform even if it meant losing the election. In 2016, in response to healthcare costs in western and central Colorado, which has some of the highest healthcare costs in the United States, Bennet said he "didn\'t have answers" and called it "next to impossible" to fix the Affordable Care Act given partisan attitudes at that time.As part of a group of Democrats proposing "more incremental steps to broaden health care coverage", as opposed to Bernie Sanders\'s push of "Medicare for All", Senator Tim Kaine and Michael Bennet have proposed "Medicare X". Medicare X would "create a public option modeled after Medicare alongside private options on the ObamaCare marketplaces".Immigration policy In September 2009, Bennet cosponsored the DREAM Act (S. 729), which proposed amending the Illegal Immigration Reform and Immigrant Responsibility Act of 1996 by giving residency to immigrants enrolled in higher education programs or serving in the military. In 2013, Bennet was a member of the Gang of Eight, a bipartisan group of four Democratic and four Republican U.S. Senators who introduced comprehensive immigration reform legislation. Their bill, the Border Security, Economic Opportunity, and Immigration Modernization Act of 2013, passed the U.S. Senate with a vote of 68-32, but stalled in the House due to opposition from the Republican majority.Energy policy In 2009, Bennet co-sponsored the Solar Manufacturing Jobs Creation Act, legislation that would have provided a tax credit to support solar manufacturing in the U.S. The legislation was not enacted.He was one of the handful of Democratic Senators who have supported construction of the Keystone XL pipeline, voting for it in 2013, 2014, and 2015.Cannabis Bennet has cosponsored the bipartisan STATES Act proposed in the 115th U.S. Congress by Massachusetts Senator Elizabeth Warren and fellow Colorado Senator Cory Gardner that would exempt individuals or corporations in compliance with state cannabis laws from federal enforcement of the Controlled Substances Act.', 'Personal life': 'On October 26, 1997, he married Earthjustice Legal Defense Fund attorney Susan Diane Daggett, in Marianna, Arkansas. They have three daughters and reside in Denver\'s Congress Park neighborhood.Though not raised in an observant household, Bennet acknowledges his family\'s Jewish roots. Bennet has stated that he was "raised with two different heritages, one [that] was Jewish and one [that] was Christian," and that he believes in God.His brother, James Bennet, is the editorial page director for The New York Times.', 'Electoral history': 'United States Senate Democratic primary election in Colorado, 2010PartyCandidateVotes%DemocraticMichael Bennet184,71454.15DemocraticAndrew Romanoff156,41945.85United States Senate election in Colorado, 2010PartyCandidateVotes%DemocraticMichael Bennet854,68548.08RepublicanKen Buck824,78946.40GreenBob Kinsey38,8842.19LibertarianMaclyn Stringer22,6461.27Independent ReformJason Napolitano19,4501.09IndependentCharley Miller11,3510.64IndependentJ. Moromisato5,7800.03Republican (write-in)Robert Rank520.00Independent (write-in)Michele Newman200.00Green (write-in)Bruce Lohmiller110.00United States Senate election in Colorado, 2016PartyCandidateVotes%DemocraticMichael Bennet1,370,71049.97RepublicanDarryl Glenn1,215,31844.31LibertarianLily Tang Williams99,2773.62GreenArn Menconi36,8051.34Others20,9130.76', 'introduction': "Michael Farrand Bennet (born November 28, 1964) is an American businessman, lawyer and politician serving as the senior United States Senator from Colorado, a seat he has held since 2009. A member of the Democratic Party, he was appointed to the seat when Ken Salazar resigned to become Secretary of the Interior. Bennet previously worked as managing director for the Anschutz Investment Company, chief of staff to then-Denver Mayor (and current Colorado Governor) John Hickenlooper, and superintendent of Denver Public Schools.\nBennet is the son of Douglas J. Bennet, a former State Department official and president of Wesleyan University. Early in his career, Bennet worked for Ohio Governor Richard Celeste. He went on to receive his Juris Doctor degree, after which he worked as a law clerk and later as Counsel to the U.S. Deputy Attorney General in the Clinton Administration.\nBennet became superintendent of the Denver public school system in July 2005. Bennet was speculated in late 2008 as a candidate for Obama's United States Secretary of Education. He was appointed by Governor Bill Ritter to fill the U.S. Senate seat vacated by Ken Salazar when Salazar became Secretary of the Interior in January 2009. Bennet was elected in the 2010 Senate election where he defeated Republican Ken Buck. He chaired the Democratic Senatorial Campaign Committee (DSCC) for the 2014 cycle and was reelected in the 2016 elections.\n\n"}, 'personal': {'Born': 'Michael Farrand Bennet (1964-11-28) November 28, 1964 (age53)New Delhi, India', 'Political party': 'Democratic', 'Spouse(s)': 'Susan Daggett (m.1997)', 'Children': '3', 'Education': 'Wesleyan University (BA)Yale University (JD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Colorado': {'date': 'Assumed office January 21, 2009Serving with Cory Gardner', 'Appointed by': 'Bill Ritter', 'Preceded by': 'Ken Salazar'}, 'Chair of the Democratic Senatorial Campaign Committee': {'date': 'In officeJanuary 3, 2013– January 3, 2015', 'Leader': 'Harry Reid', 'Preceded by': 'Patty Murray', 'Succeeded by': 'Jon Tester'}, 'Superintendent of Denver Public Schools': {'date': 'In officeJuly 1, 2005– January 21, 2009', 'Preceded by': 'Jerome Wartgow', 'Succeeded by': 'Tom Boasberg'}}, 'code': 'B001267'}