{"name": "Mike.Crapo", "picture": "C000880.jpg", "detail": {"Early life": "Crapo was born in Idaho Falls, Idaho, the son of Melba (née Olsen) and George Lavelle Crapo. His brother Terry was 12 years older. He is distantly related to Henry Howland Crapo, who served as Governor of Michigan from 1865 to 1869, and William Crapo Durant, Henry's grandson, who founded General Motors. He graduated from Idaho Falls High School in 1969. He earned a B.A. in political science from Brigham Young University in 1973 and a J.D. from Harvard Law School in 1977.", "Early political career": "Crapo served for one year as clerk to Judge James M. Carter at the United States Court of Appeals for the Ninth Circuit. He returned to Idaho to practice as a lawyer, joining his brother's law firm of Holden Kidwell Hahn & Crapo in Idaho Falls.In the 1980s, he became active in the Republican Party's campaigns for seats in the state legislature.  His brother Terry Crapo served in Idaho House of Representatives for four years as majority leader (1968 to 1972) and was considered a rising star in Idaho politics.Following his brother Terry's death from leukemia in 1982, Mike ran for an open seat in the Idaho Senate. He was elected to the State Senate in 1984, where he served until 1992. In 1988, Senate President pro tempore Jim Risch unexpectedly lost reelection to the Idaho Senate, and Crapo was elected by his colleagues to the president's position. He served as senate president pro tempore from 1988 to 1992.On January 27, 1989 he served as acting governor of Idaho for 12 hours. Governor Cecil D. Andrus was out of the state testifying before Congress, and then-Lieutenant Governor Butch Otter was out of the state on business for his employer Simplot. Due to laws of succession, the president pro tempore is next in line.  Andrus, a Democrat, left Crapo a note saying, \"Don't do anything I wouldn't do.... P.S. The chair is comfortable, isn't it?\" Crapo was elected to Congress in 1992, representing Idaho's 2nd congressional district in the United States House of Representatives. He was elected to the House for a total of three terms from 1993 until 1999. He ran and won election to the U.S. Senate in 1998.", "US Senate": "Elections Crapo was elected to the U.S. Senate in 1998, gaining the seat of Republican Dirk Kempthorne, who stepped down to run successfully for governor. In his Senate bid, as in his House campaigns, Crapo's campaign made signs that had a macron placed over the \"a\" in his name (Crāpo) to indicate its correct pronunciation (\"Cray-poe\").He was re-elected in 2004 with 99.2% of the vote, with the other .8% going to a write-in candidate, Democrat Scott McClure.In November 2010, Crapo was re-elected to a third term with 71% of the vote, defeating Democratic Party challenger P. Tom Sullivan and Constitution Party candidate Randy Bergquist.In November 2016, Crapo was re-elected to a fourth term with 66% of the vote, defeating Democratic Party challenger Jerry Sturgill and Constitution Party candidate Ray Writz. In October 2016, after the Donald Trump and Billy Bush recording came to light, Crapo said he would not be voting for the Republican presidential nominee. He later reversed this decision and supported candidate Trump. Tenure In the 111th Congress, Crapo served on the following Senate committees: Banking, Housing and Urban Development; Budget; Environment and Public Works; Indian Affairs; and Finance. He co-chairs the Senate Nuclear Caucus, the Canada-U.S. Inter-parliamentary Group (IPG); the COPD (Chronic Obstructive Pulmonary Disease) Caucus, which he founded; and the Congressional Sportsmen's Caucus.Crapo became the state's senior senator when the 111th United States Congress convened on January 3, 2009, succeeding Larry Craig, who decided not to seek re-election. At the convening of the 112th United States Congress, Crapo is ranked 39th in seniority in the Senate.He opposed President Barack Obama's health reform legislation, voted against the Patient Protection and Affordable Care Act in December 2009, and again voted against the Health Care and Education Reconciliation Act of 2010.In April 2013, Crapo was one of forty-six senators to vote against the passing of a bill which would have expanded background checks for all gun buyers. He voted with 40 Republicans and 5 Democrats to stop the passage of the bill. The New York Times had predicted a 0% chance of Crapo voting for the bill.The New York Times noted that Crapo became \"something of a hero among advocates of bipartisanship\" for his involvement in the \"Gang of Six\".His view on senatorial responsibilities for Supreme Court nominees has evolved.  Regarding President George Bush's 2006 nomination of Samuel Alito, Crapo said in a press release, \"All of the President's nominees deserve up-and-down votes and not efforts to obstruct judicial nominees for political purposes. Judges are not politicians, and hopefully, Judge Alito's nomination will put an end to the politics which have crept into the nomination process.\" But, in contrast in 2016, his press release regarding President Obama's nomination of Merrick Garland to replace the late Antonin Scalia said, The Constitution gives the President the right to make nominations to the Supreme Court, with the advice and consent of the Senate. As part of its role in this process, the Senate may, at its discretion, withhold consent. The next Supreme Court justice will make decisions that affect every American and shape our nation's legal landscape for decades. Therefore, the current Supreme Court vacancy should be filled by an individual nominated by the next President of the United States.In 2017, Crapo was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement.Committee assignments Committee on Banking, Housing, and Urban Affairs (chair)Subcommittee on Housing, Transportation and Community DevelopmentSubcommittee on Financial InstitutionsSubcommittee on Securities, Insurance and InvestmentCommittee on the BudgetCommittee on JudiciaryCommittee on FinanceSubcommittee on Health CareSubcommittee on Energy, Natural Resources, and InfrastructureSubcommittee on International Trade, Customs, and Global Competitiveness (Ranking Member)Committee on Indian AffairsCaucus memberships International Conservation CaucusSenate Diabetes CaucusSenate Nuclear Cleanup Caucus (co-chair)Senate Renewables and Energy Efficiency Caucus (co-chair)Sportsmen's Caucus (co-chair)Western Water CaucusZero Capital Gains Tax Caucus", "Political positions": "Abortion Crapo is pro-life. In 1998, he supported a bill that made it illegal for minors to cross state lines to get abortions in order to avoid parental consent laws.Gun law In 2012, Crapo stated that he disagreed that more gun control regulations would curb violence in the United States. He also stated that he supported efforts to improve mental health access rather than more gun laws.As of 2013, Crapo had an \"A+\" rating from the National Rifle Association (NRA) for his positive voting record on causes supported by the NRA. That same year, Crapo joined 12 other Senators stating he would filibuster any attempts by Democrats to introduce additional gun control regulations in the wake of the Sandy Hook Elementary School shooting. Additionally, Crapo supported legislation to make open carry legal in National Parks.In January 2017, the NRA praised Crapo for introducing the Hearing Protection Act, which would make access to gun silencers easier.In response to the 2017 Las Vegas shooting, Crapo called for \"solidarity\" and praised first responders. Additionally, he stated \"May we unite in the fight against evil with an ever-vigilant drive toward peace.\" The Hearing Protection Act bill was tabled in wake of the shooting.", "Personal life": "Crapo married Susan Diane Hasleton in June 1974, and the couple have five children. He is a member of The Church of Jesus Christ of Latter-day Saints.Crapo was diagnosed with prostate cancer in 1999 and underwent a radical prostatectomy in January 2000. He had a full recovery and was declared cancer-free at that time. He had a recurrence in 2005 of prostate cancer, and he underwent a series of radiation treatments. He has become active in advocating early detection tests for cancer and other treatable diseases. Crapo has also pushed to create a federal Office of Men's Health.Crapo was arrested on December 23, 2012, for DUI after running a red light in Alexandria, Virginia, at around 12:45 am EST. He failed field sobriety tests, registering a blood alcohol content of 0.11 percent. Hours after his arrest, Crapo issued a public apology for his behavior. Various Idaho media outlets were critical of Crapo's arrest, particularly in light of the temperance beliefs of his religion.On January 4, 2013, Crapo pleaded guilty to a drunk driving charge and received the standard punishment for a first-time offender in Virginia: $250 fine and court costs, one-year suspension of his driver's license, and court-ordered alcohol education and awareness classes. He successfully completed all. Following his court appearance, Crapo held a news conference outside the Alexandria courthouse, again apologizing and providing a more complete explanation regarding his actions as well as his intention to regain the trust of Idahoans.Crapo is an Eagle Scout, awarded in 1966. He received the Distinguished Eagle Scout Award (DESA) in 2000.", "Electoral history": "This section is missing information about the 2016 campaign. Please expand the section to include this information. Further details may exist on the talk page. (April 2017)U.S. House of Representatives 2nd District Republican Primary election in Idaho, 1996PartyCandidateVotes%+%RepublicanMike Crapo (inc.)51,77886%RepublicanPeter Rickards8,38214%Idaho's 2nd congressional district: Results 1992–1996YearDemocraticVotesPctRepublicanVotesPct3rd PartyPartyVotesPct3rd PartyPartyVotesPct1992J. D. Williams81,45035%Mike Crapo139,78361%Steven L. KauerIndependent4,9172%David W. MansfieldIndependent3,8072%1994Penny Fletcher47,93625%Mike Crapo143,59375%1996John D. Seidl67,62529%Mike Crapo157,64669%John ButlerNatural Law3,9772%U.S. Senate Republican Primary election in Idaho, 1998PartyCandidateVotes%+%RepublicanMike Crapo110,20587%RepublicanMatt Lambert16,07513%U.S. Senate Republican Primary election in Idaho, 2010PartyCandidateVotes%+%RepublicanMike Crapo (inc.)127,33279%RepublicanClaude \"Skip\" Davis, III33,15021%Senate elections in Idaho (Class III): Results 1998–2016YearDemocraticVotesPctRepublicanVotesPct3rd PartyPartyVotesPct1998Bill Mauk107,37528%Mike Crapo262,96670%George J. MansfeldNatural Law7,8332%2004(no candidate)Mike Crapo (inc.)499,79699%Scott F. McClure (write-in)Democratic4,1361%2010Tom Sullivan112,05725%Mike Crapo (inc.)319,95371%Randy BergquistConstitution17,4294%2016Jerry Sturgill188,24928%Mike Crapo (inc.)449,01766%Ray J. WritzConstitution41,6776%", "Further reading": "Anatomy of a Press Release, editorial, Times-News (Idaho), October 10, 2011", "introduction": "Michael Dean Crapo (/ˈkreɪpoʊ/ KRAY-poh; born May 20, 1951) is an American politician serving as the senior United States Senator from Idaho, a seat he was first elected to in 1998. A Republican, he previously served as the U.S. Representative for Idaho's 2nd congressional district from 1993 to 1999.\nBorn in Idaho Falls, Crapo is a graduate of Brigham Young University and Harvard Law School. He practiced law in his home city throughout the 1980s, while also maintaining an active role in local Republican politics. His brother Terry Crapo was majority leader in the Idaho House of Representatives from 1968 to 1972 and an influential political figure until his death from leukemia in 1982. After his brother's death, Crapo successfully ran for the Idaho Senate in 1984. Crapo served as Senate President pro tempore from 1988 to 1992.\nCrapo was elected to an open seat in Congress in 1992, representing Idaho's 2nd congressional district in the United States House of Representatives. After three terms in the House, he ran for the open seat in the U.S. Senate in 1998 when Dirk Kempthorne vacated it to run for Idaho Governor. Crapo was elected with 70% of the vote, and became the first Mormon to represent Idaho in the United States Senate. In the 2004 election, he won 99% of the vote against his only opponent, write-in Democratic candidate Scott McClure. He was reelected again in 2010 with 71% of the vote, and again in 2016 with 66% of the vote.\n\n"}, "personal": {"Born": "Michael Dean Crapo (1951-05-20) May 20, 1951 (age67)Idaho Falls, Idaho, U.S.", "Political party": "Republican", "Spouse(s)": "Susan Hasleton (m.1974)", "Children": "5", "Education": "Brigham Young University (BA)Harvard University (JD)"}, "timeline": {"United States Senatorfrom Idaho": {"date": "Assumed office January 3, 1999Serving with Jim Risch", "Preceded by": "Dirk Kempthorne"}, "Chair of the Senate Banking Committee": {"date": "Assumed office January 3, 2017", "Preceded by": "Richard Shelby"}, "Member of the US House of Representativesfrom Idaho's 2nd district": {"date": "In officeJanuary 3, 1993– January 3, 1999", "Preceded by": "Richard H. Stallings", "Succeeded by": "Mike Simpson"}, "37th President pro tempore of the Idaho Senate": {"date": "In officeDecember 1, 1988– December 1, 1992", "Preceded by": "Jim Risch", "Succeeded by": "Jerry Twiggs"}, "Member of the Idaho Senatefrom the 32nd district": {"date": "In officeDecember 1, 1984– December 1, 1992", "Succeeded by": "Mel Richardson"}}, "code": "C000880", "type": "3", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.51", "social": "0.28", "leadership": "0.51"}