{'name': 'Mike.Enzi', 'picture': 'E000285.jpg', 'detail': {'Early life, education and business career': "Mike Enzi was born on February 1, 1944 in Bremerton, Washington, the son of Dorothy M. (née Bradley) and Elmer Jacob Enzi. His paternal grandparents were ethnic Germans from Ukraine, and his mother had Irish and German ancestry. Enzi was raised in Thermopolis, Wyoming, after his father's return from military duty on the Pacific Coast. He attended elementary school in Thermopolis and graduated from Sheridan High School in 1962. He is an Eagle Scout and a recipient of the Distinguished Eagle Scout Award from the Boy Scouts of America.Enzi received a degree in accounting from George Washington University in Washington, D.C., in 1966. He is also a member of the Sigma Chi Fraternity and Alpha Kappa Psi business fraternity. He received an M.B.A. in retail marketing from the University of Denver in Colorado in 1968. He also served in the Wyoming Air National Guard from 1967 to 1973. On June 7, 1969, Enzi married the former Diana Buckley; the couple has two daughters (Amy and Emily) and a son (Brad), as well as four grandchildren (Trey, Lily Grace, Megan Riley, and Allison Quinn).Soon after his marriage, Enzi moved to Gillette, where he expanded his father's shoe-sale business, NZ Shoes, which later also had locations in Sheridan and in Miles City, Montana. As a young business owner, he served as president of the Wyoming chapter of the United States Junior Chamber.", 'Early political career': 'Enzi was elected mayor of Gillette in 1974 at age 30 and held the position for two terms, serving until 1982. During his tenure, the city doubled in size. From 1976 to 1979, Enzi worked with the U.S. Department of Interior on energy policy via its Coal Advisory Committee.Enzi was elected to the Wyoming House of Representatives as a Republican and served from 1987 to 1991. He was then a member of the Wyoming Senate from 1991 to 1997. In the State Senate Enzi became a vocal opponent of proposals to legalize gambling in the state. In 1994 he served as the primary spokesman of WyBett, an anti-casino group . He also worked from 1985 to 1997 as an accountant with an oil drilling company and during the 1990s as an executive director with the Black Hills Corporation, an energy holding company that owns utilities and natural gas and coal mining operations.', 'US Senate': 'Elections Enzi was first elected to the U.S. Senate in 1996. He endured a tough primary challenge during his first campaign before winning the general election by an 8-point margin. At the time of his election, Enzi was the only accountant in the U.S. Senate. Enzi won reelection by a large margin in 2002. He became the senior U.S. Senator from Wyoming when his colleague Craig L. Thomas died of leukemia on June 4, 2007. His new colleague is fellow Republican John Barrasso, a former State Senator from Casper, whom Enzi, as a then-State Senator himself, narrowly defeated in the 1996 senatorial primary, 32% to 30%.In 2008 Enzi was reelected to his third term in the U.S. Senate with over 76% of the vote against Democratic opponent Chris Rothfuss, a professor of political science at the University of Wyoming.Dick Cheney criticized him for receiving funding mainly from Washington-based PACs rather than supporters in his state.In July 2014 Enzi declared his intention to run for a fourth term and was reelected in November with 71% of the vote. No incumbent Wyoming Republican Senator running for reelection in the direct vote era has failed to win his party\'s nomination. In 2013, Enzi was accused of lying about his friendship with Cheney and relying on political action committee funding in preparation for his reelection campaign and a primary challenge by Liz Cheney. The National Republican Senatorial Committee and Wyoming Republicans supported Enzi.Tenure In 2005 Enzi became the ninth U.S. Senator from Wyoming to ascend to the rank of Chairman on one of the 16 standing committees in the U.S. Senate. He has been a member of the Senate Health, Education, Labor and Pensions Committee since his arrival in the U.S. Senate in 1997. During his time as Chairman of the HELP Committee, 37 bills were reported out of the committee, 23 bills passed the Senate, 352 nominations were reported favorably, and 15 laws came through the committee that were signed by President George W. Bush.In March 2007 National Journal ranked Enzi the sixth-most conservative U.S. Senator.Fiscal policy Enzi supports imposing a new sales tax on internet sales and other sales of interstate commerce. On November 9, 2011 he introduced Senate Bill 1832 which would require businesses to calculate, collect and pay the new tax whenever they sell products or services to consumers from another state, regardless of the manner in which the sale is transacted. The bill provides no exemption for businesses in tax-free states, so even sellers within states that have no sales tax would be required to calculate and pay the new tax.After the Marketplace Fairness Act (S.1832) failed in the 112th Congress, Enzi reintroduced it (twice) in the 113th Congress as the Marketplace Fairness Act of 2013 (S.336 and S.743).Enzi has voted for the repeal of legislation governing such things as the estate tax and the "marriage penalty." Enzi is a signer of Americans for Tax Reform’s Taxpayer Protection Pledge.He supports partial privatization of Social Security and has consistently voted against measures to expand Medicare or to enroll more children or lower-class individuals in public health care.A strong supporter of the coal industry, Enzi also rejects alternative energy proposals and advocates Arctic National Wildlife Refuge (ANWR) and offshore drilling. Enzi\'s committee led the first revisions to mine safety laws in 28 years by promoting the use of new technologies to improve mine safety and save lives. He has a somewhat mixed record on trade issues: he has voted to approve most free trade bills but has rejected the Central America Free Trade Agreement (CAFTA), one of the largest pieces of such legislation, and is opposed to presidential fast-tracking of trade relation normalization.Enzi takes a hard-line view on illegal immigration and has been rated highly by groups that support tighter border controls. He has voted in favor of the construction of a fence along the U.S.-Mexican border and against the implementation of guest worker programs. Enzi has voted to uphold the PATRIOT Act and is opposed to calls to cut down on wiretapping and to extend rights to Guantanamo Bay detainees. Enzi also rejected calls for a timetable for military withdrawal from Iraq.Healthcare Enzi opposed President Barack Obama\'s health reform legislation; he voted against the Patient Protection and Affordable Care Act in December 2009, and he voted against the Health Care and Education Reconciliation Act of 2010.Enzi was one of the Gang of Six senators working to find a bipartisan solution to health care reform. Speaking on the topic, Enzi told the media, "We all want health care reform that will reduce costs, improve quality and expand access without breaking the bank. The bipartisan talks we\'re having in the Finance Committee represent the best chance we have of achieving our shared goals, and I urge Democrat (sic) leaders not to close the door on these productive discussions." In 2017, Enzi was part of the group of 13 Senators drafting the Senate version of the AHCA behind closed doors.Environment Enzi was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement. According to the Center for Responsive Politics, Enzi has received over $270,000 from the oil and gas industry since 2012.Foreign policy Despite his strong support of the War in Iraq, he was one of 14 U.S. Senators to vote against the Iraq War funding bill in May 2007 because he opposed the clauses of the bill which increase domestic spending.Social policy On social issues, Enzi is strongly conservative. He opposes all types of abortion and has voted in favor of proposals that would provide restrictions on the procedure for minors, those stationed on military bases, and other groups. He has voted in favor of failed constitutional amendments that suggested banning gay marriage and flag desecration. However, in August 2013, Enzi was the only Republican to sign a letter in support of ending the national ban on donated blood from men who have sex with men. Enzi also is a strong supporter of gun rights and is ranked very favorably by the National Rifle Association (NRA).In April 2013, Senator Enzi was one of forty-six senators to vote against the passing of a bill which would have expanded background checks for all gun buyers. Enzi voted with 40 Republicans and 5 Democrats to stop the passage of the bill. NY Times predicted a 0% chance of Senator Enzi voting aye on the bill.Committee assignments Committee on the Budget (Chairman)Committee on FinanceSubcommittee on Health CareSubcommittee on Taxation, IRS Oversight, and Long-Term GrowthSubcommittee on Energy, Natural Resources, and InfrastructureCommittee on Health, Education, Labor, and PensionsUnited States Senate Health Subcommittee on Primary Health and Retirement Security (Chairman)Committee on Small Business and Entrepreneurship', 'Election history': 'United States Senate election in Wyoming, 2014PartyCandidateVotes%±RepublicanMike Enzi*121,55471.19%-4.44DemocraticCharlie Hardy29,37717.45%IndependentCurt Gottshall13,3117.90%United States Senate Republican primary election in Wyoming, 2014PartyCandidateVotes%±RepublicanMike Enzi*77,96578.51%RepublicanBryan Miller9,3309.39%RepublicanJames "Coaltrain" Gregory3,7403.77%RepublicanThomas Bleming2,5042.52%RepublicanArthur Bruce Clifton1,4031.41%United States Senate election in Wyoming, 2008PartyCandidateVotes%±RepublicanMike Enzi*189,04675.63%+ 2.68DemocraticChris Rothfuss60,63124.26%United States Senate election in Wyoming, 2002PartyCandidateVotes%±RepublicanMike Enzi*133,71072.95%+ 18.89DemocraticJoyce Jansa Corcoran49,57027.05%United States Senate Republican primary election in Wyoming, 2002PartyCandidateVotes%±RepublicanMike Enzi*78,61285.87%RepublicanCrosby Allen12,93114.13%United States Senate election in Wyoming, 1996PartyCandidateVotes%±RepublicanMike Enzi114,11654.06%DemocraticKathy Karpan89,10342.21%LibertarianW. David Herbert5,2892.51%Natural LawLloyd Marsden2,5691.22%United States Senate Republican primary election in Wyoming, 1996PartyCandidateVotes%±RepublicanMike Enzi27,05632.47%RepublicanJohn Barrasso24,91829.90%RepublicanCurt Meier14,73917.69%RepublicanNimi McConigley6,0057.21%RepublicanKevin Meenan6,0007.20%RepublicanKathleen Jachkowski2,2692.72%RepublicanBrian Coen9431.13%RepublicanCleveland Holloway8741.05%RepublicanRuss Hanrahan5240.63%', 'introduction': "Michael Bradley Enzi (/ˈɛnzɪ/; born February 1, 1944) is an American politician serving as the senior United States Senator from Wyoming, a seat he was first elected to in 1996. He is a member of the Republican Party.\nRaised in Thermopolis, Wyoming, Enzi attended George Washington University and the University of Denver. He expanded his father's shoe store business in Gillette, Wyoming before being elected the city's mayor in 1974. In the late 1970s, he worked for the United States Department of the Interior. He served as a state legislator in both the Wyoming House of Representatives (1987–1991) and Wyoming Senate (1991–1997). During the 1980s and 1990s, he worked as an accountant and executive director in the energy industry.\nEnzi was elected to the U.S. Senate in 1996 with 54% of the vote and was reelected in 2002 with 73% of the vote, in 2008 with 75% of the vote and in 2014 with 71% of the vote. Since his election, he has consistently been ranked one of the most conservative members of the Senate. He was a member of the 2009 Gang of Six, which attempted to negotiate health care reform. Since 2015, he has also chaired the Senate Budget Committee, during the 114th and 115th Congresses.\n\n"}, 'personal': {'date': 'EducationGeorge Washington University (BS)University of Denver (MBA)', 'Political party': 'Republican', 'Spouse(s)': 'Diana Buckley', 'Children': '3', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Wyoming': {'date': 'Assumed office January 3, 1997Serving with John Barrasso', 'Preceded by': 'Alan Simpson'}, 'Chairman of the Senate Budget Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Patty Murray'}, 'Chairman of the Senate Health, Education, Labor, and Pension Committee': {'date': 'In officeJanuary 3, 2005– January 3, 2007', 'Preceded by': 'Judd Gregg', 'Succeeded by': 'Ted Kennedy'}, 'Member of the Wyoming Senatefrom the 24th district': {'date': 'In officeJanuary 1993– January 3, 1997', 'Preceded by': 'County-based representation', 'Succeeded by': 'Richard Erb'}, 'Member of the Wyoming Senatefrom Johnson and Campbell Counties': {'date': 'In officeDecember 13, 1991– January 1993', 'Preceded by': 'Kelly Mader', 'Succeeded by': 'Numerical districting'}, 'Mayor of Gillette': {'date': 'In office1975–1982', 'Preceded by': 'Cliff Davis', 'Succeeded by': 'Herb Carter'}, 'Military service': {'Allegiance': 'United States', 'Service/branch': 'United States Air Force', 'Years of service': '1967–1973', 'Unit': 'Wyoming Air National Guard'}}, 'code': 'E000285'}