{'name': 'Neal.Dunn', 'picture': 'D000628.jpg', 'detail': {'Early life and career': 'Dunn was born in New Haven, Connecticut on February 16, 1953. He studied Interdisciplinary Sciences at Washington and Lee University where he received his bachelor of science. He then graduated from the George Washington University School of Medicine & Health Sciences and completed his medical internship at Walter Reed Army Medical Center. He served in the United States Army for eleven years of active duty service, reaching the rank of Major. He then settled in Panama City, Florida, where he helped found the Panama City Urological Center, the Panama City Surgery Center, and was the founding chairman of Summit Bank.', 'US House of Representatives': 'In August 2015, Dunn announced his candidacy for the United States House of Representatives for Florida\'s 2nd congressional district in the 2016 elections.  The district\'s one-term incumbent, Democrat Gwen Graham, opted to retire after a court-ordered redistricting made the district heavily Republican. He won the Republican Party nomination, defeating attorneys Lathika (Mary) Thomas and Ken Sukhia. He defeated Walter Dartland in the general election. He was sworn into the House of Representatives on January 3, 2017.Brian Schubert, Neal Dunn\'s chief of staff resigned in February 2018 following the House Ethics Committee having launched an investigation "into alleged sexual harassment by him and his former boss", Patrick Meehan.Dunn has not held a town hall since March 2017. The congressman has told media outlets that he doesn\'t believe town halls are a productive format for engaging constituents.  Constituents have voiced frustration with Dunn for his refusal to host town halls. Committee assignments Committee on AgricultureSubcommittee on General Farm Commodities and Risk ManagementSubcommittee on Biotechnology, Horticulture, and ResearchCommittee on Science, Space and TechnologySubcommittee on EnergySubcommittee on SpaceCommittee on Veterans\' AffairsSubcommittee on HealthSubcommittee on Oversight and InvestigationsRepublican Study Committee', 'Political positions': 'Gun policy Dunn received an "AQ" rating from the NRA during his 2016 run for office — the highest rating possible for a non-incumbent.Dunn does not support a ban of semi-automatic weapons.From 2015–2016, Dunn accepted $1,000 USD from the NRA\'s Political Victory Fund.Net Neutrality Dunn, along with 107 Republican members of Congress, sent Federal Communications Commission Chairman Ajit Pai a letter on December 13, 2017 supporting his plan to repeal Net Neutrality protections ahead of the commission’s vote. Dunn also accepted $18,500 from the telecom industry before voting to repeal the rule.Tax reform Dunn voted in favor of the Tax Cuts and Jobs Act of 2017. He describes the bill as "good medicine for America." Dunn believes that the bill will benefit many generations of Americans with a "great economy in which there will be jobs, there will be opportunity, there\'s possibilities for literally a whole new generation or two of Americans." Dunn says he has received support from "mostly small businessman" from his district on his support of the bill.Education Dunn wants to defund the Department of Education.Healthcare Dunn supports repealing the Affordable Care Act (Obamacare), which he says is "failing." He says "no one can afford" the premiums and deductibles.', 'Personal life': 'Dunn and his wife, Leah, have three sons and three grandsons.', 'introduction': "Neal Patrick Dunn (born February 16, 1953) is an American surgeon and politician of the Republican Party serving as the U.S. Representative for Florida's 2nd congressional district since 2017.\n\n", 'code': '02'}, 'personal': {'Born': ' (1953-02-16) February 16, 1953 (age65)New Haven, Connecticut, U.S.', 'Political party': 'Republican', 'Education': 'Washington and Lee University (BS)George Washington University (MD)', 'Website': 'House website'}, 'timeline': {"Member of the US House of Representativesfrom Florida's 2nd district": {'date': 'Assumed office January 3, 2017', 'Preceded by': 'Gwen Graham'}, 'Military service': {'Allegiance': 'United States', 'Service/branch': 'United States Army', 'Rank': 'Major'}, 'code': '02'}, 'code': 'D000628'}