{"name": "Norma.Torres", "picture": "T000474.jpg", "detail": {"Early life and career": "Torres was born in Guatemala. When she was five, her mother died, and she, her father, and her two brothers relocated to Los Angeles. She worked as a 9-1-1 dispatcher, where in 1994 she led a campaign to require the hiring of bilingual 9-1-1 operators. She was an active member of AFSCME, serving as local 3090's shop steward. She served on the Pomona city council prior to being elected the city's mayor in 2006. In 2008, she endorsed then-presidential candidate Barack Obama before Hillary Clinton withdrew from the race, and was a superdelegate to the Democratic National Convention. She was elected to the State Assembly in November 2008, filling the vacancy left by former legislator Nell Soto, who retired.She was 2008/09 Treasurer for the National Conference of Democratic Mayors.", "US House of Representatives": "Committee assignments Committee on Foreign AffairsSubcommittee on the Western HemisphereSubcommittee on Terrorism, Nonproliferation, and TradeCommittee on Natural ResourcesSubcommittee on Indian, Insular and Alaska Native AffairsSubcommittee on Federal LandsCaucus memberships New Democrat CoalitionCongressional Hispanic CaucusCongressional NextGen 9-1-1 Caucus", "introduction": "Norma Judith Torres (/ˈtɔːrɛs/; born April 4, 1965) is an American politician. She is a member of the United States House of Representatives for California's 35th congressional district. Previously, she was a member of the California State Senate representing the 32nd district. She is a Democrat.\n\n", "code": "35"}, "personal": {"Born": " (1965-04-04) April 4, 1965 (age53)Escuintla, Guatemala", "Political party": "Democratic", "Spouse(s)": "Louis", "Education": "Mount San Antonio CollegeRio Hondo CollegeNational Labor College (BA)"}, "timeline": {"Member of the US House of Representativesfrom California's 35th district": {"date": "Assumed office January 3, 2015", "Preceded by": "Gloria Negrete McLeod"}, "Member of the California State Senatefrom the 32nd district": {"date": "In officeMay 20, 2013– November 30, 2014", "Preceded by": "Gloria Negrete McLeod", "Succeeded by": "Connie Leyva (Redistricted)"}, "Member of the California State Assemblyfrom the 52nd district61st district (2008–2012)": {"date": "In officeDecember 1, 2008– May 20, 2013", "Preceded by": "Nell Soto", "Succeeded by": "Freddie Rodriguez"}, "Mayor of Pomona": {"date": "In officeApril 3, 2006– December 1, 2008", "Preceded by": "Edward Cortez", "Succeeded by": "Elliot Rothman"}, "Member of the Pomona City Councilfrom the 6th district": {"date": "In officeJanuary 8, 2001– April 3, 2006", "Preceded by": "Willie White", "Succeeded by": "Steven Bañales"}, "code": "35"}, "code": "T000474", "type": "4", "party": "Democrat", "description": "moderate Democratic follower", "economic": "-0.36", "social": "0.03", "leadership": "0.29"}