{"name": "Pat.Toomey", "picture": "T000461.jpg", "detail": {"Early life, education, and early career": "Toomey was born in Providence, Rhode Island, the third of six children of Catholic parents, Mary Ann (née Andrews) of East Providence and Patrick Joseph Toomey of Providence. His father was a union worker who laid cable for the Narragansett Electric Company, and his mother worked as a part-time secretary at St. Martha's Catholic Church.Toomey was a member of the Boy Scouts of America and attained the organization's highest rank, Eagle Scout. His father was of Irish descent and his mother was of Portuguese ancestry. His maternal great-grandparents were all born in the Azores.Toomey attended La Salle Academy on scholarship where he participated in the Close Up Washington civic education program. He graduated as valedictorian of his high school class. He graduated from Harvard College with an A.B. in government.Toomey was hired by Chemical Bank in 1984, where he was involved in currency swap transactions. In 1986, Toomey was hired by Morgan, Grenfell & Co., where he dealt in multiple foreign currencies, interest rates, and currency-related derivatives.In 1991, Toomey resigned from the firm when it was acquired by Deutsche Bank due, he later stated, to his concern that the new corporate owner would impose a less flexible and entrepreneurial work environment. The same year, Toomey and two younger brothers, Steven and Michael, opened Rookie's Restaurant in Allentown, Pennsylvania.In 1994, 32-year-old Toomey was elected to Allentown's newly established Government Study Commission. During his term, Toomey drafted a new charter for the commission requiring a supermajority for any tax increase. The charter was approved by Allentown voters on April 23, 1996.", "US House of Representatives": "Elections 1998In 1998, Toomey ran for the Pennsylvania's 15th congressional district, based in the Lehigh Valley region, after Democratic incumbent U.S. Congressman Paul McHale decided to retire. He won the six candidate Republican primary field with 27% of the vote.In the general election, he faced Roy C. Afflerbach, State Senator and former state representative. During the campaign, Toomey criticized the agenda of the Clinton-Gore administration, specifically plans to modify the Internal Revenue Service. He said the plan did not \"address the real fundamental problems plaguing American taxpayers\" and said that the IRS should be abolished.Later in the campaign, Toomey and Democratic opponent Roy C. Afflerbach debated the effectiveness of a flat tax-based system, an issue on which the two sharply disagreed. He promised to only serve six years if he won the election.  Toomey defeated Afflerbach by 55%–45%.2000Toomey won re-election to a second term by defeating Ed O'Brien, president of the Bethlehem-based United Steelworkers Local 2598, 53%–47%. He won Lehigh County with 54% and Northampton with 51%.2002Toomey won re-election to a third term by defeating Ed O'Brien in a rematch 57%–43%. He won Lehigh with 58% and Northampton with 54%.2004He did not run for re-election to his House seat in 2004, fulfilling a pledge that he had signed in 1998 to serve only three terms. He decided to challenge incumbent Republican U.S. Senator Arlen Specter in the primary instead.Tenure Toomey served as the U.S. Representative for Pennsylvania's 15th congressional district from 1999 to 2005. While serving in the United States House of Representatives he distinguished himself as a fiscal expert. He pushed to decrease spending by the federal government and to set aside money for debt reduction.In 2001, he proposed a budget that would cut taxes worth $2.2 trillion over ten years, exceeding Bush's $1.6 trillion plan.In 2002, Toomey voted in favor of the Iraq Resolution, which authorized military action against Iraq.Toomey strongly opposed Bush's plan for illegal immigration saying \"I think it's a slap in the face for the millions of people throughout the world who decide to take the effort to legally enter our country.\" He was a longtime supporter of creating Medicare Part D, but said he wouldn't vote for it unless it brings down costs and guarantees competition between government and private insurers. In keeping with his pledge to limit his term in the House to six years, Toomey elected to run for the Senate in 2004.Committee assignments House Budget Committee", "US Senate": "Elections 2004In 2004, Toomey, aged 42, challenged longtime incumbent Senator Arlen Specter in the Republican primary election. Aided by $2 million of advertising from the Club for Growth, Toomey's election campaign theme was that Specter was not a conservative, especially on fiscal issues. Most of the state's Republican establishment supported Specter, including Pennsylvania's other U.S. Senator, Rick Santorum, and President George W. Bush. Specter defeated Toomey narrowly, 51%–49%, a margin of 1.6 points and a difference of about 17,000 votes out of over 1 million votes cast.2010On April 15, 2009, Toomey announced his intention to once again challenge Specter in the Republican senatorial primary.On April 28, 2009, Specter announced that he was switching parties and would run as a Democrat, after polls showed him losing to Toomey in the primary. Specter's withdrawal left Toomey as the front runner for the 2010 Republican nomination. Both primaries were held on May 18, 2010.Toomey defeated Peg Luksik in the Republican primary 81%–19%, and Specter was eliminated when he lost the Democratic primary 54%–46% to U.S. Congressman Joe Sestak of Delaware County.  The general election became ugly, and ultimately cost over $50 million, including spending by the candidates, political parties, and outside groups. Toomey prevailed, 51%–49%, carrying most of the state's counties.2016Toomey successfully ran for re-election to the U.S. Senate in 2016. He was endorsed by the Club for Growth. He ran unopposed in the Republican primary and defeated Democratic candidate Kathleen McGinty in the general election.Toomey won his re-election with 48.9% of the vote, compared to Democratic challenger Katie McGinty's 47.2% and Libertarian challenger Ed Clifford's 3.85%.Tenure Toomey, the first Lehigh Valley resident to serve as United States Senator from Pennsylvania since Richard Brodhead in the mid-19th century, was elected to the United States Senate on November 2, 2010. His term began on January 3, 2011. He joined the Congressional Hispanic Conference, a caucus which he was an original member of in his days in the House.On August 11, 2011, Toomey was named to the United States Congress Joint Select Committee on Deficit Reduction by Senate minority leader Mitch McConnell. The committee's duties included composing a package of spending cuts for submission to both Houses of Congress.On April 26, 2012, Toomey was selected to succeed Jim DeMint of South Carolina as chairman of the United States Senate Steering Committee, a caucus consisting of several Republican Senators who collaborate on legislation. DeMint had previously expressed his intention of transferring the committee's chairmanship to a member of the Republican 2010 Senate class.Toomey has been criticized by certain activists for purportedly not meeting sufficiently with his constituents, including never having held an in-person town hall in Philadelphia, despite carrying out at least 47 \"teleconference town hall meetings\" with his constituents.Committee assignments Committee on Banking, Housing, and Urban AffairsSubcommittee on Financial Institutions and Consumer Protection (Chairman)Subcommittee on Housing, Transportation, and Community DevelopmentSubcommittee on Securities, Insurance, and InvestmentCommittee on the BudgetCommittee on FinanceJoint Economic CommitteeJoint Select Committee on Deficit Reduction", "Political positions": "Education Toomey has strongly supported increased school choice and charter schools.During 2017, Toomey supported Betsy DeVos for President Trump's cabinet pick for the Secretary of Education.  At the time of the vote, Toomey had received $60,500 from the DeVos family during his career. There were weekly protests at his office, and high numbers of phone/faxes/emails were noted.Environment During Toomey's tenure in Congress, he supported legislation that would speed up approval of forest thinning projects in areas at high risk of wildfire, disease, or pest infestation in 2003, supported opening the Arctic National Wildlife Refuge to oil drilling and development, opposed implementing the Kyoto Protocol, and opposed legislation that would mandate increased vehicle fuel efficiency standards and provide incentives for alternative fuels.[better source needed]In 2010, Toomey said, \"I think it's clear that [climate change] has happened. The extent to which that has been caused by human activity I think is not as clear. I think that is still very much disputed and has been debated\".[better source needed] In 2011, he voted to limit the Environmental Protection Agency's ability to regulate greenhouse gas emissions.In 2013, he voted for a point of order opposing a carbon tax or a fee on carbon emissions. In 2015, he voted against the Clean Power Plan.In a series of roll call votes attached to debate about Keystone on January 21, 2015, he voted against an amendment offered by Brian Schatz expressing the sense of Congress regarding climate change but voted in favor of a similar amendment offered by John Hoeven.Government shutdown In 2013, Toomey was one of 18 Senators who voted against the bill to reopen the government during the United States government shutdown of 2013. Regarding the vote, he said: \"The one major redeeming aspect of this bill is that it reopens the government ... But I cannot support piling hundreds of billions of dollars of debt on current and future generations of Americans without even a sliver of reform to start putting our fiscal house in order.\"National security Toomey supports temporary suspension of immigrants from countries that serve as what he described as terrorist \"safe havens.\" He supported President Donald Trump's 2017 executive order to impose a temporary ban on entry to the U.S. to citizens of seven Muslim-majority countries.Deregulation Regarding deregulation of the financial services industry, Toomey said in 1999: \"The trend in deregulation, beginning in the early 1980s, is one of the biggest reasons for the sustained economic expansion. I would like to see us continue to deregulate on many fronts, including the financial services industry.\"While serving on the House Banking Committee, Toomey, in 1999, helped write House Resolution 10, which led to the repeal of parts of the Depression-era Glass-Steagall Act. The repeal of the Act, which had regulated the separation of banks and investment firms, allowed for companies that combined banking and investment operations.[citation needed]Toomey was also a supporter of the deregulation of the derivatives market, an area in which he had professional experience, stating that he believed the market to be adequately regulated by banking supervisors and state-level regulators. He pressed the House to pass the Commodity Futures Modernization Act of 2000 because it would \"eliminate most of the cloud of legal and regulatory uncertainty that has shadowed\" derivatives since their invention. He stated that he hoped that the Senate would modify the bill to \"allow greater flexibility in the electronic trading\" of over-the-counter derivatives.Toomey was a leading sponsor of the JOBS Act, which passed the Senate in March 2012.  The Act would reduce costs for businesses that go public by phasing in SEC regulations for \"emerging growth companies\" over a five-year period. It would also help startup companies raise capital by reducing some SEC regulations.Toomey orchestrated legislation to repeal consumer protection measures enacted by the Consumer Financial Protection Bureau which had been intended auto lenders from discriminating on the basis of race.Gun policy In 2013, in response to the Sandy Hook Elementary School shooting, Toomey and Democratic Senator Joe Manchin introduced legislation that would require a background check for most gun sales. The legislation did not pass when it was originally introduced, or when it was re-introduced in 2015. In 2016, Toomey voted against a bill that would prohibit gun purchases for individuals on the no-fly list.According to Politico, \"Toomey's advocacy for expanded background checks has hurt his standing among gun-rights groups but bolstered his bipartisan bona fides in the swing state of Pennsylvania.\"Toomey opposed President Obama's executive orders on gun control as contrary to the constitutional system of checks and balances, but believes background checks should be passed by the Congress. He received nearly $93,000 from guns rights groups, including the National Rifle Association but earned a poor rating (a \"C\") from the NRA after championing, in 2013, legislation that would have expanded background checks. He launched that effort after the Sandy Hook mass shooting in Newtown, Connecticut.LGBT issues In 2004, Toomey stated that he believes society should only give special benefits to couples which meet the \"traditional\" definition of marriage as \"one man, one woman.\" He voted in 2004 to amend the U.S. Constitution to ban same-sex marriage.In 2010, Toomey supported the repeal of Don't ask, don't tell, a policy which banned openly gay or bisexual persons from serving in the military, in a statement made while he was Senator-elect.In November 2013, Toomey proposed an amendment exempting private religious entities from following the Employment Non-Discrimination Act. The amendment failed. After the bill received the sixty votes required for cloture, Toomey cast his vote in support.Following the cloture vote, Toomey stated that he has long believed that more legal protections are appropriate to prevent employment discrimination based on sexual orientation, but plans to modify the bill to offer more \"leeway\" to religious groups.In 2015, Toomey voiced his opposition and disagreement with the Supreme Court ruling allowing same sex marriage.Healthcare Toomey opposed the passage of the Medicare Prescription Drug Act which he argued was fiscally irresponsible. His 2012 budget proposal called for turning Medicaid into a block grant to states and cutting federal funding for the program by half by 2021.He opposes the Affordable Care Act, better known as Obamacare, and has supported multiple efforts to dismantle, repeal or defund the law.Toomey intervened to have Sarah Murnaghan, a 10-year-old girl dying of cystic fibrosis at the Children's Hospital of Philadelphia, moved ahead of other recipients in obtaining a lung transplant, on the grounds that the existing policy reduced access for children. As a 10-year-old, Murnaghan was only eligible for transplants from other children, and not from adults, leading to a longer waiting time than adult patients. Some doctors said this decision privileged Murnaghan and another child over other recipients, and privileged them above a national policy of allocating organs according to well-established rules. Murnaghan's case resulted in a permanent organ transplant policy change for pediatric patients.During the 2017 repeal and replace of the Affordable Care Act, Toomey described the independent insurance market as being in a \"death spiral\" as a result of the ACA. In 2017 Toomey participated in a panel of 13 senators to develop a bill to repeal and replace the Affordable Care Act.Taxes and government spending Toomey has been a consistent advocate of reducing and eliminating taxes. While in Congress he voted to reduce the capital gains tax, to eliminate the estate tax, to cut small business taxes, to eliminate the \"marriage penalty\", to first cut federal income taxes and other taxes by $958B over 10 years (the Economic Growth and Tax Relief Reconciliation Act of 2001) and later to make these cuts permanent, to reduce capital gains and income taxes by nearly $100 billion (the Economic Security and Recovery Act of 2002), and to expand and extend multiple tax credits to individuals and businesses.Toomey publicly opposed the 2009 federal stimulus package. He opposes government-run or subsidized healthcare, and farm subsidies.In 2011, he sponsored a federal balanced budget amendment. He supported extending unemployment benefits and offsetting the cost with reduced government spending in other areas.In his first term as a congressman, Toomey won $12 million overall in earmark funding to his district. In successive terms in Congress, he swore off earmarks and signed the \"No Pork\" pledge as a Senate candidate.In December 2011, Toomey partnered with Sen. Claire McCaskill (D-MO) to introduce the Earmark Elimination Act of 2011. The bill, which did not pass, was reintroduced by the pair in 2014.In September 2018, Toomey was among six Republican senators, Jeff Flake, Mike Lee, Rand Paul, David Perdue, and Ben Sasse, as well as Bernie Sanders, that voted against a $854 billion spending bill, meant to avoid another government shutdown. Said bill included funding for the departments of Defense, Health and Human Services, Labor and Education.Social issues Toomey identifies himself as pro-life. He has stated that he would support penalties for doctors who perform illegal abortions.When he first ran for Congress in 1998, Toomey said that he personally opposes abortion and believes it should only be legal in the first trimester. Toomey voted for reauthorization of the Violence Against Women Act in 2013.In March 2015, Toomey voted for an amendment to establish a deficit-neutral reserve fund to allow employees to earn paid sick time.Impeaching Pennsylvania Supreme Court justices In February 2018, Toomey said that it was worth discussing whether to impeach justices on the Pennsylvania Supreme Court who had ruled that a gerrymandered congressional map violated the Pennsylvania constitution.", "Personal life": "In November 1997, Toomey married Kris Ann Duncan. The couple have three children, Bridget, Patrick, and Duncan, who was born while Toomey was campaigning for the senate in 2010.", "Electoral history": "Pennsylvania's 15th congressional district: Results 1998–2002YearDemocraticVotesPctRepublicanVotesPct1998Roy C. Afflerbach66,93045%Patrick J. Toomey81,75555%2000Edward O'Brien103,86447%Patrick J. Toomey118,30753%2002Edward O'Brien73,21243%Patrick J. Toomey98,49357%United States Senate Republican primary election in Pennsylvania, 2004PartyCandidateVotes%±RepublicanArlen Specter530,83950.82RepublicanPat Toomey513,69349.18United States Senate Republican primary election in Pennsylvania, 2010PartyCandidateVotes%±RepublicanPat Toomey667,61481.5RepublicanPeg Luksik151,90118.5United States Senate election in Pennsylvania, 2010PartyCandidateVotes%±RepublicanPat Toomey2,028,94551.01%-1.61%DemocraticJoe Sestak1,948,71648.99%+7.00%Majority80,2292.02%Total votes3,977,661100.0Republican gain from DemocraticSwingUnited States Senate election in Pennsylvania, 2016PartyCandidateVotes%±RepublicanPat Toomey (inc.) 2,951,702 48.77% -2.24% DemocraticKatie McGinty2,865,01247.34%-1.65%LibertarianEdward T. Clifford III235,1423.89%N/ATotal votes6,051,941100.00%Republican holdSwingNA", "introduction": "Patrick Joseph Toomey (born November 17, 1961) is an American businessman, former Wall Street banker and politician serving as the junior United States Senator for Pennsylvania, elected in 2010. A Republican, Toomey served as the U.S. Representative for Pennsylvania's 15th congressional district for three terms, from 1999 to 2005, but did not seek a fourth term to honor a pledge he had made while running for office in 1998.\nToomey attended La Salle Academy in Providence, Rhode Island before earning a B.A. in government from Harvard College. He was employed as a currency trader, first by Chemical Bank and subsequently by Morgan, Grenfell & Co. beginning in 1984 and 1986, respectively, until resigning from the latter in 1991. He narrowly lost the Republican primary for United States Senate in 2004. From 2005 to 2009, he served as president of the Club for Growth.\nAfter becoming the Republican nominee for the 2010 U.S. Senate election in Pennsylvania, Toomey was elected to the seat on November 2, 2010, defeating his  Democratic opponent, former U.S. Navy Three-star admiral and Congressman Joe Sestak. He is currently the only Republican holding statewide office in Pennsylvania.\nIn the U.S. Senate, Toomey serves on the Committee on Banking, Housing, and Urban Affairs, the Committee on the Budget, the Committee on Finance, and the Congressional Joint Economic Committee, among others including several subcommittees. In 2011, he also served on the Joint Select Committee on Deficit Reduction. In April 2012, Toomey was named to succeed South Carolina Senator Jim DeMint as chairman of the United States Senate Steering Committee, a Senate Republican caucus. He was re-elected on November 8, 2016, to his second term as the junior United States Senator from Pennsylvania, defeating Katie McGinty by 1.43% in the general election, while winning 48.77% of the state's votes.\n\n"}, "personal": {"date": "BornPatrick Joseph Toomey (1961-11-17) November 17, 1961 (age 56)Providence, Rhode Island, U.S.", "Political party": "Republican", "Spouse(s)": "Kris Toomey", "Children": "3", "Residence": "Zionsville, Pennsylvania, U.S.", "Education": "Harvard University (AB)", "Signature": ""}, "timeline": {"United States Senatorfrom Pennsylvania": {"date": "Assumed office January 3, 2011Serving with Bob Casey Jr.", "Preceded by": "Arlen Specter"}, "Member of the US House of Representativesfrom Pennsylvania's 15th district": {"date": "In officeJanuary 3, 1999– January 3, 2005", "Preceded by": "Paul McHale", "Succeeded by": "Charlie Dent"}}, "code": "T000461", "type": "3", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.64", "social": "-0.3", "leadership": "0.53"}