{'name': 'Pat.Roberts', 'picture': 'R000307.jpg', 'detail': {'Early life, education, and early political career': "Roberts was born in Topeka, Kansas, the son of Ruth B. (née Patrick) and C. Wesley Roberts.[self-published source?] His father served for four months as Chairman of the Republican National Committee under Dwight D. Eisenhower. Roberts's great-grandfather, J.W. Roberts, was the founder of the Oskaloosa Independent, which is the second-oldest newspaper in Kansas.Roberts graduated in 1954 from Holton High School in Holton, Kansas. He went on to earn a B.A. in Journalism from Kansas State University in 1958, where he became a member of the Pi Kappa Alpha fraternity. From 1958 to 1962, he served as an officer in the U.S. Marine Corps, achieving the rank of Captain. Roberts was a reporter and editor for several Arizona newspapers between 1962 and 1967, when he joined the staff of Republican Kansas Senator Frank Carlson. In 1969, he became administrative assistant to Kansas's 1st District Congressman Keith Sebelius.", 'US House of Representatives (1981–1997)': 'Elections After Keith Sebelius announced his retirement, Roberts easily won the Republican primary, which was tantamount to election in the heavily Republican 1st District.  He was re-elected seven times without serious difficulty, never receiving less than 60 percent of the vote; in 1988, he ran unopposed.Committee assignments Roberts served as the chairman of the House Agriculture Committee from 1995 to 1997.', 'US Senate (1997–present)': 'Elections 1996 After Republican Senator Nancy Kassebaum declined to seek a fourth term, Roberts ran to succeed her. He easily won the Republican primary, defeating three minor candidates with 78% of the vote. In the general election, he faced Democratic State Treasurer Sally Thompson. Term limits were an issue during the campaign; while Roberts said that he was not totally opposed to term limits, he was wary of limits that did not apply to current members of Congress, saying that the proposed limits should apply to everyone. While Thompson signed the national term limits pledge from the group Americans for Limited Terms, Roberts declined to do so, becoming the only major party candidate for the U.S. Senate in the 1996 elections to not sign the pledge. However, he did say that "I plan only to serve two terms in the U.S. Senate."In the general election, Roberts defeated Thompson by 652,677 votes (62.02%) to 362,380 (34.44%), almost certainly helped by the presence of former Kansas Senator Bob Dole atop the ticket as the Republican presidential nominee.2002 Roberts was opposed in the Republican primary by Tom Oyler, who had run against him in 1996. Roberts defeated him 84% to 16%. No Democratic candidate opposed him in the general election; he faced only Libertarian nominee Steven Rosile and Reform nominee George H. Cook, defeating them by 641,075 votes (82.52%) to 70,725 (9.10%) and 65,050 (8.37%), respectively.2008 Roberts was unopposed in the Republican primary and defeated the Democratic nominee, former Congressman Jim Slattery, in the general election by 727,121 votes (60.06%) to 441,399 (36.46%).2014 In the 2014 election, Roberts faced a hard-fought primary challenge from physician Milton R. Wolf. Wolf received several endorsements from national organizations associated with the Tea Party movement. Roberts defeated Wolf in the Republican primary by 125,406 votes (48.12%) to 106,202 (40.75%). In the general election, for the second time in his tenure, Roberts did not face a Democratic opponent; Democratic nominee Chad Taylor withdrew from the race. Roberts won the general election, obtaining 53.15% of the vote; Independent Greg Orman received 42.53%, while Libertarian nominee Randall Batson received 4.32%.Tenure Despite being the longest-serving member of the Kansas delegation, Roberts spent the first 14 years of his Senate career as Kansas\' junior senator, since Sam Brownback had taken office on election day 1996 to finish out Dole\'s term.  However, after Brownback gave up his seat to make a successful run for Governor, Roberts became Kansas\' senior senator.Roberts was a senior member of the Senate Armed Services Committee, chairing the Subcommittee on Emerging Threats and Capabilities. This subcommittee oversaw the military\'s work in the area of homeland security and the efforts to prevent proliferation of nuclear, chemical, and biological weapons.Committee assignments Committee on Agriculture, Nutrition, and Forestry (Chairman)Subcommittee on Energy, Science and TechnologySubcommittee on Domestic and Foreign Marketing, Inspection, and Plant and Animal HealthSubcommittee on Production, Income Protection and Price SupportCommittee on FinanceSubcommittee on Taxation, IRS Oversight, and Long-term GrowthSubcommittee on Social Security, Pensions, and Family PolicySubcommittee on International Trade, Customs, and Global CompetitivenessCommittee on Health, Education, Labor, and PensionsSubcommittee on Children and FamiliesSelect Committee on EthicsCommittee on Rules & AdministrationAgriculture Committee attendance During his tenure in the Senate, Roberts missed 130 (65%) of his Agriculture Committee meetings. The Agriculture Committee is responsible for farm, nutrition and forestry issues.Controversy While participating in negotiations over the Republican-sponsored American Healthcare Act, Roberts was asked by Alice Ollstein if he supported a proposed revision to mandated coverage in the bill. He responded: "I wouldn\'t want to lose my mammograms." This comment was widely condemned. Roberts subsequently apologized.', 'Political positions': 'Social issues Roberts is pro-life and opposes same-sex marriage.Healthcare Roberts opposed President Barack Obama\'s health reform legislation; he voted against the Patient Protection and Affordable Care Act in December 2009, and he voted against the Health Care and Education Reconciliation Act of 2010.In September 2017, Roberts supported the Graham-Cassidy healthcare bill. When interviewed about why he supported it, Roberts repeatedly refused to say why he thought the bill was good, and avoided speaking about the bill\'s policy contents. Instead, he said he supported the bill because it was the last best chance to repeal Obamacare.Environment Roberts worked to secure $15 million for research on carbon sequestration. On the topic of global warming, Roberts has said, "There\'s no question there\'s some global warming, but I\'m not sure what it means. A lot of this is condescending elitism."Roberts voted to confirm Gale Norton as Secretary of the Interior, to exclude oil and gas smokestacks from mercury regulations, and to reclassify the United States Environmental Protection Agency (EPA) as a Cabinet department.In 2012, Roberts introduced an amendment that would open up the Arctic National Wildlife Refuge to drilling for oil and approve the Keystone XL Pipeline.In 2017, Roberts was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement. According to the Center for Responsive Politics, Roberts has received over $415,000 from oil, gas and coal interests since 2012.Education In January 2014, Roberts introduced the Opportunities Created At the Local Level Act. The bill would allow states to freely choose without federal interference their own education standards, testing and curricula.Domestic security Roberts supports the Patriot Act, and the President\'s authority for warrantless surveillance.  Roberts was the only senator blocking the nomination of Army Secretary Eric Fanning.  Roberts\' refusal to lift his hold on the nomination until President Obama promised to never move anyone from the Guantanamo Bay detention camp to Fort Leavenworth drew criticism on the Senate floor from Armed Services Committee Chairman John McCain, who noted that the United States Secretary of the Army has no control over the detainees.Intelligence program The 2004 Intelligence Authorization Act saw the creation of the Pat Roberts Intelligence Scholars Program. The program links undergraduate and graduate students with US security and intelligence agencies" by providing funding to selected US students entering university, in return for a commitment to join the agency for at least 18 months on graduation. PRISP is a decentralized program which funds students through various intelligence agencies.Investigation into pre-war intelligence on Iraq As chairman of the U.S. Senate Select Committee on Intelligence, Roberts was responsible for the committee\'s investigation into the intelligence failures prior to the 2003 invasion of Iraq. The first half of the Senate Report of Pre-war Intelligence on Iraq was released on July 9, 2004. The second half, according to language voted on by the full Committee, consists of five parts including: whether public statements and reports and testimony regarding Iraq by U.S. Government officials made between the Gulf War period and the commencement of Operation Iraqi Freedom were substantiated by intelligence information; the postwar findings about Iraq\'s weapons of mass destruction and weapons programs and links to terrorism and how they compare with prewar assessments; prewar intelligence assessments about postwar Iraq; any intelligence activities relating to Iraq conducted by the Policy Counterterrorism Evaluation Group (PCTEG) and the Office of Special Plans within the Office of the Under Secretary of Defense for Policy; and the use by the Intelligence Community of information provided by the Iraqi National Congress (INC).Biotech labeling to block Vermont\'s genetic engineering labeling law Sen. Pat Roberts introduced a biotech labeling bill on February 19.  The bill aims to establish a standardized voluntary labeling plan that would block Vermont from enacting its mandatory genetic engineering labeling law on July 1.Gun law Roberts has an "A" rating from the National Rifle Association (NRA) for his consistent, ongoing support of pro-gun legislation. The NRA endorsed Roberts in the 2014 election and NRA-Political Victory Fund chairman stated that "Pat is the only ally and battle-tested candidate in this race who has consistently  protected our Second Amendment freedoms." Since 1998, the NRA has provided Roberts $23,800 in donations.One month after the Orlando nightclub shooting Roberts voted for two Republican-backed proposals on gun policy: Chuck Grassley\'s amendment to increase funding for background checks and John Cornyn\'s policy that would have put a 72-hour hold on any terrorist suspect buying a gun. He voted against both of the Democrat\'s policies, including the Feinstein Amendment, which banned suspected terrorists from buying guns. Roberts voted against the Manchin-Toomey amendment to expand background checks for gun purchases.In the immediate aftermath of the 2017 Las Vegas shooting, Roberts said it was "too early" to discuss gun policy change.In February 2018, after the Stoneman Douglas High School shooting in which 17 were killed, Roberts came out in favor of age limits on the AR-15, the assault rifle that the assailant used in the high school shooting. Roberts said, "Certainly nobody under 21 should have an AR-15. I don\'t know why anybody would want an AR-15 unless they\'re going to take one out on the shooting range".', 'Personal life': 'Roberts married Franki Fann in 1969. The couple has three adult children: David, Ashleigh, and Anne-Wesley.Roberts lives in Alexandria, Virginia. The New York Times has reported that the house that Roberts claims as his residence in Dodge City, Kansas is actually owned and occupied by campaign contributors C. Duane and Phyllis Ross.', 'Electoral history': 'United States Senate election in Kansas, 2014Pat Roberts (R) (inc.) 53.3%Greg Orman (Ind.) 42.4%Randall Batson (Lib.) 4.3%United States Senate Republican Primary election in Kansas, 2014Pat Roberts (R) (inc.) 48%Milton Wolf (R) 40.7%D.J. Smith (R) 5.7%Alvin Zahnter (R) 5.3%United States Senate election in Kansas, 2008Pat Roberts (R) (inc.) 60%Jim Slattery (D) 36%United States Senate election in Kansas, 2002Pat Roberts (R) (inc.) 82.5%Steven Rosile (Lib.) 9.1%George Cook (Reform) 8.4%United States Senate Republican Primary election in Kansas, 2002Pat Roberts (R) (inc.) 83.7%Tom Oyler (R) 16.3%United States Senate election in Kansas, 1996Pat Roberts (R) 62%Sally Thompson (D) 34.4%Mark S. Marney (Reform) 2.3%Steven Rosile (Lib.) 1.2%United States Senate Republican Primary election in Kansas, 1996Pat Roberts (R) 78.2%Tom Little (R) 8%Thomas Oyler (R) 7.4%Richard Cooley (R) 6.4%1994 Kansas 1st District United States Congressional ElectionPat Roberts (R) (inc.) 77%Terry L. Nichols (D) 23%1992 Kansas 1st District United States Congressional ElectionPat Roberts (R) (inc.) 68%Duane West (D) 29%Steven Rosile (L) 2%1990 Kansas 1st District United States Congressional ElectionPat Roberts (R) (inc.) 62%Duane West (D) 37%1988 Kansas 1st District United States Congressional ElectionPat Roberts (R) (inc.) 100%1986 Kansas 1st District United States Congressional ElectionPat Roberts (R) (inc.) 76.5%Dale Lyon (D) 23.5%1980 Kansas 1st District United States Congressional ElectionPat Roberts (R) 62%Phil Martin (D) 38%', 'introduction': 'Charles Patrick Roberts (born April 20, 1936) is an American politician of the Republican Party serving as the senior United States Senator from Kansas, a position he has held since 1997. Roberts previously served as the Chairman of the Senate Select Committee on Intelligence.\nBorn in Topeka, Kansas, Roberts is a graduate of Kansas State University. He served as a captain in the U.S. Marine Corps and worked as a newspaper reporter before entering politics in the late 1960s. He was elected to the U.S. House of Representatives in 1980 to succeed 1st District Congressman Keith Sebelius, for whom he had worked. He served eight terms in the House, including one as chairman of the House Agriculture Committee.\nRoberts was elected to the U.S. Senate in 1996, and is currently serving his fourth term. On the Intelligence Committee, he was responsible for an investigation into the intelligence failures prior to the 2003 invasion of Iraq. He is currently the dean of the Kansas congressional delegation.\n\n'}, 'personal': {'Born': 'Charles Patrick Roberts (1936-04-20) April 20, 1936 (age82)Topeka, Kansas, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Franki Fann', 'Children': '3', 'Education': 'Kansas State University (BA)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Kansas': {'date': 'Assumed office January 3, 1997Serving with Jerry Moran', 'Preceded by': 'Nancy Kassebaum'}, 'Chairman of the Senate Agriculture, Nutrition and Forestry Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Debbie Stabenow'}, 'Chairman of the Senate Intelligence Committee': {'date': 'In officeJanuary 3, 2003– January 3, 2007', 'Preceded by': 'Bob Graham', 'Succeeded by': 'Jay Rockefeller'}, 'Chairman of the Senate Ethics Committee': {'date': 'In officeNovember 19, 1999– January 3, 2001', 'Preceded by': 'Bob Smith', 'Succeeded by': 'Harry Reid'}, 'Chairman of the House Agriculture Committee': {'date': 'In officeJanuary 3, 1995– January 3, 1997', 'Preceded by': 'Kika de la Garza', 'Succeeded by': 'Robert Smith'}, "Member of the US House of Representativesfrom Kansas's 1st district": {'date': 'In officeJanuary 3, 1981– January 3, 1997', 'Preceded by': 'Keith Sebelius', 'Succeeded by': 'Jerry Moran'}, 'Military service': {'Allegiance': 'United States', 'Service/branch': 'United States Marine Corps', 'Years of service': '1958–1962', 'Rank': ' Captain'}}, 'code': 'R000307'}