{'name': 'Patty.Murray', 'picture': 'M001111.jpg', 'detail': {'Early life': 'One of seven children, Murray was born in Bothell, Washington, a daughter of David L. Johns and Beverly A. McLaughlin. Her mother was an accountant. Her father served in World War II, and was awarded a Purple Heart. Her ancestry includes Welsh, Irish, Scottish, and French-Canadian. When she was a teenager, her family was forced to apply for welfare assistance when her father became disabled by the onset of multiple sclerosis. He had previously been the manager of a five-and-ten store. She attended Saint Brendan Catholic School as a young child.Murray received her Bachelor of Arts degree in physical education from Washington State University in 1972. She was a pre-school teacher for several years, and taught a parenting class at Shoreline Community College from 1984–1987.', 'Early career': 'As a citizen-lobbyist for environmental and educational issues, she says she was once told by a state representative that she could not make a difference because she was just a "mom in tennis shoes". The phrase stuck, and she later used it in her successful campaigns for Shoreline School District Board of Directors (1985–1989), Washington State Senate (1989–1993), and United States Senate (1993–present). Murray was successful in gathering grass-roots support to strike down proposed pre-school program budget cuts.Her 1988 State Senate campaign was successful, and she unseated two-term incumbent Republican Bill Kiskaddon.', 'United States Senator': 'Committee assignments Committee on AppropriationsSubcommittee on DefenseSubcommittee on Energy and Water DevelopmentSubcommittee on Homeland SecuritySubcommittee on Labor, Health and Human Services, Education, and Related Agencies (Ranking Member)Subcommittee on Military Construction, Veterans Affairs, and Related AgenciesSubcommittee on Transportation, Housing and Urban Development, and Related AgenciesCommittee on Veterans\' AffairsCommittee on Health, Education, Labor, and Pensions (Ranking Member)Committee on the BudgetCaucus memberships Senate Oceans CaucusSenate Aerospace CaucusAfterschool CaucusesCongressional NextGen 9-1-1 CaucusLegislation On February 28, 2013, Murray introduced the Green Mountain Lookout Heritage Protection Act into the United States Senate. The bill would prevent the United States Forest Service from removing a building from the Glacier Peak Wilderness Area in the State of Washington unless the agency determines that the structure is unsafe for visitors. Murray argued that the bill should be passed in order to help the tourism industry in the area, but protecting the lookout point in question. The bill would be "a very small step in what will be a very long recovery" and that it would "provide a glimmer of hope for the long-term recovery of this area." Murray was referring to the recovery of the area from the casualties and damage caused by the 2014 Oso mudslide. The bill passed in both the House and the Senate.', 'Political positions': 'Wars in Iraq and Afghanistan In October 2002, Murray was one of 21 Democrats in the Senate to vote against the War Authoritization for invading Iraq. Quoted from her Senate speech:Mr. President, if we do take action in Iraq, there is no doubt that our armed forces will prevail. We will win a war with Iraq decisively, and, God willing, we will win it quickly. But what happens after the war? That will have as big an impact on our future peace and security. Will we be obligated to rebuild Iraq? If so, how? Our economy is reeling, our budget is in deficit, and we have no estimate of the cost of rebuilding. And with whom? As New York Times columnist Tom Friedman points out, there\'s a retail store mentality that suggests to some – if "you break it, you buy it."In December 2002, while speaking to students at Columbia River High School in Vancouver, Murray made a number of remarks about Osama bin Laden, as she attempted to explain why the US had such problems winning hearts and minds in the Muslim world, and how bin Laden had garnered support among some in the Middle East. Among other things, she had stated that bin Laden has "been out in these countries for decades, building schools, building roads, building infrastructure, building daycare facilities, building health care facilities, and the people are extremely grateful. He\'s made their lives better. We have not done that." This attracted attention from political opponents, who argued that this was inaccurate and constituted support for bin Laden.Global Trade Exchange Senator Patty Murray put the controversial intelligence ports-data project Global Trade Exchange into the Homeland security budget.', 'Notes': 'Fiscal year 2014 federal budget On December 10, 2013, Murray announced that she and Republican Representative Paul Ryan had reached a compromise agreement on a two-year, bi-partisan budget bill, called the Bipartisan Budget Act of 2013.The deal was scheduled to be voted on first in the House and then the Senate. Some people believed House Democrats would pass the deal as a way to reduce the sequester cuts. However, the ranking Democrat on the House Budget Committee Chris Van Hollen (D-MD) told a morning news show on December 12, 2013, that "members of his party are outraged that House Republicans are planning to adjourn without addressing unemployment benefits." Van Hollen said that "it is too early to say" whether a majority of House Democrats would vote in favor of the budget bill. The deal was also unpopular with many conservatives.Health care In 2014, Murray introduced legislation in the Senate called The Emergency Contraception Access and Education Act. The bill would require hospitals that receive federal funding to provide rape victims with emergency contraception. In July 2014, she introduced an amendment to a bill in the Senate to require health insurance plans to offer contraceptive coverage to patients regardless of employers\' beliefs, religious or otherwise. Her amendment required 60 votes to move forward, and all but three Republicans voted against the measure.Other In May 2006, Murray, along with 38 of 44 Senate Democrats, voted in favor of the Comprehensive Immigration Reform Act of 2006 (S. 2611). The bill includes provisions to improve border security, increases fines and other punishments for employers of illegal immigrants, creation of a guest worker program (which includes an almost doubling of the number of H-1B visas), and creates a path to citizenship for illegal immigrants already in the country. The bill, with support from some in the GOP leadership, passed 62-36.Murray repeatedly cosponsored legislation to create the Wild Sky Wilderness area in the Washington Cascade Range. She eventually succeeded, with the bill being signed by President Bush on May 8, 2008. Murray has also supported legislation to increase the size of the Alpine Lakes Wilderness, also in the Washington Cascades.On August 2, 2006, the New York Times wrote that, "In 1994, Senator Strom Thurmond of South Carolina was said to have engaged in excessive touching of his then-freshman colleague Patty Murray of Washington.The Seattle Post-Intelligencer that Murray asked for, and received, an apology. Through a spokeswoman, Ms. Murray declined to comment."2008 presidential election On January 30, 2008, Murray endorsed Hillary Clinton in the 2008 Democratic presidential primaries. One month later, the Washington Democratic caucus awarded two-thirds of its delegates to Barack Obama and one-third to Clinton. After Clinton\'s June 7 concession, Murray switched her endorsement to Obama.', 'Political campaigns': '1992 In 1992, Murray announced her intention to run for the U.S. Senate following the publication of a series of articles by The Seattle Times alleging that incumbent Democratic Senator Brock Adams had sexually assaulted a number of women. Adams denied the allegations, but his popularity statewide was weakened considerably by the scandal and he chose to retire rather than risk losing the seat for his party. Murray defeated Representative Don Bonker to win the Democratic nomination. In the general election she faced Republican Representative Rod Chandler, whom she defeated 54% to 46% despite being outspent by a wide margin. Chandler seemed to have the upper hand in one of the debates until for some unknown reason he quoted the Roger Miller song "Dang Me." He was further damaged by the unpopularity of President George H. W. Bush in the Pacific Northwest.Results United States Senate Democratic primary election in Washington, 1992PartyCandidateVotes%DemocraticPatty Murray318,45557.91DemocraticDon Bonker208,32137.88DemocraticGene David Hart15,8942.89DemocraticJeffrey Brian Venezia7,2591.32United States Senate election in Washington, 1992PartyCandidateVotes%DemocraticPatty Murray1,197,97353.99RepublicanRod Chandler1,020,82946.011998 In 1998, Murray faced Representative Linda Smith, a staunch conservative and maverick who was one of nine House Republicans to vote against confirming House Speaker Newt Gingrich in early 1997, opposed gay rights and viewed homosexuality as a "morally unfit inclination." Murray won re-election by 58% to 42%.Results Democratic primary election resultsPartyCandidateVotes%DemocraticPatty Murray (incumbent)479,00994.78DemocraticAmundson Amundseon10,9052.16DemocraticJames Sherwood Stokes5,9891.19DemocraticHarvey Vernier3,8820.77DemocraticRobert Tilden Medley3,3500.66DemocraticCharlie Jackson2,2340.44General election resultsPartyCandidateVotes%DemocraticPatty Murray (incumbent)1,103,18458.41RepublicanLinda Smith785,37741.592004 In 2004, Murray faced another Republican Representative, George Nethercutt. Term limits became an issue in the campaign, as Democrats seized on Nethercutt\'s broken term-limits pledge that he had made when he unseated Speaker Tom Foley in 1994. Nethercutt was also hampered by his lack of name recognition in the more densely populated western part of the state, home to two-thirds of the state\'s population. Washington has not elected a Senator from east of the Cascades since Miles Poindexter in 1916. Other important issues included national security and the war in Iraq. Nethercutt supported the invasion of Iraq, while Murray opposed it. Nethercutt was a heavy underdog from the start and his campaign never gained much traction. In the general election, Murray was re-elected by 55% to 43%.Results Democratic primary election resultsPartyCandidateVotes%DemocraticPatty Murray (incumbent)709,47792.20DemocraticWarren Hanson46,4876.04DemocraticMohammad Said13,5261.76General election resultsPartyCandidateVotes%DemocraticPatty Murray (incumbent)1,549,70854.98RepublicanGeorge R. Nethercutt, Jr.1,204,58442.74LibertarianJ. Mills34,0551.21GreenMark B. Wilson30,3041.082010 The 2010 election was the first Senate election to be held under the new blanket primary since Initiative 872 had passed in 2004. In the August 17 primary, Murray appeared on the ballot alongside four other Democratic candidates, six Republican candidates, a Reform Party candidate and three Independent candidates. Murray received a plurality, 46%, and advanced to the general election along with her main Republican challenger, former State Senator and two-time gubernatorial nominee Dino Rossi, who received 33%. Leading up to the election, Murray was endorsed by several prominent Washington State newspapers. Rossi conceded the election to Murray on November 4, 2010, two days after election day. The final tally showed Murray with 52.36% to Rossi\'s 47.64%, enabling Murray to go on to serve a fourth term in the United States Senate.Results General election resultsPartyCandidateVotes%DemocraticPatty Murray (incumbent)1,314,93052.36RepublicanDino Rossi1,196,16447.64Blanket primary election resultsPartyCandidateVotes%DemocraticY Patty Murray (incumbent)670,28446.22RepublicanY Dino Rossi483,30533.33RepublicanClint Didier185,03412.76RepublicanPaul Akers37,2312.57IndependentSkip Mercer12,1220.84DemocraticCharles Allen11,5250.79DemocraticBob Burr11,3440.78RepublicanNorma Gruber9,1620.63RepublicanMichael Latimer6,5450.45DemocraticMike the Mover6,0190.42DemocraticGoodspaceguy4,7180.33ReformWilliam Baker4,5930.32IndependentMohammad Said3,3870.23IndependentSchalk Leonard2,8180.19RepublicanWilliam Chovil2,0390.14Total votes1,450,1261002016 Murray ran for a fifth term in 2016. She faced three Democratic challengers in the August 2, 2016, primary election. In the general election, she faced Chris Vance. She defeated Vance 59% to 41%, and won a fifth term.General election resultsPartyCandidateVotes%DemocraticPatty Murray (incumbent)1,913,97959.01RepublicanChris Vance1,329,33840.99', 'Electoral history': 'Washington State Senate District 1 election, 1988PartyCandidateVotes%±%DemocraticPatty Murray22,94853%RepublicanBill Kiskaddon (inc.)20,48047%Washington Senator (Class III) results: 1992–2016YearDemocraticVotesPctRepublicanVotesPct3rd PartyPartyVotesPct3rd PartyPartyVotesPct1992Patty Murray1,197,97354%Rod Chandler1,020,82946%1998Patty Murray1,103,18458%Linda Smith785,37742%2004Patty Murray1,549,70855%George R. Nethercutt, Jr.1,204,58443%J. MillsLibertarian34,0551%Mark B. WilsonGreen30,3041%2010Patty Murray1,314,93052%Dino Rossi1,196,16448%2016Patty Murray1,913,97959%Chris Vance1,329,33841%', 'Personal life': "Murray is married to Rob Murray and has two grown children, Sara and Randy. Murray's hometown is Bothell, Washington, but she now lives on Whidbey Island, Washington.", 'introduction': "Patricia Lynn Murray (née Johns; October 11, 1950) is an American politician serving as the senior United States Senator from Washington, a seat she was first elected to in 1992. A member of the Democratic Party, Murray is Washington State's first female U.S. Senator.\nShe served as the Senate Majority Conference Secretary from 2007 until 2017, which made her the fourth-highest-ranking Democrat and the highest-ranking woman in the Senate. In 2017, Murray became the Senate Assistant Minority Leader, making her the third-highest-ranking Democrat and still the highest-ranking woman in the Senate. Murray chaired the Democratic Senatorial Campaign Committee from 2001 to 2003, and again from 2011 to 2013. Murray chaired the Senate Budget Committee from 2013 to 2015. She also previously served as co-chair of the United States Congress Joint Select Committee on Deficit Reduction. Since January 2015, Murray has been the Ranking Democratic Member on the Senate Committee on Health, Education, Labor, and Pensions. She is currently the 7th most senior member of the United States Senate, the 3rd most senior Democrat, and the dean of Washington's congressional delegation.\nOn December 10, 2013, Murray and Republican Representative Paul Ryan announced that they had negotiated a two-year, bi-partisan budget, known as the Bipartisan Budget Act of 2013.\n\n"}, 'personal': {'Born': 'Patricia Lynn Johns (1950-10-11) October 11, 1950 (age68)Bothell, Washington, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Rob Murray', 'Children': '2', 'Education': 'Washington State University (BA)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Washington': {'date': 'Assumed office January 3, 1993Serving with Maria Cantwell', 'Preceded by': 'Brock Adams'}, 'Senate Assistant Democratic Leader': {'date': 'Assumed office January 3, 2017', 'Leader': 'Chuck Schumer', 'Preceded by': 'Position established'}, 'Ranking Member of the Senate Health Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Lamar Alexander'}, 'Secretary of the Senate Democratic Conference': {'date': 'In officeJanuary 3, 2007– January 3, 2017', 'Leader': 'Harry Reid', 'Preceded by': 'Debbie Stabenow', 'Succeeded by': 'Tammy Baldwin'}, 'Chair of the Senate Budget Committee': {'date': 'In officeJanuary 3, 2013– January 3, 2015', 'Preceded by': 'Kent Conrad', 'Succeeded by': 'Mike Enzi'}, "Chair of the Senate Veterans' Affairs Committee": {'date': 'In officeJanuary 3, 2011– January 3, 2013', 'Preceded by': 'Daniel Akaka', 'Succeeded by': 'Bernie Sanders'}, 'Chair of the Democratic Senatorial Campaign Committee': {'date': 'In officeJanuary 3, 2001– January 3, 2003', 'Leader': 'Tom Daschle', 'Preceded by': 'Robert Torricelli', 'Succeeded by': 'Jon Corzine'}, 'Member of the Washington Senatefrom the 1st district': {'date': 'In officeJanuary 9, 1989– January 11, 1993', 'Preceded by': 'Bill Kiskaddon', 'Succeeded by': 'Rosemary McAuliffe'}}, 'code': 'M001111'}