{'name': 'Peter.Roskam', 'picture': '', 'detail': {'Early life, education and career': 'Roskam was born in Hinsdale, Illinois. He was the fourth of five children and was raised in Glen Ellyn, Illinois, graduating from Glenbard West High School. He earned his B.A. in political science from the University of Illinois at Urbana-Champaign and his J.D. from the Chicago-Kent College of Law. As a member of his law school team, he was named  "Best Oral Advocate" by the American College of Trial Lawyers at its 1988 National Trial Competition.In 1984, Roskam taught history and government at All Saints High School in St. Thomas, U.S. Virgin Islands. From 1985–86, Roskam served as a legislative assistant to Rep. Tom DeLay (R-TX), and from 1986–87 as a legislative assistant to Congressman Henry Hyde. In the late 1980s, he served as the Executive Director of Educational Assistance Ltd., a scholarship program for disadvantaged children founded by his father in 1982.In 1992, Roskam was elected to the Illinois House of Representatives, serving from 1993–99. In 2000, he was appointed by DuPage County Republican leaders to replace the retiring Beverly Fawell in the Illinois State Senate where he served until his election to the U.S. House of Representatives. Roskam resides in Wheaton, Illinois with his wife, Elizabeth, and their four children.Roskam was a partner in the law firm Salvi, Roskam & Maher, a personal injury firm. The firm, now called Salvi & Maher, is politically notable because former Republican Senate candidate Al Salvi and former Republican House candidate Kathy Salvi are also partners in the firm. The Chicago Tribune noted that Roskam earned over $615,000 in 2005 as a personal injury trial lawyer.After his parents took a trip to Vietnam and saw American veterans\' dog tags for sale on the street, the family worked to return the dog tags to their owners or the families of the deceased.', 'Illinois General Assembly': 'Roskam served in the Illinois General Assembly as a Representative from 1993 to 1998, and Senator from 2000 to 2006. In the Senate, Roskam served as the Republican Whip, the Republican spokesman on the Executive Committee, and a member of the Rules Committee, Environment and Energy Committee, Insurance and Pensions Committee, and Judiciary Committee. In the Senate, Roskam sponsored legislation giving the Supreme Court of Illinois authority to reverse a death penalty sentence, has sponsored legislation increasing the penalties for repeat D.U.I. offenders, and was the lead sponsor of a law to maintain courts\' power to hold deadbeat parents in contempt to ensure child support. Roskam has authored or co-authored fourteen bills to cut taxes.Gun lawRoskam sponsored an Illinois state Senate bill which would have allowed retired military and police personnel to carry concealed weapons.HealthcareOn May 20, 2005, Roskam and six other Illinois senators missed a vote in the Illinois Senate on a non-binding resolution urging the United States Congress to protect Social Security and reject private accounts. The resolution passed 32–19–1, but no action was taken in the Illinois House. Roskam has said in a WBBM post-debate press conference, "I am against privatizing Social Security, I am against raising taxes for Social Security benefits, and I\'m against benefit reductions for Social Security.Minimum wageIn November 2006, Roskam expressed opposition to raising the national minimum wage from $5.15 per hour, referring to possible effect on small businesses.Tax reformIn November 2004, he voted against State Comptroller Dan Hynes\'s $1 billion proposal to raise taxes on cosmetic surgery to fund stem cell research. The proposal was narrowly defeated 29-28-1 in the Illinois State Senate.', 'US House of Representatives': "Tenure Roskam became the Chief Deputy Whip in the 112th Congress, ranking fourth among house Republican leaders. He served in that position until 2014.He and Arizona Democrat Gabrielle Giffords were periodically interviewed together on NPR's All Things Considered during their first term as to their experiences as freshmen members of Congress.In 2013, the United States House Committee on Ethics investigated a $25,000 trip that Roskam and his wife had taken to Taiwan. The committee closed its review of the trip with no finding of wrongdoing. On February 22, 2017, Crain's Chicago Business reported that Roskam was one of three Illinois congressional members to receive pension benefits from the State of Illinois while collecting a paycheck as a member of the U.S. House, and began collecting $37,452 in annual pension benefits.On January 2, 2017, Roskam vocally supported a measure to eliminate the independence of the Office of Congressional Ethics, placing it under the jurisdiction of the House Ethics Committee, a measure that some described as dissolving the office. Crain's Chicago Business editorial board criticized Roskam for his efforts to place the Office of Congressional Ethics under the jurisdiction of the House Ethics Committee, as he had previously been the subject of an ethics investigation.Committee assignments Committee on Ways and MeansSubcommittee on Tax Policy (Chairman)Subcommittee on HealthHouse Select Committee on the Events Surrounding the 2012 Terrorist Attack in BenghaziCaucus memberships House Baltic CaucusCongressional NextGen 9-1-1 CaucusVeterinary Medicine Caucus", 'Political positions': 'As of July 6, 2018, Roskam has voted with his party in 92.6% of votes in the 115th Congress – ranking him #112 of 429 in voting against his party – and voted in line with President Trump\'s position in 94% of the votes. When it comes to co-sponsoring legislation Roskam was ranked number 153rd in bipartisanship in the House for the 114th Congress and 25th in the first year of the 115th Congress, according to the Bipartisan Index published by The Lugar Center and Georgetown\'s McCourt School of Public Policy. FiveThirtyEight ranks Roskam as the tenth-most partisan Trump supporter in the House when compared to his district\'s voting patterns.Environment In 2006, Roskam called climate science "junk science".The League of Conservation Voters gave Roskam an environmental rating of 3% for 2017 and a lifetime rating of 7%.As an Illinois state legislator he received a 67% rating in 2005 from the Illinois Environmental Council. In 2004 he had scored 100%, while in 2003 he had scored 40%.In 2018, he joined the House Climate Solutions Caucus, explaining: “It is incumbent upon each and every one of us to understand the impacts and challenges that come from a changing climate. The Climate Solutions Caucus is a bipartisan venue to enact common sense solutions.” Later that year Roskam voted to oppose a tax on carbon emissions. In doing so, he opposed the Republican co-chair of the Climate Solutions Caucus, who announced plans for a bill substituting a carbon tax for existing gasoline and fuel taxes.Gun policy He received a National Rifle Association (NRA) endorsement for being a supporter of gun rights. On July 15, 2006, Roskam was the featured guest at an NRA support rally for him in Addison, Illinois.[dead link]Health care In his first year in Congress, Roskam secured "more than $50 million federal dollars…to expand health care facilities and programs and improve traffic congestion." This included $195,000 to fund the expansion of the new emergency room at Adventist GlenOaks Hospital in Glendale Heights and $243,000 to expand mental health programs at the Access Community Health Network\'s Martin T. Russo Family Health Center in Bloomingdale.On September 25, 2007, Roskam voted with the majority of his party against expanding the State Children\'s Health Insurance Program. The bill passed Congress but was vetoed by President Bush.On January 12, 2007, Roskam voted with the majority of his party against the Medicare Prescription Drug Price Negotiation Act, which would require the Secretary of Health and Human Services to negotiate lower covered Part D drug prices on behalf of Medicare beneficiaries.Roskam is in favor of repealing the Patient Protection and Affordable Care Act (also known as Obamacare). On May 4, 2017, he voted to repeal and replace it with the American Health Care Act.Roskam is against the ObamaCare\'s health insurance tax. In July 2018, the House passed a measure meant to delay the tax "for two years and expand Health savings accounts". Referring to the measure, he stated it "is a flawed tax that gets passed onto American families".Social Security According to a direct mailing by the National Republican Congressional Committee (NRCC), Roskam will protect Social Security by opposing any plans that reduce benefits. Roskam told The Hill that he opposes any measures that would add private savings accounts or slice up the current program to create a private account. However, Roskam responded to a National Taxpayers Union questionnaire stating he would "work and vote for Social Security Choice that will allow younger workers to have the choice of investing much of their Social Security taxes in regulated individual retirement accounts."Economic issues Roskam supports the Dominican Republic-Central America Free Trade Agreement (CAFTA).On February 17, 2012, National Review ran an essay in which Roskam and Kevin McCarthy criticized President Obama\'s stimulus package, the American Recovery and Reinvestment Act, which Obama said would "save or create 3.5 million jobs." Three years later, however, the American economy was "down more than 1.1 million jobs and the national unemployment rate still hasn’t dropped below 8 percent."Roskam advocates making permanent the 2001 and 2003 tax cuts, and has sponsored or cosponsored fourteen pieces of legislation for lower taxes, including child tax credits and reducing the income tax, and has stated support for a research and development tax credit. As an Illinois General Assembly legislator, Roskam authored and supported several pieces of tax reduction legislation. Americans for Tax Reform named Roskam "Hero of the Taxpayer" in 2005 for his opposition to HB-755 which would have raised income and sales taxes by 67% or nearly $7 billion.In 2010, he signed a pledge sponsored by Americans for Prosperity promising to vote against any global warming legislation that would raise taxes.Roskam voted in favor of the Tax Cuts and Jobs Act of 2017. In 2017, Roskam said that the "middle class is crumbling under the current tax code," after voting in favor of the Tax Cuts and Jobs Act.Technology Roskam voted to express "congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Federal Communications Commission relating to \'Protecting the Privacy of Customers of Broadband and Other Telecommunications Services\'" – the measure passed in a 215–205 decision on March 28, 2017. Passage is an attempt to roll back the regulation initiated by the Obama administration that would have required internet service providers (e.g., Comcast, Time Warner, Verizon, and AT&T) to obtain individual consumers\' approval to sell personal data (e.g., internet usage and web history) to marketers and other such data-buyers.Energy In March 2007, Roskam announced a $3 million Department of Energy grant to the Des Plaines-based Gas Technology Institute (GTI).In June 2007, Roskam supported a bill (H. R. 2619) to authorize $2.5 million per year for 2009-2011 to establish and operate an ethanol anti-idling power unit research program. Roskam noted that GTI would be eligible for the grant as would any other 501(c)(3) organization that "has performed energy-related research". No further action was taken on the bill in 2007 after it was referred to Subcommittee on Technology and Innovation in mid June.Later, Roskam voted against legislation boosting automobile fuel economy requirements to an industry average of 35 miles per gallon by 2020. The bill also encouraged the use of renewable fuels.On June 24, 2008, Roskam voted against H.R. 6346: The Federal Price Gouging Prevention Act. The bill failed when it was voted on following a suspension of normal rules to stop debate and it required a 2/3 vote to pass. Opponents of the bill posit that price gouging is not widespread and that it is difficult to prove that it occurred. Roskam stated he voted against the bill as a protection of the free market.Roskam, with Rep. John Shimkus, proposed the Energy VISION Act, which would seek to end America\'s reliance on foreign energy within 15 years. According to the Baltimore Sun, "The plan mixes conservation and alternative fuel production with aggressive domestic energy exploration, including drilling offshore and in the Arctic National Wildlife Refuge and opening vast swaths of land to oil shale development."Infrastructure Roskam helped to pass the Safe American Roads Act of 2007, which prohibits the U.S. Department of Transportation from granting Mexican trucks access beyond the U.S./Mexico commercial zone until the department complies with the safety and security regulations Congress has already enacted.On July 1, 2008, Roskam announced plans to introduce legislation preventing the acquisition of the EJ&E Railway by the CN Railway by designating "a 36-mile stretch of the EJ&E as a Corridor for Inter-Suburban Commuter Rail" for use in Metra\'s STAR line. He introduced H.R. 6476 on July 10, 2008 with co-sponsors Judy Biggert and Donald A. Manzullo. Roskam has stated that this would be the nation\'s first suburb-to-suburb commuter rail line.Immigration In interviews on National Public Radio, Roskam stated his opposition to the Senate\'s Comprehensive Immigration Reform Act of 2007 and stated support for the House immigration reform bill, H.R. 4437 the Border Protection, Anti-terrorism, and Illegal Immigration Control Act of 2005. During the interviews he said that his constituency did not support amnesty and wanted stronger border security.When U.S. President Donald Trump signed an executive order to suspend the U.S. Refugee Admissions Program (USRAP) and suspend the entry of foreign nationals from seven Muslim-majority countries, Roskam said the "implementation was bumpy" but that he supported "the underlying theme."Social issues Roskam opposes abortion except in cases where the life of the mother is at risk, making no exceptions for cases of rape or incest.Roskam has a "D" rating from NORML for his voting history regarding cannabis-related causes. Roskam opposes to veterans having access to medical marijuana if recommended by their Veterans Health Administration doctor and if it is legal for medicinal purposes in their state of residence.Roskam opposes same-sex marriage.Roskam supports adult and umbilical cord stem cell research. He has argued against embryonic stem cell research in the Illinois Senate, even if privately funded, and voted against the Stem Cell Research Enhancement Act in Congress.Foreign policy Israel In March 2016, the Israeli newspaper Arutz Sheva described Roskam\'s long-term efforts to combat the BDS movement, which he described as "an insidious effort to marginalize Israel" and "part of a longer-term strategy for people not to protest against Israel, but people that actually want Israel destroyed." Roskam noted a law that "makes BDS an issue in America\'s trade policy, not just Israel\'s" by ensuring that American "trade negotiators are doing everything they can to push back against European BDS in particular." Roskam complained, however, that the Obama White House had "given mixed signals" on Israel.In April 2018, Roskam and Grace Meng (D-NY) wrote a letter requesting $500 million for U.S.-Israeli defense cooperation, including $70 million for the Iron Dome missile defense system. Roskam said that "US-Israel missile defense cooperation is a critical investment in the safety and security of Israel and stability in the Middle East."Hezbollah In a March 2016 letter to the EU Ambassador in Washington, David O’Sullivan, Roskam and Grace Meng (D-NY) asked that the EU label Hezbollah\'s political wing a terrorist organization. “While the 2013 EU designation of Hezbollah’s military wing was a step in the right direction,” they wrote, “distinguishing between Hezbollah’s military and political arms is a distinction without a difference.”Iran In July 2010, Roskam and Mike Quigley introduced a House resolution condemning Iranian textbooks that “applaud martyrdom and contain anti-Israel, anti-Semitic, and anti-Western passages aimed at radicalizing students.”Roskam was an adamant opponent of the 2015 internal nuclear agreement with Iran, saying that he viewed it as important to fight the agreement in every possible way.He and then-fellow U.S. Representative Mike Pompeo successfully pressured House Republican leadership to hold a vote on whether to approve the Iran agreement, rather than an originally planned vote on a "resolution of disapproval" against the agreement, in a bid to "force Democrats to assert their support for the contentious accord, a vote Republicans hope will be more politically costly than the originally planned vote on a resolution disapproving of the nuclear deal."In 2016, Roskam opposed the Treasury Department\'s grant of a license to Airbus and Boeing to deliver planes contracted for by Iran Air. Roskam said that Congress would attempt to stymie the aviation agreements by making delivery of the aircraft difficult and expensive.Qatar Roskam wants the U.S. government to hold accountable Qatar for its support of Hamas. He has appealed to the Obama Administration for support. He joined the U.S. Treasury Department in his criticism.On July 31, 2014, Roskam joined Secretary of State John Kerry and Treasury Secretary Jack Lew to urge the Obama Administration to end the United States partnership with Qatar. Roskam, Kerry and Lew cited Qatar\'s support of Hamas as one of the primary reasons.Roskam cited an article published by The New York Times, which accused Qatar\'s emir of pledging $400 million in financial aid to Hamas in October 2012.In December 2014, Roskam and Sherman requested new sanctions on Qatar in a letter to Secretary of Treasury Jack Lew. They also asked for a detailed accounting of public and private financing from within Qatar for Hamas, Al-Qaeda, the Islamic State, and the al-Nusra Front.Cuba Roskam opposes the normalization of U.S.-Cuba relations, accusing the Obama administration of "appeasement" and saying that the restoration of American-Cuban relations "rewards and legitimizes the Castros\' decades of repressive, dictatorial rule." He criticized the 2014 agreement that led to the release of U.S. government contractor Alan Gross from Cuban captivity in exchange for the release of three Cubans imprisoned in the U.S. for espionage, calling it a "dangerous mistake."Guantanamo Bay Roskam adamantly opposed President Obama\'s planned relocation of Guantanamo Bay detention camp inmates to Thomson Correctional Center in Thompson, Illinois, calling it "a misguided decision that will ultimately be regretted."Kosovo In February 2017, Roskam led a bipartisan House delegation that visited Kosovo to reiterate American support for that country.Iraq War On September 21, 2006, Roskam said that the U.S. should "stay the course" and that U.S. troops should not return home until Iraq is safe.', 'Political campaigns': '1998 Roskam ran for Congress in 1998 in Illinois\' 13th congressional district to replace retiring Congressman Harris W. Fawell, but lost in the Republican primary to state Representative Judy Biggert, who went on to win the general election. Roskam received 40% of the vote to Biggert\'s 45%.In 1999, at Biggert\'s request, the Federal Election Commission (FEC) investigated a mailing sent out by a political action committee (PAC), the Campaign for Working Families (CWF), in support of Roskam. The FEC did not find the Roskam campaign at fault, but CWF was found to have violated election law. The PAC was led by conservative activist Gary Bauer.2006 In March 2006, Roskam, running unopposed, won the Republican nomination to attempt to fill the seat in the 6th; his former boss, Hyde, was retiring after 32 years in Congress. His opponent in the November general election was an Iraq War veteran, Democrat Tammy Duckworth. Hyde endorsed Roskam. The competitive race was called "the nation\'s most-watched congressional contest" by Eric Krol of the Daily Herald.Roskam was endorsed by the Teamsters labor union, The International Union of Operating Engineers Local 150, and the Veterans of Foreign Wars. On November 7, 2006, Roskam defeated Duckworth by a margin of 51% to 49%.2008 In March 2008, Roskam was again nominated to run for the 6th District seat in the Republican Primary. He was opposed by Democrat Jill Morgenthaler.In late October, The Chicago Sun-Times reported that Roskam launched a new website at ObamaVotersForRoskam.com. The website displayed a fragment of a quotation from Democratic Presidential front-runner Barack Obama which seemed to indicate that Obama admires Roskam. The portion of the Obama quotation omitted by Roskam goes: "Having said that, have I said that he\'s wrong? I love him, but he\'s wrong." The Daily Herald called the website a "... move to grab a hold of Obama\'s coattails ..." Hardball with Chris Matthews featured a segment on Roskam\'s website. The Morgenthaler campaign pointed out that Obama supports Morgenthaler, not Roskam. However, the district reverted to form, and Roskam won re-election by a 16% margin (58% to 42%).2010 Peter Roskam defeated Democratic nominee Ben Lowe by a 27% margin in the 2010 midterm election.2012 Roskam defeated Democratic nominee Leslie Coolidge, a former partner at KPMG, by an 18.4% margin in the 2012 election.2014 Roskam defeated Democratic nominee Michael Mason, a retired postal manager, by a 34% margin in the 2014 general election.2016 In the Republican primary, Roskam defeated Glen Ellyn Park District commissioner Jay Kinzler, who ran to the political right of Roskam, with 68.8% of the vote.2018 In February 2018, it was reported that seven Democratic candidates were vying to challenge Roskam for his seat. They included scientist and engineer Sean Casten; Becky Anderson Wilkins, co-owner of Anderson’s Bookshops and a member of the Naperville City Council; College of Lake County Trustee Amanda Howland; regulatory attorney Jennifer Zordani; Palatine resident Ryan Huffman; Barrington Hills plan commissioner Kelly Mazeski; and Carole Cheney of Naperville. The primary was won by Casten.', 'Electoral history': '1992 General Election for Illinois House of Representatives – 40th districtPeter Roskam (R), 61%Pat Cullerton (D), 39%1994 General Election for Illinois House of Representatives – 40th districtPeter Roskam (R), unopposed1996 General Election for Illinois House of Representatives – 40th districtPeter Roskam (R), 71%Kevin Schuele (D), 29%2006 General Election for U.S. House of Representatives – 6th DistrictPeter Roskam (R), 51%Tammy Duckworth (D), 49%2008 General Election for U.S. House of Representatives – 6th DistrictPeter Roskam (R), 59%Jill Morgenthaler (D), 41%2010 General Election for U.S. House of Representatives – 6th DistrictPeter Roskam (R), 64%Ben Lowe (D), 36%2012 General Election for U.S. House of Representatives – 6th DistrictPeter Roskam (R), 59%Leslie Coolidge (D), 41%2014 General Election for U.S. House of Representatives – 6th DistrictPeter Roskam (R), 67%Michael Mason (D), 33%2016 General Election for U.S. House of Representatives – 6th DistrictPeter Roskam (R), 59%Amanda Howland (D), 41%', 'Further reading': 'Statement of the Chairman and Ranking Member of the Committee on Ethics Regarding Representative Peter Roskam, United States House Committee on Ethics, September 11, 2013; accessed June 25, 2017.', 'introduction': "Peter James Roskam /ˈrɒskəm/ (born September 13, 1961) is the U.S. Representative for Illinois's 6th congressional district, serving since 2007. He is a member of the Republican Party and served as the Chief Deputy Majority Whip from 2011–14, ranking fourth among House Republican leaders. Previously, he served in the Illinois Senate and the Illinois House of Representatives. He currently serves as Chairman of the House Ways and Means Subcommittee on Tax Policy.\n\n", 'code': '06'}, 'personal': {'Born': 'Peter James Roskam (1961-09-13) September 13, 1961 (age57)Hinsdale, Illinois, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Elizabeth Roskam', 'Children': '4', 'Education': 'University of Illinois at Urbana–Champaign (BA)Illinois Institute of Technology (JD)', 'Website': 'roskam.house.gov'}, 'timeline': {"Member of the US House of Representativesfrom Illinois's 6th district": {'date': 'Assumed office January 3, 2007', 'Preceded by': 'Henry Hyde'}, 'House Republican Chief Deputy Whip': {'date': 'In officeJanuary 3, 2011– August 1, 2014', 'Preceded by': 'Kevin McCarthy', 'Succeeded by': 'Patrick McHenry'}, 'Member of the Illinois Senatefrom the 48th district': {'date': 'In officeJanuary 15, 2000– January 3, 2007', 'Preceded by': 'Beverly Fawell', 'Succeeded by': 'Randy Hultgren'}, 'Member of the Illinois House of Representativesfrom the 40th district': {'date': 'In officeJanuary 13, 1993– January 12, 1998', 'Preceded by': 'Daniel Cronin', 'Succeeded by': 'Randy Hultgren'}, 'code': '06'}, 'code': ''}