{'name': 'Rand.Paul', 'picture': 'P000603.jpg', 'detail': {'Early life': 'Randal Howard Paul was born on January 7, 1963, in Pittsburgh, Pennsylvania, to Carol (née Wells) and Ron Paul, who is also a politician and physician. The elder Paul was a U.S. Representative from Texas and ran for President of the United States three times. The middle child of five, his siblings are Ronald "Ronnie" Paul Jr., Lori Paul Pyeatt, Robert Paul, and Joy Paul-LeBlanc.Paul was baptized in the Episcopal Church and identified as a practicing Christian as a teenager.Despite his father\'s libertarian views and strong support for individual rights, the novelist Ayn Rand was not the inspiration for his first name. Growing up, he went by "Randy", but his wife shortened it to "Rand."The Paul family moved to Lake Jackson, Texas, in 1968, where he was raised and where his father began a medical practice and for an extent of time was the only obstetrician in Brazoria County.When Rand was 13, his father was elected to the United States House of Representatives. That same year, Paul attended the 1976 Republican National Convention, where his father headed Ronald Reagan\'s Texas delegation. The younger Paul often spent summer vacations interning in his father\'s congressional office. In his teenage years, Paul studied the Austrian economists that his father respected, as well as the writings of Objectivist philosopher Ayn Rand. Paul went to Brazoswood High School and was on the swimming team and played defensive back on the football team.Paul attended Baylor University from fall 1981\xa0to summer 1984 and was enrolled in the honors program. During the time he spent at Baylor, he was involved in the swim team and the Young Conservatives of Texas and was a member of a secret organization known as The NoZe Brotherhood. He regularly contributed to The Baylor Lariat student newspaper. Paul dropped out of Baylor without completing his baccalaureate degree, when he was accepted into his father\'s alma mater, the Duke University School of Medicine, which, at the time, did not require an undergraduate degree for admission to its graduate school. He earned an M.D. degree in 1988 and completed his residency in 1993.', 'Medical career': 'After completing his residency in ophthalmology, Paul moved to Bowling Green, Kentucky. He has held a state-issued medical license since moving there in 1993. He received his first job from John Downing of Downing McPeak Vision Centers, which brought him to Bowling Green after completing his residency. Paul worked for Downing for about five years before parting ways. Afterwards, he went to work at the Graves Gilbert Clinic, a private medical group in Bowling Green, for 10\xa0years before creating his own practice in a converted one-story house across the street from Downing\'s office. After his election to the U.S. Senate, he merged his practice with Downing\'s medical practice. Paul has faced two malpractice lawsuits between 1993 and 2010; he was cleared in one case while the other was settled for $50,000. His medical work has been praised by Downing and he has medical privileges at two Bowling Green hospitals.Paul specializes in cataract and glaucoma surgeries, LASIK procedures, and corneal transplants. As a member of the Bowling Green Noon Lions Club, Paul founded the Southern Kentucky Lions Eye Clinic in 2009 to help provide eye surgery and exams for those who cannot afford to pay. Paul won the Melvin Jones Fellow Award for Dedicated Humanitarian Services from the Lions Club International Foundation for his work establishing the Southern Kentucky Lions Eye Clinic.National Board of OphthalmologyIn 1995, Paul passed the American Board of Ophthalmology (ABO) boards on his first attempt and earned board-certification under the ABO for 10 years.[citation needed] Prior to this, in 1992, the ABO had changed its certification program, which had previously awarded lifetime certifications, instead requiring doctors to recertify every 10 years. Those who had already been given lifetime certification were allowed to keep it (according to the ABO, they would not legally have been able to rescind these certifications). Shortly after this change, Paul began a campaign to protest it. This effort culminated in 1997 with him creating, "along with 200 other young ophthalmologists", the National Board of Ophthalmology (NBO) to offer an alternative certification system, at a cost substantially lower than that of the ABO. Its certification exam, an open book take-home test, was described by one taker as "probably harder" and "more clinically relevant" than the ABO\'s exam.Named board members were Paul, his wife, and his father-in-law.The NBO was, itself, never accepted as an accrediting entity by organizations such as the American Board of Medical Specialties, and its certification was considered invalid by many hospitals and insurance companies. Paul let his own ABO certification lapse in 2005, which did not affect his practice in Kentucky; the state does not require board certification. By Paul\'s estimate, about 50 or 60 doctors were certified by the NBO. The NBO was incorporated in 1999, but Paul allowed it to be dissolved in 2000 when he did not file the required paperwork with the Kentucky Secretary of State\'s office. He later recreated the board in 2005, but it was again dissolved in 2011.', 'Political activism': 'Paul was head of the local chapter of the Young Conservatives of Texas during his time at Baylor University. In 1984, Paul took a semester off to aid his father\'s primary challenge to Republican Senator Phil Gramm.While attending Duke University School of Medicine, Paul volunteered for his father\'s 1988 Libertarian presidential campaign.In response to President Bush\'s breaking his election promise to not raise taxes, Paul founded the North Carolina Taxpayers Union in 1991. In 1994, Paul founded the anti-tax organization Kentucky Taxpayers United (KTU), and was chair of the organization from its inception. He has often cited his involvement with KTU as the foundation of his involvement with state politics. The group examined Kentucky legislators\' records on taxation and spending and encouraging politicians to publicly pledge to vote uniformly against tax increases.Paul managed his father\'s successful 1996 Congressional campaign, in which the elder Paul returned to the House after a twelve-year absence. The elder Paul defeated incumbent Democrat-turned-Republican Greg Laughlin in the Republican primary, despite Laughlin\'s support from the NRCC and Republican leaders such as Newt Gingrich and George W. Bush.The Wall Street Journal reported in 2010 that, although Paul had told a Kentucky television audience as recently as September 2009 that KTU published ratings each year on state legislators\' tax positions and that "we\'ve done that for about 15 years", the group had stopped issuing its ratings and report cards after 2002 and had been legally dissolved by the state in 2000 after failing to file registration documents.Paul spoke on his father\'s behalf when his father was campaigning for office, including throughout the elder Paul\'s run in the 2008 presidential election, during which Rand campaigned door-to-door in New Hampshire and spoke in Boston at a fundraising rally for his father on the 234th anniversary of the Boston Tea Party.In February 2014, Paul joined the Tea Party-affiliated conservative advocacy group FreedomWorks in filing a class-action lawsuit charging that the federal government\'s bulk collection of Americans\' phone records metadata is a violation of the Fourth Amendment of the U.S. Constitution. Commenting on the lawsuit at a press conference, Paul said, "I\'m not against the NSA, I\'m not against spying, I\'m not against looking at phone records... I just want you to go to a judge, have an individual\'s name and [get] a warrant. That\'s what the Fourth Amendment says." He also said there was no evidence the surveillance of phone metadata had stopped terrorism. Critics, including Harvard University law professor Alan Dershowitz and Steven Aftergood, the director of the American Scientists\' Project on Government Secrecy, called the lawsuit a political "stunt". Paul\'s political campaign organization said that the names of members of the public who went to Paul\'s websites and signed on as potential class-action participants would be available in the organization\'s database for future campaign use.On the announcement of the filing of the lawsuit, Mattie Fein, the spokeswoman for and former wife of attorney Bruce Fein, complained that Fein\'s intellectual contribution to the lawsuit had been stolen and that he had not been properly paid for his work. Paul\'s representatives denied the charge, and Fein issued a statement saying that Mattie Fein had not been authorized to speak for him on the matter and that he had in fact been paid for his work on the lawsuit.Paul is co-author of a book entitled The Tea Party Goes to Washington (2011) and also the author of Government Bullies: How Everyday Americans Are Being Harassed, Abused, and Imprisoned by the Feds (2012). Paul was included in Time magazine\'s world\'s 100 most influential people, for 2013 and 2014. He is also a contributor to Time magazine.', 'Election to US Senate': 'Primary campaignAt the beginning of 2009, there was movement by political supporters of his father to draft Paul in a bid to replace beleaguered Republican Kentucky senator Jim Bunning. Paul\'s potential candidacy was discussed in the Los Angeles Times and locally in the Kentucky press. Paul\'s father said, "Should Senator Bunning decide not to run, I think Rand would make a great U.S. Senator." On April 15, 2009, Paul gave his first political speech as a potential candidate at a Tea Party rally held in his town of Bowling Green, Kentucky, where more than 700 people had gathered in support of the Tea Party movement.On May 1, 2009, Paul said that if Bunning, whose fundraising in 2009 matched his poor numbers in opinion polling for the 2010 election, declined to seek a third term, he would almost certainly run in the Republican Party primary to succeed him, and formed an exploratory committee soon after, while still promising to stay out of the race if Bunning ultimately decided to run for reelection. Paul made this announcement on MSNBC\'s The Rachel Maddow Show, though a Kentucky news site first broke the news.On July 28, 2009, Bunning announced that he would not run for reelection in the face of insufficient fundraising. The announcement left only Paul and Secretary of State Trey Grayson as the remaining candidates for the Republican nomination, with Paul announcing on August 5, 2009, that he would officially run for the U.S. Senate as a Republican. The announcement was made through a series of national TV events, radio, and other programs, as well as newspapers in Kentucky.On August 20, 2009, Paul\'s supporters planned a moneybomb to kick off his campaign. The official campaign took in $433,509 in 24 hours. His website reported that this set a new record in Kentucky\'s political fundraising history in a 24-hour period. A second "moneybomb" was held on September 23, 2009, to counter a D.C. fundraiser being held for primary opponent Trey Grayson, by 23 Republican United States Senators. The theme was a UFC "fight" between "We the People" and the "D.C. Insiders". Later in the campaign, Paul claimed his pledge to not take money from lobbyists and Senators who had voted for the bailout was only a "primary pledge"; he subsequently held a fundraiser in Washington, D.C., with the same Senators who had been the target of the September 23, 2009, "moneybomb". Paul ended up raising some $3 million during the primary period. Paul\'s fundraising was aided by his father\'s network of supporters.Although Grayson was considered the frontrunner in July 2009, Paul found success characterizing Grayson as a "career politician" and challenging Grayson\'s conservatism. Paul ran an ad in February that made an issue out of Grayson\'s September 2008 admission that he voted for Bill Clinton when he was 20 years old. James Dobson, a Christian evangelical figure, endorsed Grayson on April 26 based on the advice of what Dobson described as "senior members of the GOP", but on May 3 the Paul campaign announced that Dobson had changed his endorsement to Paul after Paul and some Paul supporters had lobbied Dobson insisting on Paul\'s social conservative bona fides.On May 18, Paul won the Republican Senatorial primary by a 23% margin, meaning he would face the Kentucky Attorney General Jack Conway, in the November 2 general election.General campaignIn the 2010 general election, Paul faced Kentucky Attorney General Jack Conway. The campaign attracted $8.5 million in contributions from outside groups, of which $6 million was spent to help Paul and $2.5 million to help Conway. This money influx was in addition to the money spent by the candidates themselves: $6 million by Paul and $4.7 million by Conway.On June 28, 2010, Paul supporters held their first post-primary online fundraising drive, this time promoted as a "money blast".Paul\'s campaign got off to a rough start after his comments on the Civil Rights Act of 1964 stirred controversy. Paul stated that he favored 9 out of 10 titles of the Civil Rights Act of 1964, but that had he been a senator during the 1960s, he would have raised some questions on the constitutionality of Title II of the Act. Paul said that he abhors racism, and that he would have marched with Martin Luther King Jr. to repeal Jim Crow laws. He later released a statement declaring that he would have voted for the Act and stated "unequivocally\xa0... that I will not support any efforts to repeal the Civil Rights Act of 1964". Later he generated more controversy by characterizing statements made by Obama Administration officials regarding the Deepwater Horizon oil spill cleanup as sounding "un-American".Paul defeated Conway in the general election with 56% of the vote to 44% for Conway.', 'US Senate': '112th Congress (2011–2013)Paul was sworn in on January 5, 2011, along with his father, who was simultaneously in the House of Representatives.Paul was assigned to be on the Energy and Natural Resources, Health, Education, Labor and Pensions, Homeland Security and Government Affairs, and Small Business committees. Paul also formed the Senate Tea Party Caucus with Jim DeMint and Mike Lee as its inaugural members. His first legislative proposal was to cut $500\xa0billion from federal spending in one year. This proposal included cutting the Department of Education by 83\xa0percent and the United States Department of Homeland Security by 43\xa0percent, as well as folding the Department of Energy into the Department of Defense and eliminating the Department of Housing and Urban Development. Seven independent agencies would be eliminated and food stamps would be cut by 30\xa0percent. Under Paul\'s proposal, defense spending would be reduced by 6.5\xa0percent and international aid would be eliminated. He later proposed a five-year budget plan intended to balance the budget.In February, Paul was one of two Republicans to vote against extending three key provisions of the USA PATRIOT Act (roving wiretaps, searches of business records, and conducting surveillance of "lone wolves"\xa0— individuals not linked to terrorist groups).On March 2, Paul was one of nine senators to vote against a stopgap bill that cut $4\xa0billion from the budget and temporarily prevent a government shutdown, saying that it did not cut enough from the budget. One week later, he voted against the Democratic and Republican budget proposals to keep funding the federal government, saying that both bills did not cut enough spending. Both bills failed to pass the Senate. He later voted against stopgap measures on March 17 and April 8, both of which passed the senate.On April 14, he was one of 19 senators to vote against a budget that cut $38.5\xa0billion from the budget and fund the government for the remainder of the fiscal year.Paul voiced opposition to U.S. intervention in the Libyan Civil War  and has criticized President Obama for not gaining congressional consent for Operation Odyssey Dawn. During the debt ceiling crisis, the Senator stated that he would only support raising the debt ceiling if a balanced budget amendment was enacted. Paul was a supporter of the Cut, Cap and Balance Act, which was tabled by Democratic opposition. On August 3, Paul voted against a bill that would raise the debt ceiling.On September 7, Paul called for a vote of no confidence in United States Secretary of the Treasury Timothy Geithner. Later that month, Paul blocked legislation that would strengthen safety rules for oil and gas pipelines, because, he stated, the bill was not strong enough. In October, Paul blocked a bill that would provide $36\xa0million in benefits for elderly and disabled refugees, saying that he was concerned that it could be used to aid domestic terrorists. This was in response to two alleged terrorists who came to the United States through a refugee program and were receiving welfare benefits when they were arrested in 2011 in Paul\'s hometown of Bowling Green. Paul lifted his hold on the bill after Democratic leaders promised to hold a Congressional hearing into how individuals are selected for refugee status and request an investigation on how the two suspects were admitted in the country through a refugee program.In June 2012, Paul endorsed Mitt Romney after it became apparent that he would be the Republican nominee for the 2012 presidential election. However, he was later vocal about his disagreements with Romney on a number of policies.113th Congress (2013–2015)For the 113th Congress, Paul was added to the Foreign Relations committee and retained his spot on the Health, Education, Labor and Pensions, Homeland Security and Government Affairs, and Small Business committees.On March 6–7, 2013, Paul engaged in a filibuster to delay voting on the nomination of John O. Brennan as the Director of the Central Intelligence Agency. Paul questioned the Obama administration\'s use of drones and the stated legal justification for their potential use within the United States. Paul held the floor for 12 hours and 52 minutes. He ceded to several Republican senators and Democratic senator, Ron Wyden, who generally also questioned drone usage. Paul said his purpose was to challenge drone policy in general and specifically as it related to noncombatants on U.S. soil. He requested a pledge from the Administration that noncombatants would not be targeted on U.S. soil. Attorney General Eric Holder responded that the President is not authorized to deploy extrajudicial punishment without due process, against non-combatant citizens. Paul answered that he was "quite happy" with the response. The filibuster was ended with a cloture vote of 81 to 16, and Brennan was confirmed by the Senate with a vote of 63 to 34.In March 2013, Paul, with Senators Ted Cruz and Mike Lee, threatened another filibuster, this one opposing any legislative proposals to expand federal gun control measures. The filibuster was attempted on April 11, 2013, but was dismissed by cloture, in a 68–31 vote. Also in March 2013, Paul endorsed fellow Kentucky Republican Senator Mitch McConnell\'s 2014 re-election campaign. McConnell had previously hired Paul\'s 2010 campaign manager, Jesse Benton, as his own campaign manager. Paul\'s endorsement was seen as a major win for McConnell in avoiding a challenge in the Republican primary.In response to Detroit\'s declaration of bankruptcy, Paul stated he would not allow the government to attempt to bail out Detroit. In a phone interview with Breitbart News on July 19, 2013, Paul said, "I basically say he is bailing them out over my dead body, because we don\'t have any money in Washington." Paul said he thought a federal bailout would send the wrong message to other cities with financial problems.In September, Paul stated that the United States should avoid military intervention in the ongoing Syrian Civil War. In an op-ed, Paul disputed the Obama administration\'s claims that the threat of military force caused Syria\'s government to consider turning over its chemical weapons, instead arguing that the opposition to military action in Syria, and the delay that it caused, led to diplomatic progress.In October 2013, Paul was the subject of some controversy when it was discovered that he had plagiarized from Wikipedia part of a speech in support of Virginia gubernatorial candidate Ken Cuccinelli. Referencing the movie Gattaca, Paul quoted almost verbatim from the Wikipedia article about the film without citing the source. Evidence soon surfaced that Paul had copied sentences in a number of his other speeches nearly verbatim from other authors without giving credit to the original sources, including in the speech he had given as the Tea Party rebuttal to the president\'s 2013 State of the Union address. In addition, a three-page-long passage of Paul\'s book Government Bullies was taken directly from an article by the conservative think tank The Heritage Foundation. When it became apparent that Paul\'s op-ed in The Washington Times on mandatory minimums and related testimony he had given before the Senate Judiciary Committee both contained material that was virtually identical to an article that had been published by another author in The Week a few days earlier, the Washington Times said that the newspaper would no longer publish the weekly column Paul had been contributing to the paper. After a week of almost daily news reports of new allegations of plagiarism, Paul said that he was being held to an "unfair standard", but would restructure his office in order to prevent mistakes in the future, if that would be what it would take "to make people leave me the hell alone."In response to political turmoil in Ukraine in early 2014, Paul initially said that the United States should remain mindful of the fact that although the Cold War is over, Russia remains a military power with long-range nuclear missiles. He said that the United States should try to maintain a "respectful relationship with Russia" and avoid taking actions that the Russians might view as a provocation, such as seeking to have Ukraine join NATO or otherwise interfering in Russia\'s relationship with Ukraine.Two weeks later, after the Russian parliament authorized the use of military force in Ukraine and Russian President Vladimir Putin ordered military exercises along Russia\'s border with Ukraine, Paul began taking a different tone. He wrote: "Vladimir Putin\'s invasion of Ukraine is a gross violation of that nation\'s sovereignty and an affront to the international community\xa0... Putin must be punished for violating the Budapest Memorandum, and Russia must learn that the U.S. will isolate it if it insists on acting like a rogue nation." He said that the United States and European allies could retaliate against Russia\'s military aggression without any need for military action. He urged that the United States impose economic sanctions on Russia and resume an effort to build defensive anti-missile installations in Poland and the Czech Republic. He also called for the United States to take steps as a counterweight to Russia\'s strategic influence on Europe\'s oil and gas supply, such as lifting restrictions on new exploration and drilling for fossil fuels in the United States along with immediate approval of the controversial Keystone Pipeline, which he said would allow the United States to ship more oil and gas to Europe if Russia attempts to cut off its own supply to Europe.Paul played a leading role in blocking a treaty with Switzerland that would enable the IRS to conduct tax evasion probes, arguing that the treaty would infringe upon Americans\' privacy. Paul received the 2014 Distinguished Service Award from the Center for the National Interest (formally called the Nixon Center) for his public policy work.In response to reports that the CIA infiltrated the computers of the Senate Intelligence Committee, Paul called for the firing of CIA Director John O. Brennan. In December 2014, Paul supported the actions to change United States policy towards Cuba and trade with that country taken by the Obama administration.114th Congress (2015–2017)In the beginning of 2015, Senator Paul re-introduced the Federal Reserve Transparency Act. Senator Paul also introduced the FAIR Act, or Fifth Amendment Integrity Restoration Act, which would restrict civil forfeiture proceedings.On May 20, 2015, Paul spoke for ten and a half hours in opposition to the reauthorization of Section 215 of the Patriot Act. Sections of the Patriot Act were prevented from being reauthorized on June 1.After the death of Antonin Scalia in February 2016, on February 15, Paul indicated that he would oppose any nomination by President Obama to replace the late Supreme Court Justice.During a press briefing on May 6, 2016, President Obama called on Paul to stop "blocking the implementation of tax treaties that have been pending for years", arguing that they assisted law enforcement in off shore investigations into tax evasion.On May 20, Paul advocated with the abolition of gun-free zones during a speech to the National Rifle Association, citing repeated tragedies occurring in these locations.On June 6, Paul spoke of introducing legislation to cease Selective Service, three days after the passing of Muhammad Ali, after whom he intended to name the legislation in tribute.115th Congress (2017–present)In March 2017, Paul introduced the Stop Arming Terrorists Act that would prohibit the use of United States Government funds to provide assistance to Al Qaeda, Jabhat Fateh al-Sham, and the Islamic State of Iraq and the Levant (ISIL) and to countries supporting those organizations.On March 16, Senator John McCain accused Paul of being an agent of Vladimir Putin after Paul objected to adding Montenegro to NATO. Paul responded the following day by saying McCain "makes a really, really strong case for term limits", suggesting McCain had become "a little unhinged" as a result of his seniority. On April 7, McCain said he did not pay attention to any of Paul\'s rhetoric and that the latter did not have "any real influence" in the United States Senate.In April, Paul questioned President Trump\'s missile strike to Syria by saying, "While we all condemn the atrocities in Syria, the United States was not attacked." He said that further action should not be taken without congressional authorization.In May, Paul was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement. According to the Center for Responsive Politics, Paul has received over $250,000 from oil, gas and coal interests since 2012.In July 2017, Rand Paul joined Reps. Justin Amash (R-MI), Thomas Massie (R-KY), John Duncan Jr. (R-TN) and Sen. Bernie Sanders (I-VT) in opposing a bill that would impose new economic sanctions against Russia, Iran, and North Korea. President Trump opposed the bill, pointing out that relations with Russia were already "at an all-time and dangerous low". He did, however, sign the bill though likely out of political pressure.On September 5, 2017, the Trump administration announced the intended recission of the Deferred Action for Childhood Arrivals program. In tweets responding to the act, Paul stated the executive order that created DACA was illegal and congressional bipartisanship was needed to solve or fix the program.In February 2018, Republican Senators introduced immigration framework akin to that proposed by President Trump and with his support that called for a 25 billion being provided for border security in exchange for a pathway to citizenship for 1.8 million immigrants brought into the US illegally. Paul was one of fourteen Republican Senators to vote against the proposal.In an October 2017 interview, Paul confirmed he would not vote for the Republican budget in the Senate unless billions in spending were removed from the plan: "If leadership is unwilling to compromise with somebody who is concerned about the debt, then they deserve to lose."Five ThirtyEight, which tracks Congressional votes, found that Paul has voted with Donald Trump\'s positions the least out of all republicans, only voting with him 74% of the time as of August 2018.Affordable Care Act repealOn January 25, 2017, Paul introduced a bill to replace the Affordable Care Act, which included each person\'s having a tax credit of $5,000 and not requiring everyone to have coverage, unlike Obamacare.On March 2, after marching to the House of Representatives side of Capital Hill, Paul was filmed knocking on a door while demanding to see their copy of the replacing and repealing the Affordable Care Act bill. Paul spoke with President Trump over the phone on March 6, Paul telling him that the repeal and replacement of the Affordable Care Act should be two separate bills. Two days later, Paul said Republicans were united in repealing the Affordable Care Act, but divided in their stances on its replacement. On March 12, Paul accused House Speaker Paul Ryan of being misleading in portraying supporters of the American Health Care Act of 2017 as not being negotiable, and three days later, March 15, furthered that Ryan was "selling" President Trump "a bill of goods" that he had not explained fully to the president.On March 24, after the bill was pulled by Republican leaders from a vote, Paul released a statement thanking House conservatives for rebelling "against ObamaCare Lite."Later, on April 2, Paul golfed with Trump and Budget Director Mick Mulvaney at the Trump National Golf Club in Virginia, where they discussed a variety of topics, including healthcare.On June 15, Paul told reporters that he was willing to vote for a partial repeal, but not the implementation of new Republican entitlement programs, which he identified as present in both House and Senate versions of the bill.On September 11, Paul told reporters that he did not believe the Graham-Cassidy bill would pass. On September 15, Paul tweeted that Graham-Cassidy retained "90% of Obamacare" and dubbed it "more Obamacare Lite".On September 19, Paul asserted the Graham-Cassidy bill as immortalizing the Affordable Care Act and "a big government boondoggle of a trillion dollars of spending" that Republicans should abandon in favor of pursuing measures that would allow for health insurance to be purchased across state lines. On September 22, after President Trump tweeted that "Rand Paul, or whoever votes against Hcare Bill, will forever (future political campaigns) be known as \'the Republican who saved Obamacare\'", Paul responded that he would not be coerced into supporting Graham-Cassidy with bribes or bullying.Committee assignmentsCurrentCommittee on Foreign Relations (starting 2013)United States Senate Foreign Relations Subcommittee on International Operations and Organizations, Human Rights, Democracy and Global Women\'s IssuesUnited States Senate Foreign Relations Subcommittee on African AffairsUnited States Senate Foreign Relations Subcommittee on International Development and Foreign Assistance, Economic Affairs and International Environmental Protection, and Peace CorpsUnited States Senate Foreign Relations Subcommittee on Western Hemisphere and Global Narcotics AffairsCommittee on Health, Education, Labor, and Pensions (starting 2011)United States Senate Health Subcommittee on Children and FamiliesUnited States Senate Health Subcommittee on Employment and Workplace SafetyCommittee on Homeland Security and Governmental Affairs (starting 2011)United States Senate Homeland Security Subcommittee on Emergency Management, Intergovernmental Relations, and the District of Columbia (Chairman)Permanent Subcommittee on InvestigationsUnited States Senate Homeland Security Subcommittee on the Efficiency and Effectiveness of Federal Programs and the Federal WorkforceCommittee on Small Business and Entrepreneurship (starting 2011)PreviousCommittee on Energy and Natural Resources (2011–13)', '2016 presidential campaign': 'BackgroundPaul was considered a potential candidate for the Republican nomination for the Presidency of the United States since at least January 2013. He delivered the Tea Party response to President Barack Obama\'s State of the Union address on February 13, 2013, while Marco Rubio gave the official Republican response. This prompted some pundits to call that date the start of the 2016 Republican primaries. That year, he spoke at the Conservative Political Action Conference in Washington D.C., where he won the 2016 Presidential straw poll. Paul went on to win the straw poll for the next two years as well, leading to some considering Paul to be a front runner for the nomination, although CPAC attendees are typically considered younger and more libertarian-minded than average Republican voters.In a speech at the GOP Freedom Summit in April 2014, Paul insisted that the GOP has to broaden its appeal in order to grow as a party. To do so, he said it cannot be the party of "fat cats, rich people and Wall Street" and that the conservative movement has never been about rich people or privilege, "we are the middle class", he said. Paul also said that conservatives must present a message of justice and concern for the unemployed and be against government surveillance to attract new people to the movement, including the young, Hispanics, and blacks.During the 2014 election, Paul launched a social media campaign titled "Hillary\'s Losers" which was meant to highlight many of the Democratic candidates that lost their bids for the U.S. Senate despite endorsements from Hillary Clinton. Clinton was also a candidate for President and eventually won the Democratic Party\'s nomination, going on to lose to Donald Trump in the general election.Paul began to assemble his campaign team, setting up campaign offices and hiring his campaign manager in the beginning of 2015, fueling speculation that he was preparing to enter the Presidential race. Paul officially announced his presidential candidacy on April 7, 2015. Within a day of his announcement, Paul raised $1 million.Senate re-electionIn April 2011, Paul filed to run for re-election to his Senate seat in 2016. Had he become the Republican presidential (or vice-presidential) nominee, state law would prohibit him from simultaneously running for re-election. In March 2014, the Republican-controlled Kentucky Senate passed a bill that would allow Paul to run for both offices, but the Democratic-controlled Kentucky House of Representatives declined to take it up.Paul spent his own campaign money in the 2014 legislative elections, helping Republican candidates for the State House in the hopes of flipping the chamber, thus allowing the legislature to pass the bill (Democratic Governor Steve Beshear\'s veto can be overridden with a simple majority). However, the Democrats retained their 54–46 majority in the State House. Paul has since given his support to the idea that the Kentucky Republican Party could decide to hold a caucus rather than a primary, potentially giving Paul more time to decide whether he should run for U.S. Senator or continue a potential bid for President.SuspensionPaul announced the suspension of his presidential campaign on February 3, 2016, shortly after the Iowa caucus, where he finished 5th of the 12 Republicans in the race.', 'Political positions': 'A supporter of the Tea Party movement, Paul has described himself as a "constitutional conservative". He is generally described as a libertarian, a term he both embraced and rejected during his first Senate campaign. He supports term limits, a balanced budget amendment, and the Read the Bills Act, in addition to the widespread reduction of federal spending and taxation. He favors a flat tax rate of 14.5% for individuals and business, while eliminating the FICA payroll taxes, as well as taxes on inheritance, gifts, capital gains, dividends, and interest. Paul has frequently appeared on Infowars with radio show host and right-wing conspiracy theorist Alex Jones.On social issues, Paul describes himself as "100% pro life", believing that legal personhood begins at fertilization. In 2009, his position was to ban abortion under all circumstances. Since 2010, he has said he would allow for a doctor\'s discretion in life-threatening cases such as ectopic pregnancies.Paul has said that same-sex marriage "offends [himself] and a lot of people" on a personal level, and said there is a "crisis that allows people to think there would be some other sorts of marriage." Paul holds the view that the decision to ban same-sex marriage should be in the hands of states.Paul is uncertain regarding the causes behind global warming; he believes the scientific opinion on climate change is "not conclusive." Paul said pollution emissions are subject to "onerous regulation." In 2018, Paul called for an investigation of a National Science Foundation grant that went towards educating meteorologists about the science of climate change. Paul said the grant was "not science" but "propagandizing".Paul has criticized mandatory minimums for drug crimes, which he believes have led to unreasonably harsh sentences for repeat offenders. Paul does not believe in legalizing the recreational use of drugs like marijuana and cocaine, but does not support jailing marijuana users. He supports state laws to legalize the use of marijuana for medical purposes. Paul was one of three U.S. senators in 2015 to introduce a bipartisan bill, CARERS, that would legalize medical marijuana under federal law. In 2017, Paul voted to confirm Jeff Sessions as Attorney General despite Sessions\' opposition to criminal justice reform and drug decriminalization because Democrats criticized Sessions\' record on race during his confirmation hearings.Paul opposes all forms of gun control as a violation of Second Amendment rights, including provisions of the Patriot Act. His advocacy of personal property rights includes introducing House Bill S. 890, the Defense of Environment and Property Act of 2012. Provisions of the bill include restricting the ability of the Environmental Protection Agency and other Federal agencies to "impinge upon states\' power over land and water use." The bill holds requires Federal agencies to reimburse private property owners double the amount of any economic losses arising from new Federal regulations "that relate to the definition of navigable waters or waters of the United States", and holds the enforcement of any such regulation in abeyance until such payments are complete.Unlike his more stridently "non-interventionist" father, Paul concedes a role for American armed forces abroad, including permanent foreign military bases. He has said that he blames supporters of the Iraq War and not President Obama for the growth in violence that occurred in 2014, and that the Iraq War "emboldened" Iran. Dick Cheney, John McCain and Rick Perry responded by calling Paul an isolationist, but Paul has pointed to opinion polls of likely GOP primary voters as support for his position. Paul stated, referring to ISIS: "I personally believe that this group would not be in Iraq and would not be as powerful had we not been supplying their allies in the war [against Syrian Bashar al-Assad\'s government]."Paul then supported airstrikes against ISIS, but questioned the constitutionality of Obama\'s unilateral actions without a clear congressional mandate. Paul has stated concerns about arms sent to Syrian rebels that wind up in unfriendly hands. In 2015, Paul called for a defense budget of $697 billion in 2016. In 2011, shortly after being elected, he proposed a budget which specified $542 billion in defense spending.On February 2, 2015, Paul generated controversy by suggesting that states should not require parents to vaccinate their children, because parents should have the freedom to make that decision for their children. In an interview with CNBC on February 2, Paul clarified this statement, commenting "I\'m not arguing vaccines are a bad idea. I think they are a good thing, but I think the parent should have some input. The state doesn\'t own your children. Parents own the children, and it is an issue of freedom." On February 3, he posted a photograph to Twitter of himself being vaccinated.In 2016, Paul was one of the first members of Congress to come out in opposition to United States support for the Saudi Arabian-led intervention in Yemen. In June 2017, Paul tried to block Trump administration\'s plan to sell more weapons to Saudi Arabia. In April 2018, he again criticized the U.S.-Saudi Arabia alliance, highlighting that "Saudi Arabia has funded radical madrassas, teaching hatred of America throughout the world, and that Saudi Arabia also supplied arms to ISIS in the Syrian civil war." Paul said that U.S.-backed Saudi blockade of Yemen has further aggravated the humanitarian crisis in the country.Paul, like father, has also been a critic of neoconservatism, and urged Trump to not choose prominent neoconservative Elliott Abrams to serve as Deputy Secretary of State. In April 2018, Paul voted for the confirmation of Mike Pompeo as Secretary of State. Paul had previously insisted that he would not confirm Pompeo, citing Pompeo\'s hawkish foreign policy beliefs.On June 12, 2017, U.S. senators reached an agreement on legislation imposing new sanctions on Russia and Iran. The bill was opposed only by Rand Paul and Bernie Sanders. In July 2018, shortly after 12 Russian intelligence officers have been charged with hacking and leaking emails of senior Democrats, he described the Special Counsel investigation into Russian interference in the 2016 election as a "witch hunt on the president". That same month, Paul blocked a Senate resolution that backed the intelligence community\'s assessment of Russian election interference and called on President Trump to speak with special counsel Robert Mueller.In July 2018, Paul was among only two Senators to vote against a Senate motion supporting NATO.', 'Personal life': 'Paul is married to Kelley Paul (née Ashby), a freelance writer. They and their three sons reside in Bowling Green, Kentucky. They are active members of the Presbyterian church.Paul is deaf in one ear.Assault on Paul in November 2017This section may need to be rewritten entirely to comply with Wikipedia\'s quality standards. You can help. The discussion page may contain suggestions. (July 2018)On November 3, 2017, Paul was assaulted by a neighbor, Rene Boucher (then aged 59), a former anesthesiologist. Paul, who is deaf in one ear, was wearing noise-cancelling headphones while mowing his lawn, enabling Boucher to blindside Paul.Boucher was arrested and charged with one count of fourth degree assault and released on a $7,500 bond. Initial announcements stated that Paul suffered only minor injuries but subsequent news reports said he sustained five broken ribs and lacerations to his lungs. Some sources later stated that six ribs had been broken and that pleural effusion had set in. Three of the ribs were displaced fractures.Voter records from March 2017 showed Boucher registered as a Democrat, but his attorney, Matthew Baker, claimed there was no political motivation for the assault and described it as "a very regrettable dispute between two neighbors over a matter that most people would regard as trivial".Paul suggested the attack was not motivated by a "landscaping dispute", with a Breitbart story calling such a description "fake news".A Washington Examiner investigation, based on interviews with seven neighbors of the gated community, rejected media claims that the dispute was prompted by poor landscaping. The Breitbart investigation corroborated the Examiner\'s conclusion, implying the attack may indeed have been politically-motivated.On November 9, Boucher pleaded not guilty in Warren County, Kentucky\'s District Court to the charge of assaulting a member of Congress but was convicted. Prosecutors sought a 21-month prison sentence, Boucher pleaded guilty to assaulting a member of Congress but the judge, Marianne O. Battani, sentenced him to a 30-day prison term and a year of supervised release rather than the sentence requested by the prosecutors. The judge, a Democrat and Clinton appointee, claimed the attack was "an isolated incident" and "had nothing to do with politics".', 'Electoral history': 'U.S. Senate Republican Primary election in Kentucky, 2010PartyCandidateVotes%+%RepublicanRand Paul206,98658.8%RepublicanTrey Grayson124,86435.5%RepublicanBill Johnson7,8612.2%RepublicanJohn Stephenson6,8852.0%RepublicanGurley Martin2,8500.8%RepublicanJon Scribner2,8290.8%U.S. Senate election in Kentucky, 2010PartyCandidateVotes%+%RepublicanRand Paul755,70655.7%DemocraticJack Conway600,05244.3%Write-inBilly Ray Wilson3380.0%U.S. Senate Republican Primary election in Kentucky, 2016PartyCandidateVotes%+%RepublicanRand Paul (inc.)169,18084.8%RepublicanJames Gould16,6118.3%RepublicanStephen Howard Slaughter13,7286.9%U.S. Senate election in Kentucky, 2016PartyCandidateVotes%+%RepublicanRand Paul (inc.)1,090,17757.3%DemocraticJim Gray813,24642.7%Write-inVarious420.0%', 'Books': 'The Tea Party Goes to Washington (February 2011) .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\\"""\\"""\'""\'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em}ISBN\xa01455503118Government Bullies: How Everyday Americans Are Being Harassed, Abused, and Imprisoned by the Feds (September 2012) ISBN\xa01455522759Our Presidents & Their Prayers: Proclamations of Faith by America\'s Leaders (October 2015, co-authored with James Randall Robison) ISBN\xa01455535737Taking a Stand: Moving Beyond Partisan Politics to Unite America (May 2015) ISBN\xa01455549576', 'Further reading': 'Lizza, Ryan (October 2014). "The Revenge of Rand Paul". The New Yorker.Anon. (April 11, 2015). "Rand\'s stand". United States. The Economist. 415 (8933): 32.', 'introduction': 'Early life\nRandal Howard Paul was born on January 7, 1963, in Pittsburgh, Pennsylvania, to Carol (née Wells) and Ron Paul, who is also a politician and physician. The elder Paul was a U.S. Representative from Texas and ran for President of the United States three times. The middle child of five, his siblings are Ronald "Ronnie" Paul Jr., Lori Paul Pyeatt, Robert Paul, and Joy Paul-LeBlanc.\nPaul was baptized in the Episcopal Church and identified as a practicing Christian as a teenager.\nDespite his father\'s libertarian views and strong support for individual rights, the novelist Ayn Rand was not the inspiration for his first name. Growing up, he went by "Randy", but his wife shortened it to "Rand."\nThe Paul family moved to Lake Jackson, Texas, in 1968, where he was raised and where his father began a medical practice and for an extent of time was the only obstetrician in Brazoria County.\nWhen Rand was 13, his father was elected to the United States House of Representatives. That same year, Paul attended the 1976 Republican National Convention, where his father headed Ronald Reagan\'s Texas delegation. The younger Paul often spent summer vacations interning in his father\'s congressional office. In his teenage years, Paul studied the Austrian economists that his father respected, as well as the writings of Objectivist philosopher Ayn Rand. Paul went to Brazoswood High School and was on the swimming team and played defensive back on the football team.\nPaul attended Baylor University from fall 1981\xa0to summer 1984 and was enrolled in the honors program. During the time he spent at Baylor, he was involved in the swim team and the Young Conservatives of Texas and was a member of a secret organization known as The NoZe Brotherhood. He regularly contributed to The Baylor Lariat student newspaper. Paul dropped out of Baylor without completing his baccalaureate degree, when he was accepted into his father\'s alma mater, the Duke University School of Medicine, which, at the time, did not require an undergraduate degree for admission to its graduate school. He earned an M.D. degree in 1988 and completed his residency in 1993.\n\nMedical career\nAfter completing his residency in ophthalmology, Paul moved to Bowling Green, Kentucky. He has held a state-issued medical license since moving there in 1993. He received his first job from John Downing of Downing McPeak Vision Centers, which brought him to Bowling Green after completing his residency. Paul worked for Downing for about five years before parting ways. Afterwards, he went to work at the Graves Gilbert Clinic, a private medical group in Bowling Green, for 10\xa0years before creating his own practice in a converted one-story house across the street from Downing\'s office. After his election to the U.S. Senate, he merged his practice with Downing\'s medical practice. Paul has faced two malpractice lawsuits between 1993 and 2010; he was cleared in one case while the other was settled for $50,000. His medical work has been praised by Downing and he has medical privileges at two Bowling Green hospitals.\nPaul specializes in cataract and glaucoma surgeries, LASIK procedures, and corneal transplants. As a member of the Bowling Green Noon Lions Club, Paul founded the Southern Kentucky Lions Eye Clinic in 2009 to help provide eye surgery and exams for those who cannot afford to pay. Paul won the Melvin Jones Fellow Award for Dedicated Humanitarian Services from the Lions Club International Foundation for his work establishing the Southern Kentucky Lions Eye Clinic.\n\nNational Board of Ophthalmology\nIn 1995, Paul passed the American Board of Ophthalmology (ABO) boards on his first attempt and earned board-certification under the ABO for 10 years.[citation needed] Prior to this, in 1992, the ABO had changed its certification program, which had previously awarded lifetime certifications, instead requiring doctors to recertify every 10 years. Those who had already been given lifetime certification were allowed to keep it (according to the ABO, they would not legally have been able to rescind these certifications). Shortly after this change, Paul began a campaign to protest it. This effort culminated in 1997 with him creating, "along with 200 other young ophthalmologists", the National Board of Ophthalmology (NBO) to offer an alternative certification system, at a cost substantially lower than that of the ABO. Its certification exam, an open book take-home test, was described by one taker as "probably harder" and "more clinically relevant" than the ABO\'s exam.\nNamed board members were Paul, his wife, and his father-in-law.\nThe NBO was, itself, never accepted as an accrediting entity by organizations such as the American Board of Medical Specialties, and its certification was considered invalid by many hospitals and insurance companies. Paul let his own ABO certification lapse in 2005, which did not affect his practice in Kentucky; the state does not require board certification. By Paul\'s estimate, about 50 or 60 doctors were certified by the NBO. The NBO was incorporated in 1999, but Paul allowed it to be dissolved in 2000 when he did not file the required paperwork with the Kentucky Secretary of State\'s office. He later recreated the board in 2005, but it was again dissolved in 2011.\n\nPolitical activism\nPaul was head of the local chapter of the Young Conservatives of Texas during his time at Baylor University. In 1984, Paul took a semester off to aid his father\'s primary challenge to Republican Senator Phil Gramm.\nWhile attending Duke University School of Medicine, Paul volunteered for his father\'s 1988 Libertarian presidential campaign.\nIn response to President Bush\'s breaking his election promise to not raise taxes, Paul founded the North Carolina Taxpayers Union in 1991. In 1994, Paul founded the anti-tax organization Kentucky Taxpayers United (KTU), and was chair of the organization from its inception. He has often cited his involvement with KTU as the foundation of his involvement with state politics. The group examined Kentucky legislators\' records on taxation and spending and encouraging politicians to publicly pledge to vote uniformly against tax increases.\nPaul managed his father\'s successful 1996 Congressional campaign, in which the elder Paul returned to the House after a twelve-year absence. The elder Paul defeated incumbent Democrat-turned-Republican Greg Laughlin in the Republican primary, despite Laughlin\'s support from the NRCC and Republican leaders such as Newt Gingrich and George W. Bush.\nThe Wall Street Journal reported in 2010 that, although Paul had told a Kentucky television audience as recently as September 2009 that KTU published ratings each year on state legislators\' tax positions and that "we\'ve done that for about 15 years", the group had stopped issuing its ratings and report cards after 2002 and had been legally dissolved by the state in 2000 after failing to file registration documents.\nPaul spoke on his father\'s behalf when his father was campaigning for office, including throughout the elder Paul\'s run in the 2008 presidential election, during which Rand campaigned door-to-door in New Hampshire and spoke in Boston at a fundraising rally for his father on the 234th anniversary of the Boston Tea Party.\nIn February 2014, Paul joined the Tea Party-affiliated conservative advocacy group FreedomWorks in filing a class-action lawsuit charging that the federal government\'s bulk collection of Americans\' phone records metadata is a violation of the Fourth Amendment of the U.S. Constitution. Commenting on the lawsuit at a press conference, Paul said, "I\'m not against the NSA, I\'m not against spying, I\'m not against looking at phone records... I just want you to go to a judge, have an individual\'s name and [get] a warrant. That\'s what the Fourth Amendment says." He also said there was no evidence the surveillance of phone metadata had stopped terrorism. Critics, including Harvard University law professor Alan Dershowitz and Steven Aftergood, the director of the American Scientists\' Project on Government Secrecy, called the lawsuit a political "stunt". Paul\'s political campaign organization said that the names of members of the public who went to Paul\'s websites and signed on as potential class-action participants would be available in the organization\'s database for future campaign use.\nOn the announcement of the filing of the lawsuit, Mattie Fein, the spokeswoman for and former wife of attorney Bruce Fein, complained that Fein\'s intellectual contribution to the lawsuit had been stolen and that he had not been properly paid for his work. Paul\'s representatives denied the charge, and Fein issued a statement saying that Mattie Fein had not been authorized to speak for him on the matter and that he had in fact been paid for his work on the lawsuit.\nPaul is co-author of a book entitled The Tea Party Goes to Washington (2011) and also the author of Government Bullies: How Everyday Americans Are Being Harassed, Abused, and Imprisoned by the Feds (2012). Paul was included in Time magazine\'s world\'s 100 most influential people, for 2013 and 2014. He is also a contributor to Time magazine.\n\nElection to U.S. Senate\nMain article: United States Senate election in Kentucky, 2010\nPrimary campaign\n Rand Paul speaking at a Tea Party rally in Hawesville, Kentucky, on November 21, 2009\n Rand Paul greeting supporters at Bowman Field in Louisville, Kentucky on November 1, 2010.\nAt the beginning of 2009, there was movement by political supporters of his father to draft Paul in a bid to replace beleaguered Republican Kentucky senator Jim Bunning. Paul\'s potential candidacy was discussed in the Los Angeles Times and locally in the Kentucky press. Paul\'s father said, "Should Senator Bunning decide not to run, I think Rand would make a great U.S. Senator." On April 15, 2009, Paul gave his first political speech as a potential candidate at a Tea Party rally held in his town of Bowling Green, Kentucky, where more than 700 people had gathered in support of the Tea Party movement.\nOn May 1, 2009, Paul said that if Bunning, whose fundraising in 2009 matched his poor numbers in opinion polling for the 2010 election, declined to seek a third term, he would almost certainly run in the Republican Party primary to succeed him, and formed an exploratory committee soon after, while still promising to stay out of the race if Bunning ultimately decided to run for reelection. Paul made this announcement on MSNBC\'s The Rachel Maddow Show, though a Kentucky news site first broke the news.\nOn July 28, 2009, Bunning announced that he would not run for reelection in the face of insufficient fundraising. The announcement left only Paul and Secretary of State Trey Grayson as the remaining candidates for the Republican nomination, with Paul announcing on August 5, 2009, that he would officially run for the U.S. Senate as a Republican. The announcement was made through a series of national TV events, radio, and other programs, as well as newspapers in Kentucky.\nOn August 20, 2009, Paul\'s supporters planned a moneybomb to kick off his campaign. The official campaign took in $433,509 in 24 hours. His website reported that this set a new record in Kentucky\'s political fundraising history in a 24-hour period. A second "moneybomb" was held on September 23, 2009, to counter a D.C. fundraiser being held for primary opponent Trey Grayson, by 23 Republican United States Senators. The theme was a UFC "fight" between "We the People" and the "D.C. Insiders". Later in the campaign, Paul claimed his pledge to not take money from lobbyists and Senators who had voted for the bailout was only a "primary pledge"; he subsequently held a fundraiser in Washington, D.C., with the same Senators who had been the target of the September 23, 2009, "moneybomb". Paul ended up raising some $3 million during the primary period. Paul\'s fundraising was aided by his father\'s network of supporters.\nAlthough Grayson was considered the frontrunner in July 2009, Paul found success characterizing Grayson as a "career politician" and challenging Grayson\'s conservatism. Paul ran an ad in February that made an issue out of Grayson\'s September 2008 admission that he voted for Bill Clinton when he was 20 years old. James Dobson, a Christian evangelical figure, endorsed Grayson on April 26 based on the advice of what Dobson described as "senior members of the GOP", but on May 3 the Paul campaign announced that Dobson had changed his endorsement to Paul after Paul and some Paul supporters had lobbied Dobson insisting on Paul\'s social conservative bona fides.\nOn May 18, Paul won the Republican Senatorial primary by a 23% margin, meaning he would face the Kentucky Attorney General Jack Conway, in the November 2 general election.\n\nGeneral campaign\nIn the 2010 general election, Paul faced Kentucky Attorney General Jack Conway. The campaign attracted $8.5 million in contributions from outside groups, of which $6 million was spent to help Paul and $2.5 million to help Conway. This money influx was in addition to the money spent by the candidates themselves: $6 million by Paul and $4.7 million by Conway.\nOn June 28, 2010, Paul supporters held their first post-primary online fundraising drive, this time promoted as a "money blast".\nPaul\'s campaign got off to a rough start after his comments on the Civil Rights Act of 1964 stirred controversy. Paul stated that he favored 9 out of 10 titles of the Civil Rights Act of 1964, but that had he been a senator during the 1960s, he would have raised some questions on the constitutionality of Title II of the Act. Paul said that he abhors racism, and that he would have marched with Martin Luther King Jr. to repeal Jim Crow laws. He later released a statement declaring that he would have voted for the Act and stated "unequivocally\xa0... that I will not support any efforts to repeal the Civil Rights Act of 1964". Later he generated more controversy by characterizing statements made by Obama Administration officials regarding the Deepwater Horizon oil spill cleanup as sounding "un-American".\nPaul defeated Conway in the general election with 56% of the vote to 44% for Conway.\n\nU.S. Senate\n112th Congress (2011–2013)\n Rand Paul being sworn in as a senator by Vice President Joe Biden, along with his family, in the Old Senate Chamber in the United States Capitol building\nPaul was sworn in on January 5, 2011, along with his father, who was simultaneously in the House of Representatives.\nPaul was assigned to be on the Energy and Natural Resources, Health, Education, Labor and Pensions, Homeland Security and Government Affairs, and Small Business committees. Paul also formed the Senate Tea Party Caucus with Jim DeMint and Mike Lee as its inaugural members. His first legislative proposal was to cut $500\xa0billion from federal spending in one year. This proposal included cutting the Department of Education by 83\xa0percent and the United States Department of Homeland Security by 43\xa0percent, as well as folding the Department of Energy into the Department of Defense and eliminating the Department of Housing and Urban Development. Seven independent agencies would be eliminated and food stamps would be cut by 30\xa0percent. Under Paul\'s proposal, defense spending would be reduced by 6.5\xa0percent and international aid would be eliminated. He later proposed a five-year budget plan intended to balance the budget.\nIn February, Paul was one of two Republicans to vote against extending three key provisions of the USA PATRIOT Act (roving wiretaps, searches of business records, and conducting surveillance of "lone wolves"\xa0— individuals not linked to terrorist groups).\nOn March 2, Paul was one of nine senators to vote against a stopgap bill that cut $4\xa0billion from the budget and temporarily prevent a government shutdown, saying that it did not cut enough from the budget. One week later, he voted against the Democratic and Republican budget proposals to keep funding the federal government, saying that both bills did not cut enough spending. Both bills failed to pass the Senate. He later voted against stopgap measures on March 17 and April 8, both of which passed the senate.\nOn April 14, he was one of 19 senators to vote against a budget that cut $38.5\xa0billion from the budget and fund the government for the remainder of the fiscal year.\nPaul voiced opposition to U.S. intervention in the Libyan Civil War  and has criticized President Obama for not gaining congressional consent for Operation Odyssey Dawn. During the debt ceiling crisis, the Senator stated that he would only support raising the debt ceiling if a balanced budget amendment was enacted. Paul was a supporter of the Cut, Cap and Balance Act, which was tabled by Democratic opposition. On August 3, Paul voted against a bill that would raise the debt ceiling.\nOn September 7, Paul called for a vote of no confidence in United States Secretary of the Treasury Timothy Geithner. Later that month, Paul blocked legislation that would strengthen safety rules for oil and gas pipelines, because, he stated, the bill was not strong enough. In October, Paul blocked a bill that would provide $36\xa0million in benefits for elderly and disabled refugees, saying that he was concerned that it could be used to aid domestic terrorists. This was in response to two alleged terrorists who came to the United States through a refugee program and were receiving welfare benefits when they were arrested in 2011 in Paul\'s hometown of Bowling Green. Paul lifted his hold on the bill after Democratic leaders promised to hold a Congressional hearing into how individuals are selected for refugee status and request an investigation on how the two suspects were admitted in the country through a refugee program.\nIn June 2012, Paul endorsed Mitt Romney after it became apparent that he would be the Republican nominee for the 2012 presidential election. However, he was later vocal about his disagreements with Romney on a number of policies.\n\n113th Congress (2013–2015)\nFor the 113th Congress, Paul was added to the Foreign Relations committee and retained his spot on the Health, Education, Labor and Pensions, Homeland Security and Government Affairs, and Small Business committees.\nOn March 6–7, 2013, Paul engaged in a filibuster to delay voting on the nomination of John O. Brennan as the Director of the Central Intelligence Agency. Paul questioned the Obama administration\'s use of drones and the stated legal justification for their potential use within the United States. Paul held the floor for 12 hours and 52 minutes. He ceded to several Republican senators and Democratic senator, Ron Wyden, who generally also questioned drone usage. Paul said his purpose was to challenge drone policy in general and specifically as it related to noncombatants on U.S. soil. He requested a pledge from the Administration that noncombatants would not be targeted on U.S. soil. Attorney General Eric Holder responded that the President is not authorized to deploy extrajudicial punishment without due process, against non-combatant citizens. Paul answered that he was "quite happy" with the response. The filibuster was ended with a cloture vote of 81 to 16, and Brennan was confirmed by the Senate with a vote of 63 to 34.\n\n Rand Paul speaking during filibuster on the Senate floor on March 6, 2013.\nIn March 2013, Paul, with Senators Ted Cruz and Mike Lee, threatened another filibuster, this one opposing any legislative proposals to expand federal gun control measures. The filibuster was attempted on April 11, 2013, but was dismissed by cloture, in a 68–31 vote. Also in March 2013, Paul endorsed fellow Kentucky Republican Senator Mitch McConnell\'s 2014 re-election campaign. McConnell had previously hired Paul\'s 2010 campaign manager, Jesse Benton, as his own campaign manager. Paul\'s endorsement was seen as a major win for McConnell in avoiding a challenge in the Republican primary.\nIn response to Detroit\'s declaration of bankruptcy, Paul stated he would not allow the government to attempt to bail out Detroit. In a phone interview with Breitbart News on July 19, 2013, Paul said, "I basically say he is bailing them out over my dead body, because we don\'t have any money in Washington." Paul said he thought a federal bailout would send the wrong message to other cities with financial problems.\nIn September, Paul stated that the United States should avoid military intervention in the ongoing Syrian Civil War. In an op-ed, Paul disputed the Obama administration\'s claims that the threat of military force caused Syria\'s government to consider turning over its chemical weapons, instead arguing that the opposition to military action in Syria, and the delay that it caused, led to diplomatic progress.\nIn October 2013, Paul was the subject of some controversy when it was discovered that he had plagiarized from Wikipedia part of a speech in support of Virginia gubernatorial candidate Ken Cuccinelli. Referencing the movie Gattaca, Paul quoted almost verbatim from the Wikipedia article about the film without citing the source. Evidence soon surfaced that Paul had copied sentences in a number of his other speeches nearly verbatim from other authors without giving credit to the original sources, including in the speech he had given as the Tea Party rebuttal to the president\'s 2013 State of the Union address. In addition, a three-page-long passage of Paul\'s book Government Bullies was taken directly from an article by the conservative think tank The Heritage Foundation. When it became apparent that Paul\'s op-ed in The Washington Times on mandatory minimums and related testimony he had given before the Senate Judiciary Committee both contained material that was virtually identical to an article that had been published by another author in The Week a few days earlier, the Washington Times said that the newspaper would no longer publish the weekly column Paul had been contributing to the paper. After a week of almost daily news reports of new allegations of plagiarism, Paul said that he was being held to an "unfair standard", but would restructure his office in order to prevent mistakes in the future, if that would be what it would take "to make people leave me the hell alone."\nIn response to political turmoil in Ukraine in early 2014, Paul initially said that the United States should remain mindful of the fact that although the Cold War is over, Russia remains a military power with long-range nuclear missiles. He said that the United States should try to maintain a "respectful relationship with Russia" and avoid taking actions that the Russians might view as a provocation, such as seeking to have Ukraine join NATO or otherwise interfering in Russia\'s relationship with Ukraine.\nTwo weeks later, after the Russian parliament authorized the use of military force in Ukraine and Russian President Vladimir Putin ordered military exercises along Russia\'s border with Ukraine, Paul began taking a different tone. He wrote: "Vladimir Putin\'s invasion of Ukraine is a gross violation of that nation\'s sovereignty and an affront to the international community\xa0... Putin must be punished for violating the Budapest Memorandum, and Russia must learn that the U.S. will isolate it if it insists on acting like a rogue nation." He said that the United States and European allies could retaliate against Russia\'s military aggression without any need for military action. He urged that the United States impose economic sanctions on Russia and resume an effort to build defensive anti-missile installations in Poland and the Czech Republic. He also called for the United States to take steps as a counterweight to Russia\'s strategic influence on Europe\'s oil and gas supply, such as lifting restrictions on new exploration and drilling for fossil fuels in the United States along with immediate approval of the controversial Keystone Pipeline, which he said would allow the United States to ship more oil and gas to Europe if Russia attempts to cut off its own supply to Europe.\nPaul played a leading role in blocking a treaty with Switzerland that would enable the IRS to conduct tax evasion probes, arguing that the treaty would infringe upon Americans\' privacy. Paul received the 2014 Distinguished Service Award from the Center for the National Interest (formally called the Nixon Center) for his public policy work.\nIn response to reports that the CIA infiltrated the computers of the Senate Intelligence Committee, Paul called for the firing of CIA Director John O. Brennan. In December 2014, Paul supported the actions to change United States policy towards Cuba and trade with that country taken by the Obama administration.\n\n114th Congress (2015–2017)\nIn the beginning of 2015, Senator Paul re-introduced the Federal Reserve Transparency Act. Senator Paul also introduced the FAIR Act, or Fifth Amendment Integrity Restoration Act, which would restrict civil forfeiture proceedings.\nOn May 20, 2015, Paul spoke for ten and a half hours in opposition to the reauthorization of Section 215 of the Patriot Act. Sections of the Patriot Act were prevented from being reauthorized on June 1.\nAfter the death of Antonin Scalia in February 2016, on February 15, Paul indicated that he would oppose any nomination by President Obama to replace the late Supreme Court Justice.\nDuring a press briefing on May 6, 2016, President Obama called on Paul to stop "blocking the implementation of tax treaties that have been pending for years", arguing that they assisted law enforcement in off shore investigations into tax evasion.\nOn May 20, Paul advocated with the abolition of gun-free zones during a speech to the National Rifle Association, citing repeated tragedies occurring in these locations.\nOn June 6, Paul spoke of introducing legislation to cease Selective Service, three days after the passing of Muhammad Ali, after whom he intended to name the legislation in tribute.\n\n115th Congress (2017–present)\nIn March 2017, Paul introduced the Stop Arming Terrorists Act that would prohibit the use of United States Government funds to provide assistance to Al Qaeda, Jabhat Fateh al-Sham, and the Islamic State of Iraq and the Levant (ISIL) and to countries supporting those organizations.\nOn March 16, Senator John McCain accused Paul of being an agent of Vladimir Putin after Paul objected to adding Montenegro to NATO. Paul responded the following day by saying McCain "makes a really, really strong case for term limits", suggesting McCain had become "a little unhinged" as a result of his seniority. On April 7, McCain said he did not pay attention to any of Paul\'s rhetoric and that the latter did not have "any real influence" in the United States Senate.\nIn April, Paul questioned President Trump\'s missile strike to Syria by saying, "While we all condemn the atrocities in Syria, the United States was not attacked." He said that further action should not be taken without congressional authorization.\nIn May, Paul was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement. According to the Center for Responsive Politics, Paul has received over $250,000 from oil, gas and coal interests since 2012.\nIn July 2017, Rand Paul joined Reps. Justin Amash (R-MI), Thomas Massie (R-KY), John Duncan Jr. (R-TN) and Sen. Bernie Sanders (I-VT) in opposing a bill that would impose new economic sanctions against Russia, Iran, and North Korea. President Trump opposed the bill, pointing out that relations with Russia were already "at an all-time and dangerous low". He did, however, sign the bill though likely out of political pressure.\nOn September 5, 2017, the Trump administration announced the intended recission of the Deferred Action for Childhood Arrivals program. In tweets responding to the act, Paul stated the executive order that created DACA was illegal and congressional bipartisanship was needed to solve or fix the program.\nIn February 2018, Republican Senators introduced immigration framework akin to that proposed by President Trump and with his support that called for a 25 billion being provided for border security in exchange for a pathway to citizenship for 1.8 million immigrants brought into the US illegally. Paul was one of fourteen Republican Senators to vote against the proposal.\nIn an October 2017 interview, Paul confirmed he would not vote for the Republican budget in the Senate unless billions in spending were removed from the plan: "If leadership is unwilling to compromise with somebody who is concerned about the debt, then they deserve to lose."\nFive ThirtyEight, which tracks Congressional votes, found that Paul has voted with Donald Trump\'s positions the least out of all republicans, only voting with him 74% of the time as of August 2018.\n\nAffordable Care Act repeal\nOn January 25, 2017, Paul introduced a bill to replace the Affordable Care Act, which included each person\'s having a tax credit of $5,000 and not requiring everyone to have coverage, unlike Obamacare.\nOn March 2, after marching to the House of Representatives side of Capital Hill, Paul was filmed knocking on a door while demanding to see their copy of the replacing and repealing the Affordable Care Act bill. Paul spoke with President Trump over the phone on March 6, Paul telling him that the repeal and replacement of the Affordable Care Act should be two separate bills. Two days later, Paul said Republicans were united in repealing the Affordable Care Act, but divided in their stances on its replacement. On March 12, Paul accused House Speaker Paul Ryan of being misleading in portraying supporters of the American Health Care Act of 2017 as not being negotiable, and three days later, March 15, furthered that Ryan was "selling" President Trump "a bill of goods" that he had not explained fully to the president.\nOn March 24, after the bill was pulled by Republican leaders from a vote, Paul released a statement thanking House conservatives for rebelling "against ObamaCare Lite."\nLater, on April 2, Paul golfed with Trump and Budget Director Mick Mulvaney at the Trump National Golf Club in Virginia, where they discussed a variety of topics, including healthcare.\nOn June 15, Paul told reporters that he was willing to vote for a partial repeal, but not the implementation of new Republican entitlement programs, which he identified as present in both House and Senate versions of the bill.\nOn September 11, Paul told reporters that he did not believe the Graham-Cassidy bill would pass. On September 15, Paul tweeted that Graham-Cassidy retained "90% of Obamacare" and dubbed it "more Obamacare Lite".\nOn September 19, Paul asserted the Graham-Cassidy bill as immortalizing the Affordable Care Act and "a big government boondoggle of a trillion dollars of spending" that Republicans should abandon in favor of pursuing measures that would allow for health insurance to be purchased across state lines. On September 22, after President Trump tweeted that "Rand Paul, or whoever votes against Hcare Bill, will forever (future political campaigns) be known as \'the Republican who saved Obamacare\'", Paul responded that he would not be coerced into supporting Graham-Cassidy with bribes or bullying.\n\nCommittee assignments\nCurrent\nCommittee on Foreign Relations (starting 2013)\nUnited States Senate Foreign Relations Subcommittee on International Operations and Organizations, Human Rights, Democracy and Global Women\'s Issues\nUnited States Senate Foreign Relations Subcommittee on African Affairs\nUnited States Senate Foreign Relations Subcommittee on International Development and Foreign Assistance, Economic Affairs and International Environmental Protection, and Peace Corps\nUnited States Senate Foreign Relations Subcommittee on Western Hemisphere and Global Narcotics Affairs\nCommittee on Health, Education, Labor, and Pensions (starting 2011)\nUnited States Senate Health Subcommittee on Children and Families\nUnited States Senate Health Subcommittee on Employment and Workplace Safety\nCommittee on Homeland Security and Governmental Affairs (starting 2011)\nUnited States Senate Homeland Security Subcommittee on Emergency Management, Intergovernmental Relations, and the District of Columbia (Chairman)\nPermanent Subcommittee on Investigations\nUnited States Senate Homeland Security Subcommittee on the Efficiency and Effectiveness of Federal Programs and the Federal Workforce\nCommittee on Small Business and Entrepreneurship (starting 2011)\nPrevious\nCommittee on Energy and Natural Resources (2011–13)\n2016 presidential campaign\nMain article: Rand Paul presidential campaign, 2016\nFurther information: Republican Party presidential primaries, 2016\n Rand Paul speaking at the 2013 Conservative Political Action Conference (CPAC) in National Harbor, Maryland, on March 14, 2013\nBackground\n Paul speaking at a campaign rally, October 2015\nPaul was considered a potential candidate for the Republican nomination for the Presidency of the United States since at least January 2013. He delivered the Tea Party response to President Barack Obama\'s State of the Union address on February 13, 2013, while Marco Rubio gave the official Republican response. This prompted some pundits to call that date the start of the 2016 Republican primaries. That year, he spoke at the Conservative Political Action Conference in Washington D.C., where he won the 2016 Presidential straw poll. Paul went on to win the straw poll for the next two years as well, leading to some considering Paul to be a front runner for the nomination, although CPAC attendees are typically considered younger and more libertarian-minded than average Republican voters.\nIn a speech at the GOP Freedom Summit in April 2014, Paul insisted that the GOP has to broaden its appeal in order to grow as a party. To do so, he said it cannot be the party of "fat cats, rich people and Wall Street" and that the conservative movement has never been about rich people or privilege, "we are the middle class", he said. Paul also said that conservatives must present a message of justice and concern for the unemployed and be against government surveillance to attract new people to the movement, including the young, Hispanics, and blacks.\nDuring the 2014 election, Paul launched a social media campaign titled "Hillary\'s Losers" which was meant to highlight many of the Democratic candidates that lost their bids for the U.S. Senate despite endorsements from Hillary Clinton. Clinton was also a candidate for President and eventually won the Democratic Party\'s nomination, going on to lose to Donald Trump in the general election.\nPaul began to assemble his campaign team, setting up campaign offices and hiring his campaign manager in the beginning of 2015, fueling speculation that he was preparing to enter the Presidential race. Paul officially announced his presidential candidacy on April 7, 2015. Within a day of his announcement, Paul raised $1 million.\n\nSenate re-election\nSee also: United States Senate election in Kentucky, 2016\nIn April 2011, Paul filed to run for re-election to his Senate seat in 2016. Had he become the Republican presidential (or vice-presidential) nominee, state law would prohibit him from simultaneously running for re-election. In March 2014, the Republican-controlled Kentucky Senate passed a bill that would allow Paul to run for both offices, but the Democratic-controlled Kentucky House of Representatives declined to take it up.\nPaul spent his own campaign money in the 2014 legislative elections, helping Republican candidates for the State House in the hopes of flipping the chamber, thus allowing the legislature to pass the bill (Democratic Governor Steve Beshear\'s veto can be overridden with a simple majority). However, the Democrats retained their 54–46 majority in the State House. Paul has since given his support to the idea that the Kentucky Republican Party could decide to hold a caucus rather than a primary, potentially giving Paul more time to decide whether he should run for U.S. Senator or continue a potential bid for President.\n\nSuspension\nPaul announced the suspension of his presidential campaign on February 3, 2016, shortly after the Iowa caucus, where he finished 5th of the 12 Republicans in the race.\n\nPolitical positions\nMain article: Political positions of Rand Paul\n Paul being interviewed by Jerry Doyle at LPAC 2011 in Reno, Nevada, September 16, 2011\nA supporter of the Tea Party movement, Paul has described himself as a "constitutional conservative". He is generally described as a libertarian, a term he both embraced and rejected during his first Senate campaign. He supports term limits, a balanced budget amendment, and the Read the Bills Act, in addition to the widespread reduction of federal spending and taxation. He favors a flat tax rate of 14.5% for individuals and business, while eliminating the FICA payroll taxes, as well as taxes on inheritance, gifts, capital gains, dividends, and interest. Paul has frequently appeared on Infowars with radio show host and right-wing conspiracy theorist Alex Jones.\nOn social issues, Paul describes himself as "100% pro life", believing that legal personhood begins at fertilization. In 2009, his position was to ban abortion under all circumstances. Since 2010, he has said he would allow for a doctor\'s discretion in life-threatening cases such as ectopic pregnancies.\n\n Rand Paul speaking with former U.S. Congressman Allen West\nPaul has said that same-sex marriage "offends [himself] and a lot of people" on a personal level, and said there is a "crisis that allows people to think there would be some other sorts of marriage." Paul holds the view that the decision to ban same-sex marriage should be in the hands of states.\nPaul is uncertain regarding the causes behind global warming; he believes the scientific opinion on climate change is "not conclusive." Paul said pollution emissions are subject to "onerous regulation." In 2018, Paul called for an investigation of a National Science Foundation grant that went towards educating meteorologists about the science of climate change. Paul said the grant was "not science" but "propagandizing".\nPaul has criticized mandatory minimums for drug crimes, which he believes have led to unreasonably harsh sentences for repeat offenders. Paul does not believe in legalizing the recreational use of drugs like marijuana and cocaine, but does not support jailing marijuana users. He supports state laws to legalize the use of marijuana for medical purposes. Paul was one of three U.S. senators in 2015 to introduce a bipartisan bill, CARERS, that would legalize medical marijuana under federal law. In 2017, Paul voted to confirm Jeff Sessions as Attorney General despite Sessions\' opposition to criminal justice reform and drug decriminalization because Democrats criticized Sessions\' record on race during his confirmation hearings.\nPaul opposes all forms of gun control as a violation of Second Amendment rights, including provisions of the Patriot Act. His advocacy of personal property rights includes introducing House Bill S. 890, the Defense of Environment and Property Act of 2012. Provisions of the bill include restricting the ability of the Environmental Protection Agency and other Federal agencies to "impinge upon states\' power over land and water use." The bill holds requires Federal agencies to reimburse private property owners double the amount of any economic losses arising from new Federal regulations "that relate to the definition of navigable waters or waters of the United States", and holds the enforcement of any such regulation in abeyance until such payments are complete.\n\n Senator Paul in New Hampshire, August 13, 2015\nUnlike his more stridently "non-interventionist" father, Paul concedes a role for American armed forces abroad, including permanent foreign military bases. He has said that he blames supporters of the Iraq War and not President Obama for the growth in violence that occurred in 2014, and that the Iraq War "emboldened" Iran. Dick Cheney, John McCain and Rick Perry responded by calling Paul an isolationist, but Paul has pointed to opinion polls of likely GOP primary voters as support for his position. Paul stated, referring to ISIS: "I personally believe that this group would not be in Iraq and would not be as powerful had we not been supplying their allies in the war [against Syrian Bashar al-Assad\'s government]."\nPaul then supported airstrikes against ISIS, but questioned the constitutionality of Obama\'s unilateral actions without a clear congressional mandate. Paul has stated concerns about arms sent to Syrian rebels that wind up in unfriendly hands. In 2015, Paul called for a defense budget of $697 billion in 2016. In 2011, shortly after being elected, he proposed a budget which specified $542 billion in defense spending.\nOn February 2, 2015, Paul generated controversy by suggesting that states should not require parents to vaccinate their children, because parents should have the freedom to make that decision for their children. In an interview with CNBC on February 2, Paul clarified this statement, commenting "I\'m not arguing vaccines are a bad idea. I think they are a good thing, but I think the parent should have some input. The state doesn\'t own your children. Parents own the children, and it is an issue of freedom." On February 3, he posted a photograph to Twitter of himself being vaccinated.\n\n Paul became a strong critic of U.S. involvement in the military intervention in Yemen\nIn 2016, Paul was one of the first members of Congress to come out in opposition to United States support for the Saudi Arabian-led intervention in Yemen. In June 2017, Paul tried to block Trump administration\'s plan to sell more weapons to Saudi Arabia. In April 2018, he again criticized the U.S.-Saudi Arabia alliance, highlighting that "Saudi Arabia has funded radical madrassas, teaching hatred of America throughout the world, and that Saudi Arabia also supplied arms to ISIS in the Syrian civil war." Paul said that U.S.-backed Saudi blockade of Yemen has further aggravated the humanitarian crisis in the country.\nPaul, like father, has also been a critic of neoconservatism, and urged Trump to not choose prominent neoconservative Elliott Abrams to serve as Deputy Secretary of State. In April 2018, Paul voted for the confirmation of Mike Pompeo as Secretary of State. Paul had previously insisted that he would not confirm Pompeo, citing Pompeo\'s hawkish foreign policy beliefs.\nOn June 12, 2017, U.S. senators reached an agreement on legislation imposing new sanctions on Russia and Iran. The bill was opposed only by Rand Paul and Bernie Sanders. In July 2018, shortly after 12 Russian intelligence officers have been charged with hacking and leaking emails of senior Democrats, he described the Special Counsel investigation into Russian interference in the 2016 election as a "witch hunt on the president". That same month, Paul blocked a Senate resolution that backed the intelligence community\'s assessment of Russian election interference and called on President Trump to speak with special counsel Robert Mueller.\nIn July 2018, Paul was among only two Senators to vote against a Senate motion supporting NATO.\n\nPersonal life\n Paul with his family on the Capitol steps\n Rand Paul and his father Ron Paul at an event hosted in their honor at CPAC 2011 in Washington, D.C.\nPaul is married to Kelley Paul (née Ashby), a freelance writer. They and their three sons reside in Bowling Green, Kentucky. They are active members of the Presbyterian church.\nPaul is deaf in one ear.\n\nAssault on Paul in November 2017\nThis section may need to be rewritten entirely to comply with Wikipedia\'s quality standards. You can help. The discussion page may contain suggestions. (July 2018)\nOn November 3, 2017, Paul was assaulted by a neighbor, Rene Boucher (then aged 59), a former anesthesiologist. Paul, who is deaf in one ear, was wearing noise-cancelling headphones while mowing his lawn, enabling Boucher to blindside Paul.\nBoucher was arrested and charged with one count of fourth degree assault and released on a $7,500 bond. Initial announcements stated that Paul suffered only minor injuries but subsequent news reports said he sustained five broken ribs and lacerations to his lungs. Some sources later stated that six ribs had been broken and that pleural effusion had set in. Three of the ribs were displaced fractures.\nVoter records from March 2017 showed Boucher registered as a Democrat, but his attorney, Matthew Baker, claimed there was no political motivation for the assault and described it as "a very regrettable dispute between two neighbors over a matter that most people would regard as trivial".\nPaul suggested the attack was not motivated by a "landscaping dispute", with a Breitbart story calling such a description "fake news".\nA Washington Examiner investigation, based on interviews with seven neighbors of the gated community, rejected media claims that the dispute was prompted by poor landscaping. The Breitbart investigation corroborated the Examiner\'s conclusion, implying the attack may indeed have been politically-motivated.\nOn November 9, Boucher pleaded not guilty in Warren County, Kentucky\'s District Court to the charge of assaulting a member of Congress but was convicted. Prosecutors sought a 21-month prison sentence, Boucher pleaded guilty to assaulting a member of Congress but the judge, Marianne O. Battani, sentenced him to a 30-day prison term and a year of supervised release rather than the sentence requested by the prosecutors. The judge, a Democrat and Clinton appointee, claimed the attack was "an isolated incident" and "had nothing to do with politics".\n\nElectoral history\n\n\nU.S. Senate Republican Primary election in Kentucky, 2010\n\n\nParty\n\nCandidate\n\nVotes\n\n%\n\n+%\n\n\nRepublican\n\nRand Paul\n\n206,986\n\n58.8%\n\n\n\n\nRepublican\n\nTrey Grayson\n\n124,864\n\n35.5%\n\n\n\n\nRepublican\n\nBill Johnson\n\n7,861\n\n2.2%\n\n\n\n\nRepublican\n\nJohn Stephenson\n\n6,885\n\n2.0%\n\n\n\n\nRepublican\n\nGurley Martin\n\n2,850\n\n0.8%\n\n\n\n\nRepublican\n\nJon Scribner\n\n2,829\n\n0.8%\n\n\n\n\n\nU.S. Senate election in Kentucky, 2010\n\n\nParty\n\nCandidate\n\nVotes\n\n%\n\n+%\n\n\nRepublican\n\nRand Paul\n\n755,706\n\n55.7%\n\n\n\n\nDemocratic\n\nJack Conway\n\n600,052\n\n44.3%\n\n\n\n\nWrite-in\n\nBilly Ray Wilson\n\n338\n\n0.0%\n\n\n\n\n\nU.S. Senate Republican Primary election in Kentucky, 2016\n\n\nParty\n\nCandidate\n\nVotes\n\n%\n\n+%\n\n\nRepublican\n\nRand Paul (inc.)\n\n169,180\n\n84.8%\n\n\n\n\nRepublican\n\nJames Gould\n\n16,611\n\n8.3%\n\n\n\n\nRepublican\n\nStephen Howard Slaughter\n\n13,728\n\n6.9%\n\n\n\n\n\nU.S. Senate election in Kentucky, 2016\n\n\nParty\n\nCandidate\n\nVotes\n\n%\n\n+%\n\n\nRepublican\n\nRand Paul (inc.)\n\n1,090,177\n\n57.3%\n\n\n\n\nDemocratic\n\nJim Gray\n\n813,246\n\n42.7%\n\n\n\n\nWrite-in\n\nVarious\n\n42\n\n0.0%\n\n\n\nBooks\nThe Tea Party Goes to Washington (February 2011) .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\\"""\\"""\'""\'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em}ISBN\xa01455503118\nGovernment Bullies: How Everyday Americans Are Being Harassed, Abused, and Imprisoned by the Feds (September 2012) ISBN\xa01455522759\nOur Presidents & Their Prayers: Proclamations of Faith by America\'s Leaders (October 2015, co-authored with James Randall Robison) ISBN\xa01455535737\nTaking a Stand: Moving Beyond Partisan Politics to Unite America (May 2015) ISBN\xa01455549576\nSee also\n\n\nBiography portal\nKentucky portal\nPolitics portal\nPhysicians in the United States Congress\nList of politicians affiliated with the Tea Party movement\nRepublican Party presidential candidates, 2016\nList of United States Congress members killed or wounded in office\n\nReferences\n\n\n^ Alessi, Ryan (September 13, 2010). "Paul\'s top goal is to cut federal spending". Lexington Herald-Leader. Retrieved December 16, 2010.\n\n^ Stonington, Joel (October 4, 2010). "How Old Is Rand Paul?". Politics Daily.com. Retrieved December 16, 2010.\n\n^ O\'Bryan, Jason (October 25, 2010). "What Is Rand Paul\'s Religion?". PoliticsDaily.com. Retrieved January 31, 2011.\n\n^ a b c d Wolfson, Andrew (October 18, 2010). "Rand Paul rides tide of anti-Washington sentiment". The Courier-Journal. Louisville, Kentucky. Retrieved February 23, 2011.\n\n^ Healy, Gene (May 18, 2010). "Rand Paul, Anti-Incumbent Republican". Cato Institute. Retrieved February 8, 2011. Given father Ron\'s libertarian convictions, people often assume that he is named after the self-styled \'radical for capitalism\' who wrote Atlas Shrugged.\n\n^ a b c d Leibovich, Mark (June 6, 2010). "For Paul Family, Libertarian Ethos Began at Home". The New York Times. Retrieved June 6, 2010.\n\n^ a b Rettig, Jessica (June 3, 2010). "10 Things You Didn\'t Know About Rand Paul". U.S. News & World Report. Retrieved December 12, 2010.\n\n^ Burnette, Eric (September 7, 2010). "The Gospel According to Paul". Louisville Magazine. Retrieved December 30, 2010.\n\n^ a b Watterson, Mark (2008). Don\'t Weep for Me, America: How Democracy in America Became the Prince (While We Slept). Dorrance Publishing. p.\xa0203. ISBN\xa0978-0-8059-7890-2.; Sherman, Jerome L. (August 3, 2007). "Texas congressman brings presidential campaign to hometown". Pittsburgh Post-Gazette. Retrieved February 12, 2011. He and his wife decided to settle in the southeastern Texan town of Lake Jackson, near the site of his military service. For a period, Paul was the only obstetrician in Brazoria County, and he delivered as many as 50 babies a month.\n\n^ a b Horowitz, Jason (February 4, 2010). "Running for Senate, Rand Paul lights a fire under Kentucky GOP". The Washington Post. Retrieved February 23, 2011.\n\n^ Wolfford, David (April 5, 2010). "Rand against the Machine". National Review. Retrieved February 23, 2011.\n\n^ Straub, Bill (September 19, 2010). "Off and running: Rand Paul". Evansville Courier & Press. Retrieved February 23, 2011.\n\n^ a b c d e f Lizza, Ryan (October 6, 2014). "The Revenge of Rand Paul". The New Yorker. Retrieved October 8, 2014.\n\n^ a b c Tanenhaus, Sam; Rutenberg, Jim (January 25, 2014). "Rand Paul\'s Mixed Inheritance". The New York Times. Retrieved January 27, 2014.\n\n^ Brammer, Jack (September 28, 2010). "Paul: GQ allegations \'absolutely untrue\'". Lexington Herald-Leader. Retrieved February 27, 2011.\n\n^ Kessler, Glenn. "Rand Paul\'s claim – twice in one day – that he has a biology degree". The Washington Post. Retrieved February 13, 2015.\n\n^ Brammer, Jack (August 5, 2010). "Contrary to some media reports, Rand Paul has no bachelor\'s degree". Lexington Herald-Leader. Retrieved September 10, 2010.\n\n^ a b c Gerth, Joseph (June 14, 2010). "Rand Paul\'s ophthalmology certification not recognized by national clearinghouse". The Courier-Journal. Retrieved July 2, 2010.\n\n^ a b c Van Benschoten, Amanda (July 5, 2010). "Rand Paul\'s political rise surprises even those in Bowling Green". The Courier-Journal. Retrieved March 6, 2011.\n\n^ Harmon, Hayley (January  5, 2011). "Rand Paul\'s Practice Merges with Downing-McPeak". WBKO. Archived from the original on January  7, 2011. Retrieved March 12, 2011.\n\n^ "Son of long-shot presidential hopeful to visit Montana". Billings, Montana: KULR-TV. Associated Press. January 21, 2008. Archived from the original on May 25, 2010. Retrieved April 4, 2009.\n\n^ Thomason, Andrew (September 5, 2010). "Rand Paul\'s balancing act". Park City Daily News. Retrieved August 15, 2014.\n\n^ a b c Fahrenthold, David A. (February 1, 2015). "How Rand Paul tried to lead an eye doctors\' rebellion". The Washington Post. Retrieved April 9, 2015.\n\n^ Weigel, David (June 14, 2010). "Rand Paul: I passed my ophthalmology certification, but took a stand against the way the board operates". The Washington Post. Retrieved March 22, 2011.\n\n^ Montopoli, Brian (June 14, 2010). "Rand Paul\'s Addresses Ophthalmology Certification Questions". CBS News. Retrieved October 18, 2013.\n\n^ "Rand Paul\'s Doctor Credentials Questioned for Lacking Top Board\'s Certification". Fox News Channel. Associated Press. June 14, 2010. Retrieved October 18, 2013.\n\n^ "Certificate of Dissolution" (PDF). Kentucky Secretary of State. Retrieved February 5, 2013.\n\n^ a b Blackmon, Douglas A. (October 14, 2010). "Rand Paul\'s Antitax Group Has Been Inactive for Years". The Wall Street Journal. Retrieved November 3, 2010.\n\n^ "56 Honored by Taxpayers Group". Lexington Herald-Leader. April 16, 1996. p.\xa0C4. Retrieved April 4, 2009.\n\n^ "Legislators Honored as Anti-Tax \'Heroes\' But Several Honorees Recently Voted for Tax". Lexington Herald-Leader. April 13, 2000. p.\xa0A12. Retrieved April 4, 2009.\n\n^ Collins, Michael (April 16, 1996). "8 Legislators Named Friends of Taxpayers". Kentucky Post. Covington, Kentucky. Retrieved April 4, 2009. Recognized by Kentucky Taxpayers United were Sens. Gex \'Jay\' Williams and Dick Roeding and Reps. Charlie Walton, Paul Marcotte, Katie Stine, Tom Kerr, Dick Murgatroyd and Jon David Reinhardt [...] Rand Paul, the group\'s chairman, said the organization did the ranking so voters could see where their lawmakers stand on the issues\n\n^ Paul, Rand (March 29, 2000). "Not One Cent More". Kentucky Post. Retrieved April 4, 2009.\n\n^ "Dr. Rand Paul: Upcoming Events". Ron Paul 2008. Archived from the original on January 23, 2008. Retrieved December 20, 2007.\n\n^ Gaines, Jim (June 6, 2007). "Bowling Green ophthalmologist says father, Rep. Ron Paul, R-Texas, stands a good chance in N.H. primary election". Bowling Green Daily News. Retrieved April 4, 2009.\n\n^ Santora, Marc (December 16, 2007). "Reinventing the revolution". The New York Times.\n\n^ a b c d Glueck, Katie (February 12, 2014). "Rand Paul files class-action suit vs NSA". Politico.\n\n^ Fuller, Jaime (February 12, 2014). "Rand Paul files suit against Obama, NSA Wednesday". The Washington Post.\n\n^ a b Carroll, James R. (February 12, 2014). "Rand Paul files lawsuit against NSA, President Obama over phone surveillance". Courier-Journal.\n\n^ Klimas, Jacqueline (February 12, 2014). "Rand Paul pandering to GOP with NSA lawsuit, former Dem governor says". Washington Times.\n\n^ Ballhaus, Rebecca (February 12, 2014). "Rand Paul files class action lawsuit over NSA surveillance". The Washington Post.\n\n^ a b Milbank, Dana (February 13, 2014). "E-mails back claim that Sen. Rand Paul \'stole\' NSA lawsuit". The Washington Post.\n\n^ The Tea Party Goes to Washington, Nashville: Center Street, 2011. 254 pp.\n\n^ Lowman, Stephen (February 22, 2011). "Every Congress member to get Rand Paul\'s book". The Washington Post. Retrieved March 5, 2011.\n\n^ ASIN\xa01455522759 \n\n^ Gavin, Patrick (April 18, 2013). "Politicians line Time\'s 100 list". Politico. Retrieved April 18, 2013.\n\n^ Lesniewski, Niels (April 24, 2014). "Paul, Gillibrand Represent the Senate on Time\'s \'100 Most Influential\'". Roll Call. Retrieved August 19, 2014.\n\n^ "Sen. Rand Paul". Time.com. Retrieved March 20, 2017.\n\n^ "Ron Paul defends earmarks, says anti-pork McCain is just grandstanding". Los Angeles Times. March 11, 2009. Retrieved November 3, 2010.\n\n^ "Rand Paul Set To Launch" Archived October 16, 2015, at the Wayback Machine., www.kywordsmith.com. May 9, 2009\n\n^ Martin, T. (March 21, 2009). "Congressman Paul\'s Statement on His Son Rand Paul". Pediatrics Week.\n\n^ The Tea Party Goes to Washington, Nashville: Center Street, 2011.\n\n^ Silver, Nate (May 1, 2009). "Bunning Retirement Might Not Save GOP in Kentucky". FiveThirtyEight.com.\n\n^ "Dr. Rand Paul Ready To Enter Primary For Bunning\'s Seat". WBKO. May  1, 2009. Archived from the original on May 29, 2012.\n\n^ "Rand Paul To Form Exploratory Committee For U.S. Senate Bid..." Archived October 16, 2015, at the Wayback Machine., www.kywordsmith.com. May 14, 2009\n\n^ Memoli, Mike (June 15, 2009). "Politics Nation – KY Sen: Potential Bunning Challenger Passes On Race". RealClearPolitics. Retrieved May 19, 2010.\n\n^ Gerth, Joseph (August 5, 2009). "Paul says he will run for Senate". Courier-Journal. Retrieved August 5, 2009.\n\n^ Giroux, Greg (August  5, 2009). "Rand Paul Declares Candidacy For Kentucky Senate Seat". CQ Politics. Retrieved August  7, 2009.[dead link]\n\n^ Keck, Kristi (August  6, 2009). "Ron Paul\'s son following in father\'s footsteps". CNN. Archived from the original on August 9, 2009. Retrieved August 7, 2009.\n\n^ "Rand Bomb Breaks Record". Randpaul2010.com. August 22, 2009. Retrieved November 3, 2010.\n\n^ "Lexington Herald-Leader – Web site promotes \'fight\' to raise money for Paul", Bluegrass Politics September 1, 2009\n\n^ "Kentucky Fight – Rand vs. Trey", kentuckyfight.com September 1, 2009\n\n^ Schreiner, Bruce (June 23, 2010). "Rand Paul flips, seeks money from bailout senators". The Guardian. London.\n\n^ Jack Brammer Some conservatives wary of Grayson Lexington Herald-Leader July 28, 2009\n\n^ Jack Brammer Senate ads trade barbs on defense Lexington Herald-Leader February 27. 2010\n\n^ Dr. James Dobson Endorses Rand Paul RandPaul2010.com\n\n^ David Weigel James Dobson endorses Rand Paul, apologizes for having previously backed his opponent The Washington Post May 3, 2010\n\n^ 2010 KY Primary results KY Secretary of State.\n\n^ "Official 2010 Kentucky Election Results" (PDF). Kentucky Secretary of State. Retrieved November 26, 2014.\n\n^ Gourlay, Kristin Espeland (May 18, 2010). "Conway Wins Democratic Primary for U.S. Senate Seat". WFPL radio. Archived from the original on July 19, 2011. Retrieved May 20, 2010.\n\n^ Steitzer, Stephanie (October 29, 2010). "Outside groups spend big in U.S. Senate race". Courier-Journal.\n\n^ "Super PACs". Sunlight Foundation. Archived from the original on July 23, 2012.\n\n^ "GoRandGo.com – Road to Victory Money Blast" Archived May 22, 2010, at the Wayback Machine., gorandgo.com/ June 7, 2010\n\n^ "Rand Paul supporters plan \'Moneyblast\'" Archived June 10, 2010, at the Wayback Machine., June 7, 2010\n\n^ Thompson, Krissah and Dan Balz. "Rand Paul comments about civil rights stir controversy", The Washington Post, May 21, 2010\n\n^ "Rand Paul Says He Has A Tea Party \'Mandate\'". All Things Considered. NPR. May 19, 2010. Retrieved September 10, 2010.\n\n^ "More raw video: Rand Paul sits down with Joe Arnold to address recent controversial statements". Whas11.com. Archived from the original on May 27, 2010. Retrieved November  3, 2010.\n\n^ "Rand Paul Sets the Record Straight". Randpaul2010.com. May 20, 2010. Retrieved November 3, 2010.\n\n^ Stein, Sam (May 21, 2010). "Rand Paul: Obama Sounds \'Un-American\' For Criticizing BP Over Gulf Oil Spill". The Huffington Post. Retrieved November 3, 2010.\n\n^ Douglas, William (January 5, 2011). "Father watches with pride as Rand Paul becomes U.S. senator". The McClatchy Company. Retrieved January 29, 2011.\n\n^ "Four committee assignments for Rand Paul". Lexington Herald-Leader. January 28, 2011. Retrieved January 29, 2011.\n\n^ Sonmez, Felicia (January 14, 2011). "Rand Paul announces Senate Tea Party Caucus". The Washington Post. Retrieved January 29, 2011.\n\n^ Straub, Bill (January 28, 2011). "Kentucky Sen. Rand Paul rolls out budget ax". Evansville Courier & Press. Retrieved January 29, 2011.; Carroll, James R. (January 25, 2011). "Senator Rand Paul seeks $500 billion in federal spending cuts". The Courier-Journal. Louisville, Kentucky. Retrieved January 31, 2011.; Freddoso, David (January 26, 2011). "A detailed look at the Rand Paul spending bill". The Washington Examiner. Retrieved April 9, 2011.\n\n^ Bruce, Mary (March 17, 2011). "Sen. Paul Unveils 5-Year Budget Plan: Eliminates Four Federal Agencies". ABC News. Retrieved March 24, 2011.\n\n^ Sonmez, Felicia (February 15, 2011). "Senate passes short-term extension of Patriot Act provisions". The Washington Post. Retrieved February 17, 2011.\n\n^ Belenky, Alexander (May 26, 2011). "Patriot Act Extension Passes Senate, Rand Paul Amendments Fail". The Huffington Post. Archived from the original on May 27, 2011. Retrieved May 26, 2011.\n\n^ Middleton, Neil (March 2, 2011). "Yarmuth and Paul vote no on stopgap spending bill". WYMT-TV. Archived from the original on July 18, 2011. Retrieved March 4, 2011.\n\n^ Jaffe, Matthew (March 17, 2011). "Kickin\' the Can: Senate Passes Stop-Gap Spending Plan, Buys Lawmakers Three More Weeks To Solve Funding Mess". ABC News. Retrieved April 9, 2011.\n\n^ Wong, Scott (April 9, 2011). "Rand Paul opposes temporary stopgap". Politico. Retrieved April 9, 2011.\n\n^ Bowman, Quinn (April 14, 2011). "House, Senate Pass Bipartisan Budget Deal to Fund Government". Public Broadcasting Service. Retrieved May 26, 2011.\n\n^ Straub, Bill (March 30, 2011). "Kentucky Senator Paul berates Obama for \'cavalierly taking us to war\'". Evansville Courier & Press. Retrieved April 14, 2011.; Sonmez, Felicia (March 17, 2011). "Rand Paul opposes U.S. military involvement in Libya". The Washington Post. Retrieved April 14, 2011.\n\n^ Klein, Rick (June 30, 2011). "Sen. Rand Paul: No Debt Ceiling Increase Without Balanced Budget Amendment". ABC News. Retrieved August 3, 2011.\n\n^ Hayward, John (July 22, 2011). "Cut, Cap, and Balance Killed". Human Events. Retrieved August 3, 2011.\n\n^ Marchmon, Jay (August  2, 2011). "Rand Paul reacts to passage of debt ceiling bill". WPSD-TV. Archived from the original on October  4, 2011. Retrieved August  3, 2011.\n\n^ Hughes, Siobhan (September 8, 2011). "Rand Paul Calls for No Confidence on Geithner". The Wall Street Journal. Retrieved September 8, 2011.\n\n^ Simon, Richard (October 5, 2011). "Rand Paul blocks pipeline-safety bill, frustrating Californians". Los Angeles Times. Retrieved October 28, 2011.\n\n^ Wong, Scott (October 5, 2011). "Rand Paul blocking refugee funds". Politico. Retrieved October 4, 2011.\n\n^ Wong, Scott (October 17, 2011). "Rand Paul ends hold on SSI benefits". Politico. Retrieved October 28, 2011.\n\n^ "Rand Paul endorses Romney". POLITICO. June 7, 2012.\n\n^ "Rand Paul: Romney\'s wrong on Middle East, defense spending". CNN. October 10, 2012.\n\n^ McCarthy, Daniel (January 3, 2013). "Rand Paul on the Foreign Relations Committee – and What It Means". The American Conservative. Retrieved March 29, 2013.\n\n^ Voorhees, Josh (March 7, 2013). "Rand Paul Ends Epic Mr. Smith-Style Filibuster After More Than 12 Hours". Slate. Retrieved March 7, 2013.\n\n^ "Sen. Paul holds floor for hours in filibuster of CIA nominee, over drone concerns". Fox News Channel. March 6, 2013. Retrieved March 6, 2013.\n\n^ Ewing, Philip (March 6, 2013). "Rand Paul pulls plug on nearly 13-hour filibuster on drones". Politico. Retrieved March 6, 2013.\n\n^ Michaels, Jim (March 7, 2013). "Rand Paul ends epic filibuster over Brennan". USA Today. Retrieved March 7, 2013.\n\n^ "Rand Paul \'happy\' with drone response". CNN. March 3, 2013. Retrieved March 3, 2013.\n\n^ "Brennan Confirmed to Lead the C.I.A." Sarah Wheaton. The New York Times. March 7, 2013. Retrieved November 1, 2013\n\n^ Allen, Jonathan (March 25, 2013). "Rand Paul and Ted Cruz threaten filibuster on guns". Politico. Retrieved March 25, 2013.\n\n^ "Gun bill clears Senate hurdle as filibuster falls short". Fox News. April 11, 2013.\n\n^ a b Howley, Patrick (March 27, 2013). "Rand Paul endorses Mitch McConnell in 2014 Senate race, won\'t back tea party challenge". The Daily Caller. Retrieved August 9, 2013.\n\n^ Trinko, Katrina (July 31, 2014). "From Rand to Mitch". National Review. Retrieved August 9, 2013.\n\n^ Arkin, James (July 19, 2013). "Rand Paul: No government bailout for Detroit". Politico. Retrieved October 16, 2013.\n\n^ Clary, Greg (September 1, 2013). "Rand Paul: U.S. involvement in Syria a \'mistake\'". CNN. Retrieved September 16, 2013.\n\n^ Blake, Aaron (September 13, 2013). "Rand Paul: Opposition to military action led to Syria diplomacy". The Washington Post. Retrieved October 16, 2013.\n\n^ Carroll, James R. (October 28, 2013). "Sen. Rand Paul warns science could be used to alter gene pool". The Courier-Journal. Louisville, KY. Retrieved October 28, 2013.\n\n^ Yarvitz, Michael (October 29, 2013). "The Rand Paul plagiarism read-along!". The Rachel Maddow Show. MSNBC.\n\n^ Contorno, Steve; Kliegman, Julie (November 1, 2013). "Rachel Maddow says Rand Paul\'s \'Gattaca\' speech \'was totally ripped off of Wikipedia\'". PolitiFact (Tampa Bay Times).\n\n^ Miller, Jake (November 1, 2013). "Critics pounce on Rand Paul\'s borowed language". CBS News.\n\n^ Martin, Jonathan (November 4, 2013). "Senator Rand Paul faces new charges of plagiarism". The New York Times.\n\n^ Kaczynski, Andrew (November 2, 2013). "Three pages of Rand Paul\'s book were plagiarized from think tanks". BuzzFeed.\n\n^ Kaczynski, Andrew (November 7, 2013). "More instances of plagiarism in Rand Paul\'s book". BuzzFeed.\n\n^ Kaczynski, Andrew (November 4, 2013). "Sections of Rand Paul\'s op-ed on drug sentencing plagiarized from article week earlier". BuzzFeed.\n\n^ Blake, Aaron (November 6, 2013). "After plagiarism allegations, Rand Paul\'s Washington Times column nixed". The Washington Post.\n\n^ Rutenberg, Jim; Parker, Ashley (November 5, 2013). "After Plagiarism Charges, Paul Announces Office Restructuring". The New York Times. Retrieved November 5, 2013.\n\n^ Costa, Robert (February 25, 2014). "Rand Paul: GOP shouldn\'t \'tweak\' Russia over Ukraine". The Washington Post.\n\n^ Lally, Kathy; Englund, Will; Booth, William (March 1, 2014). "Russian parliament approves use of troops in Ukraine". The Washington Post.\n\n^ Higgins, Andrew; Myers, Steven Lee (February 26, 2014). "Putin orders drills in Crimea, clash shows region\'s divide". The New York Times.\n\n^ Hook, Janet; O\'Connor, Patrick (March 5, 2014). "GOP hawks are on the rise". The Wall Street Journal.\n\n^ a b Paul, Rand (March 9, 2014). "U.S. must take strong action against Putin\'s aggression". TIME.\n\n^ Bade, Rachael (March 2, 2014). "Rand Paul in cross hairs of tax evasion war". Politico. Retrieved March 5, 2014.\n\n^ Romeyn-Sanabria, Marjorie (October 24, 2014). "Rand Paul\'s \'Conservative Realism\' Is Encouraging, But It Lacks A Diplomatic Vision". Daily Caller. Retrieved October 30, 2014.\n\n^ Everett, Burgess. "Rand Paul: Fire Brennan". Politico.com. Politico. Retrieved August 3, 2014.\n\n^ Weigel, Dave (December 19, 2014). "Rand Paul Battles Marco Rubio Over Cuba Policy". Bloomberg L.P. Retrieved December 19, 2014.\n\n^ "Sen. Paul Proposes an Audit of the Federal Reserve". Rand PAC. January 28, 2015. Retrieved February 4, 2015.\n\n^ "Sen. Rand Paul Introduces the FAIR Act". Rand PAC. January 27, 2015. Retrieved February 4, 2015.\n\n^ Kim, Seung Min; Byers, Alex. "Rand Paul calls it a night after 10 1/2 hours". Politico.com. Retrieved May 21, 2015.\n\n^ "Rand Paul seizes political moment with NSA protest". CNN. May 22, 2015.\n\n^ "NSA reform advances as Senate moves to vote on USA Freedom Act – as it happened". The Guardian.\n\n^ Atkin, Emily (February 15, 2016). "Rand Paul: It\'s A \'Conflict Of Interest\' For Obama To Nominate A Supreme Court Justice".\n\n^ "Obama Calls Out Rand Paul For Blocking Tax Treaties". dailycaller.com. May 6, 2016.\n\n^ Kazin, Matthew (May 6, 2016). "Obama Calls on Congress to Reform U.S. Tax Code". Fox Business.\n\n^ Devaney, Tim (May 20, 2016). "Paul calls for end of gun-free zones". The Hill.\n\n^ Weigel, David (June 6, 2016). "Rand Paul\'s tribute to Muhammad Ali: Trying to end Selective Service". The Washington Post.\n\n^ "https://www.congress.gov/bill/115th-congress/house-bill/608/all-info"\n\n^ "The Two Non-Interventionists". HuffPost. July 3, 2017\n\n^ "John McCain: Rand Paul \'Now Working for Vladimir Putin\' | Fox News Insider". Insider.foxnews.com. Retrieved March 20, 2017.\n\n^ "John McCain accuses Rand Paul of working for Vladimir Putin [Video]". Yahoo.com. March 16, 2017. Retrieved March 20, 2017.\n\n^ Collins, Eliza (March 16, 2017). "Rand Paul and John McCain trade jabs, as Paul calls McCain \'past his prime,\' \'unhinged\'". USA Today.\n\n^ "John McCain Slams Rand Paul Over Syria: \'He Doesn\'t Have Any Real Influence\'". TIME. April 7, 2017.\n\n^ King, Alexandra (April 8, 2017). "Rand Paul: Syria strikes \'not in the national interest\'". CNN. Retrieved April 12, 2017.\n\n^ Lardner, Richard (April 7, 2017). "Lawmakers slam Trump for bypassing Congress on Syria strike". Boston.com. Associated Press. Retrieved April 12, 2017.\n\n^ Inhofe, James. "Senator". Retrieved 7 June 2017.\n\n^ "The Republicans who urged Trump to pull out of Paris deal are big oil darlings". The Guardian. June 1, 2017. Retrieved June 1, 2017.\n\n^ "Meet the 5 Lawmakers Who Voted Against the Russia Sanctions Bill". IVN.us. August 3, 2017.\n\n^ "Paul calls for bipartisan DACA solution". The Hill. September 5, 2017.\n\n^ Carney, Jordain (February 12, 2018). "GOP senators introduce Trump immigration framework". The Hill.\n\n^ Carney, Jordain (February 17, 2018). "The 14 GOP senators who voted against Trump\'s immigration framework". The Hill.\n\n^ "Rand Paul opposes Senate GOP budget". Politico. October 17, 2017.\n\n^ Bycoffe, Aaron (2017-01-30). "Tracking Congress In The Age Of Trump". FiveThirtyEight. Retrieved 2018-08-24.\n\n^ "Rand Paul unveils ObamaCare replacement". The Hill. January 25, 2017.\n\n^ "In chaotic scene, Rand Paul demands to see the House GOP\'s Obamacare repeal bill". CNN. March 3, 2017.\n\n^ Everett, Burgess (March 8, 2017). "Rand stands up to Trump on Obamacare". Politico.\n\n^ "Sen. Paul slams Rep. Ryan on health care". CNN. March 12, 2017.\n\n^ "Rand Paul says Paul Ryan selling \'bill of goods\' to Trump". CNN. March 15, 2017.\n\n^ Carney, Jordain (March 24, 2017). "Rand Paul takes victory lap on GOP health bill". The Hill.\n\n^ Firozi, Paulina (April 2, 2017). "Trump plays golf with Rand Paul, budget chief at Trump Golf Club in Virginia". The Hill. President Trump hit the links at one of his golf courses on Sunday with Sen. Rand Paul (R-Ky.) and Office of Management and Budget Director Mick Mulvaney. Trump will reportedly discuss a "variety of topics" with Paul and Mulvaney, including healthcare, at Trump National Golf Club in Sterling, Va.\n\n^ Pytalki, Jan (April 2, 2017). "Trump talks healthcare with Republican critic on golf course". Reuters. Senator Rand Paul and Office of Management and Budget Director Mick Mulvaney joined the president at Trump National Golf Club outside of Washington. The trio was "discussing a variety of topics, including healthcare", said White House Deputy Press Secretary Stephanie Grisham.\n\n^ Sullivan, Peter (June 15, 2017). "Rand Paul denounces \'new entitlements\' in emerging health bill". The Hill.\n\n^ Sullivan, Peter (September 11, 2017). "Paul: Cassidy-Graham health care bill not \'going anywhere\'". The Hill.\n\n^ Roubein, Rachel (September 15, 2017). "Rand Paul says can\'t support last-ditch GOP ObamaCare repeal". The Hill.\n\n^ Beavers, Olivia (September 19, 2017). "Paul calls new ObamaCare repeal bill a trillion-dollar boondoggle". The Hill.\n\n^ McCaskill, Nolan D. (September 22, 2017). "Rand Paul to Trump: \'I won\'t be bribed or bullied\' into supporting Graham-Cassidy bill". Politico.\n\n^ Weinger, Mackenzie (January 28, 2013). "Rand Paul: GOP must \'evolve and adapt\'". Politico. Retrieved August 20, 2013.\n\n^ "Tea party State of the Union 2013 rebuttal: Rand Paul response (full text)". Politico. February 13, 2013. Retrieved August 20, 2013.\n\n^ "Rand Paul: \'Big Government\'s Not A Friend To Those Who Are Trying To Get Ahead\'". All Things Considered. NPR. February 14, 2013. Retrieved August 20, 2013.\n\n^ "Rand Paul wins 2015 CPAC straw poll". Fox News. February 28, 2015. Retrieved March 1, 2015.\n\n^ Cha, Ariana (February 28, 2015). "Rand Paul wins CPAC straw poll, with Scott Walker a close second". The Washington Post. Retrieved March 2, 2015. A candidate\'s popularity with the Conservative Political Action Conference hasn\'t necessarily been a great predictor of his or her success with the larger GOP electorate, as attendees tend to have a stronger libertarian bent than the Republican majority.\n\n^ Holland, Steve (February 28, 2015). "Senator Rand Paul wins straw poll in boost to 2016 presidential prospects". Reuters. Retrieved March 2, 2015. Whether the victory for Paul will have long-lasting benefit is unclear since his libertarian views may not have broad appeal in the Republican Party.\n\n^ "Obamacare\' under attack as conservatives eye 2016". Associated Press. Retrieved April 14, 2014.\n\n^ Sherfinski, David (November 7, 2014). "Rand Paul: \'Clinton Democrats\' became \'Hillary\'s losers\' during election landslide". Washington Times. Retrieved February 4, 2015.\n\n^ Costa, Robert (January 13, 2015). "Rand Paul announces campaign manager for likely 2016 campaign". The Washington Post. Retrieved February 4, 2015.\n\n^ Ballhaus, Rebecca (April 8, 2015). "Rand Paul Sprints to $1 Million Fundraising Mark". The Wall Street Journal.\n\n^ Epstein, Jennifer (April 19, 2011). "Rand Paul files for reelection race five years away". Politico.\n\n^ Raju, Manu. "Rand Paul, Marco Rubio face 2016 bind". Politico.com.\n\n^ Berman, Matt (April 2, 2014). "Marco Rubio Won\'t Run for Senate in 2016 if He Runs for President". National Journal. Retrieved April 2, 2014.\n\n^ Youngman, Sam (March 18, 2014). "Kentucky Senate passes bill to let Rand Paul run for re-election and president in 2016". Kentucky.com. Kentucky.com. Retrieved April 18, 2014.\n\n^ Silverleib, Alan (April 17, 2014). "Dead for now: Kentucky bill allowing twin Paul 2016 runs". Cnn.com. CNN. Retrieved July 30, 2018.\n\n^ "The Obscure Kentucky Contests That Could Alter Rand Paul\'s 2016 Plans". National Journal. August 14, 2014. Retrieved October 27, 2014.\n\n^ "Will Rand Paul Have to Risk His Senate Seat for the Presidency?". Reason.com. September 2, 2014. Retrieved October 27, 2014.\n\n^ "Democrats maintain control of Kentucky House of Representatives". Lexington Herald-Leader. November 4, 2014. Retrieved November 6, 2014.\n\n^ Wilson, Reid (November 4, 2014). "Democrats hold Kentucky House, a minor blow to Rand Paul\'s presidential hopes". The Washington Post. Retrieved November 6, 2014.\n\n^ "Kentucky looks at primary change that would help Rand Paul". Politico. November 5, 2014. Retrieved November 6, 2014.\n\n^ Hook, Janet (February 24, 2015). "Mitch McConnell Backs Rand Paul\'s Bid to Run for Both Senate, White House". The Wall Street Journal. Retrieved February 26, 2015. In a shift first reported by the Lexington Herald-Leader, a McConnell aide said the senator had decided to support Mr. Paul\'s proposal that the Kentucky GOP establish a presidential selection caucus in March separate from the state\'s May primary for other offices.\n\n^ Caldwell, Leigh Ann (February 3, 2016). "Kentucky Sen. Rand Paul Suspends Republican Presidential Campaign". NBCNews.com. Retrieved July 30, 2018.\n\n^ Fineman, Howard (July 12, 2013). "Rand Paul Torn Between Tea Party Fire, White House Dreams". Huffington Post.\n\n^ "Tea party State of the Union 2013 rebuttal: Rand Paul response (full text, video)". Politico. February 12, 2013.\n\n^ Solomon, Deborah (March 29, 2010). "Questions for Rand Paul – Tea Time Interview". The New York Times. Retrieved October 23, 2010.\n\n^ Stewart, Martina (May 4, 2010). "\'I\'m very serious about running\', Ron Paul\'s son says". CNN. Retrieved November 15, 2010. Like his father, the son also favors notions of limited government. "Libertarian would be a good description," Rand Paul told CNN, "because libertarians believe in freedom in all aspects of your life – your economic life as well as your social life as well as your personal life."\n\n^ a b Newton-Small, Jay (March 17, 2010). "Is Rand Paul Good or Bad for Republicans?". Time. Retrieved March 30, 2014. They thought all along that they could call me a libertarian and hang that label around my neck like an albatross, but I\'m not a libertarian.\n\n^ Schreiner, Bruce (September 12, 2010). "Paul says GOP shares blame for deficits". The Daily Caller. Retrieved October 23, 2010.\n\n^ Sahadi, Jeanne (April 7, 2015). "Rand Paul\'s flat tax plan". Cnn.com. Retrieved April 22, 2015.\n\n^ "That Time Rand Paul Told Alex Jones He Wouldn\'t Join The Bilderberg Group Out Of Fear Of Being Shamed By Him". BuzzFeed News. Retrieved 2018-07-21.\n\n^ "Senator Rand Paul\'s Amazingly Frank Interview With Alex Jones". Business Insider. Retrieved 2018-07-21.\n\n^ Nuzzi, Olivia (2014-07-28). "Rand Paul\'s Daddy Issues". The Daily Beast. Retrieved 2018-07-21.\n\n^ "How Would President Rand Paul Handle the Media, Anyway?". Bloomberg.com. Retrieved 2018-07-21.\n\n^ Viebeck, Elise (March 15, 2013). "Rand Paul floats fetal rights bill". The Hill.\n\n^ Kasperowicz, Pete (June 26, 2012). "Reid vows to block vote on Paul\'s \'life at conception\' amendment to flood bill". The Hill. Archived from the original on October 30, 2013.\n\n^ Lynch, Rene (May 12, 2012). "Sen. Rand Paul: Didn\'t think Obama\'s view \'could get any gayer\'". Los Angeles Times.\n\n^ Urbina, Ian (November 25, 2009). "In Kentucky, a Senate candidate with a pedigree for agitation". The New York Times.\n\n^ "Ron Paul\'s son borrows tactics for Senate bid in Kentucky". Evansville Courier & Press. Evansville, IN. Associated Press. November 11, 2009.\n\n^ Abad-Santos, Alexander (March 20, 2013). "Rand Paul isn\'t 100% pro life anymore". The Atlantic Wire.\n\n^ "Rand Paul on the Issues". The New York Times. April 7, 2015.\n\n^ Boaz, David (April 6, 2015). "Is Rand Paul a Real Libertarian?". Newsweek. Retrieved April 10, 2015. His recent comments on gay marriage—"personally offended" and "moral crisis"—created a libertarian backlash.\n\n^ Urbina, Ian (November 25, 2009). "In Kentucky, a Senate Candidate With a Pedigree for Agitation". The New York Times. New York. Retrieved March 2, 2015.\n\n^ Waldman, Paul (May 12, 2014). "Where the 2016 GOP contenders stand on climate change". The Washington Post. Retrieved February 7, 2017.\n\n^ Barron-Lopez, Laura (April 23, 2014). "Rand Paul: Science behind climate change \'not conclusive\'". The Hill. Retrieved February 7, 2017.\n\n^ "GOP senators challenge funding for global warming education program". NBC News. Retrieved 2018-06-23.\n\n^ Sullivan, Andy (March 9, 2015). "Rand Paul to introduce medical marijuana bill in U.S. Congress". Reuters. Retrieved April 17, 2015.\n\n^ Graves, Lucia (July 25, 2014). "Rand Paul\'s Quiet Weed Overture". The National Journal.\n\n^ Chokshi, Niraj (March 10, 2015). "Sens. Booker, Gillibrand and Paul unveil federal medical marijuana bill". The Washington Post. Retrieved April 17, 2015.\n\n^ "Rand Paul explains vote for Sessions: Democrats alienated him with \'character\' attacks". Washington Post. Retrieved 2018-09-07.\n\n^ "Rand Paul Senate Website". Retrieved February 12, 2015.\n\n^ "Congress.gov Website". Retrieved February 12, 2015.\n\n^ Ward, Jon (April 1, 2013). "Rand Paul Supports Some Military Bases On Foreign Soil, A Big Difference From His Dad". The Huffington Post. Retrieved August 20, 2013.\n\n^ Johnson, Eliana (June 22, 2014). "Rand Paul: Blame Bush, Not Obama". National Review. Retrieved April 8, 2015.\n\n^ Miller, Jake (June 22, 2014). "Rand Paul: Blame Dick Cheney for Iraq violence, not Obama". Cbsnews.com. CBS News. Retrieved July 6, 2014.\n\n^ Perry, Rick (July 11, 2014). "Isolationist policies make the threat of terrorism even greater". The Washington Post. Retrieved July 12, 2014.\n\n^ Bennett, John T. (July 11, 2014). "GOP\'s Paul Doubles Down on Isolationism". DefenseNews.com. Gannett Government Media. Retrieved July 14, 2014.\n\n^ Akinyemi, Aaron (June 22, 2014). "Republican Senator Rand Paul Accuses US of Arming Isis Terrorists". International Business Times. Retrieved July 27, 2014.\n\n^ Sarlin, Benjy (September 19, 2014). "Rand Paul\'s hawkish turn breeds unease at libertarian conference". Msnbc.com. MSNBC. Retrieved September 19, 2014.\n\n^ Rogers, Alex (September 10, 2014). "Rand Paul Calls Obama\'s ISIS Plan \'Unconstitutional\' But he does support the intervention". Time.com. Retrieved September 21, 2014.\n\n^ Paul, Rand (October 23, 2014). "Rand Paul: The Case for Conservative Realism". Nationalinterest.org. The National Interest. Retrieved October 23, 2014.\n\n^ Rogers, Alex (March 26, 2015). "Rand Paul Proposes Boosting Defense Spending". Time.com. Retrieved March 26, 2015.\n\n^ Fox, Michelle (February 2, 2015). "Vaccines should be voluntary: Rand Paul". CNBC. Retrieved July 22, 2015.\n\n^ "Rand Paul No-Show at Senate Vaccine Hearing In The Wake Of Controversial Comments". ABC News. February 10, 2015. Retrieved February 12, 2015.\n\n^ "Senators consider vote to block United States arms deal to Saudi Arabia – report". The Guardian. August 14, 2016.\n\n^ "Rand Paul and Most Senate Democrats Almost Blocked Trump\'s Saudi Arms Deal". The Nation. June 14, 2017.\n\n^ a b "Sen. Rand Paul On Yemen And U.S. Foreign Interventions". National Public Radio (NPR). April 27, 2018.\n\n^ Kass, John. "Sen. Rand Paul\'s war with the neocons".\n\n^ Shelbourne, Mallory (February 7, 2017). "Rand Paul urges Trump not to open State Department to neocons". thehill.com.\n\n^ CNN, Phil Mattingly and Lauren Fox,. "Mike Pompeo approved out of committee following Rand Paul flipping his vote". CNN. Retrieved 2018-04-23.\n\n^ Demirjian, Karoun (2018-03-14). "Sen. Rand Paul opposes confirming Trump\'s secretary of state and CIA nominees". Washington Post. ISSN\xa00190-8286. Retrieved 2018-04-23.\n\n^ "US bill on Russia sanctions prompts German, Austrian outcry". Deutsche Welle. June 15, 2017.\n\n^ Samuels, Brett (2018-07-15). "Rand Paul on Russia indictments: We should focus on protecting elections instead of \'witch hunt on the president\'". TheHill. Retrieved 2018-07-15.\n\n^ Balluck, Kyle (2018-07-19). "Rand Paul blocks Sanders\'s Russia resolution, calls it \'crazy hatred\' against Trump". TheHill. Retrieved 2018-07-22.\n\n^ Anapol, Avery (2018-07-10). "Senate votes to support NATO ahead of Trump summit". TheHill. Retrieved 2018-07-24.\n\n^ Cassady, Pam (October 30, 2007). "Local tie to Paul – RHS grad a daughter-in-law to Republican president hopeful". News-Democrat & Leader. p.\xa0A-1.\n\n^ Pulliam, Sarah (April 7, 2015). "Here\'s what we know about Sen. Rand Paul\'s faith: \'Never been easy\'". The Washington Post. Retrieved March 20, 2017.\n\n^ Nuzzi, Olivia (November 6, 2017). "Radical Liberalism or Gardening Dispute? Digging into the Mystery of Rand Paul\'s Assault". New York Magazine.\n\n^ Fandos, Nicholas; Weiland, Noah; Martin, Jonathan (November 6, 2017). "Is Landscaping Drama at the Root of Rand Paul\'s Assault?". New York Times. Because Mr. Paul was wearing sound-muting earmuffs, he did not realize Mr. Boucher was coming, according to one of the Kentucky Republicans and a friend familiar with the altercation.\n\n^ Blake, Aaron (November 9, 2017). "Analysis – \'A disturbed person\': The mystery behind the attack on Rand Paul grows, as Paul\'s side weighs in". Washingtonpost.com. Retrieved November 9, 2017.\n\n^ Gee, Brandon; O\'Keefe, Ed (November 5, 2017). "Sen. Rand Paul\'s injuries far more severe than initially thought". Washington Post. Retrieved November 5, 2017.\n\n^ Lowery, Wesley; O\'Keefe, Ed (November 6, 2017). "Suspect in attack on Sen. Rand Paul might face more serious charges, police say". Washington Post.\n\n^ Moore, Mark (November 9, 2017). "Rand Paul suggests assault wasn\'t over \'landscaping dispute\'". New York Post.\n\n^ Bedard, Paul (November 8, 2017). "Rand Paul\'s neighbors rip media \'landscaping dispute\' reports". Washington Examiner.\n\n^ Gee, Brandon; O\'Keefe, Ed (November 9, 2017). "Suspect in attack on Sen. Rand Paul pleads not guilty". The Washington Post. Retrieved July 21, 2018.\n\n^ "Used to scuffles, Rand Paul takes on Senate, risks shutdown". Associated Press. February 9, 2018. Retrieved February 9, 2018.\n\n^ Associated Press (June 15, 2018). "Rand Paul\'s neighbor sentenced to 30 days in prison for yard attack". Washington Examiner.\n\n^ Kentucky Secretary of State official results for the 2010 primary elections in Kentucky\n\n^ Kentucky Secretary of State official results for the 2010 general elections in Kentucky\n\n^ Kentucky Secretary of State official results for the 2016 primary elections in Kentucky, elect.ky.gov; accessed July 30, 2018.\n\n^ Kentucky Secretary of State official results for the 2016 general elections in Kentucky\n\n\nFurther reading\nLizza, Ryan (October 2014). "The Revenge of Rand Paul". The New Yorker.\nAnon. (April 11, 2015). "Rand\'s stand". United States. The Economist. 415 (8933): 32.\nExternal links\n\nFind more aboutRand Paulat Wikipedia\'s sister projects\n\n\nMedia from Wikimedia Commons\nQuotations from Wikiquote\nTexts from Wikisource\nData from Wikidata\n\n\n\nSenator Rand Paul official U.S. Senate site\nRand Paul for U.S. Senate campaign site\nRand Paul at Curlie (based on DMOZ)\nAppearances on C-SPAN\n\nBiography at the Biographical Directory of the United States Congress\nProfile at Vote Smart\nFinancial information (federal office) at the Federal Election Commission\nLegislation sponsored at the Library of Congress\n\n\nParty political offices\n\n\nPreceded\xa0byJim Bunning\n\n Republican nominee for U.S. Senator from Kentucky(Class 3)2010, 2016\n\nMost recent\n\n\nU.S. Senate\n\n\nPreceded\xa0byJim Bunning\n\n  U.S. Senator (Class 3) from Kentucky2011–present        Served alongside: Mitch McConnell\n\nIncumbent\n\n\nCurrent U.S. order of precedence (ceremonial)\n\n\nPreceded\xa0byRon Johnson\n\n United States Senators by seniority57th\n\nSucceeded\xa0byDick Blumenthal\n\n\nLinks to related articlesvteRand Paul\nPolitical positions\nElectoral history\n2016 presidential campaign\nLegislation\nRead the Bills Act\nFederal Reserve Transparency Act\nCompassionate Access, Research Expansion and Respect States Act\nBooks\nThe Tea Party Goes to Washington\nGovernment Bullies\nTaking a Stand\nRelated\nKelley Paul (wife)\nRon Paul (father)\n2010 U.S. Senate election\n2016 U.S. Senate election\nTea Party movement\n\nvteRon Paul\nPolitical positions\nElectoral history\n1988 presidential campaign\n2008 presidential campaign\n2012 presidential campaign\nCampaign for Liberty\nYoung Americans for Liberty\nLegislation\nAmerican Sovereignty Restoration Act\nFamily Education Freedom Act\nFederal Reserve Transparency Act\nSanctity of Life Act\nBooks\nBibliography\nA Foreign Policy of Freedom: Peace, Commerce, and Honest Friendship\nThe Revolution: A Manifesto\nEnd the Fed\nLiberty Defined\nRelated\nRon Paul newsletters\nAustrian School\nMoneybomb\nTrevor Lyman\nRand Paul\nPaulville, Texas\nDraft Ron Paul movement\n2009 Tea Party protests\nFoundation for Rational Economics and Education\n\nvteCurrent statewide elected officials and legislative leaders of KentuckyU.S. Senators\nMitch McConnell\nRand Paul\nState government\nMatt Bevin, Governor\nJenean Hampton, Lieutenant Governor\nAlison Lundergan Grimes, Secretary of State\nAndy Beshear, Attorney General\nRyan Quarles, Agriculture Commissioner\nAllison Ball, Treasurer\nMike Harmon, Auditor\nSenate\nRobert Stivers, President\nDamon Thayer, Majority Leader\nRay Jones, Minority Leader\nHouse\nDavid Osborne, Speaker\nJonathan Shell, Majority Leader\nRocky Adkins, Minority Leader\nSupreme Court\nJohn Minton, Chief Justice\nLisabeth Hughes, Deputy Chief Justice\nBill Cunningham\nDaniel Venters\nLaurance B. VanMeter\nMichelle Keller\nSamuel Wright, Justices\n\nvteKentucky\'s current delegation to the United States CongressSenators\nMitch McConnell (R)\nRand Paul (R)\nRepresentatives (ordered by district)\nJames Comer (R)\nBrett Guthrie (R)\nJohn Yarmuth (D)\nThomas Massie (R)\nHal Rogers (R)\nAndy Barr (R)\nOther states\' delegations\nAlabama\nAlaska\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nFlorida\nGeorgia\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMississippi\nMissouri\nMontana\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nOhio\nOklahoma\nOregon\nPennsylvania\nRhode Island\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVermont\nVirginia\nWashington\nWest Virginia\nWisconsin\nWyoming\nNon-voting delegations\nAmerican Samoa\nDistrict of Columbia\nGuam\nNorthern Mariana Islands\nPuerto Rico\nU.S. Virgin Islands\n\nvteCurrent United States SenatorsPresident: Pence (R) — President Pro Tempore: Hatch (R)\xa0\xa0\xa0\n\n\nAL:\n\xa0\xa0 Shelby (R)\n\xa0\xa0 Jones (D)\n\n\nAK:\n\xa0\xa0 Murkowski (R)\n\xa0\xa0 Sullivan (R)\n\n\nAZ:\n\xa0\xa0 Flake (R)\n\xa0\xa0 Kyl (R)\n\n\nAR:\n\xa0\xa0 Boozman (R)\n\xa0\xa0 Cotton (R)\n\n\nCA:\n\xa0\xa0 Feinstein (D)\n\xa0\xa0 Harris (D)\n\n\nCO:\n\xa0\xa0 Bennet (D)\n\xa0\xa0 Gardner (R)\n\n\nCT:\n\xa0\xa0 Blumenthal (D)\n\xa0\xa0 Murphy (D)\n\n\nDE:\n\xa0\xa0 Carper (D)\n\xa0\xa0 Coons (D)\n\n\nFL:\n\xa0\xa0 Nelson (D)\n\xa0\xa0 Rubio (R)\n\n\nGA:\n\xa0\xa0 Isakson (R)\n\xa0\xa0 Perdue (R)\n\n\nHI:\n\xa0\xa0 Schatz (D)\n\xa0\xa0 Hirono (D)\n\n\nID:\n\xa0\xa0 Crapo (R)\n\xa0\xa0 Risch (R)\n\n\nIL:\n\xa0\xa0 Durbin (D)\n\xa0\xa0 Duckworth (D)\n\n\nIN:\n\xa0\xa0 Donnelly (D)\n\xa0\xa0 Young (R)\n\n\nIA:\n\xa0\xa0 Grassley (R)\n\xa0\xa0 Ernst (R)\n\n\nKS:\n\xa0\xa0 Roberts (R)\n\xa0\xa0 Moran (R)\n\n\nKY:\n\xa0\xa0 McConnell (R)\n\xa0\xa0 Paul (R)\n\n\n\n\n\nLA:\n\xa0\xa0 Cassidy (R)\n\xa0\xa0 Kennedy (R)\n\n\nME:\n\xa0\xa0 Collins (R)\n\xa0\xa0 King (I)\n\n\nMD:\n\xa0\xa0 Cardin (D)\n\xa0\xa0 Van Hollen (D)\n\n\nMA:\n\xa0\xa0 Warren (D)\n\xa0\xa0 Markey (D)\n\n\nMI:\n\xa0\xa0 Stabenow (D)\n\xa0\xa0 Peters (D)\n\n\nMN:\n\xa0\xa0 Klobuchar (D)\n\xa0\xa0 Smith (D)\n\n\nMS:\n\xa0\xa0 Wicker (R)\n\xa0\xa0 Hyde-Smith (R)\n\n\nMO:\n\xa0\xa0 McCaskill (D)\n\xa0\xa0 Blunt (R)\n\n\nMT:\n\xa0\xa0 Tester (D)\n\xa0\xa0 Daines (R)\n\n\nNE:\n\xa0\xa0 Fischer (R)\n\xa0\xa0 Sasse (R)\n\n\nNV:\n\xa0\xa0 Heller (R)\n\xa0\xa0 Cortez Masto (D)\n\n\nNH:\n\xa0\xa0 Shaheen (D)\n\xa0\xa0 Hassan (D)\n\n\nNJ:\n\xa0\xa0 Menendez (D)\n\xa0\xa0 Booker (D)\n\n\nNM:\n\xa0\xa0 Udall (D)\n\xa0\xa0 Heinrich (D)\n\n\nNY:\n\xa0\xa0 Schumer (D)\n\xa0\xa0 Gillibrand (D)\n\n\nNC:\n\xa0\xa0 Burr (R)\n\xa0\xa0 Tillis (R)\n\n\n\n\n\nND:\n\xa0\xa0 Hoeven (R)\n\xa0\xa0 Heitkamp (D)\n\n\nOH:\n\xa0\xa0 Brown (D)\n\xa0\xa0 Portman (R)\n\n\nOK:\n\xa0\xa0 Inhofe (R)\n\xa0\xa0 Lankford (R)\n\n\nOR:\n\xa0\xa0 Wyden (D)\n\xa0\xa0 Merkley (D)\n\n\nPA:\n\xa0\xa0 Casey (D)\n\xa0\xa0 Toomey (R)\n\n\nRI:\n\xa0\xa0 Reed (D)\n\xa0\xa0 Whitehouse (D)\n\n\nSC:\n\xa0\xa0 Graham (R)\n\xa0\xa0 Scott (R)\n\n\nSD:\n\xa0\xa0 Thune (R)\n\xa0\xa0 Rounds (R)\n\n\nTN:\n\xa0\xa0 Alexander (R)\n\xa0\xa0 Corker (R)\n\n\nTX:\n\xa0\xa0 Cornyn (R)\n\xa0\xa0 Cruz (R)\n\n\nUT:\n\xa0\xa0 Hatch (R)\n\xa0\xa0 Lee (R)\n\n\nVT:\n\xa0\xa0 Leahy (D)\n\xa0\xa0 Sanders (I)\n\n\nVA:\n\xa0\xa0 Warner (D)\n\xa0\xa0 Kaine (D)\n\n\nWA:\n\xa0\xa0 Murray (D)\n\xa0\xa0 Cantwell (D)\n\n\nWV:\n\xa0\xa0 Manchin (D)\n\xa0\xa0 Moore Capito (R)\n\n\nWI:\n\xa0\xa0 Johnson (R)\n\xa0\xa0 Baldwin (D)\n\n\nWY:\n\xa0\xa0 Enzi (R)\n\xa0\xa0 Barrasso (R)\n\n\n\n\xa0\xa0 Republican (51)\n\xa0\xa0 Democratic (47)\n\xa0\xa0 Independent (2)\n\nvteUnited States Senators from KentuckyClass 2\nBrown\nThruston\nClay\nBibb\nWalker\nBarry\nHardin\nCrittenden\nJohnson\nBibb\nCrittenden\nMorehead\nJ. Underwood\nThompson\nPowell\nGuthrie\nMcCreery\nStevenson\nBeck\nCarlisle\nLindsay\nBlackburn\nPaynter\nJames\nMartin\nStanley\nSackett\nRobsion\nWilliamson\nM. Logan\nChandler\nStanfill\nCooper\nChapman\nT. Underwood\nCooper\nBarkley\nHumphreys\nCooper\nHuddleston\nMcConnell\nClass 3\nEdwards\nMarshall\nJ. Breckinridge\nAdair\nClay\nPope\nBledsoe\nTalbot\nW. Logan\nTalbot\nRowan\nClay\nCrittenden\nMetcalfe\nClay\nMeriwether\nDixon\nCrittenden\nJ. C. Breckinridge\nDavis\nMachen\nMcCreery\nWilliams\nBlackburn\nDeboe\nMcCreary\nBradley\nCamden\nBeckham\nErnst\nBarkley\nWithers\nClements\nMorton\nCook\nFord\nBunning\nPaul\n\n\n\nvteKentucky\'s delegation(s) to the 112th–115th United States Congresses (ordered by seniority)\n\n\n112th\n\nSenate: M.\xa0McConnell | R.\xa0Paul\n\nHouse: H.\xa0Rogers | E.\xa0Whitfield | B.\xa0Chandler | G.\xa0Davis (until Jul. 2012) | J.\xa0Yarmuth | B.\xa0Guthrie | T.\xa0Massie (from Nov. 2012)\n\n\n113th\n\nSenate: M.\xa0McConnell | R.\xa0Paul\n\nHouse: H.\xa0Rogers | E.\xa0Whitfield | J.\xa0Yarmuth | B.\xa0Guthrie | T.\xa0Massie | A.\xa0Barr\n\n\n114th\n\nSenate: M.\xa0McConnell | R.\xa0Paul\n\nHouse: H.\xa0Rogers | E.\xa0Whitfield (until Sep. 2016) | J.\xa0Yarmuth | B.\xa0Guthrie | T.\xa0Massie | A.\xa0Barr | J.\xa0Comer (from Nov. 2016)\n\n\n115th\n\nSenate: M.\xa0McConnell • R.\xa0Paul\n\nHouse: H.\xa0Rogers • J.\xa0Yarmuth • B.\xa0Guthrie • T.\xa0Massie • A.\xa0Barr  • J.\xa0Comer\n\nvte(2012 ←) \xa0\xa0 United States presidential election, 2016 \xa0\xa0 (→ 2020)\nUnited States elections, 2016\nFundraising\nPolitical positions\nPolls\nnational\ndemographically\nstatewide\ninternational\nSocial media\nTimeline\nGeneral election debates\nNewspaper endorsements\nprimary\nVote pairing\nRecounts\nRussian interference\nFaithless electors\nRepublican Party\nDebates and forums\nEndorsements\nPrimaries\nResults\nConvention\nPolls\nnational\nstatewide\nstraw\nCandidates (VP)\nNominee\nDonald Trump\ncampaign\nendorsements\nprimary\npositions\nprotests\nRepublican opposition\nVP nominee: Mike Pence\nOther candidates\nJeb Bush\ncampaign\npositions\nBen Carson\ncampaign\nChris Christie\ncampaign\nTed Cruz\ncampaign\nendorsements\npositions\nMark Everson\nJack Fellure\nCarly Fiorina\ncampaign\nJim Gilmore\ncampaign\nLindsey Graham\ncampaign\nMike Huckabee\ncampaign\npositions\nBobby Jindal\ncampaign\nJohn Kasich\ncampaign\nendorsements\nJosue Larose\nDennis Michael Lynch\nAndy Martin\nJimmy McMillan\nGeorge Pataki\ncampaign\nRand Paul\ncampaign\npositions\nRick Perry\ncampaign\npositions\nMarco Rubio\ncampaign\npositions\nRick Santorum\ncampaign\nScott Walker\ncampaign\nDemocratic Party\nPolitical positions\nEndorsements\nDebates and forums\nPrimaries\nResults\nSuperdelegates\nConvention\nPolls\nnational\nstatewide\nstraw\nCandidates (VP)\nNominee\nHillary Clinton\ncampaign\nendorsements\npolitical\nnon-political\npositions\nDemocratic opposition\nVP nominee: Tim Kaine\nOther candidates\nJeff Boss\nHarry Braun\nLincoln Chafee\ncampaign\nRocky De La Fuente\ncampaign\nPaul T. Farrell Jr.\nKeith Judd\nLawrence Lessig\ncampaign\nMartin O\'Malley\ncampaign\nBernie Sanders\ncampaign\nendorsements\npositions\nSam Sloan\nMichael Steinberg\nVermin Supreme\nJim Webb\ncampaign\nRobby Wells\nWillie Wilson\nJohn Wolfe Jr.\nLibertarian Party\nDebates and forums\nPrimaries\nConvention\nCandidates\nNominee\nGary Johnson\ncampaign\nendorsements\npositions\nVP nominee: Bill Weld\nOther candidates\nJohn McAfee\nAustin Petersen\nDarryl W. Perry\nVermin Supreme\nGreen Party\nDebates and forums\nPrimaries\nConvention\nCandidates\nNominee\nJill Stein\ncampaign\nendorsements\nVP nominee: Ajamu Baraka\nOther candidates\nDarryl Cherney\nConstitution Party\nPrimaries\nConvention\nCandidates\nNominee\nDarrell Castle\ncampaign\nVP nominee: Scott Bradley\nOther candidates\nTom Hoefling\nIndependent\nBetter for America\nEvan McMullin\ncampaign\nendorsements\nMindy Finn\nOther third-party and independent candidates\nAmerican Delta Party\nRocky De La Fuente\ncampaign\nVP nominee: Michael Steinberg\nAmerican Party of South Carolina\nPeter Skewes\nAmerican Solidarity Party\nMike Maturen\nAmerica\'s Party\nTom Hoefling\nNutrition Party\nRod Silva\nParty for Socialism and Liberation\nGloria La Riva\nVP nominee: Eugene Puryear*\nPeace and Freedom Party\nGloria La Riva\nVP nominee: Dennis Banks\nOther candidates\nMonica Moorehead\nJill Stein\nProhibition Party\nJames Hedges\nReform Party\nRocky De La Fuente\ncampaign\nVP nominee: Michael Steinberg\nOther candidates\nDarcy Richardson\nSocialist Equality Party\nJerry White\nSocialist Party USA\nMimi Soltysik\ncampaign\nVP nominee: Angela Nicole Walker\nSocialist Workers Party\nAlyson Kennedy\nVP nominee: Osborne Hart\nUnited States Pacifist Party\nBradford Lyttle\nVeterans Party of America\nChris Keniston\nWorkers World Party\nMonica Moorehead\nIndependent candidates\nLaurence Kotlikoff\nNot on any ballots\nDan Bilzerian\nWaka Flocka Flame*\nZoltan Istvan\nTerry Jones\nLucy Lou*\nJohn McAfee\nMerlin Miller\nDeez Nuts*\nGuy Schwartz\nRon White\nTed Williams\n\n* These candidates are constitutionally ineligible to serve as President or Vice President.\n\nAuthority control \n WorldCat Identities\nGND: 1081514949\nISNI: 0000 0003 7355 2896\nLCCN: no2011039480\nNDL: 001216559\nUS Congress: P000603\nVIAF: 169556843\n\n \nNewPP limit report\nParsed by mw1266\nCached time: 20181012121304\nCache expiry: 1900800\nDynamic content: false\nCPU time usage: 2.884 seconds\nReal time usage: 3.262 seconds\nPreprocessor visited node count: 23278/1000000\nPreprocessor generated node count: 0/1500000\nPost‐expand include size: 898617/2097152 bytes\nTemplate argument size: 203951/2097152 bytes\nHighest expansion depth: 17/40\nExpensive parser function count: 15/500\nUnstrip recursion depth: 1/20\nUnstrip post‐expand size: 672579/5000000 bytes\nNumber of Wikibase entities loaded: 2/400\nLua time usage: 1.405/10.000 seconds\nLua memory usage: 9.42 MB/50 MB\n\n\nTransclusion expansion time report (%,ms,calls,template)\n100.00% 2629.680      1 -total\n 59.16% 1555.635      1 Template:Reflist\n 34.85%  916.469    187 Template:Cite_news\n 11.32%  297.676     52 Template:Cite_web\n  8.78%  230.962      1 Template:Infobox_officeholder\n  7.71%  202.626      1 Template:Navboxes\n  7.15%  187.930      3 Template:Infobox\n  3.65%   95.870     13 Template:Navbox\n  3.56%   93.577      4 Template:ISBN\n  2.91%   76.534     17 Template:Infobox_officeholder/office\n\n Saved in parser cache with key enwiki:pcache:idhash:11914121-0!canonical and timestamp 20181012121301 and revision id 860878136\n \n \n\t\t\t\t\t\tRetrieved from "https://en.wikipedia.org/w/index.php?title=Rand_Paul&oldid=860878136"\t\t\t\t\t\nCategories: 1963 birthsLiving people20th-century American Episcopalians20th-century American physicians20th-century Presbyterians21st-century American male writers21st-century American non-fiction writers21st-century American physicians21st-century American politicians21st-century PresbyteriansAmerican foreign policy writersAmerican gun rights advocatesAmerican libertariansAmerican ophthalmologistsAmerican political writersAmerican PresbyteriansBaylor University alumniChristian libertariansChristians from KentuckyConservatism in the United StatesCrime victimsCritics of neoconservatismDrug policy reform activistsDuke University School of Medicine alumniFormer AnglicansKentucky RepublicansNon-interventionismPeople from Lake Jackson, TexasPhysicians from KentuckyPoliticians from Bowling Green, KentuckyPoliticians from PittsburghPrivacy activistsRand PaulRepublican Party United States SenatorsTea Party movement activistsTime (magazine) peopleUnited States presidential candidates, 2016United States Senators from KentuckyThe Washington Times peopleWriters from KentuckyHidden categories: Webarchive template wayback linksAll articles with dead external linksArticles with dead external links from July 2018Wikipedia indefinitely semi-protected biographies of living peopleGood articlesUse mdy dates from March 2017All articles with unsourced statementsArticles with unsourced statements from January 2018Wikipedia articles needing rewrite from July 2018All articles needing rewriteArticles with Curlie linksWikipedia articles with GND identifiersWikipedia articles with ISNI identifiersWikipedia articles with LCCN identifiersWikipedia articles with NDL identifiersWikipedia articles with USCongress identifiersWikipedia articles with VIAF identifiers \n\n\n\nNavigation menu\n\n\nPersonal tools\n\nNot logged inTalkContributionsCreate accountLog in \n\n\n\nNamespaces\n\nArticleTalk \n\n\n\n\nVariants\n\n\n\n\n\n\n\n\n\nViews\n\nReadView sourceView history \n\n\n\nMore\n\n\n\n\n\n\n\nSearch\n\n\n\n \n\n\n\n\n\n\n\nNavigation\n\n\nMain pageContentsFeatured contentCurrent eventsRandom articleDonate to WikipediaWikipedia store \n\n\n\nInteraction\n\n\nHelpAbout WikipediaCommunity portalRecent changesContact page \n\n\n\nTools\n\n\nWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationWikidata itemCite this page \n\n\n\nPrint/export\n\n\nCreate a bookDownload as PDFPrintable version \n\n\n\nIn other projects\n\n\nWikimedia CommonsWikiquoteWikisource \n\n\n\nLanguages\n\n\nالعربيةBislamaČeštinaCymraegDanskDeutschEestiΕλληνικάEspañolEsperantoفارسیFrançaisGaeilge한국어ՀայերենBahasa IndonesiaÍslenskaItalianoעבריתಕನ್ನಡMagyarमराठीNederlands日本語NorskPolskiPortuguêsРусскийScotsShqipSimple EnglishSrpskohrvatski / српскохрватскиSuomiSvenskaTürkçeУкраїнськаTiếng Việt粵語中文 \nEdit links \n\n\n\n\n\n This page was last edited on 23 September 2018, at 17:36\xa0(UTC).\nText is available under the Creative Commons Attribution-ShareAlike License;\nadditional terms may apply.  By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\n\n\nPrivacy policy\nAbout Wikipedia\nDisclaimers\nContact Wikipedia\nDevelopers\nCookie statement\nMobile view\n\n\n\n \n\n \n\n\n\n(window.RLQ=window.RLQ||[]).push(function(){mw.config.set({"wgPageParseReport":{"limitreport":{"cputime":"2.884","walltime":"3.262","ppvisitednodes":{"value":23278,"limit":1000000},"ppgeneratednodes":{"value":0,"limit":1500000},"postexpandincludesize":{"value":898617,"limit":2097152},"templateargumentsize":{"value":203951,"limit":2097152},"expansiondepth":{"value":17,"limit":40},"expensivefunctioncount":{"value":15,"limit":500},"unstrip-depth":{"value":1,"limit":20},"unstrip-size":{"value":672579,"limit":5000000},"entityaccesscount":{"value":2,"limit":400},"timingprofile":["100.00% 2629.680      1 -total"," 59.16% 1555.635      1 Template:Reflist"," 34.85%  916.469    187 Template:Cite_news"," 11.32%  297.676     52 Template:Cite_web","  8.78%  230.962      1 Template:Infobox_officeholder","  7.71%  202.626      1 Template:Navboxes","  7.15%  187.930      3 Template:Infobox","  3.65%   95.870     13 Template:Navbox","  3.56%   93.577      4 Template:ISBN","  2.91%   76.534     17 Template:Infobox_officeholder/office"]},"scribunto":{"limitreport-timeusage":{"value":"1.405","limit":"10.000"},"limitreport-memusage":{"value":9877722,"limit":52428800}},"cachereport":{"origin":"mw1266","timestamp":"20181012121304","ttl":1900800,"transientcontent":false}}});mw.config.set({"wgBackendResponseTime":3428,"wgHostname":"mw1266"});});\n\n\n'}, 'personal': {'Born': 'Randal Howard Paul (1963-01-07) January 7, 1963 (age55)Pittsburgh, Pennsylvania, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Kelley Ashby (m.1990)', 'Children': '3', 'Parents': 'Ron PaulCarol Wells', 'Education': 'Baylor UniversityDuke University (MD)', 'Signature': '', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Kentucky': {'date': 'Assumed office January 3, 2011Serving with Mitch McConnell', 'Preceded by': 'Jim Bunning'}}, 'code': 'P000603'}