{'name': 'Richard.Burr', 'picture': 'B001135.jpg', 'detail': {'Background': 'Burr was born in Charlottesville, Virginia, the son of Martha (née Gillum) and The Rev. David Horace White Burr, a minister. He graduated from Richard J. Reynolds High School in Winston-Salem, North Carolina, in 1974 and earned a B.A. in Communications from Wake Forest University in 1978. Burr was on the football team at both Reynolds High School and Wake Forest. Burr lettered for the Demon Deacons during the 1974 and 1975 seasons. He is a member of the Kappa Sigma fraternity.Prior to running for Congress, Burr worked for 17 years as a sales manager for Carswell Distributing Company, a distributor of lawn equipment.  Burr is currently a board member of Brenner Children\'s Hospital, as well as of the group Idealliance—a group of local, academic, and government officials working to expand North Carolina\'s Piedmont Triad Research Park. Burr is also a board member of the West Point Board of Visitors.Burr has been married to Brooke Fauth Burr, a real estate agent, since 1984, and the couple have two sons, Tyler and William.Burr\'s father, a minister, said that Burr is a 12th cousin of Aaron Burr, the former Vice President, Senator, lawyer, and Continental Army officer known most for killing Founding Father Alexander Hamilton in an 1804 duel and for being arrested, indicted, and ultimately acquitted for treason. Richard Burr is the first Burr in the Senate since Aaron Burr served as the Senator from New York—and only the second person with his last name to win election to Congress (the first being the presumably unrelated Albert G. Burr)—since Aaron. Sen. Burr himself has stated that there are no longer any direct descendants of Aaron Burr, and that he descends from Aaron\'s brother. However, it is more likely that Senator Burr is descended from the brother of Aaron\'s father as biographies of Aaron Burr state that he had only an older sister, that his parents died young and they were raised by his father\'s brother.When queried, Burr states that he has tempered pride of the association: "I am [proud] ... though history has proved to shine a different light on him." Burr was inspired to enter politics in response to anger at rising taxes in the early 1990s.', 'US House of Representatives': 'In 1992, Burr ran against incumbent Democratic Representative Stephen L. Neal and lost. He ran again in 1994 after Neal chose not to seek re-election, and was elected to Congress during a landslide year for Republicans. He ran on a platform that advocated accountability for the federal government, lower health care costs, economic development, and strong school systems.While in the House, Burr authored the FDA Modernization Act of 1997. He also helped to create the National Institute for Biomedical Imaging and Bioengineering. In the aftermath of the 9/11 attacks, he successfully sponsored amendments to improve defenses against bioterrorism.As a representative, Burr co-sponsored, with Senator Kit Bond (R-MO) an amendment to the Energy Policy Act of 2003 relaxing restrictions on the exports of specific types of enriched uranium, first enacted in the Schumer Amendment to the Energy Policy Act of 1992. The original Schumer amendment placed increased controls on U.S. civilian exports of weapons grade highly enriched uranium (HEU) to encourage foreign users to switch to reactor grade low-enriched uranium (LEU) for isotope production. HEU is attractive to terrorists because it can be used to create a simple nuclear weapon, while LEU cannot be used directly to make nuclear weapons.  The amendment allowed exports to five countries for creating medical isotopes.Burr did not face a serious challenge in any of his re-election campaigns.', 'United States Senate': 'Elections 2004 In July 2004, Burr won the Republican primary to seek the U.S. Senate seat being vacated by Democrat John Edwards, who had retired from the Senate to run for Vice President under presidential nominee John Kerry in the 2004 election, in which they lost to incumbent president George W. Bush. He faced Democratic Party nominee Erskine Bowles and Libertarian Tom Bailey.  Burr won the election by five percentage points.2010 Burr defeated North Carolina Secretary of State Elaine Marshall (D) on November 2, 2010, with 55% of the vote. He is the first Republican since Jesse Helms to be re-elected to the United States Senate from North Carolina. He also broke the "curse" that his seat held, being the first Senator re-elected to the seat since 1968 (when Sam Ervin won his final term).2016 Burr defeated Democratic nominee Deborah K. Ross in the November 2016 general election by a margin of 51–45. Burr was a supporter of and campaign advisor for the presidential election bid of Donald Trump.2022 On July 20, 2016, during his re-election campaign, Burr announced that, should he win that year\'s election, which he eventually did, he would not seek re-election to a fourth term in 2022.Tenure In 2007, Burr ran for the leadership post of Republican Conference chairman but lost to Sen. Lamar Alexander by a vote of 31 to 16. In 2009, he was chosen to serve as Chief Deputy Whip in the 111th Congress. In 2007, Burr was named a deputy whip.  In 2011, he announced his intention to seek the post of minority whip, the number two Republican position in the Senate, but he dropped out of that race in 2012.As Chairman of the United States Senate Select Committee on Intelligence, Burr will lead that chamber\'s investigation into Russian interference in the 2016 United States elections.Committee assignments Committee on FinanceSubcommittee on Energy, Natural Resources, and InfrastructureSubcommittee on Health CareSubcommittee on Taxation and IRS OversightCommittee on Health, Education, Labor, and PensionsSubcommittee on Children and FamiliesSubcommittee on Employment and Workplace SafetySubcommittee on Primary Health and AgingSelect Committee on Intelligence (Chairman)Special Committee on AgingCaucus membership Congressional Boating Caucus (Co-Chair)International Conservation CaucusSportsmen\'s CaucusWeapons of Mass Destruction Terrorism CaucusCongressional NextGen 9-1-1 Caucus', 'Political positions': 'Campaign finance Burr opposes the DISCLOSE act, which would require political ads include information about who funded the ad. Burr supports the decision on Citizens United by the U.S. Supreme Court, which allowed unions and corporations to spend an unlimited amount of money leading up to political elections.Economic issues Burr believes the government should have less control over the banking industry, and was critical after the Consumer Financial Protection Bureau fined Wells Fargo $185 million and required they pay back their customers after the bank was caught opening millions of cost-inducing personal accounts and credit cards without customer\'s knowledge. In response to what Burr has said is a federal overreach, he heavily campaigned against and then voted against the Dodd-Frank financial reform bill.In fall 2008, during that year\'s financial crisis, Burr said he was going to an ATM every day and taking out cash because he thought the financial system was going to soon collapse.  In April 2009, in response to press about his experience, Burr told NC public radio station WFAE that he would do the same thing again next time.Burr is a signatory of the "Taxpayer Protection Pledge", which indicates he is opposed to tax increases for any reason. He is opposed to raising taxes on businesses or high-income people to fund public services.In February 2009, he added an amendment to the proposed economic stimulus package that would end the automatic pay increases of Congress, though he has voted to increase his pay seven times including most recently in 2015 when he voted against H.R. 2029 (which prohibited cost of living adjustments in 2016 for members of congress). In his official statement, he said there were some aspects of the bill he supported, but only listed as examples the reauthorization of the Land and Water Conservation Fund, defense bills, and intelligence related bills.In 2013, Burr criticized some of his Republican colleagues in the Senate, who were filibustering the passage of the fiscal year 2014 federal budget in an effort to defund the Affordable Care Act. In a tweet, he called their strategy "the height of hypocrisy".He is opposed to the Trans Pacific Partnership (TPP).Environmental issues Burr was one of 20 senators who voted against the Omnibus Public Land Management Act of 2009. Supporters of this measure stated that its provisions enjoyed bipartisan backing in Congress and strong local support in the areas affected, and would protect millions of acres of wild land.  Opponents said that it was laden with expensive earmarks, that it precluded oil and gas production on large tracts of federal land, and that its provisions would harm rural economies. Burr supports the 1965 Land and Water Conservation Fund, which gives states funds from oil and gas leases to help them buy back natural areas and water resources for the purpose of cultural heritage and recreational opportunities.Climate change Burr believes global warming is real, but does not believe it\'s caused by human activity.In 2011, Burr said he was unsure of how much human activity contributed to climate change, and that he does not think science can prove it. He has supported the lowering of federal taxes on alternative fuels, renewal of the Land and Water Conservation Fund and the initiation of a hydropower project on the Yadkin River in Wilkes County, North Carolina.In 2013, he voted against legislation that would create a federal tax or fee on carbon emissions.Burr voted in favor of the Keystone XL pipeline. In a series of roll call votes attached to debate about the Keystone XL pipeline on January 21, 2015, he voted against Amendments 58 and 87, which were written to "express the sense of Congress regarding climate change." A vote for the amendment was to declare that climate change is real, human-caused, creating problems, and that the US must shift from fossil fuels to sustainable energy.Burr indicated in 2015 that he believes climate change is not a hoax, but he does not believe global climate change is caused by human activity. He clarified again in 2016 he doesn\'t think human have caused climate change, and opposes efforts by the government to restrict the release of greenhouse gases.In 2016, he stated he does not agree with federal grants or subsidies that encourage the productions of renewable energy.Education On Feb 6, Burr voted to confirm Betsy DeVos as U.S. education secretary; DeVos won the Senate\'s confirmation, 51-50, with vice president Mike Pence as the deciding vote. Her family donated $43,200 to Burr\'s re-election campaign against Democrat Deborah Ross. Burr typically votes no towards any increased funding for federal education projects, for example in 2016, he stated he is against increasing student financial aid like Pell Grants and opposes any new subsidies that would help students refinance their loans. He supports the goals of charter schools and has voted yes to allowing school prayer.Gun policy Burr has an "A+" rating from the National Rifle Association (NRA) for his ongoing support of pro-gun legislation. The NRA endorsed Burr in the 2016 election and as of 2017, has donated $6,986,620 to his political activities.He voted against the 2013 legislation which would have extended background checks to internet and gun show weapons purchases. He sponsored legislation to stop the U.S. Department of Veterans Affairs from adding the names of veterans to the National Instant Criminal Background Check System (NICS) if the department has assigned a financial fiduciary to take care of their finances due to mental incompetence, unless a judge or magistrate deems them to be a danger.  Persons added to the NICS system are barred from purchasing or owning a firearm in the United States. Burr voted against Senator Diane Feinstein\'s No Fly No Buy bill, but said he is open to legislation blocking gun sales to terrorists if due process is observed. Speaking privately on the topic of guns to a group of GOP volunteers in Mooresville, North Carolina, Burr joked that a magazine cover of Hillary Clinton ought to have had a bullseye on it.  Burr quickly apologized for the comment.Health policy Burr voted against the Patient Protection and Affordable Care Act in December 2009, and he voted against the Health Care and Education Reconciliation Act of 2010.Burr unsuccessfully tried to filibuster the Family Smoking Prevention and Tobacco Control Act of 2009.In 2014, Burr sponsored the Patient Choice, Affordability, Responsibility and Empowerment Act along with Senator Orrin Hatch. The bill is intended to provide an alternative health care reform system to the Affordable Care Act, according to Ripon Advance. The bill would repeal the Affordable Care Act and implement provisions related to consumer protections, pre-existing conditions, and "consumer-directed healthcare measures."Burr opposes the regulation of the tobacco industry by the U.S. Food and Drug Administration (FDA). During the 108th Congress, Burr proposed the National Uniformity for Food Act, which would have banned states from forcing manufacturers to include labels other than those that are required by the Food and Drug Administration on consumables and health and beauty products. A similar bill passed the House, but it died in the Senate.Abortion Burr has voted to oppose late-term abortion and to support parental notification laws and efforts to restrict federal funding of Planned Parenthood. He voted yes to define a pregnancy as carrying an "unborn child" from the moment of conception. He voted to prevent minors who have crossed state lines from getting an abortion, as well as ensure parents are notified if their child does get an abortion. He voted to extend the federal prohibition on tax dollars being used for abortions by preventing the U.S. Department of Health & Human Services from giving grants to any organization that performs abortions at any of their locations.Medical marijuana In 2010, he stated that "medical marijuana has no real intrinsic values that you can\'t get through other things." Burr in 2016 said he opposes both medical marijuana and any recreational use of cannabis. He stated that there should be greater enforcement of current anti-cannabis federal laws in all states, even when cannabis is legal according to that state\'s laws.Social Security and Medicare In 2012, Burr co-sponsored a plan to overhaul Medicare; his bill would have raised the eligibility age from 65 to 67 over time and added more private insurance options. The proposal would have begun "a transition to a system dominated by private insurance plans." In 2016, he said he supports the privatization of Social Security.Judiciary Senator Burr opposed holding hearings about U.S. Supreme Court nominee Merrick Garland. He blocked the nomination of Patricia Timmons-Goodson to fill a vacancy on the federal court bench in Eastern North Carolina which has been vacant for more than eleven years. He has expressed pride at creating the longest federal court bench vacancy in US history by blocking the appointment of a judge nominated by Obama.  Burr said that if Hillary Clinton were elected president, he would try to block her from ever filling the Supreme Court vacancy, saying that if she won, "I am going to do everything I can do to make sure four years from now, we still got an opening on the Supreme Court."LGBT & gender On December 18, 2010, Burr voted in favor of the Don\'t Ask, Don\'t Tell Repeal Act of 2010, the only Southern Republican senator to do so. The repeal would go on to end the core aspect of official Department of Defense employment discrimination against openly gay individuals. Burr and John Ensign were the only Senators who voted against cloture but voted in support of the final passage. Senator Susan Collins (R) of Maine who spearheaded the fractional Republican party support for the repeal expressed grateful surprise at Burr\'s joining her group in the final vote: "I think that was a gutsy vote" said Collins, "he was not someone who I thought to lobby." Burr strongly expressed his opposition to the timing of the vote, reasoning he said that the chaos of double wars warranted delay, but decided it was right to support the bill when the Senate decided to stop waiting.On same-sex marriage, Burr\'s personal belief is that marriage is between a man and a woman; however, he believes that the law should be left to the states.  Burr thinks that bathroom access should be regulated by sex listed on birth certificates, but has also sought to distance himself from HB2, the North Carolina bathroom legislation.Burr voted for re-authorization of the Violence Against Women Act in 2013.Burr voted against earmarking money to reduce teen pregnancy (via a requirement that health insurers have equitable birth control coverage, increased funding for family planning services, and funding for education programs that teaches vulnerable teens about contraceptives). He has stated he supports giving employers the right to restrict access to birth control coverage of employees if it is for moral reasons.National security Burr was the sponsor of Senate bill 1873, the Biodefense and Pandemic Vaccine and Drug Development Act of 2005, nicknamed "Bioshield Two", which he says will give the Department of Health and Human Services "additional authority and resources to partner with the private sector to rapidly develop drugs and vaccines." Portions of Senate Bill 1873 were eventually included in Senate Bill 3678 (the Pandemic and All-Hazards Preparedness Act), which was signed into law in December 2006.Some provisions of the Patriot Act, including those enabling the bulk collection of metadata for private telephone records by the National Security Agency, were scheduled to expire at the end of May 2015. As Chairman of the Senate Intelligence Committee, Burr proposed extending the provisions for two years, but his amendments were defeated.  After the provisions expired, the Senate passed the USA Freedom Act which instead allowed the NSA to subpoena the data from telephone companies.Burr voted for the Authorization for Use of Military Force Against Iraq Resolution of 2002 (H.J.Res. 114), making him a supporter of the Iraq War.Burr supported President Bush\'s troop surge in Iraq in January 2007, citing the "need for security and stability".Burr was a national security adviser to Donald Trump\'s campaign.In April 2016, following the FBI–Apple encryption dispute in the same year, a discussion draft of a bill sponsored by Burr and Senator Dianne Feinstein was leaked.  The bill would require technology companies to design their encryption so that they can provide law enforcement with user data in an "intelligible format" when required to do so by court order.President Trump Burr was a national security adviser to the Donald Trump campaign. Burr stated that Trump "aligns perfectly" with the Republican Party. When asked on the campaign trail about Trump\'s offensive remarks regarding women, Burr said Trump should be forgiven for a few mistakes and given time to change.As of December 29, 2017, Burr has voted with Trump about 96% of the time, and has only voted against Trump regarding putting sanctions on Russia, North Korea and Iran.In 2017, Burr reacted to Trump\'s firing of FBI Director James Comey by saying, "I have found Director Comey to be a public servant of the highest order."Worker rights In March 2015, Burr voted for an amendment to establish a deficit-neutral reserve fund to allow employees to earn paid sick time. Burr opposes raising the federal minimum wage, and believes that decision should be made by the states.', 'Personal life': '@media all and (max-width:720px){.mw-parser-output .tmulti>.thumbinner{width:100%!important;max-width:none!important}.mw-parser-output .tmulti .tsingle{float:none!important;max-width:none!important;width:100%!important;text-align:center}}Burr\'s car, a 1973 Volkswagen Thing, is "something of a local celebrity" on Capitol Hill. Burr has a known aversion to reporters, once even climbing out of his office window while carrying his dry cleaning to avoid them. Burr is a member of the United Methodist Church.', 'Electoral history': 'North Carolina\'s 5th congressional district: Results 1992–2002YearDemocraticVotesPctRepublicanVotesPct3rd partyPartyVotesPct3rd partyPartyVotesPct1992Stephen L. Neal117,83553%Richard Burr102,08646%Gary AlbrechtLibertarian3,7582%*1994A. P. "Sandy" Sands63,19443%Richard Burr84,74157%1996Neil Grist Cashion Jr.74,32035%Richard Burr130,17762%Barbara J. HoweLibertarian4,1932%Craig BergNatural Law1,008<1%1998 Mike Robinson55,80632%Richard Burr119,10368%Gene PaczeltLibertarian1,3821%2000(no candidate)Richard Burr172,48993%Steven Francis LeBoeufLibertarian13,3667%2002David Crawford58,55830%Richard Burr137,87970%*Write-in and minor candidate notes: In 1992, write-ins received 4 votes.North Carolina Senator (Class III) 2004 results:YearDemocraticVotesPctRepublicanVotesPct3rd partyPartyVotesPct2004Erskine Bowles1,632,52747%Richard Burr1,791,45052%Tom BaileyLibertarian47,7431%*2010Elaine Marshall1,145,07443%Richard Burr1,458,04655%Mike BeitlerLibertarian55,6822%2016Deborah Ross2,128,16545%Richard Burr2,395,37651%Sean HaughLibertarian167,5924%.mw-parser-output .refbegin{font-size:90%;margin-bottom:0.5em}.mw-parser-output .refbegin-hanging-indents>ul{list-style-type:none;margin-left:0}.mw-parser-output .refbegin-hanging-indents>ul>li,.mw-parser-output .refbegin-hanging-indents>dl>dd{margin-left:0;padding-left:3.2em;text-indent:-3.2em;list-style:none}.mw-parser-output .refbegin-100{font-size:100%}U.S. Senate Republican primary election in North Carolina, 2004PartyCandidateVotes%+%RepublicanRichard Burr302,31988%RepublicanJohn Ross Hendrix25,9718%RepublicanAlbert Lee Wiley Jr.15,5855%U.S. Senate Republican primary election in North Carolina, 2016PartyCandidateVotes%+%RepublicanRichard Burr (inc.)627,26361%RepublicanGreg Brannon257,29625%RepublicanPaul Wright86,9339%RepublicanLarry Holmquist50,5005%', 'introduction': "Richard Mauze Burr (born November 30, 1955) is an American businessman and politician who is the senior United States Senator from North Carolina, serving since 2005.  A member of the Republican Party, Burr was previously a member of the United States House of Representatives.\nBorn in Charlottesville, Virginia, Burr is a graduate of Wake Forest University.  Prior to seeking elected office, Burr was a sales manager for a lawn equipment company.  In 1994 he was elected to the U.S. House of Representatives for North Carolina's 5th Congressional District as part of the Republican Revolution.\nBurr was elected to the United States Senate in 2004, defeating Democrat Erskine Bowles.  Since 2015, Burr has served as the Chair of the Senate Intelligence Committee.\n\n"}, 'personal': {'Born': 'Richard Mauze Burr (1955-11-30) November 30, 1955 (age62)Charlottesville, Virginia, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Brooke Fauth', 'Children': '2', 'Education': 'Wake Forest University (BA)', 'Signature': '', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom North Carolina': {'date': 'Assumed office January 3, 2005Serving with Thom Tillis', 'Preceded by': 'John Edwards'}, 'Chair of the Senate Intelligence Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Dianne Feinstein'}, "Member of the US House of Representativesfrom North Carolina's 5th district": {'date': 'In officeJanuary 3, 1995– January 3, 2005', 'Preceded by': 'Stephen L. Neal', 'Succeeded by': 'Virginia Foxx'}}, 'code': 'B001135'}