{'name': 'Rick.Larsen', 'picture': 'L000560.jpg', 'detail': {'Early life, education and career': "Part of a series onNew DemocratsIdeologyCentrismClintonismCultural liberalismEconomic liberalismRadical centrismSocial liberalismThird WayPeopleBruce BabbittEvan BayhJoe BidenJohn CarneyTom CarperLawton ChilesBill ClintonHillary ClintonGerry ConnollyJim DavisSusan DavisCal DooleyJohn EdwardsHarold Ford Jr.Al FromDick GephardtAl GoreBob GrahamJim HimesJohn KerryRon KindMary LandrieuRick LarsenJoe LiebermanBlanche LincolnWill MarshallJim MoranSam NunnBarack ObamaJared PolisChuck RobbTimothy J. RoemerPaul TsongasAllyson SchwartzAdam SmithOrganizationsCoalition for a Democratic MajorityDemocratic Leadership CouncilModerate Dems Working GroupNew Democrat CoalitionNew Democrat NetworkProgressive Policy InstituteSenate Centrist CoalitionThird Way Politics portalvteBorn in Arlington, Washington, he attended Pacific Lutheran University and the University of Minnesota, earning a master's degree in public affairs. He formerly worked as director of public affairs for the Washington State Dental Association and as a lobbyist for the dental profession. He also worked for the city of Everett, Washington as director of economic development for the city's port.Before being elected to the House, Larsen gained political experience when he served as a Snohomish County Councilman and as chair of the Snohomish County Council.", 'US House of Representatives': 'Committee assignments United States House Committee on Armed ServicesSubcommittee on Strategic ForcesCommittee on Transportation and InfrastructureSubcommittee on Coast Guard and Maritime Transportation (Ranking Member)Subcommittee on Railroads, Pipelines, and Hazardous MaterialsCaucus Participation U.S.-China Working GroupElectronic Warfare Working GroupCaucus to Fight and Control MethamphetamineCongressional Arts CaucusCongressional Puget Sound Recovery CaucusCongressional CemAfterschool CaucusesCongressional NextGen 9-1-1 Caucus', 'Staff Twitter scandal': "On December 8, 2011, three staff members of Larsen were fired by Larsen after they were tweeting insults about Larsen and bragging about drinking on the job in Larsen's Washington D.C. office. Larsen's office fired the offending staffers within hours.", 'Political positions': 'In 2006, CQPolitics described him:Larsen, a member of the centrist New Democrat Coalition in the House, has carved an image as a moderate that appeals to crucial swing voters in the politically competitive coastal district in the northwestern corner of Washington State. He still maintains support from  centers surrounding the port cities of Everett and Bellingham.Given the importance of defense- and aviation-oriented jobs in the 2nd District, Larsen\'s seats on the Armed Services Committee and the Transportation and Infrastructure Committee are politically advantageous.Rick Larsen has repeatedly cosponsored legislation that would create the Wild Sky Wilderness area in his home district and is a member of the Congressional Wildlife Refuge Caucus.Larsen has authored a law that regulates the international marriage brokering industry, by protecting "mail order brides" from abuse and clients from being monetarily ripped off. Among his other priorities are fighting for better access to health care for veterans and the poor, increasing support for government programs that combat homelessness, increasing highway funding, and finding solutions to the growing methamphetamine problem in the district. Larsen also meets regularly with the community-at-large in various events or forums and is able to help provide information if needed.Transportation One of Rick Larsen\'s major priorities is transportation issues. As a member of the House Transportation and Infrastructure Committee, he has voted yes on every transportation bill since being reelected in 2008. He believes that "sound investments in transportation keep our economy moving," and improve conditions in other areas. Representative Larsen has gotten over $52 million in the form of transportation projects for the SAFETEA-LU Bill to improve highways, increase funding for ferry systems, and expedite the flow of traffic and goods through border crossings.Labor Since being reelected in 2008, Representative Larsen has voted yes on every labor bill, ranging from the "S-Miner Act" to the "Extending Federal Emergency Unemployment Benefits and Providing Business and Homebuyer Tax Credits" bill.  Rick Larsen has shown strong support for the interests of the Utility Workers Union of America, Service Employees International Union, American Federation of State, County & Municipal Employees, and AFL – CIO. He works to support the local Washington economy by investing in small to medium-sized businesses to help them succeed in the global economy.Abortion Pro-choice interest groups have consistently supported Rick Larsen. Planned Parenthood, National Family Planning & Reproductive Health Association and NARAL Pro-Choice America have all highly rated his position on abortion. In addition, he has voted against several bills that would restrict abortion rights.Healthcare reform Larsen has supported the House Democratic proposal for publicly funded health care. He voted for the reform bill in November 2009.Iraq War Although Larsen initially voted against a bill authorizing military force in Iraq in October 2002, he has since voted yes on nearly every bill put forth in the House concerning the Iraq and Afghanistan. Larsen supported President Obama\'s proposed exit strategy which promises to remove combat troops by summer of 2010.', 'Political campaigns': "2006 Larsen defeated Republican candidate Doug Roulstone, a retired Navy officer who was recruited by GOP strategists. Larsen received 65% of the vote to Roulstone's 34%.2008 Larsen was challenged in the Democratic primary during his 2008 reelection campaign by perennial candidate Glen Johnson. His Republican opponent for the House race was recently retired Snohomish County Sheriff Rick Bart.For the 2008 election cycle, Rick Larsen's campaign's total income was $1,336,438. His campaign spent $1,155,691. The companies that contributed the most money were Boeing Co., Microsoft Corp., American Dental Assn., McBee Strategic Consulting, and Puget Energy. The labor, finance/insurance/real estate, transportation, misc. business, and health sectors were the largest contributing sectors. The major industry donations came from health professionals, transportation unions, building trade unions, retired, and sea transport.2010 Larsen narrowly defeated Republican nominee John Koster to win a sixth term.Larson was endorsed by the Seattle Post-Intelligencer on October 13, 2010.2012 United States House of Representatives elections, 2012#District 2In 2012, Larsen won reelection by a comfortable margin, with 61% of the vote as compared to Republican Dan Matthews' 39%.2016 Larsen was challenged by Republican Marc Hennemann. Hennemann decided to challenge Larson after he received an answer he did not like to a question at a town hall meeting in Coupeville, WA. In the general election, Larsen gathered 64% of the vote compared to Hennemann's 36%.", 'Electoral history': "Washington's 2nd congressional district: Results 1992–2014YearDemocratVotesPctRepublicanVotesPct3rd PartyPartyVotesPct3rd PartyPartyVotesPct2000Rick Larsen146,61750%John Koster134,66046%Stuart AndrewsLibertarian7,6723%Glen S. JohnsonNatural Law4,2311%2002Rick Larsen101,21950%Norma Smith92,52846%Bruce GuthrieLibertarian4,3262%Bernard P. HaggertyGreen4,0772%2004Rick Larsen202,38364%Suzanne Sinclair106,33334%Bruce GuthrieLibertarian7,9662%2006Rick Larsen157,06464%Doug Roulstone87,73036%2008Rick Larsen217,41662%Rick Bart131,05138%2010Rick Larsen155,24151%John Koster148,72249%2012Rick Larsen184,82661%Dan Matthews117,46539%2014Rick Larsen67,81262%B.J. Guillot41,88938%2016Rick Larsen208,31464%Marc Hennemann117,09436%", 'introduction': "Richard Ray Larsen (born June 15, 1965) is the United States Representative for Washington's 2nd congressional district and a member of the Democratic Party. He was first elected to the House of Representatives in 2000 and was re-elected in each of the eight subsequent elections, most recently in 2016.\nLarsen is a member of the House Armed Services Committee and the House Transportation and Infrastructure Committee.\n\n", 'code': '02'}, 'personal': {'Born': ' (1965-06-15) June 15, 1965 (age53)Arlington, Washington, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Tiia Larsen', 'Children': '2', 'Education': 'Pacific Lutheran University (BA)University of Minnesota (MPA)'}, 'timeline': {"Member of the US House of Representativesfrom Washington's 2nd district": {'date': 'Assumed office January 3, 2001', 'Preceded by': 'Jack Metcalf'}, 'code': '02'}, 'code': 'L000560'}