{"name": "Rick.Crawford", "picture": "C001087.jpg", "detail": {"Early life and education": "Crawford was born at Homestead Air Force Base in Florida, the son of Ruth Anne and Donny J. \"Don\" Crawford. Crawford grew up in a military family; his father served in the United States Air Force. He graduated from Alvirne High School in Hudson, New Hampshire. He enlisted in the Army and served as an explosive ordnance disposal technician for four years, and advanced to the rank of Sergeant. After his service, he attended Arkansas State University in Jonesboro, Arkansas, and graduated in 1996 with a B.S. in Agriculture Business and Economics.", "Radio career": "He has been a news anchor and agri-reporter on KAIT-TV in Jonesboro and farm director on KFIN-FM. He owned and operated the AgWatch Network, a farm news network heard on 39 radio stations in Arkansas, Missouri, Tennessee, Mississippi, and Kentucky.", "US House of Representatives": "Elections 2010Crawford chose to run for Arkansas' 1st congressional district after Democratic U.S. Representative Marion Berry decided to retire. Crawford received the endorsements of Governor Tim Pawlenty of Minnesota, former Arkansas Governor Mike Huckabee, current Governor Asa Hutchinson, and former U.S. Representative Ed Bethune of Arkansas' 2nd congressional district. He won the Republican primary, defeating Princella Smith 72 to 28 percent. He won the general election, defeating Berry's chief of staff Chad Causey 52 to 43 percent.2012Crawford won re-election to a second term by defeating Democratic prosecutor, Scott Ellington, 56 to 39 percent.2014Crawford won re-election to a third term, defeating Heber Springs Mayor Jackie McPherson 63 to 33 percent.2016Crawford won re-election to a fourth term, defeating Libertarian candidate Mark West 76 to 24 percent. Tenure On January 5, 2011, Crawford was sworn into office as a member of the 112th Congress. He is the first Republican to represent his district in Washington since Reconstruction. The last Republican to represent the district was Asa Hodges who vacated the seat on March 3, 1875, during Reconstruction. Crawford is a member of the Republican Study Committee.Crawford voted to repeal U.S. President Barack H. Obama's Patient Protection and Affordable Care Act and to return federal non-security spending to fiscal year 2008 levels.  He also voted to terminate taxpayer financing of presidential election campaigns and party conventions.In 2010, Crawford signed a pledge sponsored by Americans for Prosperity to vote against any global warming legislation that would raise taxes.Crawford supported President Donald Trump's 2017 executive order to impose a ban on travel to the U.S. by citizens of seven Muslim-majority countries, saying that the order was \"designed to keep our nation safer\" although \"Green card holders and aides of the U.S. military should be allowed entry.\"Crawford voted in favor of the Tax Cuts and Jobs Act of 2017, supporting tax reform. He believes that the bill will make it easier for people to file their taxes and that \"the vast majority of middle-income families in my district will get to keep more of their money to use as they wish.\" He also believes that local businesses will hire more and provide pay raises to current employers in the wake of the bill's implementation.Legislation On January 18, 2013, Crawford introduced the Farmers Undertake Environmental Land Stewardship Act (H.R. 311; 113th Congress) into the House. The bill would require the Environmental Protection Agency (EPA) to modify the Spill Prevention, Control, and Countermeasure (SPCC) rule, which regulates oil discharges into navigable waters and adjoining shorelines. The rule requires certain farmers to develop an oil spill prevention plan that is certified by a professional engineer and may require them to make infrastructure changes. According to supporters, this bill would \"ease the burden placed on farmers and ranchers\" by making it easier for smaller farms to self-certify and raising the level of storage capacity under which farms are exempted.Committee assignments Committee on AgricultureSubcommittee on Department Operations, Oversight, and CreditSubcommittee on General Farm Commodities and Risk ManagementSubcommittee on Nutrition and HorticultureCommittee on Transportation and InfrastructureSubcommittee on Economic Development, Public Buildings and Emergency ManagementSubcommittee on Highways and TransitSubcommittee on Water Resources and EnvironmentRepublican Study Committee", "Political positions": "LGBT rights Crawford opposed the landmark Obergefell v. Hodges ruling legalizing same-sex marriage and believes that it should have been decided state-by-state, not by the Supreme Court.", "Personal life": "Crawford and his wife, Stacy, live in Jonesboro with their children. He attends Nettleton Baptist Church, a Southern Baptist congregation in Jonesboro.", "Electoral history": "Arkansas 1st Congressional District Republican primary election, 2010PartyCandidateVotes%RepublicanRick Crawford14,46171.79RepublicanPrincella Smith5,68228.21Arkansas 1st Congressional District Election, 2010PartyCandidateVotes%RepublicanRick Crawford93,22451.79DemocraticChad Causey78,26743.48GreenKen Adler8,3204.62Write-insWrite-ins2050.11Arkansas 1st Congressional District election, 2012PartyCandidateVotes%RepublicanRick Crawford (inc.)138,80056.23DemocraticScott Ellington96,60139.13LibertarianJessica Paxton6,4272.60GreenJacob Holloway5,0152.03Arkansas 1st Congressional District election, 2014PartyCandidateVotes%RepublicanRick Crawford (inc.)124,13963.25DemocraticJackie McPherson63,55532.38LibertarianBrian Scott Willhite8,5624.36", "introduction": "Eric Alan \"Rick\" Crawford (born January 22, 1966) is an American politician who has been the U.S. Representative for Arkansas's 1st congressional district since 2011. He is a member of the Republican Party. Before he was elected to Congress, Crawford was a radio announcer, businessman and a soldier in the United States Army.\n\n", "code": "01"}, "personal": {"Born": "Eric Alan Crawford (1966-01-22) January 22, 1966 (age52)Homestead Base, Florida, U.S.", "Political party": "Republican", "Spouse(s)": "Stacy Crawford", "Children": "2", "Education": "Arkansas State University (BS)"}, "timeline": {"Member of the US House of Representativesfrom Arkansas's 1st district": {"date": "Assumed office January 3, 2011", "Preceded by": "Marion Berry"}, "Military service": {"Allegiance": "United States", "Service/branch": "United States Army", "Years of service": "1985–1989", "Rank": " Sergeant"}, "code": "01"}, "code": "C001087", "type": "4", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.38", "social": "0.47", "leadership": "0.5"}