{'name': 'Rob.Bishop', 'picture': 'B001250.jpg', 'detail': {'Early life, education, and early career': "Bishop was born in Kaysville, Utah and graduated from Davis High School. He served as a Mormon missionary in Germany from 1970 until 1972. Bishop received a bachelor's degree in political science from the University of Utah in Salt Lake City in 1974.  He taught civics classes at Brigham City's Box Elder High School from 1974 to 1980; he next taught German in Ogden, Utah at Ben Lomond High School; then he returned to teaching government and history classes at Box Elder High School until his retirement from teaching in 2002. While a teacher at Box Elder, Bishop partnered with the Close Up Foundation to help students participate in Close Up's Washington, D.C. based civic education programs. He remains actively involved in the program and works to ensure that Utah students have the opportunity to visit Washington, D.C.", 'Early political career': 'Bishop was a member of the Utah House of Representatives from 1978 to 1994.  He was House Majority Leader and later served as Speaker of the House from 1992 until 1994.  After his retirement from the state legislature, Bishop returned to Box Elder High School and taught advanced placement courses while chairing the history department.In 1997 he was elected chairman of the Utah Republican Party, and served for two terms in this position. He has also worked as a legislative lobbyist in Washington.', 'US House of Representatives': 'Elections In 2002, Bishop returned to politics when he ran for the Republican nomination in the 1st District.  22-year incumbent Jim Hansen had recently announced his retirement.  At the state Republican convention, he finished first in the seven-candidate field and went on to face State Representative Kevin Garn in a primary.  He defeated Garn in that primary with 59.8 percent of the vote, all but assuring him of being the next congressman from this heavily Republican district.  As expected, he won the general election with 61% of the vote. He has won re-election in 2004, 2006, 2008, 2010, and 2012 with even larger margins. In 2014, he was reelected with 64% of the vote.Tenure As a teacher, he has made education related issues a top priority. He is a strong advocate for increased local control of schools.  He opposes No Child Left Behind and supports school vouchers. He was also a co-sponsor of a proposed amendment to guarantee a balanced federal budget.[citation needed]In 2016 Bishop led drafting efforts on legislation to address the Puerto Rican government-debt crisis.In the 2016 election cycle, 92.6% of contributions to Bishop\'s political campaign came from outside Utah, the highest out-of-state percentage of any member of the House, with much of the contributions coming from the energy and agribusiness sectors, according to an analysis by the Center for Responsive Politics.Federalism In May 2010 Bishop joined with other conservative House members to launch the 10th Amendment Task Force.  The Task Force aims to educate Congress and the public about the concept of Federalism.[citation needed]In 2010 Bishop introduced to the House an amendment to the United States Constitution, known as the "repeal amendment,"  which would allow a majority vote of the states to overturn any act of the United States Congress.Land use and the environment Bishop supports repeal of the Endangered Species Act of 1973, saying it has been "hijacked" to control land and block economic development, and that he "would love to invalidate" the law. Bishop is among those most critical of the Antiquities Act. Bishop opposed the designation of the Bears Ears National Monument and supports repealing or shrinking the designation. Bishop supports transferring federal public lands to the states.From 2008–2010 Bishop served as Chairman of the Congressional Western Caucus, where he advocated for multiple use of public lands and the need for fewer restrictions and mandates that limit use.[citation needed]As a Member of Congress, Bishop has introduced legislation to increase domestic energy production in the United States, such as the 3-D energy bill. Ever a proponent of Multiple use parks over single use parks, he leveraged his position as Chairman of the Subcommittee over National Parks, Forests and Public Lands to stop the Department of Interior from designating areas as new de facto wilderness areas known as Wild Lands.In February 2011, Bishop introduced a budget amendment that would have defunded the National Landscape Conservation System, which manages 27 million acres of Bureau of Land Management land, including the National Monument, National Conservation Area, National Wilderness Preservation, National Wild and Scenic Rivers, National Scenic Trail, National Historic Trail systems and other systems. After coming under fire for introducing this amendment, Bishop withdrew it.In mid-2011, after touring of the U.S. Mexico border, Bishop supported H.R. 1505 the National Security and Federal Lands Protection Act. This bill gives the U.S. Border Patrol the authority to override specific environmental laws in order to allow the U.S. Border Patrol greater access to some of the most highly trafficked areas along the border. In addition it cedes various wilderness areas to corporations.  U.S. Border Patrol agents have cited that their efforts to address rampant criminal activity along the border have been hampered by environmental laws. The bill passed the House Natural Resources Committee and has not yet been brought before the full U.S. House of Representatives for a vote.Bishop co-sponsored a bill put forth by House Majority whip Kevin McCarthy to remove regulations from 43\xa0million acres (170,000\xa0km2) of Forest Service Roadless Areas and Wilderness Study Areas to multiple use purposes.In 2013, Bishop announced the establishment of the Utah Public Lands Initiative. According to a staff report prepared by the offices of Bishop, Jason Chaffetz, and Chris Stewart, the Utah Public Lands Initiative is a locally driven initiative to bring resolution to some of the most challenging land disputes in the State of Utah.  The initiative is rooted in the belief that conservation and economic development can coexist to make Utah a better place to live, work, and visit.In March 2013, Bishop sponsored the Fruit Height Lands Conveyance Act that would transfer United States Forest Service land, at no cost, to the city of Fruit Heights, Utah. The bill passed in the United States House of Representatives on June 11, 2013.On April 10, 2013, Bishop introduced the Ensuring Public Involvement in the Creation of National Monuments Act. The bill would amend the Antiquities Act of 1906 to subject national monument declarations by the President to the National Environmental Policy Act of 1969 (NEPA). At present, the President of the United States can unilaterally designate areas of federally-owned land as a national monument, whereas national parks and other areas are required to be enacted into law by the United States Congress. In addition to limiting the number of national monument declarations the president could make, the bill would forbid the government from declaring land belonging to a private owner as a national monument without the private owner\'s consent. Bishop argued that "the American people deserve the opportunity to participate in land-use decisions regardless of whether they are made in Congress or by the President". He claims his new bill would ensure "that new national monuments are created openly with consideration of public input".In February 2014 House Natural Resources Committee Chairman Doc Hastings announced that he will retire at the close of the 113th Congress. Bishop, rumored to be a top contender for the Chairmanship, was named to succeed him.In January 2018, Bishop sent a letter to the founder of the clothing brand Patagonia expressing his disappointment that he declined his invitation to appear before the United States House Committee on Natural Resources to discuss the corporation\'s position on President\'s Trump\'s actions related to the Bears Ears National Monument.Committee assignments Committee on Natural Resources - ChairmanSubcommittee on Public Lands and Environmental Regulation (Chairman)House Armed Services CommitteeCaucus memberships Tenth Amendment Task Force (Co-Founder)Second Amendment Task ForceCongressional Lupus CaucusHouse GOP Policy Committee (Vice Chair)Co-founder of the Western States Coalitionpast Chairman of the Congressional Western CaucusTea Party CaucusRepublican Study CommitteeHouse Baltic CaucusCongressional Constitution Caucus (Co-Chair)Congressional Western CaucusUnited States Congressional International Conservation CaucusBishop is the co-founder of the Western State Coalition, a states\' rights organization.[citation needed]', 'Electoral history': "Utah's 1st congressional district: Results 2002–2008YearDemocraticVotesPctRepublicanVotesPct3rd PartyPartyVotesPct3rd PartyPartyVotesPct2002Dave Thomas66,10437%Rob Bishop109,26561%Craig AxfordGreen4,0272%*2004Steven Thompson85,63029%Rob Bishop199,61568%Charles JohnstonConstitution4,5102%Richard W. SoderbergPersonal Choice4,2061%2006Steven Olsen57,92232%Rob Bishop112,54663%Mark HudsonConstitution5,5393%Lynn BadlerLibertarian2,4671%2008Morgan Bowen87,13930.4%Rob Bishop186,03165.0%Kirk D. PearsonConstitution6,8612.4%Joseph G. BuchmanLibertarian6,2872.2%", 'Personal life': 'Bishop is married to Jeralynn Hansen, a former Miss Peach Queen for Brigham City, Utah, where he and his family currently live. They have five children – four sons and one daughter.Well known for his fashionable three piece suits, Bishop was named the third-best-dressed congressmen in 2012 according to the Washingtonian.', 'introduction': "Robert William Bishop (born July 13, 1951) is the U.S. Representative for Utah's 1st congressional district, and Chairman of the House Natural Resources Committee serving since 2003. He is a member of the Republican Party.\n\n", 'code': '01'}, 'personal': {'Born': ' (1951-07-13) July 13, 1951 (age67)Kaysville, Utah, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Jeralynn Hansen', 'Children': '5', 'Education': 'University of Utah (BA)', 'Website': 'House website'}, 'timeline': {'Chair of the House Natural Resources Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Doc Hastings'}, "Member of the US House of Representativesfrom Utah's 1st district": {'date': 'Assumed office January 3, 2003', 'Preceded by': 'James V. Hansen'}, 'Member of the Utah House of Representativesfrom the 2nd district': {'date': 'In office1982–1994', 'Preceded by': 'Stephen Holbrook', 'Succeeded by': 'Peter C. Knudson'}, 'Member of the Utah House of Representativesfrom the 61st district': {'date': 'In office1978–1982', 'Preceded by': 'Willis Hansen', 'Succeeded by': 'Richard Ellertson'}, 'code': '01'}, 'code': 'B001250'}