{"name": "Rob.Portman", "picture": "P000449.jpg", "detail": {"Heritage and early life": "Portman was born in 1955, in Cincinnati, Ohio, the son of Joan (née Jones) and entrepreneur William C. \"Bill\" Portman II. Portman was raised in a Presbyterian family. His great-grandfather on his father's side, surnamed \"Portmann\", immigrated from Switzerland; Portman also has Scots Irish, English, and German ancestry.In 1926, Portman's grandfather Robert Jones purchased the Golden Lamb Inn in Lebanon, Ohio, and, together with his future wife, Virginia Kunkle Jones, whom he married two years later, refurbished it, and decorated it with antique collectibles and Shaker furniture. The couple ran the inn together until 1969, when they retired and leased the Golden Lamb to the Comisar family, owners of the now defunct five-star Maisonette restaurant.When Rob was young, his father borrowed money to start the Portman Equipment Company, a forklift dealership where he and his siblings all worked growing up. The company grew from a small business with five employees to one that employed over 300 people. According to a 2010 Weekly Standard profile, Portman \"developed a political philosophy grounded in entrepreneurship,\" as a result of his experiences growing up at a time when his father was starting his own company, and hearing conversations at home \"about regulations, and taxes, and government getting in the way of small business\". It was from his mother Joan, a liberal Republican, that Portman inherited his political sympathy for the Republican Party.", "Education and early career": "Portman graduated from Cincinnati Country Day School in 1974, where he had served as treasurer of his class, enjoyed playing baseball, and developed an interest in politics, later telling the National Review, \"[In high school,] I wasn't a Democrat or a Republican. No one in my family had ever been in politics. My dad thought it was something that got in the way.\" He went on to attend Dartmouth College, where he started leaning to the right, and majored in anthropology and earned a Bachelor of Arts (B.A.) in 1978. At Dartmouth, he was a member of the Ledyard Canoe Club, and went on several kayaking and canoeing expeditions around the world. He spent summers throughout college in the American West, on cattle farms and ranches, tending to livestock, riding horses, and assisting in related chores. In Cincinnati, Portman worked on Bill Gradison's Congressional campaign, and Gradison soon became a mentor to Portman. Portman next entered the University of Michigan Law School, earning his Juris Doctor (J.D.) degree in 1984 and serving as vice president of the student senate. During law school, Portman embarked on a kayaking and hiking trip across China, and, not long before, blind dated a young Democratic volunteer, Jane Dudley, whom he married in 1986, as stated under \"Personal Life\" below. Dudley's aunt and uncle lived in Cincinnati and were friends with Portman's parents. Dudley embarked on a hiking trip with her aunt in the Himalayas, and took part in the date with Portman following her aunt's advice. Dudley had become interested in politics by working for a family friend who was running for the state legislature in North Carolina. She majored in political science at Vanderbilt University, and wanted to work on Capitol Hill. She then worked in a U.S. Senate campaign in 1984 for Jim Hunt who was governor of North Carolina. After graduating from law school, Portman moved to Washington, D.C., where he worked for the law firm Patton Boggs. Portman next became an associate at Graydon Head & Ritchie law firm in Cincinnati.Early appointments and return to Ohio In 1989, Portman began his career in government as an associate White House Counsel under President George H. W. Bush. From 1989 to 1991, Portman served as George H. W. Bush's deputy assistant and director of the White House Office of Legislative Affairs. While serving as White House counsel under George H.W. Bush, Portman visited China, Egypt, Kuwait, Saudi Arabia and the United Arab Emirates.In September 1996, after his return to Ohio and after a 16-year-old named Jeff Gardner died from huffing gasoline, Portman founded the Coalition for a Drug-Free Greater Cincinnati. Portman wrote of the effort: .mw-parser-output .templatequote{overflow:hidden;margin:1em 0;padding:0 40px}.mw-parser-output .templatequote .templatequotecite{line-height:1.5em;text-align:left;padding-left:1.6em;margin-top:0}I decided we could not afford to wait for another tragedy to prompt us to action. Over the last year and a half, I have spearheaded an effort to establish the Coalition for a Drug-Free Greater Cincinnati. [...] It's a serious, long-term initiative that brings together for the first time community activists already involved in the antidrug effort, key business figures, religious leaders, the media, parents, young people, law enforcement officials, and others. Our aim is to develop and implement a comprehensive, community-based strategy to reduce drug abuse in our region. The coalition advances \"a comprehensive effort to address youth substance abuse.\"", "United States Representative: 1993–2005": "Congressional elections In 1993, Portman entered a special election to fill the seat of Congressman Bill Gradison of Ohio's second congressional district, who had stepped down to become president of the Health Insurance Association of America. In the Republican primary, Portman faced six-term Congressman Bob McEwen, who had lost his Sixth District seat to Ted Strickland in November 1992; real estate developer Jay Buchert, president of the National Association of Home Builders; and several lesser known candidates.Primary election In the primary, Portman was criticized for his previous law firm's work for Haitian president Baby Doc Duvalier.  Buchert ran campaign commercials labeling Portman and McEwen \"Prince Rob and Bouncing Bob.\"  Portman lost four of the district's five counties. However, he won the largest, Hamilton County, his home county and home to 57% of the district's population. Largely on the strength of his victory in Hamilton, Portman took 17,531 votes (36%) overall, making him the overall winner.General elections In the general election, Portman defeated his Democratic opponent, attorney Lee Hornberger by 53,020 (70%) to 22,652 (29%).Portman was re-elected in 1994, 1996, 1998, 2000, 2002, and 2004, defeating Democrats Les Mann, Thomas R. Chandler, and then Waynesville mayor Charles W. Sanders four times in a row.House legislative career As of 2004, Portman had a lifetime rating of 89 from the American Conservative Union, and ranked 5th among Ohio's 18 House members.One of Portman's first votes in Congress was for the North American Free Trade Agreement on November 17, 1993.During his tenure in Congress, Portman authored or co-authored over a dozen bills that became law, including legislation to reform the Internal Revenue Service, curb unfunded mandates, and expand pensions. Portman also co-authored legislation to swap Costa Rica's debt for the preservation of tropical forests. He published an article called \"Addicted to Failure\" in the congressional Policy Review in autumn 1996. In the article, Portman writes:  President Clinton hurt the antidrug effort by cutting the Office of National Drug Control policy from 147 to 25 full-time positions, by hiring a surgeon general who advocated legalization of drugs, by cutting funding for interdiction efforts, and by sending confusing messages about the stigma of illegal drug use. It is no surprise, then, that after dramatic reductions in drug use during the decade before Clinton took office, drug use has nearly doubled among teenagers during his administration. [...] The public rightly expects the federal government to do something about drug abuse, which diminishes and threatens the lives of so many of our young people. And the federal government clearly has an important role in combating drug abuse: protecting our borders and interdicting drugs from other countries, strengthening our federal criminal-justice system, and providing federal assistance for the best prevention and treatment programs. [...] Despite a significant federal effort, however, our country is still seeing dramatic increases in drug use among our teenagers. In the last two years alone, use of drugs has increased 50 percent. We need a new approach.Of Portman's work on the Internal Revenue Service Restructuring and Reform Act of 1998, Pete Sepp of the National Taxpayers Union said, \"He set a professional work environment that rose above partisanship and ultimately gave taxpayers more rights.\" Democratic Representative Stephanie Tubbs Jones from Cleveland said Portman, \"compared to other Republicans, is pleasant and good to work with.\" Additionally, during the first four years of the Bush Administration, Portman served as a liaison between Congressional Republicans and the White House. Portman voted for the Iraq War Resolution in 2002. Portman was known for his willingness to work with Democrats to ensure that important legislation was enacted.Portman has said that his proudest moments as a U.S. Representative were \"when we passed the balanced budget agreement and the welfare reform bill.\" As a congressman, Portman traveled to Argentina, Chile, Costa Rica, the Czech Republic, Egypt, Iraq, Israel, Jordan, Kuwait and Mexico. During his time in the House, Portman began assisting prominent Republican candidates prepare for debates by standing in for their opponents in practice debates. He has taken on the role of Lamar Alexander (for Bob Dole in 1996), Al Gore (for George W. Bush in 2000), Hillary Clinton (for Rick Lazio in 2000), Joe Lieberman (for Dick Cheney in 2000), John Edwards (for Cheney in 2004), and Barack Obama (for John McCain in 2008 and Mitt Romney in 2012). His portrayals mimic not only the person's point of view but also their mannerisms, noting for instance that he listened to Obama's audiobook reading to study his pattern of speech.", "White House appointments: 2005–2007": "United States Trade Representative Portman spoke on March 17, 2005 at the White House during a ceremony at which President George W. Bush nominated him to be United States Trade Representative, calling Portman \"a good friend, a decent man, and a skilled negotiator.\" Portman was confirmed on April 29, and sworn in on May 17, 2005.Portman sponsored an unfair-trading claim to the World Trade Organization against Airbus because American allies in the European Union were providing subsidies that arguably helped Airbus compete against Boeing. European officials countered that Boeing received unfair subsidies from the United States, and the WTO ruled separately that they each received unfair government assistance.Portman spent significant time out of the United States negotiating trade agreements with roughly 30 countries, visiting Brazil, Burkina Faso, China, France, Hong Kong, India, Mexico, South Korea, Switzerland and the United Kingdom. During his tenure, Portman also helped to win passage of the Central American Free Trade Agreement. Portman utilized a network of former House colleagues to get support for the treaty to lift trade barriers between the United States and Costa Rica, the Dominican Republic, El Salvador, Nicaragua, Guatemala, and Honduras. According to The Hill, Portman took his wife, Jane, with him to the Capitol on their wedding anniversary so he could work on the deal.Hong Kong and trade suit As the United States' Trade Representative, Portman was an attendant of the World Trade Organization's Hong Kong conference in 2005. He addressed the conference with a speech on development in Doha, and advocated a 60% cut in targeted worldwide agricultural subsidies by 2010. Portman then sponsored a claim against China for extra charges it levied on American auto parts. U.S. steel manufacturers subsequently beseeched the White House to halt an influx of Chinese steel pipe used to make plumbing and fence materials. This was a recurring complaint and the United States International Trade Commission recommended imposing import quotas, noting \"the economic threat to the domestic pipe industry from the Chinese surge.\" With Portman as his top trade advisor, Bush replied that quotas were not part of U.S. economic interest. He reasoned the American homebuilding industry used the pipe and wanted to maintain a cheap supply and that other cheap exporters would step in to fill China's void if Chinese exports were curtailed. This occurred at a time when the U.S. steel industry lost $150 million in profit between 2005 and 2007, although China's minister of commerce cited the U.S. industry's \"record high profit margins\" in the first half of 2004 and continued growth in 2005. China next lobbied Portman to leave matters alone, meeting with his office twice and threatening in a letter that restrictions and what it called \"discrimination against Chinese products\" would bring a \"serious adverse impact\" to the U.S.-China economic and trade relationship. Portman vowed to \"hold [China's] feet to the fire\" and provide a \"top-to-bottom review\" of the U.S.–China trade relationship. Portman's claim that China had improperly favored domestic auto parts became the first successful trade suit against China in the World Trade Organization. During Portman's tenure as trade ambassador, the U.S. trade deficit with China increased by 21 percent.Director of the Office of Management and Budget On April 18, 2006, President George W. Bush nominated Portman to be the Director of the Office of Management and Budget, replacing Joshua Bolten, who was appointed White House Chief of Staff. Portman said at the time that he looked forward to the responsibility, \"It's a big job. The Office of Management and Budget touches every spending and policy decision in the federal government,\" while President Bush expressed his confidence in the nominee, \"The job of OMB director is a really important post and Rob Portman is the right man to take it on. Rob's talent, expertise and record of success are well known within my administration and on Capitol Hill.\" He was confirmed by the U.S. Senate unanimously by voice vote on May 26, 2006.As OMB director from May 2006 to August 2007, Portman helped to craft a $2.9 trillion budget for fiscal year 2008. The Cincinnati Enquirer wrote that \"The plan called for making the 2001 and 2003 tax cuts permanent, at a cost of more than $500 billion over the five-year life of the proposal. It requested a hefty increase in military spending, along with reductions in low-income housing assistance, environmental initiatives, and health care safety-net programs.\" Portman is said to have been \"frustrated\" with the post, calling the budget that President Bush's office sent to Congress, \"not my budget, his budget,\" and saying, \"it was a fight, internally.\" Edward Lazear of President Bush's Council of Economic Advisers said that Portman was the leading advocate for a balanced budget, while other former Bush administration officials said that Portman was the leading advocate for fiscal discipline, within the administration.On June 19, 2007, Portman resigned his position of OMB director, citing a desire to spend more time with his family and three children. Democratic Chairman of the Senate Budget Committee Kent Conrad expressed regret at Portman's resignation, saying, \"He is a person of credibility and decency that commanded respect on both sides of the aisle.\"", "Post-White House career": "On November 8, 2007, Portman joined the law firm of Squire Sanders as part of the firm's transactional and international trade practice in Cincinnati, Ohio. His longtime chief of staff, Rob Lehman, also joined the firm as a lobbyist in their Washington, D.C. office. In 2007, Portman founded Ohio's Future P.A.C., a political action committee dedicated to ensuring \"the critical policy issues important to Ohioans remain at the forefront of Ohio's political agenda.\" In 2008, Portman was cited as a potential running mate for Republican presidential candidate John McCain. Portman remained critical of the American Recovery and Reinvestment Act of 2009, passed while he was out of office.", "United States Senator: 2011–present": "2010 election On January 14, 2009, two days after George Voinovich announced he would not be running for re-election, Portman publicly declared his candidacy for the open U.S. Senate seat. Running unopposed in the Republican primary, Portman benefitted substantially from Tea Party support, and by July 2010 had raised more campaign funds than Democrat Lee Fisher by a 9 to 1 margin. Portman campaigned on the issue of jobs and job growth. He toured Ohio in a large RV, meeting with voters and reporters between events.Of all candidates for public office in the U.S., Portman was the top recipient of corporate money from insurance industries and commercial banks in 2010. Portman possessed the most campaign funds of any Republican during 2010, at $5.1 million, raising $1.3 million in his third quarter of fundraising.Portman won the election with a margin of 57 to 39 percent, winning 82 of Ohio's 88 counties. In a 2010 campaign advertisement, Portman said a \"[ cap-and-trade bill] could cost Ohio 100,000 jobs we cannot afford to lose;\" subsequently, The Cleveland Plain Dealer and PolitiFact called Portman's claim \"barely true\" with the most pessimistic estimates.2016 election The 2016 re-election campaign posed several special challenges to Portman and his team—it would be run in heavily targeted Ohio, it would occur in a presidential year when Democratic turnout was expected to peak, and both parties would bombard Buckeye State voters with tens of millions of dollars in TV, cable and digital ads for the national, senatorial and downticket contests. For his manager, Portman chose Corry Bliss, who had just run the successful re-election of Sen. Pat Roberts in Kansas. Portman and Bliss chose to run what Time magazine called \"a hyperlocal campaign without betting on the nominee's coattails.\"As Real Clear Politics noted, Portman faced \"the thorny challenge of keeping distance from Trump in a state Trump [was] poised to win. Portman, in the year of the outsider, [was] even more of an insider than Clinton . . . Yet he [ran] a local campaign focused on issues like human trafficking and opioid addiction, and secured the endorsement of the Teamsters as well as other unions\" (despite being a mostly conservative Republican).Polls showed the race even (or Portman slightly behind) as of June 2016; afterwards, Portman led Democratic ex-Gov. Ted Strickland in every public survey through Election Day. The final result was 58.0% to 37.2%, nearly a 21-point margin for Portman.Chris Cillizza of the Washington Post argued that the context of Ohio's result had wider implications. \"There are a lot of reasons Republicans held the Senate this fall. But Portman's candidacy in Ohio is the most important one. Portman took a seemingly competitive race in a swing state and put it out of reach by Labor Day, allowing money that was ticketed for his state to be in other races, such as North Carolina and Missouri . . .\"The Washington Post said \"Portman took the crown for best campaign\", while Real Clear Politics said, \"Sen. Rob Portman ran the campaign of the year.\". Portman himself was generous in praising his campaign manager: \"\"With an emphasis on utilizing data, grassroots, and technology, Corry led our campaign from behind in the polls to a 21-point victory. He's one of the best strategists in the country.\"Tenure events In the 112th Congress, Portman voted with his party 90% of the time. However, in the 114th United States Congress, Portman was ranked as the third most bipartisan member of the U.S. Senate by the Bipartisan Index, a metric created jointly by The Lugar Center and the McCourt School of Public Policy to reflect Congressional bipartisanship. During the first session of the 115th Congress, Portman's bipartisanship score improved further, propelling him to second in the Senate rankings (only Senator Susan Collins scoring higher), Portman's intellectual leadership among the Senate G.O.P., and his fundraising capabilities, led to his being named the Vice Chairman for Finance of the National Republican Senatorial Committee for the 2014 election cycle.  In March 2013, Portman was one of several Republican senators invited to have dinner with President Obama at The Jefferson Hotel in an attempt by the administration to court perceived moderate members of the upper chamber for building consensual motivation in Congress; however, Portman did not attend and instead had dinner with an unnamed Democratic senator.Portman delivered the eulogy at the August 2012 funeral of Neil Armstrong, and the commencement address at the University of Cincinnati's December 2012 graduation ceremony.In August 2011, Portman was selected by Minority Leader Mitch McConnell to participate in the United States Congress Joint Select Committee on Deficit Reduction. During the committee's work, Portman developed strong relationships with the other members, especially Sen. John Kerry and Rep. Chris Van Hollen. The committee was ultimately unsuccessful, with Portman left disappointed, saying \"I am very sad about this process not succeeding because it was a unique opportunity to both address the fiscal crisis and give the economy a shot in the arm.\"Portman spoke at the May 7, 2011 Michigan Law School commencement ceremonies, which was the subject of criticism by some who opposed his stance on same-sex marriage.  He and his wife walked in the 50th anniversary march over the Edmund Pettus Bridge commemorating Bloody Sunday and the March on Selma.Committee assignments United States Senate Committee on FinanceSubcommittee on Health CareSubcommittee on Taxation and IRS Oversight (Chairman)Subcommittee on Social Security, Pensions, and Family PolicyUnited States Senate Committee on Energy and Natural ResourcesSubcommittee on EnergySubcommittee on National ParksSubcommittee on Water and PowerUnited States Senate Committee on Homeland Security and Governmental AffairsPermanent Subcommittee on Investigations (Chairman)Subcommittee on Regulatory Affairs and Federal ManagementUnited States Senate Committee on Foreign RelationsSubcommittee on Europe and Regional Security CooperationSubcommittee on Near East, South Asia, Central Asia, and Counter-TerrorismSubcommittee on State Department and USAID Management, International Operations, and Bilateral International DevelopmentSubcommittee on Multilateral Development, Multilateral Institutions, and International Economic, Energy, and Monetary PolicyCaucus memberships Portman belongs to the following caucuses in the United States Senate:Congressional Serbian American CaucusInternational Conservation Caucus (Co-Chair)Sportsmen's CaucusSenate Ukraine Caucus (Co-Chair)", "Political positions": "Senator Rob Portman is sometimes considered to be a more moderate Republican. GovTrack places Portman toward the center of the Senate's ideological spectrum; according to GovTrack's analysis, Portman is the third most moderate Republican in 2017 being to the right of Susan Collins and Lisa Murkowski but to the left of his other Republican colleagues. The American Conservative Union gives Portman a lifetime 80% conservative grade. The progressive Americans for Democratic Action gave Portman a 25% liberal quotient in 2014. The non-partisan National Journal gave Senator Portman a 2013 composite ideology score of 71% conservative and 29% liberal.According to Five ThirtyEight, which tracks Congressional records, their analysis found that Senator Portman voted in line with President Trump's position on legislation 93.3% of the time as of July 2018. CQ RollCall, which also tracks voting records, found that Portman voted with President Obama's positions on legislation 59.5% of the time in 2011. Portman was one of five Senate Republicans who voted with President Obama's position more than half the time.Fiscal policy Portman is a leading advocate for a balanced budget amendment. Portman worked with Democratic Senator Jon Tester in 2012 to end the practice of government shutdowns and partnered with Democratic Senator Claire McCaskill on an inquiry into the Obama administration's public relations spending.  Portman has proposed \"a balanced approach to the deficit\" by reforming entitlement programs, writing \"[r]eforms should not merely squeeze health beneficiaries or providers but should rather reshape key aspects of these programs to make them more efficient, flexible and consumer-oriented.\"  Portman became known for his ability to work in a bipartisan fashion when working to pass a repeal of the excise tax on telephone service.  He also unsuccessfully proposed an amendment to the surface transportation reauthorization bill to allow states to keep the gas tax money they collect, instead of sending it to Washington with some returned later.Foreign policy Portman has repeatedly supported legislation to treat currency manipulation by countries as an unfair trade practice and to impose duties on Chinese imports if China does not stop the practice.  Portman opposes the Trans Pacific Partnership trade agreement in its current form because he said it does not address currency manipulation and includes less-strict country-of-origin rules for auto parts.  In April 2015, Portman co-sponsored an amendment to Trade Promotion Authority legislation which would require the administration to seek enforceable rules to prevent currency manipulation by trade partners as part of the Trans-Pacific Partnership.  While in the Senate, Portman has visited Afghanistan twice, Germany, India, Israel, Italy, Jordan, South Korea and the United Arab Emirates; additionally, he met with Israeli Prime Minister Benjamin Netanyahu.A bill by Portman that would allow construction of a memorial to Peace Corps volunteers in the nation's capital was approved by the House of Representatives in January 2014 in a 387 to 7 vote. No public money will be spent on the memorial.Portman opposes the Law of the Sea Treaty and released a joint statement with Kelly Ayotte of New Hampshire, stating: Proponents of the Law of the Sea treaty aspire to admirable goals, including codifying the U.S. Navy's navigational rights and defining American economic interests in valuable offshore resources. But the treaty's terms reach well beyond those good intentions. [...] The terms of the treaty are not only expansive, but often ill-defined. [And as] Justice John Paul Stevens noted in a concurring opinion in Medellin v. Texas, the Law of the Sea treaty appears to \"incorporate international judgments into domestic law\" because it expressly provides that decisions of the tribunal \"'shall be enforceable in the territories of the States Parties in the same manner as judgments or orders of the highest court of the State Party in whose territory the enforcement is sought.'\" [T]he treaty equates tribunal decisions with decisions of the U.S. Supreme Court. This means that private litigants will likely be able to invoke tribunal judgments as enforceable in U.S. courts—against the government and possibly against U.S. businesses.Portman supported free trade agreements with Central America, Australia, Chile and Singapore, voted against withdrawing from the World Trade Organization, and was hailed by Bush for his \"great record as a champion of free and fair trade.\"In March 2016, Portman authored the bipartisan bill the Countering Foreign Propaganda and Disinformation Act, along with Democratic Senator Chris Murphy. Congressman Adam Kinzinger introduced the U.S. House version of the bill. After the 2016 U.S. presidential election, worries grew that Russian propaganda spread and organized by the Russian government swayed the outcome of the election, and representatives in the U.S. Congress took action to safeguard the National security of the United States by advancing legislation to monitor incoming propaganda from external threats. On November 30, 2016, legislators approved a measure within the National Defense Authorization Act to ask the U.S. State Department to take action against foreign propaganda through an interagency panel. The legislation authorized funding of $160 million over a two-year-period. The initiative was developed through the Countering Foreign Propaganda and Disinformation Act.Interior policy In 2011, Portman voted to limit the government's ability to regulate greenhouse gas emissions, and in 2015, he voted against the Clean Power Plan. In 2013, he voted for a point of order opposing a carbon tax or a fee on carbon emissions.In July 2012, Portman remarked in a speech delivered on the Senate floor:We've got to produce more [oil], we've got to produce it here at home to get away from the OPEC cartel. [...] I come from Ohio [and] we have a tradition of producing oil and gas. [...] We kind of got away from it [but] we're back in the business thanks to the shale finds. It's the Marcellus Shale, it's the Utica Shale, it's natural gas, but it's also oil and what they call wet gas. [...] People are really excited about this.During a radio interview with Fox News Radio in 2012, Portman said: \"The president [Obama] says, you know, 'we're doing more.' Well, on public lands, we're doing less. Last year, we produced 14 percent less oil on public lands than we did the year before. We should be doing more on public lands, and that's the outer continental shelf and what's going on in Alaska and so on.\" Portman supports development of the Keystone XL pipeline, stating \"The arguments when you line them up are too strong not to do this. I do think that at the end of the day the president [Obama] is going to go ahead with this.\"Portman has expressed concern about the slow pace of approving loan guarantees for developing nuclear power facilities by the Department of Energy during the Obama administration.  Portman would later co-sponsor an amendment to the 2017 Energy Bill that specifies climate change is real and human activity contributes to the problem.On June 27, 2013, Portman co-sponsored the Harmful Algal Bloom and Hypoxia Research and Control Amendments Act of 2013 (S. 1254; 113th Congress), a bill that would reauthorize and modify the Harmful Algal Bloom and Hypoxia Research and Control Act of 1998 and would authorize the appropriation of $20.5 million annually through 2018 for the National Oceanic and Atmospheric Administration (NOAA) to mitigate the harmful effects of algal blooms and hypoxia. Portman said that \"this legislation takes critical steps toward protecting Lake Erie and grand Lake St. Marys from harmful algae that has become a tremendous problem for our state... we cannot afford to let this threat to our tourism, fishing industries, and health go unchecked.\"Portman introduced the World War II Memorial Prayer Act of 2013 (S. 1044; 113th Congress), a bill that would direct the United States Secretary of the Interior to install at the World War II memorial in the District of Columbia a suitable plaque or an inscription with the words that President Franklin D. Roosevelt prayed with the United States on June 6, 1944, the morning of D-Day. Portman argued that Roosevelt's \"word brought strength and comfort to many during one of the most challenging times for our nation... We should not underestimate the power of prayer through difficult times.\"Gun laws Portman has an \"A\" rating from the National Rifle Association (NRA) for his support of the 2nd amendment. The NRA has endorsed Portman in past elections. As of 2017, Portman has received $3,061,941 in donations from the NRA.Judiciary In September 2018, Portman stated he would support Brett Kavanaugh's nomination to the Supreme Court, stating \"The Brett Kavanaugh I know is a man of integrity and humility\" and did not call for an investigation by the FBI for sexual assault allegations.National security Portman opposed President Donald Trump's 2017 executive order to temporarily curtail Muslim immigration until better screening methods are devised. He stated that the executive order was not \"properly vetted\" and that he supported the federal judges who blocked the order's implementation.Social policy Portman is a staunch opponent of the Affordable Care Act and has called for it to be repealed and replaced. In 2017, Portman opposed the AHCA, the healthcare bill passed by the House. He opposed steep cuts to Medicaid because the expansion of the program had allowed some Ohioans to gain coverage, including some impacted by Ohio's opioid crisis. However, as a member of a group of 13 Republican Senators tasked with writing a Senate version of the AHCA, he subsequently supported proposed cuts to Medicaid that would be phased in over seven years.In July 2017, Portman joined six other Republicans who broke with their party to vote with every Democrat against repealing Obamacare without a replacement. However, Portman voted in favor of the 'Skinny' repeal of Obamacare.In February 2014, Portman voted against reauthorizing long-term unemployment benefits to 1.7 million jobless Americans.  He expressed concern with the inclusion of a provision in the bill which would allow companies to make smaller contributions to employee pension funds.  Portman voted in April 2014 to extend federal funding for unemployment benefits.  Federal funding had been initiated in 2008 and expired at the end of 2013.In April 2014, the United States Senate debated the Minimum Wage Fairness Act (S. 1737; 113th Congress). The bill would amend the Fair Labor Standards Act of 1938 (FLSA) to increase the federal minimum wage for employees to $10.10 per hour over the course of a two-year period. The bill was strongly supported by President Barack Obama and many of the Democratic Senators, but strongly opposed by Republicans in the Senate and House. Portman opposed the bill, arguing that Ohio already had a higher minimum wage than the federal minimum wage, indicating that the states should be able to make their own decisions.In March 2015, Portman voted for an amendment to establish a deficit-neutral reserve fund to allow employees to earn paid sick time.Portman supports making it more difficult for non-parental adults to help minors bypass state abortion laws. On January 24, 2013, Portman sponsored a bill that would make it a federal crime to transport a minor across state lines for an abortion if it would circumvent a state law requiring parental involvement.On March 14, 2013, Portman announced that he had changed his stance on gay marriage, and now is in support of its legalization. The change came two years after his son Will came out to Portman and his wife as gay in 2011; Portman says in the March 2013 CNN interview that \"I'm announcing today a change of heart [for] gay marriage.\" Prior to this revelation, Portman was noted as having a voting record that was strongly opposed to gay rights, consistent with statements he had made on the subject. Portman co-sponsored the Defense of Marriage Act, passed in 1996, defining marriage as one man and one woman, and in 1999 he voted for a measure prohibiting same-sex couples in Washington, D.C., from adopting children. The Human Rights Campaign (HRC), which supports same-sex marriage and gay rights, gave Portman an 85% score in 2016 and a 45% in 2014; the HRC also gives Portman a 100% rating for sharing their position on marriage equality. Log Cabin Republicans, a Republican PAC which supports gay rights, endorsed Portman.In November 2013, Portman was one of ten Republican senators to vote in favor of the Employment Non-Discrimination Act (ENDA), after the Senate adopted an amendment proposed by him to expand the religious protections.Portman voted for reauthorization of the Violence Against Women Act in 2013. Despite his support for the Violence Against Women act, Portman has gone out of his way to support members of the GOP accused of violently assaulting women such as Donald Trump.He wrote about a proposed amendment to the Violence Against Women Reauthorization Act of 2013 which would seek to terminate human sex trafficking, writing:Our idea is to bring Republicans and Democrats together in this fight to respect and protect human dignity. [...] When it comes to human trafficking at home or abroad, our government's policy must be one of zero tolerance. It is an issue with special meaning for me. I grew up with my mom's stories about her great-grandparents, Quaker abolitionists who lived on a farm north of Dayton and helped slaves seek their freedom by way of the Underground Railroad. In fact, the National Underground Railroad Freedom Center, located on the banks of the Ohio River in Cincinnati, is home to a permanent exhibit on human trafficking. [...] A few years ago, the Ohio Trafficking in Persons Study Commission estimated that more than 1,000 Ohio youth are victims of sex trafficking every year, and that many more are at risk.On abortion, Portman describes himself as pro-life. He voted in favor of banning abortion after 20 weeks of pregnancy. Portman does support legal access to abortion in cases of rape and incest or if the woman's life is in danger. National Right to Life Committee and the Campaign for Working Families, both pro-life PACs, gave Portman a 100% rating in 2018; NARAL Pro-Choice America gives him a 0%, Planned Parenthood, which is pro-choice, gives him a lifetime 4% rating, and Population Connection, another pro-choice PAC, gave Portman an 11% rating in 2002.2012 presidential election Portman was considered a possible pick for Vice President on the Republican presidential ticket in 2012.Many national publications speculated on Portman becoming the vice presidential nominee soon after Romney became the presumptive nominee. In \"Why Rob Portman Will Be Romney's Vice Presidential Nominee,\" an article in The Atlantic, acclaimed syndicated journalist Major Garrett authored \"In the frenzied environment that will accompany the prelude to Romney's pick, the Portman choice may land with a thud on the charisma meter, but it won't set in motion a wave of \"guess what\" stories and will allow Romney to focus on the campaign, not thorny revelations that must be ritualistically turned into an us-against-them media meme. In fact, Portman might actually talk Boston out of its hypertensive and allergic reactions to reporters.\"Closer to the time of a selection, news agencies began highlighting Portman's perceived strengths and weaknesses. Chris Cillizza of The Washington Post wrote \"[Portman]'s spent time in both the executive and legislative branches and everywhere he's served he's won kudos for his abilities. It's hard to imagine that even his staunchest Democratic opponents would be able to argue that Portman wouldn't be up to the task of being vice president or even president.\"After the selection of Paul Ryan, Portman spoke at the 2012 Republican National Convention about trade and his family business. On trade agreements, Portman stated: \"President Obama is the first president in 75 years-Democrat or Republican-who hasn't even sought the ability to negotiate export agreements and open markets overseas. Now why is this important? Because 95 percent of the world's consumers live outside our borders. And to create jobs, our workers and our farmers need to sell more of what we make to those people.\" On October 13, 2012 Mitt Romney spoke at and toured the Golden Lamb Inn.Constructive conservatism Portman outlined his new conservative vision for government in early May 2014.  He coined the term \"constructive conservatism\" as an approach to tackling poverty which is more focused on targeted, results-oriented measures.  He pointed to his efforts to prevent recidivism, help vulnerable children by preventing human trafficking, and provide worker retraining programs as examples of this approach.Speculation on 2016 presidential campaign In March 2014, Larry Sabato of the University of Virginia Center for Politics speculated that Portman might run for president in 2016.  Sabato forecasted:  \"[Portman] might have an edge in 2016. Americans tire of their incumbent presidents, and often choose a very different successor with dissimilar characteristics. Portman is all steak and no sizzle.\" In October 2014, students from the College of William and Mary formed the Draft Rob Portman PAC to encourage Portman to run for president in 2016. However, Portman announced in December 2014 that he would not run for president and would instead seek a second term in the United States Senate.", "Electoral history": "Ohio's 2nd congressional district: Results 1994–2004YearDemocraticVotesPctRepublicanVotesPct3rd PartyPartyVotesPct1994Les Mann43,73023%Rob Portman150,12877%1996Thomas R. Chandler58,71523%Rob Portman186,85372%Kathleen M. McKnightNatural Law13,9055%1998Charles W. Sanders49,29324%Rob Portman154,34476%2000Charles W. Sanders64,09123%Rob Portman204,18474%Robert E. BidwellLibertarian9,2663%2002Charles W. Sanders48,78526%Rob Portman139,21874%*2004Charles W. Sanders89,59828%Rob Portman **227,10272%**Write-in and minor candidate notes: In 2002, James Condit, Jr. received 13 votes. In 2004, James Condit, Jr. received 60 votes.**Portman resigned his term early to serve as U.S. Trade Representative.U.S. Senate (Class III) elections in Ohio: Results 2010–2016YearDemocraticVotesPctRepublicanVotesPct3rd PartyPartyVotesPct2010Lee Fisher1,448,09239%Rob Portman2,125,81057%Eric DeatonMichael PryceDaniel LaBotzArthur SullivanConstitutionIndependentSocialistWrite-in65,85650,10126,4546482%1%1%0%2016Ted Strickland1,929,87337%Rob Portman3,048,46758%Tom ConnorsJoseph R. DeMareScott RupertIndependentGreenIndependent89,97784,52174,6822%2%1%", "Personal life": "Portman married Jane Dudley in July 1986. Dudley, who previously worked for Democratic Congressman Tom Daschle, \"agreed to become a Republican when her husband agreed to become a Methodist.\" The Portmans attend church services at Hyde Park Community United Methodist Church. Jane Portman has served on the board of the Cincinnati Children's Hospital Medical Center for 7 years and has driven a route for Meals on Wheels for 12 years. The Portmans have three children: Joseph Dudley \"Jed\" Portman, William Dudley \"Will\" Portman, and Sarah Dudley \"Sally\" Portman. Portman still owns the Golden Lamb Inn with his brother Wym Portman and sister Ginna Portman Amis. In 2004, a Dutch conglomerate purchased the Portman Equipment Company. Portman had researched the firm's local acquisitions, stating \"It's a concept I've heard described as 'Glocalism.' All these companies are trying to achieve economies of scale. This lets us develop a network and coverage globally. But you can still have the local spirit, the local name and the customer intimacy to accomplish great things.\" A July 2012 article about Portman stated that in 40 years, his only citation has been a traffic ticket for an improper turn while driving. Portman is an avid kayaker, is fluent in Spanish, and enjoys bike rides.In December 2004, Portman and Cheryl Bauer published a book on the 19th century Shaker community at Union Village, in Turtlecreek Township, Warren County, Ohio. The book was titled Wisdom's Paradise: The Forgotten Shakers of Union Village.", "Notes": "Michael Barone and Grant Ujifusa. The Almanac of American Politics, 1994. Washington, D.C.: National Journal, 1993. .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png\")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em}ISBN 0-89234-058-4Michael Barone and Grant Ujifusa. The Almanac of American Politics, 1998. Washington, D.C.: National Journal, 1997. ISBN 0-89234-080-0Michael Barone, Richard E. Cohen, and Grant Ujifusa. The Almanac of American Politics, 2002. Washington, D.C.: National Journal, 2001. ISBN 0-89234-099-1Congressional Quarterly. Congressional Quarterly Almanac, 49th edition, 103rd Congress, 1st Session, 1993. Washington, D.C.: Congressional Quarterly, 1994. ISBN 1-56802-020-1.Congressional Quarterly. Politics in America, 1992: The 102nd Congress. Washington, D.C.: CQ Press, 1991. ISBN 0-87187-599-3", "introduction": "Robert Jones Portman (born December 19, 1955) is an American attorney, serving as the junior United States Senator for Ohio, and a Republican. Portman previously served as a U.S. Representative, the 14th United States Trade Representative, and the 35th Director of the Office of Management and Budget (OMB).\nBorn in Cincinnati, Ohio, Portman graduated from Dartmouth College and the University of Michigan Law School. He worked briefly in the White House during the George H. W. Bush administration before entering the U.S. House of Representatives, representing the eastern half of Greater Cincinnati and neighboring counties along the Ohio River, and serving six consecutive terms.  Portman resigned from Congress to serve as U.S. Trade Representative from May 2005 to May 2006. As Trade Representative, Portman is cited for initiating worldwide trade agreements between other countries and the United States, and pursuing claims against China and the European Union at the World Trade Organization. He later served in the George W. Bush administration from May 2006 to June 2007 as Director of the Office of Management and Budget, where he advocated a balanced budget. Portman is married and has three children.\nA member of the Republican Party, Portman was elected U.S. Senator in 2010. Portman has voted in line with Trump's position 93.5% of the time. He has been listed as a possible Republican vice presidential candidate in the past two presidential elections.  In the Senate, Portman was a member of the Congressional Joint Select Committee on Deficit Reduction. Throughout his time in Congress, the Cabinet, and the Senate, Portman has visited over thirty countries, including Israel, China, and Iraq. In 2013, Portman became the first incumbent statewide or national-level Republican to publicly support legal recognition of same-sex marriage since Lincoln Chafee in 2004. Rob Portman was listed among the ten United States Senators receiving the most funding from the National Rifle Association.\nIn 2017, Portman introduced the Stop Enabling Sex Traffickers Act (SESTA) bill. It seeks to clarify United States sex trafficking law to make it illegal to knowingly assist, facilitate, or support sex trafficking, and amend the Section 230 safe harbors of the Communications Decency Act (which make online services immune from civil liability for the actions of their users) to exclude enforcement of federal or state sex trafficking laws from its immunity. Portman had previously led an investigation into the online classifieds service Backpage (which had been accused of facilitating child sex trafficking), and argued that Section 230 was protecting its \"unscrupulous business practices\" and was not designed to provide immunity to websites that facilitate sex trafficking.\n\n"}, "personal": {"Born": "Robert Jones Portman (1955-12-19) December 19, 1955 (age62)Cincinnati, Ohio, U.S.", "Political party": "Republican", "Spouse(s)": "Jane Dudley (m.1986)", "Children": "3", "Education": "Dartmouth College (BA)University of Michigan (JD)", "Signature": ""}, "timeline": {"United States Senatorfrom Ohio": {"date": "Assumed office January 3, 2011Serving with Sherrod Brown", "Preceded by": "George Voinovich"}, "35th Director of the Office of Management and Budget": {"date": "In officeMay 29, 2006– June 19, 2007", "President": "George W. Bush", "Preceded by": "Joshua Bolten", "Succeeded by": "Jim Nussle"}, "14th United States Trade Representative": {"date": "In officeMay 17, 2005– May 29, 2006", "President": "George W. Bush", "Preceded by": "Robert Zoellick", "Succeeded by": "Susan Schwab"}, "Member of the US House of Representativesfrom Ohio's 2nd district": {"date": "In officeMay 4, 1993– May 17, 2005", "Preceded by": "Bill Gradison", "Succeeded by": "Jean Schmidt"}}, "code": "P000449", "type": "3", "party": "Republican", "description": "centrist Republican leader", "economic": "0.37", "social": "-0.25", "leadership": "0.79"}