{"name": "Robert.Aderholt", "picture": "A000055.jpg", "detail": {"Early life, education and career": "Aderholt was born in Haleyville, Alabama, to Mary Frances Brown and Bobby Ray Aderholt. Aderholt's father, a part-time minister for a small group of Congregational churches in northwest Alabama, was a circuit judge for more than 30 years. He attended the University of North Alabama and then Birmingham-Southern College from which he graduated. During college, Aderholt was a member of Kappa Alpha Order. Aderholt received his J.D. from the Samford University Cumberland School of Law and practiced law after graduation.In 1992, Aderholt was appointed Haleyville municipal judge. In the same year, he was a delegate to the Republican National Convention. In 1995, he became the top aide to Governor Fob James. He won the 1996 Republican primary in the race to succeed 15-term Democratic incumbent Tom Bevill.", "US House of Representatives": "Committee assignments Committee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related Agencies (Chairman)Subcommittee on Commerce, Justice, Science, and Related AgenciesCommission on Security and Cooperation in EuropeCaucuses Republican Study CommitteeTea Party CaucusCongressional Caucus on Turkey and Turkish AmericansCongressional NextGen 9-1-1 CaucusUnited States Congressional International Conservation CaucusBills sponsored Sponsor HR 3808: Interstate Recognition of Notarizations Act of 2010, 111th CongressThe bill was cosponsored by Reps. Bruce Braley (D., Iowa), Michael Castle (R., Del.), and Artur Davis (D., Ala.).H.R. 3808  Interstate Recognition of Notarizations Act of 2010 – To require any Federal or State court to recognize any notarization made by a notary public licensed by a State other than the State where the court is located when such notarization occurs in or affects interstate commerce.April 27, 2010: This bill passed in the House of Representatives by voice vote. A record of each representative's position was not kept.September 27, 2010: This bill passed in the Senate by Unanimous Consent. A record of each senator's position was not kept.October 8, 2010: Vetoed by President.H.R. 2017 Continuing Appropriations Act, 2012May 26, 2011: IntroducedJune 2, 2011:  Passed House with amendmentsSeptember 26, 2011: Passed Senate with amendmentsSeptember 30, 2011: Became Public Law 112-33", "Political campaigns": "As the Republican nominee, Aderholt faced a considerable challenge against State Senator Bob Wilson Jr., who called himself a Democrat \"in the Tom Bevill tradition\". This was a seriously contested race, receiving a deal of national coverage and significant support from the Republican Party. Newt Gingrich personally visited the district during the campaign. Aderholt won narrowly, 50%–48%, becoming only the second Republican to represent this district since Reconstruction. The first, Jim Martin, was swept into office in what was then the 7th District during the 1964 wave that delivered the state's electoral votes to Barry Goldwater. Aderholt has never faced another contest nearly that close, and has been reelected nine times. He even ran unopposed in 2004, 2010, 2014, and 2016.Aderholt's increasing margins reflected the growing Republican trend in this part of Alabama. While Democrats still have a majority in voter registration, the district's Democrats are very conservative on social issues, even by Alabama standards. With a Cook Partisan Voting Index of R+30, it is the fifth-most Republican district in the nation and the third-most Republican district east of the Mississippi.2010 campaign 2012 campaign Aderholt was reelected in the November election where he beat State representative Daniel Boman, the Democratic nominee.In 2012 Aderholt raised $1,207,484.98 for his campaign, but spent only $963,859.15. Parker Towing was his largest contributor, providing $24,000.00. $493,856, 41% of his contributions came from large individual contributions. $583,000, 48% came from PACs.", "Political positions": "Defense spending He does not support reducing the defense budget to close the American deficit, and in May 2012 said \"cuts to defense budgets – the federal government's primary Constitutional responsibility – shouldn't be the relief valve for uncontrolled domestic program spending\".Environmental issues During the 2013 111th Congress, Aderholt voted for the amendment by Rep. Scalise (R-LA)[Notes 1] which would \"require that Congress be allowed to vote on any executive regulation that would impose any tax, price, or levy upon carbon emissions... effectively prevents the executive branch from levying any form of carbon tax without Congressional approval.  Since a carbon tax would be tremendously destructive to the economy as a whole, this measure would hopefully make such a tax unlikely to pass.\" Aderholt opposed regulations on greenhouse gas emissions, and in December 2008 helped write a letter to the U.S. Environmental Protection Agency (EPA) which stated, \"I am opposed to any attempt to impose greenhouse gas regulations under the Clean Air Act on the agricultural industry.\" Aderholt was against the policies promoted by the Copenhagen Climate Change Conference as well as the US proposed Cap and Trade Bill, part of what he argued was an \"unrealistic carbon emissions reduction mandate\" that would result in a loss of American jobs. He agreed with the global warming petition project that, \"[t]here is no convincing scientific evidence that human release of carbon dioxide, methane, or other greenhouse gases is causing, or will in the foreseeable future, cause catastrophic heating of the Earth's atmosphere and disruption of the Earth's climate.\"Gun policy Aderholt is a supporter of gun rights. He was endorsed by the National Rifle Association in the 2010 general election, and received $2,000 from them.In the wake of the 2016 Orlando nightclub shooting, Aderholt called it a terrorist attack and stated \"we do not have the luxury of debating the political correctness of 'radical Islam'.\" He stated a need to \"hunt down those who would do us harm.\" He opposed the media and President Obama using the shooting to \"push any type of political agenda relating to gun control. He made a call to the White House and Congress to \"protect the homeland.\"LGBT issues Aderholt is opposed to same-sex marriage. He has received high ratings from the Family Research Council, the Traditional Values Coalition, and the American Family Association.  In 2013, the Human Rights Campaign gave him a score of 0 on its Congressional Scorecard.Regulatory reform In December 2011, Aderholt voted in support of H.R. 10, the \"Regulations From the Executive in Need of Scrutiny Act,\" which would have required congressional approval for any \"major regulations\" issued by the executive branch but, unlike the 1996 Congressional Review Act, would not require the president's signature or override of a probable presidential veto.Abortion During the \"March for Life\" rally in Washington on January 22, 2010, he said, \"The issue of abortion and the sanctity of life is something that I feel strongly about and I encourage my colleagues to look for ways to curb and stop abortions in the United States, while compassionately educating on this important issue.\"Tax policy Aderholt is a signer of Americans for Tax Reform's Taxpayer Protection Pledge.He voted in favor of the Tax Cuts and Jobs Act of 2017. Aderholt said he voted for the bill \"to give back more money to Alabama taxpayers.\" He also stated that the bill \"does the right thing.\" He cited the raising of the child tax credit, changes to the state and local tax deductions, and stated that \"more than 80% the people in the 4th District of Alabama will receive a tax cut.\" Aderholt also says that more businesses will stay in the US due to a lower corporate tax rate and therefore the act is a \"jobs bill.\"", "Electoral history": "Alabama's 4th Congressional District House Primary Election, 1996PartyCandidateVotes%±RepublicanRobert B. Aderholt10,41048.83RepublicanKerry Rich5,86027.48RepublicanBarry Guess2,43411.42RepublicanMickey Moseley1,5967.49RepublicanRonny Branham1,0214.79Alabama's 4th Congressional District House Election, 1996PartyCandidateVotes%±RepublicanRobert B. Aderholt102,74149.89%DemocraticRobert T. Wilson, Jr.99,25048.20%LibertarianAlan F. Barksdale3,7181.81%Alabama's 4th Congressional District House Election, 1998PartyCandidateVotes%±RepublicanRobert B. Aderholt106,29756.40%+6.51%DemocraticDonald H. Bevill82,06543.54%-4.66%Alabama's 4th Congressional District House Election, 2000PartyCandidateVotes%±RepublicanRobert B. Aderholt140,00960.58%+4.18%DemocraticMarsha Folsom86,40037.39%-6.15%LibertarianCraig Goodrich3,5191.52%+1.52%Alabama's 4th Congressional District House Election, 2002PartyCandidateVotes%±RepublicanRobert B. Aderholt139,70586.72%+26.14%LibertarianTony H. McLendon20,8581.42%+11.43%Alabama's 4th Congressional District House Election, 2004PartyCandidateVotes%±RepublicanRobert B. Aderholt191,11074.73%-11.99%DemocraticCarl Cole64,27825.14%+25.14%Alabama's 4th Congressional District House Election, 2006PartyCandidateVotes%±RepublicanRobert B. Aderholt130,38570.17%-4.56%DemocraticBarbara Bobo54,38229.71%+4.57%Alabama's 4th Congressional District House Election, 2008PartyCandidateVotes%±RepublicanRobert B. Aderholt196,74174.76%+4.59%DemocraticNicholas B. Sparks66,07725.11%-4.60%Alabama's 4th Congressional District House Election, 2010PartyCandidateVotes%±RepublicanRobert B. Aderholt167,71498.82%+24.06%Alabama's 4th Congressional District House Election, 2012PartyCandidateVotes%±RepublicanRobert B. Aderholt197,73674.00%-24.82%DemocraticDaniel Boman69,42726.00%+26.00%Alabama's 4th Congressional District House Election, 2014PartyCandidateVotes%±RepublicanRobert B. Aderholt132,83198.57%+24.57%Write-insWrite-ins1,9211.43%+1.43%Alabama's 4th Congressional District House Primary Election, 2016PartyCandidateVotes%±RepublicanRobert B. Aderholt86,66081.18%RepublicanPhil Norris20,09618.82%Alabama's 4th Congressional District House Election, 2016PartyCandidateVotes%±RepublicanRobert B. Aderholt235,92598.53%-.04%Write-insWrite-ins3,5191.47%+.04%", "Personal life": "Aderholt is married to the former Caroline McDonald. Her father Albert McDonald served in the Alabama State Senate and was Alabama Commissioner of Agriculture and Industries. They have two children, Robert Hayes and Mary Elliot.", "Honors": "Aderholt has been awarded the following foreign honor: Commander of the Order of the Star of Romania, Romania (June 8, 2017)", "Citations": "", "introduction": "Robert Brown Aderholt (born July 22, 1965) is the U.S. Representative for Alabama's 4th congressional district, serving since 1997. He is a member of the Republican Party.  The district includes most of Tuscaloosa County north of the Black Warrior River, as well as the far northern suburbs of Birmingham in Walker County and the southern suburbs of Huntsville and Decatur.\nAderholt is a member of the congressional Tea Party Caucus and has taken conservative stands on issues such as abortion, tax reform, and defense spending.\n\n", "code": "04"}, "personal": {"Born": "Robert Brown Aderholt (1965-07-22) July 22, 1965 (age53)Haleyville, Alabama, U.S.", "Political party": "Republican", "Spouse(s)": "Caroline McDonald", "Education": "University of North AlabamaBirmingham–Southern College(BA)Samford University (JD)"}, "timeline": {"Member of the US House of Representativesfrom Alabama's 4th district": {"date": "Assumed office January 3, 1997", "Preceded by": "Tom Bevill"}, "code": "04"}, "code": "A000055", "type": "4", "party": "Republican", "description": "moderate Republican follower", "economic": "0.36", "social": "0.59", "leadership": "0.22"}