{'name': 'Ron.Johnson', 'picture': 'J000293.jpg', 'detail': {'Early life and education': "Johnson was born in Mankato, Minnesota, the son of Jeanette Elizabeth (née Thisius) and Dale Robert Johnson. His father was of Norwegian descent and his mother was of German ancestry. While growing up, Johnson delivered newspapers, worked as a caddy at a golf course, baled hay on his uncle's dairy farm, and worked as a dishwasher in a restaurant. He attended the University of Minnesota while working full-time and graduated in 1977 with a degree in business and accounting. He continued studying until 1979 but did not receive a graduate degree.", 'Business career': "In 1979, Johnson moved to Wisconsin with his wife, Jane. They both started working with Jane's brother, Patrick Curler, at his custom sheet extruder company PACUR, whose name was an abbreviation of “Patrick Curler”. A few months prior, Patrick had created the company with funding from his and Jane's father, Howard Curler, then the CEO of Bemis. For the first several years of PACUR's existence, Bemis was the company’s only customer.For nearly a year, Johnson worked as the accountant and as a machine operator at PACUR. He traded 12-hour shifts with his brother-in-law, with whom he also shared a small cot. The company later expanded into the area of medical device packaging, which involved hiring salespeople and exporting products to other countries. In the mid-1980s, Patrick Curler left PACUR and Johnson became CEO of the company. In 1987, the Curler family sold PACUR to Bowater Industries for $18 million; Johnson continued as the company's CEO following the sale. In 1997, Johnson purchased PACUR from Bowater; he remained the company's CEO until he was elected to the US Senate in 2010.", 'US Senate': 'Elections 2010The 2010 U.S. Senate campaign was Johnson\'s first run for elected office. He was described as a "political blank slate" because he had no history of campaigning or holding office. Johnson attracted the attention of the Tea Party movement when he gave two emotional speeches at Tea Party rallies. According to The New York Times, Johnson said he "did kind of spring out of the Tea Party" and is glad to be associated with it, although he did not join the Senate Tea Party Caucus following his election.In the September 14, 2010 Republican primary, Johnson, running a largely self-financed campaign, defeated Watertown businessman Dave Westlak. Johnson won 85% of the vote, with 10% going to Westlake and the remaining 5% going to Stephen Finn.As a candidate, Johnson opposed the American Recovery and Reinvestment Act of 2009. He launched his campaign by telling the Milwaukee Journal Sentinel that the United States "would have been far better off not spending any of the money and [letting] the recovery happen as it was going to happen." The newspaper later reported that the education council Johnson led considered applying for stimulus money in 2009, but ultimately elected not to do so. The Johnson campaign stated that nonprofits consider "many possibilities," but that the council "made no application" for stimulus funds.Johnson\'s 2010 Senate campaign raised a total of $15.2 million, $9 million of which was his own money. In June 2011, Johnson\'s financial disclosures showed that PACUR, the company where he served as CEO until elected to the Senate, had paid him $10 million in deferred compensation in early 2011. The compensation covered the period from 1997–2011 during which he took no salary from PACUR. Johnson said that he, as CEO, had personally determined the dollar amount and that the amount was unrelated to the contributions he had given to his campaign.In the November 2, 2010 general election, Johnson defeated Democratic incumbent Russ Feingold with 52% of the vote.After being elected to the Senate, Johnson "sold every liquid asset so there would be absolutely no chance for conflict of interest," although he was not required to sell these holdings.2016In March 2013, Johnson announced that he would seek re-election in 2016. In November 2014, he was again endorsed by the fiscally conservative Club for Growth; that month, he said he would not self-finance his re-election bid. In December 2014, the Washington Post rated Johnson the most vulnerable incumbent US Senator in the 2016 election cycle. In May 2015, former Democratic U.S. Senator Russ Feingold, whom Johnson had defeated in 2010, announced he would run to win the Senate seat back.In the November 8, 2016, general election, Johnson won his re-election bid against Feingold with 50.2% of the vote.Committee assignments Committee on Foreign RelationsSubcommittee on Europe and Regional Security Cooperation (Chairman)Committee on the BudgetCommittee on Homeland Security and Governmental Affairs (Chairman)Subcommittee on Oversight of Government Management, the Federal Workforce and the District of ColumbiaSubcommittee on Federal Financial Management, Government Information and International SecurityAd Hoc Subcommittee on Disaster Recovery and Intergovernmental AffairsUnited States Senate Committee on Commerce, Science, and Transportation', 'Political positions': 'Statute of limitations for sex abuse lawsuits In January 2010, prior to holding elective office, Johnson opposed a Wisconsin bill that would have eliminated the time limit for future child sex abuse victims to bring lawsuits while allowing an additional three years for past victims to sue. Johnson testified before the Wisconsin Senate that "punishment for the actual perpetrators should be severe," but questioned whether it would be just for employers of perpetrators to be severely financially damaged or destroyed by lawsuits. He added that the bill, if enacted, might actually reduce the reporting of child sex abuse. At the time of his testimony, Johnson was on the Finance Council of the Roman Catholic Diocese of Green Bay.  In June 2010 he told the Milwaukee Journal Sentinel, "I can\'t think of a penalty that would be too harsh for these guys" and in late September 2010, Johnson indicated that the legislation would have financially crippled organizations such as the Boys & Girls Clubs and that the punishment for child sex abuse should be "severe and swift." He also sought to address reports about his testimony, saying “I sought to warn legislators of those consequences in order to correct legislative language so that any bills that passed would punish the perpetrators and those that protect them, not honorable organizations that do so much good for our communities.  We must rid our society of people who prey on children.”Fiscal issues During the Obama presidency, Johnson proposed limiting federal spending in order to reduce the deficit, and was active in attempting to drive consensus on fiscal issues between Republicans in the Senate and the House. He was involved in the deals to raise the debt ceiling in July 2011 and January 2013. Despite projections of a 1 trillion dollar increase in the national debt over 10 years, Johnson voted for the Tax Cuts and Jobs Act of 2017.Johnson said that 2011 debate over whether to increase the US debt ceiling presented an opportunity to establish hard caps on federal spending. He argued that Congress could not keep raising the debt limit, and needed to prioritize spending. Johnson called for open negotiations over the debt ceiling, saying that the closed-door talks were "outrageous" and "disgusting." He said that default should not have been a concern, because the government had plenty of funding to pay interest on debt, Social Security benefits, and salary for soldiers.In January 2013, Johnson voted for the fiscal cliff agreement that reduced pending tax increases and delayed spending cuts that were precipitated by the 2011 debt ceiling deal.Johnson has opposed increased government spending and the federal stimulus. He has supported broad reduction in federal tax rates, simplifying regulations on business and free-market health care options. When asked if Johnson would get rid of home mortgage interest deductions (claiming mortgage interest as a tax-deductible expense), he said he "wouldn’t rule it out" as part of an effort to lower taxes and simplify the tax code.Despite his prior stances on limiting the federal deficit, Johnson voted in favor of the Tax Cut and Jobs Act, which the Congressional Budget Office found would add $242 billion to the federal budget deficit in 2018 and would result in the annual deficit topping $1 trillion in two years and rising to $1.5 trillion by 2028.Climate change In a 2010 interview, Johnson called scientists who attribute global warming to man-made causes "crazy", saying the theory is "lunacy" and attributing climate change to causes other than human activity. While on a radio talk show August 1, 2015, on Racine, Wisconsin\'s WRJN-AM, Johnson said that "the climate hasn\'t warmed in quite a few years. That is proven scientifically." In February 2016, Johnson said "I\'ve never denied climate change. The climate has always changed, and it always will". Johnson is a cosponsor of the Energy Tax Prevention Act, which would block the EPA from imposing new rules on carbon emissions.Health care Johnson is opposed to the Patient Protection and Affordable Care Act (Obamacare). In an op-ed article written for the Wall Street Journal, Johnson spoke of his personal experience with his daughter, who was born with a congenital heart defect, and suggested that the life-saving treatment she received was only possible because of the United States\' free-market health care system. Johnson says the PPACA "will lead to rationed care, lower the quality of care, increase medical costs and severely limit medical innovation… this law will add trillions of dollars to our nation’s debt and deficit". He is a cosponsor of legislation to suspend implementation of PPACA while legal challenges to the bill are decided.In 2013, Johnson co-sponsored legislation that would have allowed people at risk of losing their healthcare coverage due to Obamacare to keep their current healthcare plans. In an editorial for the Wall Street Journal on April 13, 2015, Johnson said that he would propose legislation to allow current Obamacare enrollees to keep their healthcare plans through August 2017 and to continue to receive existing subsidies. New enrollees would not receive subsidies. However, the individual and employer mandates would end. Mandated coverages would also be terminated to enable less expensive policies.In early 2014, Johnson criticized the ability of Congress to continue using pre-tax employer contributions to help pay for their medical care, rather than being subject to the full text of the Affordable Care Act that the rest of the nation must follow. Johnson initiated a lawsuit against the Obama Administration offering ACA exemptions to members of Congress and their staff. "I really do believe that the American people expect, and they have every right to expect, that members of Congress, the political class here in Washington, should be fully subject to all of the rules, all the laws that Congress imposes on the rest of America...", Johnson said. In July 2014, a court ruled that the Senator did not have standing and dismissed the case. In April 2015, a three-judge panel of the United States Court of Appeals for the Seventh Circuit also said Johnson lacked legal standing to bring the case forward.Johnson has declined to support efforts to tie funding the federal government with defunding Obamacare, stating: "Even if we were to not pass the continuing resolution [to fund the federal government], you\'re not going to be able to defund Obamacare, absent of President Obama signing a law, which I think is highly unlikely."During a radio interview in August 2017, Johnson said the following about John McCain\'s "thumbs-down" vote that ultimately killed the Senate\'s Obamacare repeal bill, "He has a brain tumor right now, the vote occurred at 1:30 in the morning, so some of that might have factored in." A McCain spokesman called the statements "bizarre and deeply unfortunate." Johnson later stated that he was "disappointed I didn\'t more eloquently express my sympathy for what Sen. McCain is going through."Domestic oil production When asked about allowing additional drilling for oil in the continental US, including the Great Lakes if oil was to be found there, Johnson responded: "We have to get the oil where it is, but we need to do it responsibly. We need to utilize American ingenuity and American technology to make sure we do it environmentally sensitively and safely." After criticism from the Feingold campaign, Johnson said in July 2010 that his answer did not mean he supported drilling in the Great Lakes. Johnson argues that America\'s dependence on imported oil creates "both security and economic threats to the nation". Johnson is a cosponsor of legislation to encourage job growth, reduce energy costs, and increase tax revenue by expanding domestic oil production.Immigration Johnson supported President Trump\'s decision to end Deferred Action for Childhood Arrivals (DACA), which he stated was unconstitutional and "created incentives for children from Central America to take great risks to enter America illegally".  Trump\'s decision makes eligible for deportation, following a six-month waiting period, the approximately 800,000 unauthorized immigrants who entered the country as minors and who had temporary permission to stay in the country.Social issues Johnson opposes abortion except in cases of incest, rape, or when the mother\'s life is in danger. He opposes the funding of research that uses embryonic stem cells. Johnson has stated he disagrees with it morally and also has said that eliminating the funding of the research would help balance the federal budget.In March 2015, Johnson voted for an amendment to establish a deficit-neutral reserve fund to allow employees to earn paid sick time.Gun policy Johnson is a strong supporter of gun rights. He is cosponsor of S.570, a bill that, if passed, would prohibit the Department of Justice from tracking and cataloging the purchases of multiple rifles and shotguns. In April 2013, Johnson was one of 12 Republican Senators who signed a letter threatening to filibuster any newly introduced gun control legislation. That month, Johnson joined 45 other Senators in defeating the Manchin-Toomey Amendment, which would have required background checks on all commercial sales of guns.Regulations In July 2011, Johnson introduced a bill that would impose a moratorium on significant new federal regulations until the national unemployment level falls to 7.7 percent – just below where it was when President Obama took office.FBI In January 2018, Johnson asserted that he had an informant who had claimed that the FBI and Department of Justice had conspired against Donald Trump in the 2016 presidential election; Johnson described it as a "secret society" and said that there was "corruption at the highest levels of the FBI". The same day, he walked back the comments.In February 2018, Johnson suggested that a text message between FBI agent Peter Strzok and Lisa Page raised questions about “the type and extent of President Obama’s personal involvement” in the Clinton emails investigation. However, the text message from September 2016, which said "Potus wants to know everything we’re doing", referred to the FBI investigation into Russian interference in the 2016 election, not the Clinton emails investigation which had concluded months earlier.Senate rules Johnson is one of the Senate Republicans arguing in favor of the "nuclear option", "to speed up consideration of President Trump\'s nominees". Changing the Senate\'s rules to a simple majority vote would "ensure a quicker pace on Trump\'s court picks".', 'Electoral history': 'Wisconsin U.S. Senate Republican primary 2010PartyCandidateVotes%RepublicanRon Johnson500,92584.7%RepublicanDave Westlake61,30310.4%RepublicanStephen Finn29,0054.9%Wisconsin U.S. Senate election 2010PartyCandidateVotes%RepublicanRon Johnson1,125,99951.86%DemocraticRuss Feingold (incumbent)1,020,95847.02%Republican gain from DemocraticWisconsin U.S. Senate election 2016PartyCandidateVotes%RepublicanRon Johnson1,479,26250.2%DemocraticRuss Feingold1,380,49646.8%LibertarianPhil Anderson87,5313.0%Republican hold', 'Personal life': 'Johnson and his wife, Jane, have three children, all of whom are graduates of the University of Wisconsin. He is a member of the Wisconsin Evangelical Lutheran Synod.During his time in the Senate, Johnson has endorsed the Joseph Project. The Joseph Project helps  unemployed persons in the Milwaukee area (some of whom have criminal records) find jobs and provides them with training in soft skills. Johnson has lobbied local companies to hire "graduates" of the program.', 'Honors': 'Johnson has been awarded the following foreign honor: Commander of the Order of the Star of Romania, Romania (June 8, 2017)', 'introduction': 'Ronald Johnson (born April 8, 1955) is an American businessperson and  politician serving as the  senior United States Senator for Wisconsin and a Republican. Prior to his election to the Senate, he was chief executive officer of PACUR, LLC, a polyester and plastics manufacturer.\n\n'}, 'personal': {'Born': 'Ronald Harold Johnson (1955-04-08) April 8, 1955 (age63)Mankato, Minnesota, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Jane Johnson (m.1977)', 'Education': 'University of Minnesota (BS)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Wisconsin': {'date': 'Assumed office January 3, 2011Serving with Tammy Baldwin', 'Preceded by': 'Russ Feingold'}, 'Chair of the Senate Homeland Security Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Tom Carper'}}, 'code': 'J000293'}