{'name': 'Roy.Blunt', 'picture': 'B000575.jpg', 'detail': {'Early life, education and career': "Blunt was born in Niangua, Missouri, the son of Neva Dora (nėe Letterman) and Leroy Blunt, a politician. He earned a B.A. degree in history in 1970 from Southwest Baptist University.During his time in college, he received three draft deferments from the Vietnam War. Two years later, he earned a master's degree in history from Missouri State University (then Southwest Missouri State University). Blunt was a high school history teacher at Marshfield High School  from 1970 to 1972, and later taught at Southwest Baptist University and as a member of the adjunct faculty at Drury University.He went on to serve as president of Southwest Baptist University, his alma mater, from 1993-96.", 'Early political career (1972–97)': 'Greene county clerk Blunt entered politics in 1973, when he was appointed county clerk and chief election official of Greene County, Missouri. He was subsequently elected to the position three times and served a total of 12 years.1980 lieutenant gubernatorial election In 1980 incumbent Republican Lieutenant Governor Bill Phelps ran for governor. Blunt, the Greene County Clerk, decided to run for the open seat and won the Republican primary, but lost the general election to State Representative Ken Rothman 56%–44%.Secretary of State In 1984, after incumbent Democratic Missouri Secretary of State James C. Kirkpatrick decided to retire, Blunt ran for the position and won the Republican primary with 79% of the vote. In the general election, he defeated Democratic State Representative Gary D. Sharpe 54%–46%. He became the first Republican to hold the post in 50 years.In 1988, he won reelection against Democrat James Askew 61%–38%.1992 gubernatorial election Since incumbent Republican Governor John Ashcroft was term-limited, Blunt ran for the governorship in 1992. Missouri Attorney General William Webster won the Republican primary, defeating Blunt and Missouri Treasurer Wendell Bailey 44%–40%–15%. Webster lost the general election to Mel Carnahan.', 'US House of Representatives (1997–2011)': 'Elections In 1996 Blunt decided to run for the United States House of Representatives after incumbent U.S. Representative Mel Hancock honored his pledge to serve only four terms. Blunt ran in Missouri\'s 7th congressional district, the state\'s most conservative district, in the Ozark Mountains in the southwest. Blunt\'s political action committee is the Rely on Your Beliefs Fund.On August 6, 1996, he won the Republican primary, defeating Gary Nodler 56%–44%. In the general election, he defeated Democrat Ruth Bamberger 65%–32%.Tenure EducationBlunt voted in favor of school prayer and supported the No Child Left Behind Act. He voted in favor of school vouchers within the District of Columbia but against broader legislation allowing states to use federal money to issue vouchers for private or religious schools. He received a 17% rating from the National Education Association in 2003.Fiscal issuesBlunt received a 97% rating from the United States Chamber of Commerce. He supported efforts to overhaul U.S. bankruptcy laws, requiring consumers who seek bankruptcy protection to repay more of their debts.Blunt opposes federal cap and trade legislation and supports drilling for oil on the U.S. coastline. He does not believe in man-made global warming, stating: "There isn\'t any real science to say we are altering the climate or path of the Earth."Gun policyBlunt voted to prohibit lawsuits against gun manufacturers and dealers if the guns they manufacture or sell are later used in a crime. He has also voted to require anyone who purchases a gun at a gun show to go through a background check that must be completed within 24 hours. He has received an "A" rating from the National Rifle Association.Health policyBlunt chaired the House Republican Health Care Solutions Group.In 2006, Blunt successfully advocated for legislation that placed restrictions on over-the-counter cold medicines that could be used in the production of methamphetamines. The legislation, called the Combat Meth Act, was opposed by retail and drug lobbyists.In August 2009, Blunt stated in two separate newspaper interviews that, because he was 59 years old, "In either Canada or Great Britain, if I broke my hip, I couldn\'t get it replaced." He stated he had heard the statement in Congressional testimony by "some people who are supposed to be experts on Canadian health care." The PolitiFact service of the St. Petersburg Times reported that it could not find any such testimony.In 2012, Blunt attempted to add an amendment to a highway funding bill that would allow employers to refuse to provide health insurance for birth control and contraceptives. In a press release, Blunt defended the amendment on the grounds that it protected the First Amendment rights of religious employers; the amendment failed, with 51 senators voting against it.Minimum wageBlunt voted against HR 2007-018, which raised the federal minimum wage to $7.25 per hour.Social issuesHe has voted to ban partial-birth abortions and to restrict or criminalize transporting minors across state lines for the purpose of getting an abortion. He opposes federal funding for elective abortions in accordance with the Hyde Amendment.He voted in favor of the unsuccessful Federal Marriage Amendment which sought to place a national ban on same-sex marriage, and has voted against gay adoption. He received 94% lifetime and 96% 2004 ratings from the conservative American Conservative Union, a 14% rating from the ACLU, and a 92% rating from the conservative Christian Coalition. In 2013 Blunt voted against Employment Non-Discrimination Act, which would have outlawed employer discrimination based on sexuality or gender identity.Social Security and MedicareIn 2005, Blunt supported President George W. Bush\'s proposal to partially privatize Social Security for those under the age of 55.In 2016 AARP said of Blunt, "He said in 2010 that he remained open to the idea of individual Social Security accounts. His position hasn\'t changed, but he has maintained for years that it\'s not a viable issue for anyone."Leadership After only one term, Blunt was appointed Chief Deputy Whip, the highest appointed position in the House Republican Caucus. In that capacity, he served as the Republicans\' chief vote-counter. In 2002, when Dick Armey retired and fellow Texan Tom DeLay was elected to succeed him, Blunt was elected to succeed DeLay as House Majority Whip.Blunt served as Majority Leader on an acting basis starting in September 2005, after DeLay was indicted on felony charges involving campaign finance. On January 8, 2006, one day after DeLay announced that he would not seek to regain his position, Blunt announced he would run to permanently replace DeLay.On January 14, 2006, Blunt issued a release claiming that the majority of the Republican caucus had endorsed him as DeLay\'s successor. But when the election was held by secret ballot on February 2, 2006, U.S. Representative John Boehner of Ohio won on the second ballot, with 122 votes to 109 for Blunt. In November 2006, House Republicans elected Blunt to their second-highest position during the 110th Congress, Minority Whip. Blunt handily defeated U.S. Representative John Shadegg of Arizona for the position. He announced he would step down from the position in late 2008, following two successive election cycles where House Republicans had lost seats, avoiding a difficult battle with his deputy, Eric Cantor, who was urged by some to challenge Blunt for the position.Committee assignments Upon entering the U.S. House, Blunt served on the House International Relations Committee, the House Committee on Agriculture, and the House Transportation Committee. In 1999, he gave up seats on the latter two committees and joined the Committee on Energy and Commerce. In addition he became a member of the Permanent Select Committee on Intelligence.', 'US Senate (2011–present)': '2010 election On February 19, 2009, Blunt announced he would seek the Republican nomination for the U.S. Senate election for the seat being vacated by incumbent Republican U.S. Senator Kit Bond. He successfully ran against Democratic nominee Secretary of State Robin Carnahan, Constitution Party nominee Jerry Beck, Libertarian nominee Jonathan Dine, and write-in candidates Mark S. Memoly, Frazier Miller, Jeff Wirick and Richie L. Wolfe.Tenure According to the St. Louis Post-Dispatch, Blunt "has one of the Senate\'s most conservative voting records, yet he generally avoids the confrontational, firebrand style" and during his tenure in the U.S. Senate "Blunt\'s most significant legislative accomplishments all had Democrat co-sponsors." The Lugar Center and Georgetown\'s McCourt School of Public Policy\'s Bipartisan Index ranked Blunt the 11th most bipartisan senator in the first session of the 115th United States Congress.Senate assignments The committee and subcommittee appointments of the seated senator, as of May 2017 are as follows.Committee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related AgenciesSubcommittee on DefenseSubcommittee on Interior, Environment, and Related AgenciesSubcommittee on Labor, Health and Human Services, Education, and Related Agencies (Chairman)Subcommittee on State, Foreign Operations, and Related ProgramsSubcommittee on Transportation, Housing and Urban Development, and Related AgenciesCommittee on Commerce, Science and TransportationSubcommittee on Aviation Operations, Safety, and Security (Chairman)Subcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Consumer Protection, Product Safety, Insurance and Data SecuritySubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on Rules and Administration (Chairman)Joint Committee on the LibrarySelect Committee on IntelligencePolitical positions Agriculture In 2013, Blunt worked with Monsanto to author a rider called the Farmer Assurance Provision, which was added into the Consolidated and Further Continuing Appropriations Act, 2013. The rider\'s language originated in an agriculture spending bill in the U.S. House.Since 2014, Blunt has been the largest recipient of campaign contributions from Monsanto, which is headquartered in Missouri.According to progressive news magazine The Nation, the rider "curtailed already weak oversight over the handful of agro-giants that control the GMO market by allowing crops that a judge ruled were not properly approved to continue to be planted." According to Blunt, who did not add the rider to the bill but who supported it, "What it says is if you plant a crop that is legal to plant when you plant it, you get to harvest it". He later led Senate Republicans in defeating an amendment by Democratic Senator Jeff Merkley to repeal the provision. Blunt claimed all the amendment did "was repeat  [sic] authority that the secretary in a hearing the other day, before the Agri[culture] Approp[riations] committee the other day, said he already had. And it didn\'t require the secretary to do anything that the secretary thought was the wrong thing to do. Which is one of the reasons I thought it was fine..."Economic policy Blunt has been opposed to raising the federal minimum wage.On June 20, 2013, Blunt co-sponsored the Death Tax Repeal Act of 2013. The bill was intended to permanently eliminate federal estate tax and it did not pass.On January 17, 2014, Blunt introduced a bill called the Partnership to Build America Act. If signed into law, the bill would create a special fund to pay for infrastructure projects across the United States, according to Ripon Advance.Energy and environment According to The Guardian, Blunt has acknowledged that climate change exists, however he said that the human role in it is "unclear".In 2015, Blunt voted against a nonbinding Senate resolution stating that "climate change is real and caused by human activity and that Congress needs to take action to cut carbon pollution."According to The Springfield News-Leader, "Blunt has railed against the Obama administration\'s proposed rules to combat global warming, which could deal a blow to Missouri\'s coal-fired power plants." In 2015, Blunt sponsored an unsuccessful amendment which "called on the Senate to nullify a climate change agreement in November between the United States and China in which both nations pledged to reduce their carbon emissions."Blunt has worked to protect the coal industry and co-sponsored an amendment to urge President Obama to consult with the Senate before ratifying the Paris climate agreements. In 2017, Blunt was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement. According to the Center for Responsive Politics, Blunt has received over $400,000 from the oil and gas industry since 2012.In 2016, Blunt worked to block a carbon tax on emissions. He supports the expanded domestic exploration for coal and natural gas. Citing his support for agriculture and energy production, Blunt "has aggressively pushed to block a rule that would allow the Environmental Protection Agency to regulate some streams, wetlands and other waters."Foreign policy In 2011, Blunt called for a no fly zone over Libya.Gun policy Blunt has an "A" rating from the National Rifle Association (NRA) for his continued support of the 2nd amendment. The NRA has donated $4,551,146 to his political activities as of 2017.In April 2013, Blunt was one of forty-six senators to vote against the passing of a bill which would have expanded background checks for all gun buyers. Blunt voted with 40 Republicans and 5 Democrats to stop the bill, which failed to pass.One month after the 2016 Orlando nightclub shooting, Blunt voted for two Republican-sponsored bills. The first was proposed by John Cornyn and would have enabled a 72-hour waiting period for federal authorities to investigate individuals seeking to buy guns who are listed on the terrorist watch list. The second bill was proposed by Chuck Grassley would have expanded background checks and made it illegal for individuals with certain mental health disorders to purchase guns. Neither bill passed. Blunt voted against two Democrat-sponsored bills, both which also did not pass, including one that would have made background checks required for online gun sales and gun sales at gun shows and another that would have not allowed anyone on the terrorist watchlist to purchase a gun.In response to the 2017 Las Vegas shooting, Blunt stated that he was "saddened by the tragic loss of life" and offered his thoughts to the victims.Health policy The Wall Street Journal reported in February 2011 that "Blunt introduced an amendment to the Patient Protection and Affordable Care Act that would allow an employer to deny health services if they conflict with their \'religious beliefs or moral convictions\'."Blunt said of the amendment, "[W]as it an overreach when Mrs. Clinton put it in the Clinton health care plan in 1994? I don\'t think it\'s an overreach at all. It doesn\'t mention any specific procedure. It doesn\'t even suggest the mandate should be eliminated."In 2012, he proposed the "Blunt Amendment," which would have amended the Affordable Care Act (Obamacare) provision that requires all insurance plans to cover the birth control pill to allow moral and religious objectors to opt out of birth control coverage. The amendment was ultimately defeated.In July 2013, Blunt indicated that he would not support efforts to tie raising the federal debt ceiling to defunding Obamacare.  In an interview on MSNBC, he expressed his opinion that Obamacare is "destined to fail", but that raising the debt ceiling shouldn\'t be "held hostage" to "any specific thing".In 2016, Senators Blunt and Patty Murray (D-WA) co-sponsored a successful $2 billion funding increase for the National Institutes of Health, the first such research increase in over a decade.National security Blunt supported President Donald Trump\'s 2017 executive order to temporarily curtail Muslim immigration until better screening methods are devised. He stated "[Trump] is doing what he told the American people he would do. I would not support a travel ban on Muslims; I do support increased vetting on people applying to travel from countries with extensive terrorist ties or activity. These seven countries meet that standard. Our top priority should be to keep Americans safe."Social Security and Medicare Blunt has argued for the need to reduce fraud and waste in Medicare and Social Security. He has spoken out for the need to reform entitlement programs such as Medicare and Social Security.Trade Blunt has been a supporter of free-trade agreements. The Springfield News-Leader wrote: "[Blunt] has supported a spate of free-trade agreements during his nearly 20 years in Congress, including a U.S-Singapore deal in 2003, the Central American Free Trade agreement in 2005 and the U.S-Korea agreement in 2011." After early enthusiasm, Blunt has been ambivalent about supporting the Trans Pacific Partnership (TPP).2016 election Blunt ran for re-election to the U.S. Senate in 2016.He won the Republican primary with 73% of the vote and faced Democrat Jason Kander in the November 2016 general election on November 8, 2016. Blunt won with 49.4% of the vote to Kander\'s 46.2%.', 'Family and personal life': 'Blunt has been married twice. He married Roseann Ray in May 1967, and had three children with her: Matt, the former governor of Missouri, Amy Blunt Mosby and Andrew Blunt. All three children are corporate lobbyists.Blunt married Abigail Perlman, a lobbyist for Kraft Foods, in 2003. In April 2006, he and Perlman adopted an 18-month-old boy from Russia. The family lives in Washington D.C.. Blunt owns a condominium in Springfield, Missouri. Roy Blunt has six grandchildren. He is a practicing Southern Baptist.', 'Electoral history': 'This section of a biography of a living person does not include any references or sources. Please help by adding reliable sources. Contentious material about living people that is unsourced or poorly sourced must be removed immediately.Find sources:\xa0"Roy Blunt"\xa0–\xa0news\xa0· newspapers\xa0· books\xa0· scholar\xa0· JSTOR (September 2016) (Learn how and when to remove this template message)All information provided here is for elections for the State of Missouri and its congressional districts.', 'introduction': "Roy Dean Blunt (born January 10, 1950) is an American politician who is the junior United States Senator from Missouri, serving since 2011. A member of the Republican Party, he previously served as a member of the United States House of Representatives and as Missouri Secretary of State.\nBorn in Niangua, Missouri, Blunt is a graduate of Southwest Baptist University and Missouri State University. After serving as Missouri Secretary of State from 1985 to 1993, he was elected to the U.S. House of Representatives for Missouri's 7th Congressional District in 1996. There he served as Republican Whip from 2003 to 2009.\nBlunt successfully ran for United States Senate in 2010. The following year, he was elected vice-chairman of the Senate Republican Conference. Blunt is the dean of Missouri's Congressional delegation.\n\n"}, 'personal': {'Born': 'Roy Dean Blunt (1950-01-10) January 10, 1950 (age68)Niangua, Missouri, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Roseann Ray(m.1967; div.2003)Abigail Perlman (m.2003)', 'Children': '4 (including Matt)', 'Education': 'Southwest Baptist University(BA)Missouri State University(MA)', 'Signature': '', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Missouri': {'date': 'Assumed office January 3, 2011Serving with Claire McCaskill', 'Preceded by': 'Kit Bond'}, 'Chair of the Senate Rules Committee': {'date': 'In officeJanuary 3, 2015– January 3, 2017', 'Preceded by': 'Chuck Schumer', 'Succeeded by': 'Richard Shelby'}, 'House Minority Whip': {'date': 'In officeJanuary 3, 2007– January 3, 2009', 'Leader': 'John Boehner', 'Preceded by': 'Steny Hoyer', 'Succeeded by': 'Eric Cantor'}, 'House Majority LeaderActing': {'date': 'In officeSeptember 29, 2005– February 2, 2006', 'Leader': 'Dennis Hastert', 'Preceded by': 'Tom DeLay', 'Succeeded by': 'John Boehner'}, 'House Majority Whip': {'date': 'In officeJanuary 3, 2003– January 3, 2007', 'Leader': 'Dennis Hastert', 'Preceded by': 'Tom DeLay', 'Succeeded by': 'Jim Clyburn'}, 'House Republican Chief Deputy Whip': {'date': 'In officeJanuary 3, 1999– January 3, 2003', 'Leader': 'Dennis Hastert', 'Preceded by': 'Dennis Hastert', 'Succeeded by': 'Eric Cantor'}, "Member of the US House of Representativesfrom Missouri's 7th district": {'date': 'In officeJanuary 3, 1997– January 3, 2011', 'Preceded by': 'Mel Hancock', 'Succeeded by': 'Billy Long'}, '33rd Secretary of State of Missouri': {'date': 'In officeJanuary 14, 1985– January 11, 1993', 'Governor': 'John Ashcroft', 'Preceded by': 'James Kirkpatrick', 'Succeeded by': 'Judi Moriarty'}}, 'code': 'B000575'}