{"name": "Ryan.Costello", "picture": "C001106.jpg", "detail": {"Early life": "Costello was born in 1976 to schoolteacher parents. Costello attended Ursinus College and Villanova University School of Law.", "Political career": "Costello served on the Board of Supervisors for East Vincent Township in Chester County, Pennsylvania, for six years, serving as chairman for the last four. He was elected the Chester County recorder of deeds in 2008. He was elected to the Chester County Board of Commissioners in 2011. His fellow commissioners elected him as chairman of the commission in 2013, and reappointed in 2014.U.S. House elections 2014 When Jim Gerlach, the Republican incumbent in Pennsylvania's 6th congressional district in the United States House of Representatives, announced that he would not run for reelection in 2014, Costello chose to run for the Republican Party nomination. He faced no primary opposition. He faced Manan Trivedi of the Democratic Party in the general election. Costello defeated Trivedi, 56%–44%.2016 In 2016, Democrat Mike Parrish challenged Costello. Hacked material from Parrish was leaked during the campaign, but the Costello campaign took the position that they would not use the illicitly obtained materials during the election. Vincent Galko, a consultant for Costello, said, \"When news broke that this material had likely been stolen by a foreign actor, we immediately said, ‘We’re not going to use it.'\"Costello was re-elected by a wide margin of 57.2 to 42.8.Tenure For his first two terms, Costello represented a district that took in northern Chester County and western Montgomery County, then reached across Berks County to take in much of heavily Republican Lebanon County. However, in February 2018, the Pennsylvania Supreme Court, which has a Democratic majority, released a new map for the state's congressional districts to replace a map which the court had previously struck down as a Republican partisan gerrymander. The court imposed a new map after the state legislature refused to submit a replacement. Costello was the only incumbent who retained his old district number. However, the 6th was made significantly more compact. It lost most of its heavily Republican western portion, as well as its share of Montgomery County. Instead, it now took in all of Chester County as well as most of the more Democratic portions of Berks County, including Reading.According to The Philadelphia Inquirer, \"Of the many Republicans who took a political blow from Pennsylvania's new congressional map, Chester County's Ryan Costello got hit the hardest.\" Costello saw his district move from having a Republican-leaning constituency to a district Hillary Clinton won by nine points. The Philadelphia Inquirer wrote that \"the previous, GOP-drawn map was one factor aiding Republicans as they held a firm grip on every competitive seat in the moderate Philadelphia suburbs.\" According to the Pottstown Mercury, the Republican-drawn congressional map was \"widely viewed as among the nation’s most gerrymandered.\" After the new congressional map was released, Costello said he supported impeaching the justices who imposed the map, calling the court corrupt and undemocratic. Republicans requested that the United States Supreme Court intervene in the redistricting dispute, although Politico reported that the Republican challenge was unlikely to be successful. In March 2018, a panel of federal judges refused to block the new congressional map from going into effect.In March 2018, Costello filed petitions to get on the 2018 ballot, but later that month, he announced that he was dropping his reelection bid. According to The Hill, he became frustrated with the Trump administration, which contributed to his dropping from the race.Political positions Throughout his tenure, Costello has been ranked as one of the most bipartisan Members of Congress, breaking with his party to support environment, health care, and education initiatives.  In 2017, Costello ranked ninth out of 435 Members of Congress in bipartisanship.In May 2017, Costello broke from his party and voted against the Republican health care legislation, the Affordable Health Care Act (AHCA). In November 2017, Costello voted for the Republican Party's 2017 tax plan that passed the House. He also voted in favor of a 2018 bipartisan bill to fund the federal government.In May 2018, Costello signed the discharge petition that would call for the House to vote on immigration legislation.  He has supported efforts to allow for DACA children to remain in the United States.", "Electoral history": "Pennsylvania's 6th Congressional District election, 2014Republican primary resultsPartyCandidateVotes%RepublicanRyan Costello24,313100Pennsylvania's 6th Congressional District, 2014PartyCandidateVotes%RepublicanRyan Costello119,64356.29DemocraticManan Trivedi92,90143.71Total votes212,544100Republican holdPennsylvania's 6th Congressional District election, 2016Republican primary resultsPartyCandidateVotes%RepublicanRyan Costello (Incumbent)88,349100Total votes88,349100Pennsylvania's 6th Congressional District, 2016PartyCandidateVotes%RepublicanRyan Costello (Incumbent)207,46957.24DemocraticMike Parrish155,00042.76Total votes362,469100Republican hold", "Committee assignments": "115th CongressCommittee on Energy and CommerceSubcommittee on Communications and TechnologySubcommittee on Digital Commerce and Consumer ProtectionSubcommittee on Oversight and Investigations114th CongressCommittee on Transportation and InfrastructureSubcommittee on Economic Development, Public Buildings and Emergency ManagementSubcommittee on Highways and TransitCommittee on Veterans' AffairsSubcommittee on Disability Assistance and Memorial AffairsSubcommittee on Economic Opportunity", "Personal life": "Ryan Costello lives along with his wife and two children in West Chester, Pennsylvania. He is a Presbyterian.", "introduction": "Ryan Anthony Costello (born September 7, 1976) is an American attorney and politician from the state of Pennsylvania. A Republican, Costello is the representative for Pennsylvania's 6th congressional district, elected in 2014 to the United States House of Representatives. He previously served on the Chester County Board of Commissioners (2011–2015), and as its chair from 2013 to 2015. He announced his retirement in 2018 on MSNBC, stating that he would not seek reelection. After announcing his retirement, CNN called him a \"rare brand in the House GOP conference: a young moderate willing to break with his leadership and his President on everything from gun control bills to repealing and replacing the Affordable Care Act.\"\n\n", "code": "06"}, "personal": {"Born": "Ryan Anthony Costello (1976-09-07) September 7, 1976 (age42)Phoenixville, Pennsylvania, U.S.", "Political party": "Republican", "Spouse(s)": "Christine Costello", "Children": "2", "Education": "Ursinus College (BA)Villanova University (JD)"}, "timeline": {"Member of the US House of Representativesfrom Pennsylvania's 6th district": {"date": "Assumed office January 3, 2015", "Preceded by": "Jim Gerlach"}, "Member of the Chester County Board of Commissioners": {"date": "In officeFebruary 17, 2011– December 16, 2014", "Preceded by": "Carol Aichele", "Succeeded by": "Michelle Kichline"}, "Chester County Recorder of Deeds": {"date": "In officeJanuary 7, 2008– February 17, 2011", "Preceded by": "Terence Farrell", "Succeeded by": "Rick Loughery"}, "code": "06"}, "code": "C001106", "type": "4", "party": "Republican", "description": "centrist Republican follower ", "economic": "0.22", "social": "-0.05", "leadership": "0.28"}