{'name': 'Salud.Carbajal', 'picture': 'C001112.jpg', 'detail': {'Early life': 'Carbajal was born in Moroleón, Mexico in 1964 and later immigrated to the United States initially to Arizona, later settling in Oxnard, California with his family, where his father worked as a farmworker. He attended the University of California, Santa Barbara and Fielding Graduate University where he earned a master’s degree in Organizational Management. He also served in the United States Marine Corps Reserve for eight years, including during the Gulf War  although he did not leave the contiguous United States.', 'Santa Barbara County Board of Supervisors': 'Carbajal was first elected to the Board of Supervisors of Santa Barbara County, California in 2004, representing the first district as a Democrat. He was reelected in 2008 and 2012.', 'US House of Representatives': "2016 campaign In 2015, Carbajal announced his intentions to run for the 24th district, after incumbent Democrat Lois Capps announced her retirement. Carbajal was seen as one of the two Democratic frontrunners in the open primary, alongside Santa Barbara Mayor Helene Schneider, and was rivaled by Republican frontrunners Assemblyman Katcho Achadjian, and small businessman and former Congressional aide Justin Fareed. The primary field consisted of 4 Democrats, 3 Republicans, and 2 independent candidates.In the primary on June 7, Carbajal ultimately came in first, with 31.9% of the vote, amounting to 66,402 total popular votes. The runner-up was Fareed, who received 20.5% (42,521 votes).In the general election on November 8, Carbajal received roughly 53.4% of the total vote over Fareed's 46.6%, which amounted to a popular vote margin of about 21,000 votes.Committee assignments Committee on Armed ServicesSubcommittee on ReadinessSubcommittee on Tactical Air and Land ForcesCommittee on the BudgetCaucus memberships New Democrat CoalitionHouse Baltic CaucusCongressional Hispanic CaucusCongressional Asian Pacific American Caucus", 'Personal life': 'Carbajal currently lives in Santa Barbara, California and is married to Gina, with whom he has two children.', 'introduction': "Salud Carbajal (/səˈluːd ˈkɑːrbəhɑːl/; born November 18, 1964) is an American politician who is the current United States Representative from  California's 24th congressional district.\n\n", 'code': '24'}, 'personal': {'Born': ' (1964-11-18) November 18, 1964 (age53)Moroleón, Mexico', 'Political party': 'Democratic', 'Spouse(s)': 'Gina', 'Education': 'University of California, Santa Barbara (BA)Fielding Graduate University (MA)', 'Website': 'House website'}, 'timeline': {"Member of the US House of Representativesfrom California's 24th district": {'date': 'Assumed office January 3, 2017', 'Preceded by': 'Lois Capps'}, 'Military service': {'Allegiance': 'United States', 'Service/branch': 'United States Marine Corps', 'Unit': 'United States Marine Corps Reserve', 'Battles/wars': 'Persian Gulf War'}, 'code': '24'}, 'code': 'C001112'}