{'name': 'Sander.Levin', 'picture': 'L000263.jpg', 'detail': {'Early life, education, and early political career': "Levin was born in Detroit, Michigan, the son of Bess (née Levinson) and Saul R. Levin. He graduated from Central High School in Detroit, received a bachelor's degree from the University of Chicago in 1952, a Master's degree in international relations from Columbia University in 1954, and a law degree from Harvard Law School in 1957.After developing a private law practice, Levin served in the Michigan Senate from 1965 to 1970, and was Senate Minority Leader 1969–1970. He made unsuccessful campaigns for Governor of Michigan in 1970 and 1974, losing to Republican William Milliken. He was a Fellow of the Harvard Kennedy School in 1975. From 1977 through 1981 he was assistant administrator of the Agency for International Development.", 'US House of Representatives': "Elections In 1982, incumbent Democratic U.S. Congressman William Brodhead decided not to run for re-election, instead making an unsuccessful run for governor. Levin won the Democratic primary in Michigan's 17th congressional district with 49% of the vote, which at that time included northwestern Detroit as well as parts of Macomb and Oakland counties. Levin subsequently won this 1982 general election with 67% of the vote. He typically won re-election with at least 56% of the vote since then, exceptions being 1992 and 1994 elections. After the 1990 United States Census, his district was renumbered as the 12th district and lost its share of Detroit. In 1992, he narrowly defeated businessman and Vietnam War veteran John Pappageorge 53%-46%. In a 1994 rematch, Levin again defeated this same opponent, during the midst of the Republican Revolution, 52%-47%. Then again in 1996, Levin defeated Pappageorge by a larger margin in a third rematch 57%-41%. In 1998, Levin won re-election against Republican nominee Leslie A. Touma, 56%-42%. In 2000, Detroit Metro area businessman Bart Baron gained the endorsement of the United Auto Workers Union, but Levin still managed to win re-election with 64% of the vote. The 2000s redistricting added heavily Democratic Southfield and Mount Clemens to the district, and he has won re-election in every election with at least 61% of the vote since then.2012After redistricting, Levin was drawn into the same district as fellow U.S. Congressman Gary Peters (D-MI).  The district retained Peters' district number—the 9th—but geographically was more Levin's district.  Peters opted to run in the newly redrawn 14th District. In 2008, Obama won the 9th district with 59% of the vote, while he won statewide with 57%. Levin now represents the 12th congressional district which picks up Oak Park, Berkley, Madison Heights, Clawson, Royal Oak, and Troy, but former portions were moved over into the adjacent 11th District to the west to now include Southfield Township, Beverly Hills, Bloomfield Township Birmingham, and portions of Royal Oak.Committee assignments Committee on Ways and Means (former Ranking Member)Subcommittee on Trade (Ranking Member)Subcommittee on Income SecurityLevin took over as chairman of the Ways and Means committee on March 4, 2010, when Charles B. Rangel of New York stepped aside in due to a number of ethics violations. Levin served as chairman until January 2011 and currently serves as a committee member, stepping down as ranking member at the end of 2016.Levin is a member of the House Baltic Caucus and the Congressional Arts Caucus.", 'Political positions': 'Foreign policy Levin is a strong supporter of Israel. He also supported the nuclear deal with Iran.', 'Personal life': "His wife of 50 years, Vicki Schlafer, died on September 4, 2008. They had four children: Andy, Jennifer, Madeleine, and Matthew and ten grandchildren.In a private ceremony in July 2012, Levin married Pamela Cole, age 61, a Pennsylvania State University psychology professor who studies emotional development. They met through his late wife Vicki. Cole and Levin worked to create a fund in her name for young professionals researching early childhood development.Levin comes from a family that has long been prominent in Michigan politics. His younger brother Carl Levin was the state's senior Senator until his retirement in January 2015. His uncle, Theodore, was a federal judge. His first cousin Charles was a Michigan Supreme Court justice, after serving as a Michigan Court of Appeals judge. Another first cousin, Joseph Levin, was a candidate for the U.S. House of Representatives. His son Andy was the 2006 Democratic candidate for the Michigan Senate in the 13th Senate District, losing in a tight race to John Pappageorge. Andy Levin is currently the Democratic nominee to replace his father in the United States House of Representatives.", 'Electoral history': "Michigan's 17th congressional district: Results 1982–1990YearDemocraticVotes%RepublicanVotes%Third partyPartyVotes%1982Sander Levin116,90167%Gerald Rosen55,62032%Virginia CropseyLibertarian2,9552%1984Sander Levin133,064100%No candidate1986Sander Levin105,03176%Calvin Williams30,87922%Charles MartellIndependent1,4771%1988Sander Levin135,49370%Dennis Flessland55,19729%Charles HahnLibertarian2,3331%1990Sander Levin92,20570%Blaine Lankford40,10030%Michigan's 12th congressional district: Results 1992–2010YearDemocraticVotes%RepublicanVotes%Third partyPartyVotes%Third partyPartyVotes%Third partyPartyVotes%1992Sander Levin137,51453%John Pappageorge119,35746%Charles HahnLibertarian2,7511%R. W. MontgomeryNatural Law1,7241%1994Sander Levin103,50852%John Pappageorge92,76247%Jerome WhiteNo party affiliation1,3861%Eric AndersonNatural Law1,3401%1996Sander Levin133,43657%John Pappageorge94,23541%Albert TitranLibertarian3,1011%Gail PetrosoffNatural Law1,6901%1998Sander Levin105,82456%Leslie Touma79,61942%Albert TitranLibertarian2,8131%Fred RosenbergNatural Law1,1721%2000Sander Levin157,72064%Bart Baron78,79532%Thomas NessGreen4,1372%Andrew LeCureauxLibertarian3,6301%Fred RosenbergNatural Law8870%2002Sander Levin140,97068%Harvey Dean61,50230%Dick GachLibertarian2,6941%Steven RevisU.S. Taxpayers1,3621%2004Sander Levin210,82769%Randell Shafer88,25629%Dick GachLibertarian5,0512%2006Sander Levin168,49471%Randell Shafer62,68926%Andrew LeCureauxLibertarian3,2591%Jerome WhiteNo party affiliation1,8621%Art MyattGreen1,7351%2008Sander Levin225,09472%Bert Copple74,56524%John VicoLibertarian4,7672%Les TownsendU.S. Taxpayers4,0761%William OpalickyGreen3,8421%2010Sander Levin124,67161%Don Volaric71,37235%Julia WilliamsGreen3,0381%Leonard SchwartzLibertarian2,3421%Les TownsendU.S. Taxpayers2,2851%*Michigan's 9th congressional district: Results 2012–YearDemocraticVotes%RepublicanVotes%Third partyPartyVotes%Third partyPartyVotes%Third partyPartyVotes%2012Sander Levin208,84662%Don Volaric114,76034%Jim FulnerLibertarian6,1002%Julia WilliamsGreen4,7081%Les TownsendU.S. Taxpayers2,9021%2014Sander Levin136,34260%George Brikho81,47036%Gregory CreswellLibertarian4,7922%John McDermottGreen3,1531%2016Sander Levin199,66158%Christopher Morse128,93737%Matthew OrlandoLibertarian9,5633%John McDermottGreen6,6142%", 'introduction': "Sander Martin Levin (born September 6, 1931) is an American politician who has served in the United States House of Representatives since 1983, representing Michigan's 9th congressional district. Levin, a member of the Democratic Party from Michigan, is the former ranking member on the House Ways and Means Committee; he was Chairman of the Ways and Means Committee from 2010 to 2011.\nLevin's district, numbered as the 12th District from 1983 to 2013, includes many of Detroit's northern and northeastern suburbs, such as Mount Clemens, Royal Oak, Clinton Township, Warren, Ferndale, Fraser, Sterling Heights, Eastpointe and St. Clair Shores. He is the older brother of former U.S. Senator Carl Levin.\nIn December 2017, Levin announced that he would retire from Congress at the end of his current term, and not seek re-election in 2018.\n\n", 'code': '09'}, 'personal': {'Born': 'Sander Martin Levin (1931-09-06) September 6, 1931 (age87)Detroit, Michigan, U.S.', 'Political party': 'Democratic', 'Spouse(s)': 'Vicki Schlafer (1958–2008)Pamela Cole (2012–present)', 'Children': '4', 'Education': 'University of Chicago (BA)Columbia University (MA)Harvard University (LLB)', 'Signature': '', 'Website': 'House website'}, 'timeline': {"Member of the US House of Representativesfrom Michigan's 9th district": {'date': 'Assumed office January 3, 2013', 'Preceded by': 'Gary Peters'}, "Member of the US House of Representativesfrom Michigan's 12th district": {'date': 'In officeJanuary 3, 1993– January 3, 2013', 'Preceded by': 'David Bonior', 'Succeeded by': 'John Dingell'}, "Member of the US House of Representativesfrom Michigan's 17th district": {'date': 'In officeJanuary 3, 1983– January 3, 1993', 'Preceded by': 'William M. Brodhead', 'Succeeded by': 'Constituency abolished'}, 'Chair of the House Ways and Means Committee': {'date': 'In officeMarch 4, 2010– January 3, 2011', 'Preceded by': 'Charlie Rangel', 'Succeeded by': 'Dave Camp'}, 'code': '09'}, 'code': 'L000263'}