{"name": "Steve.Daines", "picture": "D000618.jpg", "detail": {"Early life and education": "Daines was born in Van Nuys, California, to Sharon R. and Clair W. Daines. The family moved to Montana in 1964. He was raised in Bozeman, Montana where he attended school from kindergarten through college.Daines graduated from Bozeman High School, where he served as student body president. He earned a bachelor of science degree in Chemical Engineering from Montana State University. His high school partner in Policy Debate was United States Ambassador to Russia Michael McFaul.[citation needed]Early political involvement In his senior year, he was one of the youngest delegates at the 1984 Republican National Convention. \"I was a big fan of Ronald Reagan. He was the first president I got to vote for.\" Daines was also the president of MSU College Republicans. In 2007, he and his wife started a web site called GiveItBack.com, which urged governor Brian Schweitzer to return the state's $1 billion surplus to the taxpayers. In 2007–08, he served as state chairman for Republican Mike Huckabee's presidential campaign and as a national surrogate for Huckabee.", "Business career": "Daines spent 13 years with Procter & Gamble. After seven years managing operations in the United States, he moved his family to Hong Kong and China for six years opening factories to expand Procter & Gamble's Asian business. During the 2014 campaign, this period became a campaign issue, with the Montana Democratic Party stating that he assisted the company in outsourcing U.S. jobs to China. Daines responded to this charge by saying that he created hundreds of jobs in Montana when he worked for RightNow Technologies.  In 1997, Daines left Procter & Gamble to join the family construction business in Bozeman. Three years later, Daines met Greg Gianforte, founder of RightNow Technologies, and was put in charge of running RightNow's customer care division. Daines went on to become Vice President of North America Sales and Vice President of the Asia-Pacific division. During his tenure, the cloud-based software company became a publicly traded company and Bozeman's largest commercial employer. Daines remained with the company until March 2012, when he left to campaign full-time.", "2008 gubernatorial election": "Daines campaigned for Lieutenant Governor of Montana in 2008, running on the ticket with Roy Brown, the Republican nominee for Governor. They challenged incumbent Governor Brian Schweitzer and his running mate John Bohlinger. Brown/Daines lost the election 65%–33%, winning 7 of Montana's 56 counties.", "US House of Representatives": "2012 election On November 13, 2010, Daines announced he would run for the U.S. Senate seat held by Jon Tester in 2012. That year, a complaint was filed with the Federal Election Commission against Daines by the Montana Democratic Party, alleging that a radio ad he had run on behalf of a pro-life organization called Common Sense Issues (CSI) was illegal campaign activity. The complaint was later dismissed on September 7, 2011, as Daines had not at that time actually filed as a candidate for any federal office.  When U.S. Representative Denny Rehberg announced his intention to challenge Tester, Daines dropped out of the Senate race and announced his candidacy for the open House seat vacated by Rehberg.  Daines won the 3-candidate Republican primary with 71% of the vote.  In the general election, he defeated Democratic State Senator Kim Gillan, 53%–43%. He won 48 of the state's 56 counties.Committee assignments Committee on Homeland SecuritySubcommittee on Cybersecurity, Infrastructure Protection, and Security TechnologiesSubcommittee on Oversight, Investigations, and ManagementCommittee on Natural ResourcesSubcommittee on Energy and Mineral ResourcesSubcommittee on Indian and Alaska Native AffairsSubcommittee on Public Lands and Environmental RegulationCommittee on Transportation and InfrastructureSubcommittee on AviationSubcommittee on Highways and TransitCaucus memberships Congressional Western CaucusCongressional Rural CaucusRepublican Study CommitteeNW Energy CaucusCongressional Sportsmen's Caucus", "US Senate": "2014 election In July 2013, Daines attended a NRSC fundraiser in Washington that raised speculation that he would run for the United States Senate seat being vacated by Max Baucus. Additional anticipation that he would run was fueled when he disclosed fundraising of $415,000 in the second quarter of 2013.  On November 6, 2013, Daines announced his candidacy.In February 2014, Baucus resigned from the Senate to accept a post as U.S. ambassador to China.  Governor Steve Bullock, a Democrat, appointed lieutenant governor John Walsh to the vacant Senate seat for the remainder of Baucus's term.  Walsh had already declared his intention of running for the Senate in the 2014 election, and it was suggested that his appointment by Bullock might give him the advantage of incumbency, thus improving Democratic chances of holding the seat.Daines won the June 3, 2014, Republican primary, obtaining 83.4% of the vote to defeat Missoula state representative Champ Edmunds and political newcomer Susan Cundiff.  Walsh won the Democratic primary with 64% of the vote.In August 2014, Walsh withdrew from the race following the publication of a New York Times article that accused him of plagiarism in a paper written as part of his masters degree work at the U.S. Army War College.  With only 50 days left before the general election, a special convention called by the Montana Democratic party named one-term Butte legislator Amanda Curtis to run in place of Walsh.Daines won the general election, securing 57.8% of the vote to Curtis's 40.1%.Daines became the first Republican to hold the seat since 1913.Committee assignments Committee on Agriculture, Nutrition, and ForestrySubcommittee on Commodities, Risk Management, and TradeSubcommittee on Rural Development and EnergySubcommittee on Conservation, Forestry, and Natural ResourcesSubcommittee on Livestock, Marketing, and Agriculture SecurityCommittee on AppropriationsSubcommittee on DefenseSubcommittee on Interior, Environment, and Related AgenciesSubcommittee on State, Foreign Operations, and Related ProgramsUnited States Senate Appropriations Subcommittee on Transportation, Housing and Urban Development, and Related AgenciesUnited States Senate Appropriations Subcommittee on Financial Services and General GovernmentCommittee on Energy and Natural ResourcesSubcommittee on EnergySubcommittee on Public Lands, Forests and MiningSubcommittee on Water and PowerCommittee on Homeland Security and Governmental AffairsUnited States Senate Homeland Security Permanent Subcommittee on InvestigationsUnited States Senate Homeland Security Subcommittee on Regulatory Affairs and Federal ManagementCommittee on Indian Affairs", "Positions": "Balanced Budget & No Budget, No Pay Daines introduced his first bill, the \"Balanced Budget Accountability Act,\" in February 2013. Daines' bill would require Congress to pass a budget that would balance in 10 years or have their pay terminated.  Daines also voted in support of No Budget, No Pay Act of 2013 (Public Law 113-3) which required both chambers of Congress to pass a budget by April 15, 2013, or the salaries of Members of that chamber would be put in an escrow account.Violence Against Women Act In February 2013, Daines voted in support of the Violence Against Women Act, which passed the House with 199 House Democratic and 87 House Republican votes.Gun law Daines has been vocal in his support for Second Amendment rights. In 2013, he called the Senate legislation to expand background checks \"the wrong approach\" and has been a vocal opponent of the bill, which failed to pass the Senate that April. Daines has also pledged to \"block\" any legislation that poses a threat to Second Amendment rights. In an April tour of a Billings, Montana, sporting goods shop and shooting range, Daines adopted the nickname \"Dead-Eye Daines\" after reaffirming his opposition to gun control measures and demonstrating his marksmanship skills.Energy and natural resource development Daines has criticized President Barack Obama for the Obama administration's positions on natural resource development, calling the President's June 2013 climate change proposal a \"job killer\" and a \"war on American energy.\"  Daines co-sponsored the \"Northern Route Approval Act\" which would allow for congressional approval of the Keystone pipeline Daines has expressed strong support of Montana's coal industry and oil production in eastern Montana and the Bakken formation.Daines has also called for the need for litigation reforms to clear the way for more active forest management and the revitalization of Montana's timber industry. In April, Daines signed on to the Restoring Healthy Forests for Healthy Communities Act, legislation to address the expiration of the Secure Rural Schools program by renewing the federal government's commitment to manage forest resources.North Fork Watershed Protection Act On June 5, 2013, Daines introduced the North Fork Watershed Protection Act of 2013 which would withdraw 430,000 acres of federal lands in Montana from programs to develop geothermal and mineral resources. The law would forbid mountaintop removal mining and other natural resource development. The affected lands lie adjacent to Glacier National Park and already have some protections. Rep. Daines emphasized his desire \"to rise above partisan politics, preserve the  pristine landscape, and 'protect this critical watershed',\" when he announced that he would be introducing the bill.  According to Daines, both conservationists and energy companies support the bill. The bill, also supported by Tester and Walsh, passed in the House; but Senate Republicans prevented it from being voted on, killing it in the Senate.Agriculture Daines supported the 2014 U.S. Farm Bill which reauthorizes nutrition and agriculture programs for the years 2014-2018.Taxes Daines has vocally opposed an Internet sales tax, which would allow states to collect taxes on online sales.  He has characterized legislation to provide the authority as \"a job-killing tax hike that hurts American small businesses.National security Daines supported President Donald Trump's 2017 executive order to impose a temporary ban on entry to the U.S. to citizens of seven Muslim-majority countries. He stated that \"We are at war with Islamic extremists and anything less than 100 percent verification of these refugees' backgrounds puts our national security at risk. We need to take the time to examine our existing programs to ensure terrorists aren't entering our country. The safety of U.S. citizens must be our number one priority.\"Elizabeth Warren On February 8, 2017, Senator Daines, while presiding over the U.S. Senate invoked Rule 19 of the U.S. Senate to prevent Senator Elizabeth Warren (D-MA) from reading a letter written by Coretta Scott King and first introduced during the 1986 U.S. Senate confirmation hearing for then-United States Attorney for Alabama Jeff Sessions to become a United States federal judge. King's letter, addressed to Senator Strom Thurmond (R-SC), describes a 1984 prosecution by Sessions of Albert Turner and other members of the Perry County Civic League for voting fraud. Since Sessions was (in 2017) a sitting United States Senator (R-AL), the reading of the letter from 1986 during the 2017 confirmation hearing for Sessions's appointment as United States Attorney General would be impugning Senator Sessions. Daines was assisted by Elizabeth MacDonough, the current Parliamentarian of the United States Senate, who read the language of Rule 19 to freshman Senator Daines. Senator Daines \"carefully repeated the language of Rule 19\" while censuring Senator Warren.Senate rules Daines is one of the Senate Republicans arguing in favor of the \"nuclear option\", \"to speed up consideration of President Trump's nominees\". Changing the Senate's rules to a simple majority vote would \"ensure a quicker pace on Trump's court picks\".", "Personal life": "Daines and his wife Cindy live in Bozeman with their four children: David, Annie, Michael and Caroline. Daines and his family are actively involved in community volunteer organizations and enjoy backpacking, hunting, skiing and fishing.  Daines enjoys mountain-climbing and has scaled Granite Peak and Grand Teton.In 2009, his sister, Susan Marie Owenhouse, passed away after a long battle with primary sclerosis cholangitis at the age of 43. She left behind her husband of 22 years, magician Jay Owenhouse, and their four children.On October 4, 2018, Daines publicly announced he would be walking his daughter (Annie) down the aisle during her wedding on Saturday, October 6, 2018. This was the same day the US Senate was scheduled to vote on the confirmation of Federal Appeals Court Judge Brett Kavanaugh's confirmation to be the Supreme Court of the United States Associate Justice to replace the retired Justice Anthony Kennedy. Ultimately, Daines did not vote as the Republicans secured the necessary votes to confirm Judge Kavanaugh. However, fellow Montana Congressman Greg Gianforte offered his private plane to Daines in the event he needed to fly to Washington D.C. if necessary. Kavanaugh was confirmed 50-48, Lisa Murkowski (R-AK) during the final confirmation vote, voted \"present\" as a pair to Daines who would've cancelled her vote.", "Electoral history": "Montana Governor/Lieutenant Governor Republican primary election, 2008PartyCandidatesVotes%+%RepublicanRoy Brown/Steve Daines65,88380.81%RepublicanLarry Steele/Harold Luce15,64319.19%Montana Governor/Lieutenant Governor election, 2008PartyCandidatesVotes%+%DemocraticBrian Schweitzer/John Bohlinger318,67065.47%RepublicanRoy Brown/Steve Daines158,26832.52%LibertarianStan Jones/Michael Baker9,7962.01%Montana's at-large congressional district Republican primary election, 2012PartyCandidateVotes%+%RepublicanSteve Daines82,84371.25%RepublicanEric Brosten21,01218.07%RepublicanVincent Melkus12,42010.68%Montana's at-large congressional district election, 2012PartyCandidateVotes%+%RepublicanSteve Daines255,46853.25%DemocraticKim Gillan204,93942.72%LibertarianDavid Kaiser19,3334.03%U.S. Senate Republican primary election in Montana, 2014PartyCandidateVotes%+%RepublicanSteve Daines110,56583.37%RepublicanSusan Cundiff11,9098.98%RepublicanChamp Edmunds10,1517.65%U.S. Senate election in Montana, 2014PartyCandidateVotes%+%RepublicanSteve Daines213,70957.79%DemocraticAmanda Curtis148,18440.07%LibertarianRoger Roots7,9332.15%", "introduction": "Steven David Daines (born August 20, 1962) is an American entrepreneur and politician serving as the junior United States Senator from Montana since 2015. He previously was the U.S. Representative for Montana's at-large congressional district from 2013 to 2015. In the 2014 midterm election, he won an open seat, defeating Democrat Amanda Curtis.\n\n"}, "personal": {"Born": "Steven David Daines (1962-08-20) August 20, 1962 (age56)Van Nuys, California, U.S.", "Political party": "Republican", "Spouse(s)": "Cindy Daines", "Children": "4", "Relatives": "Jay Owenhouse (Brother-in-law)", "Education": "Montana State University (BS)"}, "timeline": {"United States Senatorfrom Montana": {"date": "Assumed office January 3, 2015Serving with Jon Tester", "Preceded by": "John Walsh"}, "Member of the US House of Representativesfrom Montana's at-large district": {"date": "In officeJanuary 3, 2013– January 3, 2015", "Preceded by": "Denny Rehberg", "Succeeded by": "Ryan Zinke"}}, "code": "D000618", "type": "3", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.54", "social": "-0.08", "leadership": "0.4"}