{'name': 'Steve.Chabot', 'picture': 'C000266.jpg', 'detail': {'Early life, education, and pre-political career': "Chabot was born in 1953 in Cincinnati, Ohio, the son of Gerard Joseph and Doris Leona (née Tilley) Chabot; paternally, he is of French-Canadian descent. He graduated from La Salle High School in Cincinnati in 1971, and then from the College of William and Mary in 1975, earning a B.A. in history. He went on to obtain a Juris Doctor degree from Northern Kentucky University's Salmon P. Chase College of Law, in Highland Heights, Kentucky, in 1978. He worked as an elementary school teacher in 1975–1976 while taking law classes at night.As a practicing attorney from 1978 to 1994, Chabot handled domestic disputes and the drafting of wills as a sole practitioner. He operated out of a small law office in Westwood.", 'Early political career': 'Chabot ran unsuccessfully for the Cincinnati City Council as an independent candidate in 1979 and as a Republican in 1983. Then, running as a Republican, he won a seat in 1985 and was re-elected in 1987 and 1989. In 1988, he ran for the U.S. House of Representatives against seven-term incumbent Democrat Tom Luken, who defeated Chabot 56–44%. After that, he was appointed a Commissioner of Hamilton County, Ohio, in 1990, and was elected later that year and again in 1992, staying until 1994.', 'US House of Representatives': 'Elections In 1994, he ran for the U.S. House again and defeated Democratic incumbent David S. Mann of Ohio\'s 1st congressional district, 56%–44%. In 1996, he defeated Democrat Mark Longabaugh, member of the Cincinnati City Council, 54%–43%. In 1998, he defeated Cincinnati Mayor Roxanne Qualls, 53% to 47%. In the series of debates during that campaign, Qualls criticized Chabot for not funneling enough federal spending back to his home district. Chabot countered that he would not support "wasteful or unnecessary" federal programs. In 2000, he defeated City Councilman and Harvard graduate John Cranley 53–44%. In 2002, he defeated Greg Harris, with 65% of the vote. In 2004, he defeated Greg Harris again, with 60% of the vote.2006He defeated Democratic challenger John Cranley again, this time by a narrower margin of 52–48%.2008Chabot was defeated by State Representative Steve Driehaus 52%–48%.2010In a rematch, Chabot defeated Democratic incumbent Steve Driehaus, Libertarian Jim Berns, and Green Party nominee Richard Stevenson. Chabot won by a margin 51%–46%.2012Steve Chabot defeated Democratic nominee Jeff Sinnard 58%–38%, with Green nominee Rich Stevenson, and Libertarian nominee Jim Berns picking up the balance. He was helped by the 2010 round of redistricting, which shifted most of heavily Republican Warren County to the 1st.Tenure Committee assignments Committee on Foreign AffairsSubcommittee on Asia and the PacificSubcommittee on the Middle East and South Asia (Chairman)Committee on the JudiciarySubcommittee on the ConstitutionSubcommittee on Intellectual Property, Competition, and the InternetCommittee on Small Business', 'Electoral history': "Ohio's 1st congressional district: Results 1988, 1994–2012YearWinnerVotesPctRunner-upVotesPct3rd PartyPartyVotesPct3rd PartyPartyVotesPct1988Thomas A. Luken (inc.)117,68257%Steve Chabot90,73843%1994Steve Chabot92,99756%David S. Mann (inc.)72,82244%1996Steve Chabot (inc.)118,32454%Mark P. Longabaugh94,71943%John G. HalleyNatural Law5,3812%1998Steve Chabot (inc.)92,42153%Roxanne Qualls82,00347%2000Steve Chabot (inc.)116,76853%John Cranley98,32845%David A. GroshoffLibertarian3,3992%Richard L. StevensonNatural Law1,9331%2002Steve Chabot (inc.)110,76065%Greg Harris60,16835%2004Steve Chabot (inc.)173,43060%Greg Harris116,23540%*2006Steve Chabot (inc.)105,68052%John Cranley96,58448%2008Steve Driehaus155,45552%Steve Chabot (inc.)140,68348%*2010Steve Chabot103,77052%Steven L. Driehaus (inc.)92,67245%Jim A. BernsLibertarian3,0762%Richard L. StevensonNatural Law2,0001%2012Steve Chabot201,90758%Jeff Sinnard131,49038%Jim A. BernsLibertarian9,6743%Richard L. StevensonGreen Party6,6452%.mw-parser-output .refbegin{font-size:90%;margin-bottom:0.5em}.mw-parser-output .refbegin-hanging-indents>ul{list-style-type:none;margin-left:0}.mw-parser-output .refbegin-hanging-indents>ul>li,.mw-parser-output .refbegin-hanging-indents>dl>dd{margin-left:0;padding-left:3.2em;text-indent:-3.2em;list-style:none}.mw-parser-output .refbegin-100{font-size:100%}", 'Political positions': 'As of January 2018, Chabot had voted with his party in 98.2% of votes in the 115th United States Congress and voted in line with President Trump\'s position in 94.9% of votes.Health care Chabot authored a bill prohibiting a form of late-term abortion called partial-birth abortion, referred to in some medical literature by its less common name of intact dilation and extraction. President George W. Bush signed the bill into law on November 5, 2003.[non-primary source needed]Chabot favors repealing the Affordable Care Act (Obamacare). He supported the March 2017 version of the American Health Care Act, the GOP\'s replacement bill for Obamacare. On May 4, 2017, Chabot voted to repeal the Patient Protection and Affordable Care Act and pass the American Health Care Act.Economy The Concord Coalition and anti-tax advocacy groups such as Citizens Against Government Waste and the National Taxpayers Union consistently rated Chabot as one of the most anti-tax members of Congress.[non-primary source needed]Chabot has advocated for a repeal or modification of the Dodd-Frank Act, which was passed as a response to the financial crisis of 2007–2008.Environment On the topic of man-made climate change, Chabot said "the evidence concerning man-made climate change is far from conclusive". Chabot said cap-and-trade was an "extreme proposal" that would harm the economy.The group Republicans for Environmental Protection issued Chabot an "environmental harm demerit" in 2006 for sponsoring H.R. 4772, a bill that allows land use disputes to proceed immediately to federal court; according to the organization, the bill "would have undermined local control over local planning and zoning matters, a central principle of America\'s federal system". In the same year, the group praised Chabot for offering legislation "prohibiting the Forest Service from spending taxpayer dollars to build new logging roads for private interests in the Tongass National Forest. The environmental advocacy group the League of Conservation Voters gave Chabot a grade of 10% for the 109th Congress, noting that he voted "anti-environment" on 11 out of 12 issues selected by that organization as crucial; his lifetime grade from the LCV is 23%.Other On August 22, 2011, Chabot asked Cincinnati police to confiscate cameras being used by private citizens to record a town-hall meeting, even as media television cameras recorded the incident. YouTube videos of the incident provided wide awareness of the incident, and the participating police officer was later disciplined.On March 25, 2014, Chabot introduced the Foreign Cultural Exchange Jurisdictional Immunity Clarification Act (H.R. 4292; 113th Congress) into the House. According to a legislative digest provided by House Republicans, the bill "narrowly amends the Foreign Sovereign Immunities Act (FSIA) to make it easier for U.S. cultural and educational institutions to borrow art and other culturally significant objects from foreign countries." However, the changes made by the bill would not provide any immunity to art or objects that were "taken in violation of international law by Nazi Germany between January 30, 1933 and May 8, 1945."In 2002, Chabot advocated teaching intelligent design alongside the theory of evolution by natural selection in Ohio high schools.Chabot has called for ending logging subsidies in the Tongass National Forest in Alaska, and promoted relations with Taiwan. In 2002, Chabot helped spearhead the local campaign against building a light rail system in Hamilton County.As of 2016, Chabot had traveled on congressional fact-finding missions to 46 countries at a cost of $200,000.', 'Personal life': 'Chabot and his wife Donna have two children.[citation needed]', 'introduction': "Steven Joseph Chabot /ˈʃæbət/ (born January 22, 1953) is an American politician and lawyer who has been the United States Representative for Ohio's 1st congressional district since 2011. Chabot, a member of the Republican Party, previously represented the district from 1995 to 2009.\n\n", 'code': '01'}, 'personal': {'Born': 'Steven Joseph Chabot (1953-01-22) January 22, 1953 (age65)Cincinnati, Ohio, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Donna Chabot', 'Children': '2', 'Education': 'College of William & Mary (BA)Northern Kentucky University (JD)'}, 'timeline': {'Chair of the House Small Business Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Sam Graves'}, "Member of the US House of Representativesfrom Ohio's 1st district": {'date': 'In officeJanuary 3, 1995– January 3, 2009', 'Preceded by': 'David Mann', 'Succeeded by': 'Steve Driehaus'}, 'code': '01'}, 'code': 'C000266'}