{'name': 'Susan.Collins', 'picture': 'C001035.jpg', 'detail': {'Early life': "This section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. (January 2018) (Learn how and when to remove this template message)One of six children, Collins was born in Caribou, Maine, where her family operates a lumber business established by her great-great-great grandfather, Samuel W. Collins, in 1844.Her parents, Patricia (née McGuigan) and Donald F. Collins (1925-2018), each served as mayor of Caribou. Her father, a decorated World War II vet, also served in both houses of the Maine Legislature, one term in the house and four in the senate. Her mother was born in Barrancabermeja, Colombia, to American parents. Collins has English and Irish ancestry. Her uncle, Samuel W. Collins Jr., sat on the Maine Supreme Judicial Court from 1988 to 1994 and served in the Maine Senate from 1973 to 1984.Collins attended Caribou High School, where she was president of the student council. During her senior year of high school in 1971, Collins was chosen to participate in the U.S. Senate Youth Program, through which she visited Washington, D.C. for the first time and engaged in a two-hour conversation with Maine's first female United States Senator, Margaret Chase Smith, also a Republican. Collins is the first program delegate elected to the Senate and currently holds the seat once held by Smith.After graduating from Caribou High School, she continued her education at St. Lawrence University in Canton, New York. Like her father, she was elected to the Phi Beta Kappa national academic honor society and Collins graduated from St. Lawrence magna cum laude with a bachelor's degree in government in 1975.", 'Early political career': "This section needs additional citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. (January 2018) (Learn how and when to remove this template message)Following graduation, Collins worked as a legislative assistant to U.S. Representative, and later U.S. Senator William Cohen (R-ME) from 1975 to 1987. She was also staff director of the Oversight of Government Management Subcommittee on the United States Senate Committee on Homeland Security and Governmental Affairs (1981–87).In 1987, Collins joined the cabinet of Governor John R. McKernan, Jr., as Commissioner of the Department of Professional and Financial Regulation. She was appointed the New England regional director for the Small Business Administration by President George H. W. Bush in 1992. After briefly serving in this post until the 1992 election of Democrat Bill Clinton, she moved to Massachusetts and became Deputy State Treasurer of Massachusetts under Joe Malone in 1993.Returning to Maine, Collins won an eight-way Republican primary in the 1994 gubernatorial election, becoming the first woman to be nominated by a major party for Governor of Maine. During the campaign, she received little support from Republican leaders and was criticized by conservative groups for her more liberal views on social issues. She lost the general election, receiving 23% of the vote and placed third behind Democrat Joseph E. Brennan and the winner, Independent candidate Angus King, her future Senate colleague.In December 1994, Collins became the founding executive director of the Center for Family Business at Husson College, Bangor, Maine. She served in this post until 1996, when she announced her candidacy for the seat in the U.S. Senate being vacated by her former boss, William Cohen, who retired to become United States Secretary of Defense under President Clinton. With Cohen's public endorsement, she won a difficult four-way primary and faced Joe Brennan, her Democratic opponent from the 1994 gubernatorial election, in the general election. She eventually defeated Brennan by a margin of 49% to 44%.[citation needed]She was reelected in 2002 over State Senator Chellie Pingree (D), 58%–42%, and again in 2008 over Rep. Tom Allen (D), 61.5%–38.5%. In both elections, she carried every county in Maine. In 2014, Collins defeated Democrat Shenna Bellows, 68.5%-31.5%, again carrying every county.[citation needed]", 'Senate career': 'Collins was described as one of "the last survivors of a once common species of moderate Northeastern Republican" during the Obama administration. She is considered a centrist member of the Republican Party, and an influential player in the U.S. Senate.In 2017, The Lugar Center, a Washington, D.C.-based nonprofit founded by Senator Richard Lugar released a bipartisan index in cooperation with Georgetown University, ranking Senator Collins the most bipartisan senator during the first session of the 115th Congress (and the only U.S. Senator from the Northeast ranked among the top 10 most bipartisan senators).She is a member of several moderate organizations within the Republican Party, including the Republican Main Street Partnership, Republican Majority For Choice, Republicans for Choice, The Wish List, Republicans for Environmental Protection, and the Republican Leadership Council.  Although she shares a centrist ideology with Maine\'s former senator, Olympia Snowe, Collins is considered a "half-turn more conservative" than Snowe. Collins has consistently been endorsed by the Human Rights Campaign, a major LGBT rights organization; she was one of six Republicans running in 2008 to be endorsed by the HRC. She supported John McCain in the 2008 election for President of the United States. Collins became the state\'s senior senator in 2013 when Snowe left the Senate and was replaced by independent Angus King, who had defeated Collins in the 1994 governor election.[citation needed]In the 1990s, Collins played an important role during the U.S. Senate\'s impeachment trial of Bill Clinton when she and fellow Maine Senator Olympia Snowe sponsored a motion that would have allowed the Senate to vote separately on the charges and the remedy. When the motion failed, both Snowe and Collins subsequently voted to acquit, believing that while Clinton had broken the law by committing perjury, the charges did not amount to grounds for removal from office.[citation needed]In March 1997, the Senate adopted a broader investigation into White House and Congressional campaign fund-raising practices than initially wanted by Senate Republicans, who softened on the issue after a lunch meeting in a private caucus room. Collins stated there were "a number of allegations that may or may not be illegal, but they may be improper".In a May 1997 interview, Collins stated her support for a proposal by Tom Daschle banning all abortions after the fetus was capable of living outside the womb and allowing exceptions to save the life of the woman and to protect her from physical injury imposed by the pregnancy. At the time there was an alternate measure proposed by Rick Santorum that would ban partial-birth abortion, which Collins said "ignores cases in the medical literature involving women with very serious physical health problems."On March 26, 2014, Elle Magazine honored Collins as "one of the ten most powerful Women in Washington Power List".Collins cast her 6,000th consecutive roll call vote on September 17, 2015. Only William Proxmire has a longer consecutive streak.According to a poll released by Morning Consult on November 24, 2015, Collins, with a 78% approval rating, had the highest approval rating of any sitting Republican U.S. senator, as well as the second-highest overall, behind only Independent Bernie Sanders of Vermont. In July, 2018, Morning Consult showed Collins with a 56% approval rating, with 34% disapproving. Only a month later, on August 21, a Public Policy Polling poll showed Collins with a 35% approval rating, with 48% disapproving, following her support for Brett Kavanaugh\'s nomination to the U.S. Supreme Court.', 'Political positions': 'Collins is a self-described "moderate Republican". She has occasionally been referred to as a "liberal Republican" relative to her colleagues. In 2013, the National Journal gave Collins a score of 55% conservative and 45% liberal.The New York Times arranged Republican Senators in 2017 based on ideology and ranked Senator Collins as the most liberal Republican. According to GovTrack, Senator Collins is the most moderate Republican in the Senate; GovTrack\'s analysis places her to the left of every Republican and four Democrats, Joe Donnelly, Heidi Heitkamp, Joe Manchin, and Jon Tester. Another website, OnTheIssues.org, labels Collins a "Moderate Libertarian Liberal". It also gives politicians a "social score" and an "economic score". Her social score is 60%, with 0% being the most conservative and 100% being the most liberal. Additionally, Collins\'s economic score is 53%, with 0% being the most liberal and 100% being the most conservative. The American Conservative Union gives her a lifetime rating of 46.03% conservative. In 2016, the ACU gave Collins a score of 23%. The Americans for Democratic Action gives her a rating of 45% liberal. In 2015, the ADA gave her a score of 30%.According to CQ Roll Call, Collins sided with President Obama\'s position 75.9% of the time, one of only two Republicans to vote with him more than 70% of the time. Five ThirtyEight, which tracks Congressional votes, found that Collins voted with President Trump\'s positions 78.9% of the time as of August 2018. Nonetheless, she has voted with the GOP majority on party-line votes with much greater frequency during the Trump presidency than during the Obama presidency.  "In 2017...Collins voted with her party a significantly higher 87% of the time on party-line votes. That was by far the highest in her career. It still made her the Republican senator most likely to cross the aisle, but it also moved her significantly closer to how often the average Republican senator voted with their party on party-line votes (96% in 2017). Collins voted for the Republican tax plan and, perhaps most significantly, for Neil Gorsuch\'s confirmation to the Supreme Court." Bipartisanship and moderate RepublicanismSusan Collins has been considered to be one of the most bipartisan members of Congress. In 2018, Collins was considered the most bipartisan senator for the fifth consecutive year by the Lugar Center. A study published by Congressional Quarterly found that Collins voted with her party on party-line votes 59% of the time between 1997 and 2016; currently, she is the Republican senator most likely to vote with Democrats.  Her perceived bipartisanship is largely due to her roots as a moderate or relatively liberal Northeastern Republican. "Liberal to moderate Northeastern Republicans once were as much a part of the political landscape as today\'s liberals from Massachusetts." With regard to judicial nominees, however, Collins has voted with the GOP majority nearly 99% of the time over the last 22 years. However, she also voted to confirm Democratic Supreme Court nominees, Sonia Sotomayor and Elena Kagan.In 2014, her Senate colleague, Angus King, an Independent who caucuses with the Democratic Party, endorsed her for her re-election campaign. This bipartisanship and centrism has attracted some criticism from the right-wing of the GOP. The conservative magazine, Human Events, considered her to be one of the top ten RINOs, or what they label insufficiently conservative, in 2005. Her highest conservative composite score from the National Journal was a 62% in 2009, while her highest liberal composite score was a 52.8% in 2006. The Tea Party threatened to challenge Collins over some of her votes. Collins "who is fiscally conservative but holds socially moderate views, plays a unique role in the current Republican drama at a time when a strong Tea Party faction has pushed the GOP — and its leadership — to the right." She was the subject of negative criticism from movement conservatives for her vote against repealing Obamacare. Conversely. she was endorsed in her 2014 re-election campaign by the League of Conservation Voters and the Human Rights Campaign.Donald TrumpOn August 8, 2016, Collins announced that she would not be voting for Donald Trump, the Republican nominee for the 2016 election. She said that as a lifelong Republican she did not make the decision lightly but felt that he is unsuitable for office, "based on his disregard for the precept of treating others with respect, an idea that should transcend politics." During the Trump presidency, Collins has voted with the GOP majority with much greater frequency (87% of the time on party-line votes in 2017).Firing of FBI Director James ComeyCollins supported Trump\'s decision to fire FBI Director James Comey.Temporary travel banOn January 28, 2017, Collins joined five other Republicans to oppose President Donald Trump\'s temporary ban on immigration from seven Muslim-majority countries saying it is "overly broad and implementing it will be immediately problematic."  She said, for example, that "it could interfere with the immigration of Iraqis who worked for American forces in Iraq as translators and bodyguards — people who literally saved the lives of our troops and diplomats during the last decade and whose lives are at risk if they remain in Iraq." She also objected to the religious aspects of the ban saying, "As I stated last summer, religious tests serve no useful purpose in the immigration process and run contrary to our American values."InvestigationsCollins stated in February 2017 that she was open to subpoena President Trump\'s tax returns as part of an investigation into Russian interference in the 2016 presidential election. She also said that she was open to public and secret hearings into Michael T. Flynn\'s covert communications with Russian officials.Foreign policy and terrorismOctober 10, 2002, saw Collins vote with the majority in favor of the Iraq War Resolution authorizing President George W. Bush to go to war against Iraq.On September 19, 2007, she voted against a motion to invoke cloture on Senator Arlen Specter\'s amendment proposing to restore habeas corpus for those detained by the United States.Collins, joining the Senate majority, voted in favor of the Protect America Act, an amendment to the Foreign Intelligence Surveillance Act of 1978. She later sponsored the Accountability in Government Contracting Act of 2007, approved unanimously by the Senate, which would create more competition between military contractors.Agreeing with the majority in both parties, Collins voted in favor of the Kyl-Lieberman Amendment, which gave President Bush and the executive branch the authorization for military force against Iran.In August 2017, after President Trump threatened North Korea would be "met with fire and fury like the world has never seen" if it continued threatening the United States, Collins said in a statement, "Given the credible and serious threat North Korea poses to our country, and in particular to U.S. forces and our allies in the region, I welcome the administration’s success in securing new economic sanctions against North Korea at the United Nations." In July 2018, Collins said a Washington Post report that found North Korea allegedly not willing to denuclearize as troubling, citing North Korea\'s "long history of cheating on agreements that it’s made with previous administrations." She recalled her support for Trump communicating with North Korean leader Kim Jong-un was "because I do believe that has the potential for increasing our safety and eventually leading to the denuclearization of North Korea" and added that this could be achieved through "verifiable, unimpeded, reliable inspections."In March 2018, Collins was one of four Republican senators to vote against tabling a resolution that would cease the U.S. military\'s support for Saudi Arabia\'s bombing operations in Yemen. In August, Collins was one of nine senators and two Republicans to sign a letter to Secretary of State Mike Pompeo urging the Trump administration to comply with a law requiring certification that Saudi Arabia and the United Arab Emirates were meeting a humanitarian criteria or else being removed from American military assistance. The letter implicated the ongoing Yemen civil war as posing a threat to American interests through its continuation.Social issuesAbortion lawsCollins is a pro-choice Republican. The Republican Majority for Choice, a pro-choice Republican PAC, supports Senator Collins. By July 2018, Collins was one of three Republican Senators, the others being Shelley Capito and Lisa Murkowski, who publicly supported the Roe v. Wade decision.On October 21, 2003, with Senate Democrats, Collins was one of the three Republican Senators to oppose the Partial-Birth Abortion Ban Act. She did however join the majority of Republicans in voting for Laci and Conner\'s Law to increase penalties for killing the fetus while committing a violent crime against the mother. On March 30, 2017, Collins would again join Senator Lisa Murkowski (R-AK) to break party lines on a vote; this time against a bill allowing states to defund Planned Parenthood. As in that case, Vice President Pence was forced to break a 50–50 tie in favor of the bill. In 2018, Collins voted with the majority of Senate Democrats against a bill that would ban abortion after 20 weeks of pregnancy. She was also one of two Republicans who voted against an amendment to ban federal funds for facilities that provide abortion services and family planning.Planned Parenthood, which rates politicians\' support for pro-choice issues, has given Collins a lifetime rating of 70%. In 2017, Planned Parenthood gave her a rating of 61%. NARAL Pro-Choice America, which also provides ratings, gave her a score of 90% in 2014. In 2014, Planned Parenthood gave Collins a rating of 85%. Conversely, National Right to Life, which opposes abortion and rates support for pro-life issues, gave Collins a rating of 25% during the 114th Congress.LGBT issuesIn 2004, Susan Collins was one of six Republicans who voted against the Federal Marriage Amendment which was an amendment intended to ban same-sex marriage. In June 2006, she voted against the Federal Marriage Amendment for a second time. Collins joined six other Republicans, including Olympia Snowe and John McCain, in voting against the effort to ban gay marriage.On December 18, 2010, Collins voted in favor of the Don\'t Ask, Don\'t Tell Repeal Act of 2010 and was the primary Republican sponsor of the repeal effort.Collins stated her support on same-sex marriage on June 25, 2014, after previously declining to publicly state her views, citing a policy to not discuss state-level issues, as well as a belief that each state\'s voters should decide the issue. When she won reelection in 2014, she became the first Republican senator to be reelected while supporting same-sex marriage.Collins voted for the Employment Non-Discrimination Act to prevent job discrimination based on sexuality and gender identity. In 2015, she was one of 11 Republican Senators who voted to give social security benefits to same-sex couples in states where same-sex marriage was not yet recognized. The Human Rights Campaign, which rates politicians\' support for LGBT issues, gave Collins a score of 85% during the 114th Congress.In 2017, Collins and New York Senator Kirsten Gillibrand "introduced a bipartisan amendment to protect transgender service members from President Trump\'s plan to ban them from the military."Judicial appointmentsIn May 2005, Collins was one of fourteen senators (seven Democrats and seven Republicans) to forge a compromise on the Democrats\' use of the judicial filibuster, thus allowing the Republican leadership to end debate without having to exercise the so-called nuclear option. Under the agreement, the minority party agreed that it would filibuster President George W. Bush\'s judicial nominees only in "extraordinary circumstances"; three Bush appellate court nominees (Janice Rogers Brown, Priscilla Owen, and William Pryor) would receive a vote by the full Senate; and two others, Henry Saad and William Myers, were expressly denied such protection (both eventually withdrew their names from consideration).Collins voted for the confirmation of George W. Bush Supreme Court nominees Samuel Alito and John G. Roberts, as well Barack Obama Supreme Court nominees Elena Kagan and Sonia Sotomayor.After President Obama nominated Merrick Garland to the Supreme Court, Collins publicly opposed the Senate Republican leadership\'s decision to refuse to consider the nomination, and urged her Republican colleagues to "follow regular order" and give Garland a confirmation hearing and a vote in the Senate Judiciary Committee in the normal fashion.In 2017 Collins voted for the confirmation of President Trump\'s nomination of John K. Bush for Circuit Judge of the United States Court of Appeals for the Sixth Circuit.  During his confirmation hearings it was disclosed that he had authored pseudonymous blog posts in which he disparaged gay rights, compared abortion to slavery, and linked to articles on right-wing conspiracy theory websites.In 2017 and 2018, Collins was one of two Senate Republicans (the other being Lisa Murkowski) who were opposed to efforts by Senate Majority Leader Mitch McConnell and the rest of the Senate Republican leadership to invoke the "nuclear option" (changing the Senate\'s rules) in order to speed up Senate confirmation of President Donald Trump\'s judicial nominees. Also in 2018, Collins was one of three Republican Senators, along with Jeff Flake (Arizona) and Murkowski, who supported an FBI investigation into sexual assault allegations made against Trump\'s second Supreme Court nominee, Brett Kavanaugh. She later announced her decision to vote in favor of his confirmation. Her vote sparked opposition, including fundraising for her next hypothetical opponent, and increased speculation about possible Democratic challengers in 2020.Immigration and tradeCollins has voted against free-trade agreements including the Dominican Republic – Central America Free Trade Agreement. In 1999 she was one of four Republicans (along with her colleague Olympia Snowe) to vote for a Wellstone amendment to the Trade and Development Act of 2000 which would have conditioned trade benefits for Caribbean countries on "compliance with internationally recognized labor rights".Collins coauthored, along with Senator Joe Lieberman (D-CT/I-CT), the Collins-Lieberman Intelligence Reform and Terrorism Prevention Act of 2004. This law implemented many of the recommendations of the 9-11 Commission, modernizing and improving America\'s intelligence systems. In October 2006, President George W. Bush signed into law major port security legislation coauthored by Collins and Washington Senator Patty Murray. The new law includes major provisions to significantly strengthen security at US ports.[citation needed]As ranking member of the Homeland Security and Governmental Affairs Committee, Collins and committee Chairman Joe Lieberman voiced concerns about budget, outside contractors, privacy and civil liberties relating to the National Cybersecurity Center, the Comprehensive National Cybersecurity Initiative and United States Department of Homeland Security plans to enhance Einstein, the program which protects federal networks. Citing improved security and the benefits of information sharing, as of mid-2008, Collins was satisfied with the response the committee received from Secretary Michael Chertoff.In 2007, she voted against the McCain-Kennedy proposal which would have given amnesty to undocumented immigrants. In 2010, Collins voted against the DREAM Act. However, in 2013, Collins was one of fourteen Republicans who voted in favor of a comprehensive immigration bill that included border security and a pathway to citizenship for undocumented immigrants.Collins criticized President Donald Trump\'s 2017 executive order to ban entry to the U.S. to citizens of seven Muslim-majority countries, stating: "The worldwide refugee ban set forth in the executive order is overly broad and implementing it will be immediately problematic." In 2018, Susan Collins co-sponsored bipartisan comprehensive immigration reform which would have granted a pathway to citizenship to 1.8 million Dreamers while also giving $25 billion to border security; at the same time, Collins voted against the McCain/Coons proposal for a pathway to citizenship without funding for a border wall as well as against the Republican proposal backed by Trump to reduce and restrict legal immigration.When President Trump and Jeff Sessions announced a \'zero-tolerance\' policy on migrants at the border and separated children from parents, Susan Collins opposed the move and urged Trump to "put an end" to the separation of families. She said that separating children from parents at the border is "inconsistent with American values." However, she said that she did not support the Democratic bill to stop the separation of families and said that she instead supports the bipartisan bill she proposed in February to give a pathway to citizenship for 2 million undocumented immigrants and provide $25 billion in border security.Economic issuesSusan Collins had a mixed record on the Bush tax cuts. In 2004, she joined other "Senate moderates -- John McCain of Arizona, Olympia J. Snowe...of Maine, and Lincoln Chafee of Rhode Island" in opposing how the Bush administration wanted to implement the tax cuts. The four Republicans cited deficit concerns as a reason for opposing the tax cut plans. Collins voted in favor of and for the extension of the Bush tax cuts in 2003 and 2006.She offered an amendment to the original bill that allowed for tax credits to school teachers who purchase classroom materials.Ultimately, Collins was one of just three Republican lawmakers to vote for the American Recovery and Reinvestment Act, earning heated criticism from the right for crossing party lines on the bill.In mid-December 2009, she was again one of three Republican senators to back a $1.1 trillion appropriations bill for the fiscal year beginning in 2010, joining Thad Cochran (R-Mississippi) and Kit Bond (R-Missouri) in compensating for three Democratic "nay" votes to pass the bill over a threatened GOP filibuster.In April 2014, the United States Senate debated the Minimum Wage Fairness Act (S. 1737; 113th Congress). The bill would amend the Fair Labor Standards Act of 1938 (FLSA) to increase the federal minimum wage for employees to $10.10 per hour over the course of a two-year period. The bill was strongly supported by President Barack Obama and many of the Democratic Senators, but strongly opposed by Republicans in the Senate and House. Collins tried to negotiate a compromise bill that centrist Republicans could agree to, but was unable to do so.Collins tried to argue that the Congressional Budget Office report predicting 500,000 jobs lost if the minimum wage was increased to $10.10 also said that an increase to $9.00 would only lead to 100,000 jobs lost, but the argument did not seem to persuade her fellow centrists. She said, "I\'m confident that the votes are not there to pass a minimum wage increase up to $10.10 therefore it seems to me to make sense for senators on both sides of the aisle to get together and see if we can come up with a package that would help low-income families with causing the kind of job loss that the Congressional Budget Office has warned against."Collins announced that she\'s opposed to cutting the tax rate for income earners making more than $1 million a year and opposed to eliminating the estate tax. She stated that she does not see a need to eliminate the estate tax. She was also one of two Republicans to vote with Democrats against budget cuts.In December 2017, Collins voted to pass the 2017 Republican tax plan. The bill would greatly reduce corporate taxes, reduce taxes for some individuals but increase them for other individuals by removing some popular deductions, and increase the deficit. The bill also repeals the individual mandate of the Affordable Care Act, which would leave 13 million Americans uninsured and raise premiums by an estimated additional 10% per year. After the vote, Collins said that she received assurances from congressional leaders that they would pass legislation intended to mitigate some of the adverse effects of the repeal of the individual mandate. When asked how she could vote for a bill that would raise the deficit by an estimated $1 trillion (over ten years) after having railed against the deficit during the Obama administration, Collins insisted that the tax plan would not raise the deficit. She said she had been advised in this determination by economists Glenn Hubbard, Larry Lindsey, and Douglas Holtz-Eakin, but Hubbard and Holtz-Eakin later denied stating that the plan would not increase the deficit.HealthcareIn April 1997, Collins was one of seven Republicans cosponsoring legislation introduced by Ted Kennedy and Orrin Hatch that would provide children\'s health insurance by raising the cigarette tax. Along with Ted Stevens and Ben Nighthorse Campbell, Collins stated her disapproval for the component increasing taxes on cigarettes and a spokesman of hers said she would find other ways to raise funds for the insurance.On January 29, 2009, Collins voted in favor of the State Children\'s Health Insurance Program Reauthorization Act (H.R. 2).Collins opposed President Barack Obama\'s health reform legislation, the Patient Protection and Affordable Care Act, and voted against it in December 2009. She voted against the Health Care and Education Reconciliation Act of 2010. Senate Republicans made an effort to delay or kill the health care legislation through a filibuster of the defense spending bill, however the filibuster was defeated and Collins was one of three Republicans who voted with Democrats to end the filibuster.In January 2017, at the beginning of the Congress, Collins voted in favor of a bill to begin the repeal of the Affordable Care Act ("Obamacare"). However, with four other Republican senators, Collins is leading an effort to slow down the ACA repeal in the Senate. Collins and fellow Republican Senator Bill Cassidy of Louisiana have proposed legislation that permits states to either keep the ACA or move to a replacement program to be funded in part by the federal government. In January 2017, Collins "was the only Republican to vote for a defeated amendment...that would have prevented the Senate from adopting legislation cutting Social Security, Medicare or Medicaid."In March 2017, Collins said that she could not support the American Health Care Act, the House Republicans\' plan to repeal and replace the ACA. Collins announced she would vote against the Senate version of the Republican bill to repeal Obamacare. Collins has also clarified that she is against repealing the Affordable Care Act without a replacement proposal.On July 26, 2017, Collins was one of seven Republicans in voting against repealing the ACA without a suitable replacement. On July 27 the following day, Collins joined two other Republicans in voting \'No\' to the \'Skinny\' repeal of the ACA.In December 2017, Collins voted for a tax bill that repealed the Affordable Care Act\'s individual mandate, which the CBO estimates would increase the number of uninsured Americans by 13 million while causing higher health care premiums for those who remain insured. Collins made a deal with Senate Majority Leader Mitch McConnell, trading her opposition to repealing the Affordable Care Act’s individual mandate provision, in exchange for legislation that would financially stabilize the remaining health insurance program. "But after Collins voted for the tax reform package, McConnell reneged and never brought the stabilization bill up for a vote. In 2018, she was the only Republican who voted with Democrats on a resolution, that ultimately did not pass, against the "low cost, low coverage" insurance plans allowed by an executive order of President Trump.Environmental issuesIn September 2008, Collins joined the Gang of 20, a bipartisan group seeking a comprehensive energy reform bill. The group is pushing for a bill that would encourage state-by-state decisions on offshore drilling and authorize billions of dollars for conservation and alternative energy.The Carbon Limits and Energy for America\'s Renewal (CLEAR) Act (S. 2877), also called the Cantwell-Collins bill, would have directed the Secretary of the Treasury "to establish a program to regulate the entry of fossil carbon into commerce in the United States to promote renewable energy, jobs and economic growth."In May 2017, Collins was one of three Republicans who joined Democrats in voting against a repeal of Obama\'s regulations for drilling on public lands; the repeal effort was rejected by a 49-51 margin.In February 2017, Collins was the only Senate Republican to vote against confirmation of Scott Pruitt to lead the Environmental Protection Agency. Fourteen months later, on CNN\'s "State of the Union," she said regarding his actions as the EPA head, "whether it\'s trying to undermine the Clean Power Plan or weaken the restrictions on lead or undermine the methane rules," his behavior has validated her "no" vote.Gun policyCollins voted for the Manchin–Toomey bill to amend federal law to expand background checks for gun purchases. She has received a C+ grade on gun rights from the NRA, and D- from Gun Owners of America.Other issuesIn April 2014, the United States Senate debated the Paycheck Fairness Act (S. 2199; 113th Congress). It was a bill that "punishes employers for retaliating against workers who share wage information, puts the justification burden on employers as to why someone is paid less and allows workers to sue for punitive damages of wage discrimination." Collins voted against ending debate on the bill, saying that one of her reasons for doing so was that Majority Leader Harry Reid had refused to allow votes on any of the amendments that Republicans had suggested for the bill.In January 2017, both Collins and Senator Lisa Murkowski voted for Donald Trump\'s selection for Secretary of Education, Betsy DeVos, within the Senate Health, Education, Labor and Pensions, passing DeVos\' nomination by a vote of 12–11 to allow the full Senate to vote on the nominee. Collins justified her support vote due to her belief that "Presidents are entitled to considerable deference in the selection of Cabinet members". Later, Collins and Murkowski became the only Republicans to break party lines and vote against the nominee. This caused a 50–50 tie that was broken by Senate President Mike Pence to successfully confirm DeVos\' appointment.Another noted involvement in the Trump Cabinet confirmation process for Collins was her formal introduction of Sen. Jeff Sessions (R-AL) to the Judiciary Committee for its hearings on Sessions\' nomination to be Attorney General.On December 14, 2017, the same day that the FCC was set to hold a vote on net neutrality, Collins, along with Angus King, sent a letter to the FCC asking that the vote be postponed so as to allow for public hearings on the merits of repealing net neutrality. Collins and King expressed concerns that repealing net neutrality could adversely affect the US economy. As part of this drive, Collins is reported to support using the authority under the Congressional Review Act to nullify the FCC\'s repeal vote. In 2018, Collins was one of three Republicans voting with Democrats to repeal rule changes enacted by the Republican-controlled FCC. The measure was meant to restore Obama-era net neutrality rules.Notable legislationCollins introduced a bill in June 2013 that would define a "full-time employee" as someone who works for 40 hours per week (instead of 30 hours). The Affordable Care Act (ACA) defined a full-time worker as someone who works 30 hours per week. Collins is cited as saying that her bill would help avoid employers reducing workers\' hours to below 30 per week in order to comply with the ACA.In September 2013, Collins introduced a bill aimed at preventing Sudden Unexpected Infant Death Syndrome (SUIDS). The bill, dubbed The Child Care Infant Mortality Prevention Act, aims to raise the amount of provider training in infant wards as well as enhanced CPR and first aid training. Backers of this bill hope this will make a dent in the 4,000 children killed every year due to SUIDS. This would require the Health and Human Services Department to update their materials as well as improve their training resources to primary providers.Committee appointmentsUnited States Senate Committee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related AgenciesSubcommittee on Commerce, Justice, Science, and Related AgenciesSubcommittee on DefenseSubcommittee on Energy and Water DevelopmentSubcommittee on Military Construction, Veterans Affairs, and Related AgenciesSubcommittee on Transportation, Housing and Urban Development, and Related Agencies (Chair)Committee on Health, Education, Labor, and PensionsSubcommittee on Primary Health and AgingSelect Committee on IntelligenceSpecial Committee on Aging (Chair)Caucus membershipsAfterschool Caucuses', 'Awards and honors': 'On September 19, 2012, Collins received the Navy League\'s Congressional Sea Services Award "for her outstanding contributions in Congress to advance the mission of our nation\'s maritime services".Collins was awarded the U.S. Chamber of Commerce\'s 2013 Spirit of Enterprise Award for her support of the Chamber\'s positions in the Senate.On December 12, 2013, Collins received the "Legislator of the Year Award" from the Congressional Fire Services Institute (CFSI). CFSI, a nonprofit, nonpartisan policy institute established in 1989 which seeks to promote Congress\' awareness of the needs of first responders, presented the award to Collins in the Capitol Building in Washington, D.C. The Award is given to a member of Congress who the organization deems to have made a "significant contribution to the fire service."On February 24, 2014, Collins received the "Thought Leader Award" from the Corporation for Public Broadcasting. The award recognizes and honors American leaders who "affirm the essential services that public media provides to citizens in areas of education, journalism, and the arts."On May 7, 2014, National Journal recognized Collins as the senator with "perfect attendance", noting that Collins hadn\'t missed a single vote since her election to the Senate in 1997.Collins was a recipient of the Publius Award from the Center for the Study of the Presidency and Congress on March 12, 2014.On March 26, 2014, Elle Magazine honored Collins, with others, at the Italian Embassy in the United States during its annual "Women in Washington Power List."The Veterans of Foreign Wars gave Collins its 2017 Congressional Award, which is annually given to one member of Congress for their significant legislative contributions on behalf of military veterans.On May 28, 2017, Bates College honored Collins as an Honorary Doctor of Humane Letters for her bipartisan work in the Senate.', 'Donors': "For the period 2013 to 2018, Collins' top three donors (in descending order) are General Dynamics (defense/weapons industry), Cohen Group (business advisory firm providing corporate leadership with strategic advice and assistance in business development, regulatory affairs, deal sourcing, and capital raising activities), and Elliott Management (financial industry:  investment management firm ... the largest activist fund in the world)", 'Personal life': 'Collins is married to Thomas Daffron, then COO of Jefferson Consulting Group. They were married on August 11, 2012, at the Gray Memorial United Methodist Church in Caribou, Maine. She identifies as a member of the Catholic Church.', 'Electoral history': 'Maine gubernatorial election, 1994PartyCandidateVotes%±IndependentAngus King 180,829 35%  DemocraticJoseph Brennan172,95134%RepublicanSusan Collins117,99023%GreenJonathan Carter32,6956%N/AWrite-InEd Finks6,5761%N/AUnited States Senate election in Maine, 1996PartyCandidateVotes%±RepublicanSusan Collins 298,422 49.2%  DemocraticJoseph E. Brennan266,22643.9%GreenJohn Rensenbrink23,4413.9%TaxpayersWilliam P. Clarke18,6183.1%United States Senate election in Maine, 2002PartyCandidateVotes%±RepublicanSusan Collins (incumbent) 299,266 58.4%  DemocraticChellie Pingree205,90141.6%United States Senate election in Maine, 2008PartyCandidateVotes%±RepublicanSusan Collins (incumbent) 444,587 61.5%  DemocraticTom Allen278,65138.5%United States Senate election in Maine, 2014PartyCandidateVotes%±RepublicanSusan Collins (incumbent) 411,211 68.4% +6.9% DemocraticShenna Bellows189,65331.6%-6.9%', 'introduction': "Susan Margaret Collins (born December 7, 1952) is an American politician serving as the senior United States Senator for Maine, a seat to which she was first elected in 1996. A Republican, Collins is the chair of the Senate Special Committee on Aging and is a former chair of the Senate Committee on Homeland Security and Governmental Affairs. She is known also for having never missed a single Senate vote since she became senator, which by September 2015 had reached a 6,000 consecutive voting streak. She is the most senior Republican woman in the Senate and dean of Maine's congressional delegation. Collins has been described as the Senate's most moderate Republican. She often positions herself as a pivotal vote, thus becoming a focal point during highly watched legislation, although some consider this moderate image to be a media façade. She has been accused of duplicity by her opponents in her public statements on issues such as tax cuts, abortion (and Roe v. Wade), health care and the nomination of Brett Kavanaugh to the U.S. Supreme Court.\nBorn in Caribou, Maine, Collins is a graduate of St. Lawrence University. Beginning her career as a staff assistant for Senator William Cohen in 1975, she later became staff director of the Oversight of Government Management Subcommittee of the Committee on Governmental Affairs (which later became the Committee on Homeland Security and Governmental Affairs) in 1981.\nShe was then appointed as the Commissioner of the Maine Department of Professional and Financial Regulation by Governor John R. McKernan, Jr. in 1987. In 1992 she was appointed by President George H. W. Bush as the director of the Small Business Administration's regional office in Boston. Staying in Massachusetts, Collins became that state's Deputy State Treasurer in 1993. After moving back to Maine in 1994, Collins became the Republican nominee for governor in the 1994 general election. Becoming the first woman to become the nominee of a major party for Governor of Maine, Collins finished third in a four-way race with 23% of the vote. After her bid for governor in 1994, Collins became the founding director of the Center for Family Business at Husson University. Collins was first elected to the Senate in 1996. She has been re-elected three times, in 2002, 2008, and 2014.\n\n"}, 'personal': {'Born': 'Susan Margaret Collins (1952-12-07) December 7, 1952 (age65)Caribou, Maine, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Thomas Daffron (m.2012)', 'Parents': 'Donald CollinsPatricia McGuigan', 'Relatives': 'Samuel Collins (uncle)', 'Education': 'St. Lawrence University (BA)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Maine': {'date': 'Assumed office January 3, 1997Serving with Angus King', 'Preceded by': 'William Cohen'}, 'Chair of the Senate Aging Committee': {'date': 'Assumed office January 3, 2015', 'Preceded by': 'Bill Nelson'}, 'Chair of the Senate Homeland Security and Governmental Affairs Committee': {'date': 'In officeJanuary 3, 2003– January 3, 2007', 'Preceded by': 'Joe Lieberman', 'Succeeded by': 'Joe Lieberman'}}, 'code': 'C001035'}