{'name': 'Tammy.Baldwin', 'picture': 'B001230.jpg', 'detail': {'Early life, education and early political career': "Baldwin was born and grew up in Madison, Wisconsin. Baldwin's mother, who died in 2017, was 19 and going through a divorce when Baldwin was born. Baldwin was raised by her grandparents and spent Saturdays with her mother, who suffered from mental illness and opioid addiction. Her maternal grandfather, biochemist David E. Green, was Jewish (the son of immigrants from Russia and Germany), and her maternal grandmother, who was Anglican, was English-born. Baldwin's aunt is biochemist Rowena Green Matthews; through her maternal grandfather, Baldwin is a third cousin of comedian Andy Samberg.Baldwin graduated from Madison West High School in 1980 as the class valedictorian. She earned a B.A. degree from Smith College in 1984 and a J.D. degree from the University of Wisconsin Law School in 1989. She was a lawyer in private practice from 1989 to 1992.Baldwin was first elected to political office in 1986 at the age of 24 when she was elected to the Dane County Board of Supervisors, a position she held until 1994. She also served one year on the Madison City Council to fill a vacancy in the coterminous district.", 'Wisconsin Assembly (1993–1999)': 'ElectionsIn 1992, Baldwin ran to represent Wisconsin\'s 78th Assembly District. She won the Democratic primary with 43% of the vote. In the general election, Baldwin defeated Mary Kay Baum (Labor and Farm Party nominee) and Patricia Hevenor (Republican Party nominee) by a vote of 59%-23%-17%. She was one of just six openly gay political candidates nationwide to win a general election in 1992.In 1994, Baldwin won reelection to a second term with 76% of the vote. In 1996, she won reelection to a third term with 71% of the vote.TenureBaldwin was the first openly lesbian member of the Wisconsin Assembly and one of a very few openly gay politicians in the country at the time. In 1993, Baldwin said she was disappointed by Democratic President Bill Clinton\'s support of the military\'s "don\'t ask, don\'t tell" policy. In early 1994, she proposed legalizing same-sex marriage in Wisconsin. In 1995, she proposed domestic partnerships in Wisconsin.Baldwin opposes capital punishment in Wisconsin.Committee assignmentsCriminal Justice CommitteeEducation Committee (Chair)', 'US House of Representatives (1999–2013)': "ElectionsIn 1998, U.S. Congressman Scott Klug of the 2nd District, based in Madison, announced he would retire, prompting Baldwin to run for the seat. She won the Democratic primary with a plurality of 37% of the vote. In the general election, she defeated Republican nominee Josephine Musser 53%-47%.Baldwin was the first woman elected to Congress from Wisconsin. She was also the first openly gay person elected to the House of Representatives, and the first open lesbian elected to Congress.In 2000, Baldwin won reelection to a second term, defeating Republican John Sharpless 51%-49%, a difference of 8,902 votes. While she lost eight of the district's nine counties, she carried the largest, Dane County, with 55 percent of the vote—enough to give her the victory.After the 2000 census, the 2nd District was made significantly more Democratic in redistricting.  Baldwin won reelection to a third term in the newly redrawn 2nd District with 66% of the vote against Republican Ron Greer. In 2004, she beat Dave Magnum 63%-37%. She won a 2006 rematch against Magnum, again winning 63%-37%. In 2008, she defeated Peter Theron 69%-31%, and in 2010 she won a seventh term with 62% of the vote against Chad Lee.Committee assignmentsCommittee on Energy and CommerceSubcommittee on Environment and EconomySubcommittee on Health", 'US Senate (2013–present)': '2012 electionBaldwin ran as the Democratic nominee against Republican nominee Tommy Thompson, who had formerly been governor and Secretary of Health and Human Services. She announced her candidacy on September 6, 2011, in a video emailed to supporters. She ran uncontested in the primary election, and spoke at the 2012 Democratic National Convention about tax policy, campaign finance reform, and equality in the United States.She was endorsed by Democracy for America, and she received campaign funding from EMILY\'s List, the Gay & Lesbian Victory Fund, and LPAC. Baldwin was endorsed by the editorial board of The Capital Times, who wrote that "Baldwin\'s fresh ideas on issues ranging from job creation to health care reform, along with her proven record of working across lines of partisanship and ideology, and her grace under pressure mark her as precisely the right choice to replace retiring U.S. Sen. Herb Kohl."Thompson claimed during his campaign that her "far left approach leaves this country in jeopardy."The candidates had three debates, on September 28, October 18, and October 26. According to Baldwin\'s Federal Election Commission filings, she raised about $12 million, over $5 million more than her opponent.On November 6, 2012, Baldwin became the first openly gay candidate to be elected to the U.S. Senate. Because of her 14 years in the House of Representatives, under Senate rules she had the highest seniority in her entering class of senators.Baldwin was featured in Time\'s November 19, 2012, edition, in the Verbatim section, where she was quoted as saying "I didn\'t run to make history" on her historic election. In a separate section, she was also mentioned as a new face to watch in the Senate.2018 electionBaldwin is running for reelection in 2018.Committee assignmentsCommittee on AppropriationsSubcommittee on Agriculture, Rural Development, Food and Drug Administration, and Related AgenciesSubcommittee on DefenseSubcommittee on Homeland SecuritySubcommittee on Labor, Health and Human Services, Education, and Related AgenciesSubcommittee on Military Construction, Veterans Affairs, and Related AgenciesCommittee on Commerce, Science, and TransportationSubcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Oceans, Atmosphere, Fisheries, and Coast GuardSubcommittee on Space, Science, and CompetitivenessSubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on Health, Education, Labor, and PensionsSubcommittee on Employment and Workplace SafetySubcommittee on Primary Health and Aging', 'Political positions': 'IdeologyIn October 2012, Baldwin described herself as a progressive in the mold of Robert M. La Follette. No two U.S. Senators from the same state vote differently as often as Baldwin and Ron Johnson do.In 2003, Baldwin served on the advisory committee of the Progressive Majority, a political action committee dedicated to electing progressive candidates to public office.Baldwin is a member of the Congressional Progressive Caucus and the Afterschool Caucuses. According to a 2011 National Journal survey, she was among the most liberal members of the House. As of 2012, her voting record made her one of the most liberal members of Congress.Economy and jobsIn a September 2015 radio interview, Baldwin said that she, the Pope, and Donald Trump all supported repeal of the carried interest tax loophole. Politifact stated that there was no record of the Pope weighing in on this particular tax break.In 2016, the U.S. Chamber of Commerce gave Baldwin a 32% cumulative score on "key business votes."In October 2017, CBS News reported that the Freedom Partners, a Koch-funded group, had "launched a $1.6 million television and digital ad campaign" targeting Baldwin for her "stance on taxes." The ads charged her with having "voted for five trillion dollars in more taxes" and with having "supported higher income taxes, sales taxes – even energy taxes." One ad stated: "If Tammy Baldwin opposes tax reform, it\'s proof that she opposes jobs."In October 2017, the editors of The Capital Times praised Baldwin and Bernie Sanders for their vocal opposition to a budget resolution that they believed would increase income inequality. Baldwin was described as "one of the budget\'s most ardent foes."In November 2017, Baldwin expressed opposition to the Trump tax-reform bill, the Tax Cuts and Jobs Act of 2017, saying that it was being drafted "behind closed doors" and charging that it was being "shoved through." In its place, she promoted a bill, the Stronger Way Act, that she and Cory Booker (D-NJ) co-sponsored.In 2018, Baldwin sponsored the Reward Work Act of 2018, which proposed to guarantee the right of employees in listed companies to elect one-third of the board of directors.Government spendingThe Wisconsin GOP claimed on October 11, 2017, that Baldwin had "voted in favor of higher taxes and fees more than 400 times since she arrived in Washington."TerrorismIn November 2013, Baldwin introduced a bill that would "bring greater government transparency, oversight and due process whenever authorities use information gathered for intelligence purposes to make domestic non-terrorism cases against Americans."Baldwin described the mass shooting in Orlando, Florida, in June 2016 as a "hate crime" and said "The question now for America is are we going to come together and stand united against hate, gun violence and terrorism?"ImmigrationIn June 2013, Baldwin voted for S. 744, the Border Security, Economic Opportunity, and Immigration Modernization Act, which would have enabled undocumented immigrants to acquire legal residency status and, later, citizenship.She voted against Kate\'s Law in 2016.In 2017, immigration reduction advocacy group NumbersUSA gave Baldwin an overall grade of F, with a score of 11% on immigration bills. On the reduction of unnecessary worker visas, she scored a C; on the reduction of refugee and asylum fraud, and on the reduction of amnesty enticements, she scored F-.Opposition to Iraq WarBaldwin was a vocal critic of the Iraq War. On October 10, 2002, she was among the 133 members of the House who voted against authorizing the invasion of Iraq. She warned there would be "postwar challenges," observing that "there is no history of democratic government in Iraq," that its "economy and infrastructure are in ruins after years of war and sanctions," and that rebuilding would take "a great deal of money." In 2005, she joined the Out of Iraq Caucus.Impeachment of Dick Cheney and Alberto GonzalesOn August 1, 2007, Baldwin cosponsored H. Res. 333, a bill proposing articles of impeachment against Vice President Dick Cheney, and H Res. 589, a bill proposing the impeachment of Attorney General Alberto Gonzales. On January 20, 2008, Baldwin wrote in the Milwaukee Journal Sentinel that on December 14, 2007, "I joined with my colleagues on the House Judiciary Committee, Reps. Robert Wexler (D-Fla.) and Luis Gutierrez (D-Ill.), in urging Chairman Rep. John Conyers (D-Mich.) to conduct hearings on a resolution of impeachment now pending consideration in that committee." Although some constituents "say I have gone too far," others "argue I have not gone far enough" and feel "we are losing our democracy and that I should do more to hold the Bush administration accountable for its actions."Health careAn outspoken advocate of single-payer, government-run universal health care system since her days as a state legislator, Baldwin introduced the Health Security for All Americans Act, which would have required states to provide such a system, in 2000, 2002, 2004, and 2005. The bill died each time it was introduced without a House vote.She has said that she "believes strongly that a single-payer health system is the best way to comprehensively and fairly reform our health care system." In November 2009, Baldwin voted for the version of health-care reform that included a public option, a government-run health-care plan that would have competed with private insurers, but only the House passed that version. She ultimately voted for the Patient Protection and Affordable Care Act, also known as Obamacare, which became law in 2010. Baldwin said she hoped a public option in the ACA would lead to a single-payer system. The first version of the ACA Baldwin voted for included a public option, but the final version did not.In 2009, Baldwin introduced the Ending LGBT Health Disparities Act (ELHDA), which sought to advance LGBT health priorities by promoting research, cultural competency, and non-discrimination policies. The bill was not passed.Resolution on 9/11 victimsBaldwin was one of 22 members of Congress to vote against a 2006 resolution honoring victims of the September 11 attacks on the fifth anniversary of 9/11. (The resolution passed 395-22.) Baldwin said she voted against the resolution because it also endorsed the Patriot Act and criticized illegal immigration.Her vote received renewed attention in the 2012 U.S. Senate campaign when Tommy Thompson\'s campaign released an ad about it. Thompson said in a statement, "Wisconsin voters need to know that Congresswoman Tammy Baldwin put her extreme views above honoring the men and women who were murdered by the terrorists in the Sept. 11 attacks on our nation." The Baldwin campaign responded by saying Thompson\'s ad was a "dishonest attack that tries to suggest Tammy Baldwin opposes honoring the victims of the 9/11 terrorist attacks."ACORNIn 2009, when the House voted overwhelmingly to defund ACORN, Baldwin was one of 75 House members who did not.2016 U.S. presidential electionOn October 20, 2013, Baldwin was one of sixteen female Democratic Senators to sign a letter endorsing Hillary Clinton as the Democratic nominee in the 2016 presidential election.Handling of Veterans Affairs reportIn January 2015, USA Today obtained a copy of a report by the United States Department of Veterans Affairs inspector general about the Tomah, Wisconsin Veterans Affairs medical facility. The report said that two physicians at the Tomah VA were among the biggest prescribers of opioids in a multistate region, raising "potentially serious concerns." Baldwin\'s office had received the report in August 2014 but did not take action until January 2015, when Baldwin called for an investigation after the Center for Investigative Reporting published details of the report, including information about a veteran who died from an overdose at the facility. A whistleblower and former Tomah VA employee learned that Baldwin\'s office had a copy of the report, and he repeatedly emailed Baldwin\'s office asking that she take action on the issue. Baldwin\'s office did not explain why they waited from August 2014 to January 2015 to call for an investigation. Baldwin was the only member of Congress who had a copy of the inspection report.In February 2015, Baldwin fired her deputy state director over her handling of the VA report. The aide was offered but declined a severance deal that included a cash payout and a confidentiality agreement that would have required her to keep quiet. The aide filed an ethics complaint with the United States Senate Select Committee on Intelligence. The complaint was dismissed as lacking merit. Baldwin said, "we should have done a better job listening to and communicating with another constituent with whom we were working on problems at the VA", and that she had started a review of why her office had failed to act on the report. As a result of the review, Baldwin fined her chief of staff, demoted her state director, and reassigned a veterans\' outreach staffer. In November 2017, Baldwin co-sponsored legislation designed to strengthen opioid safety in the Department of Veterans Affairs.', 'Electoral history': "Wisconsin's 2nd congressional district election, 1998PartyCandidateVotes%±DemocraticTammy Baldwin 116,377 52.49% +11.49 RepublicanJosephine Musser103,52846.69%-10.68%Write-ins1,5780.80%+0.76%Turnout221,693-21.50%Democratic gain from RepublicanSwingWisconsin's 2nd congressional district election, 2000PartyCandidateVotes%±DemocraticTammy Baldwin 163,534 51.36% -1.13% RepublicanJohn Sharpless154,63248.56%+2.07%Write-ins2140.06%-0.70%Turnout318,380+30.36Democratic holdSwingWisconsin's 2nd congressional district election, 2002PartyCandidateVotes%±DemocraticTammy Baldwin 163,313 66.00% +14.64 RepublicanRon Greer83,69433.82%-14.74%Write-ins4030.16%+0.10Turnout247,410-28.68%Democratic holdSwingWisconsin's 2nd congressional district election, 2004PartyCandidateVotes%±DemocraticTammy Baldwin 251,637 63.26% -2.74% RepublicanDave Magnum145,81036.66%+2.84%Write-ins2770.06%-0.10%Turnout397,724+37.79%Democratic holdSwingWisconsin's 2nd congressional district election, 2006PartyCandidateVotes%±DemocraticTammy Baldwin 191,414 62.82% -0.56% RepublicanDave Magnum113,01537.09%+0.53%Write-ins2590.08%+0.02%Turnout304,688-23.39%Democratic holdSwingWisconsin's 2nd congressional district election, 2008PartyCandidateVotes%±DemocraticTammy Baldwin 277,914 69.33% +6.51% RepublicanPeter Theron122,51330.56%6.53%Write-ins4140.10%Turnout400,841+23.98%Democratic holdSwingWisconsin's 2nd congressional district election, 2010PartyCandidateVotes%±DemocraticTammy Baldwin 191,164 61.73% -7.60% RepublicanChad Lee118,09938.16%+7.60%Write-ins1970.06%-0.04%Turnout309,460-22.79%Democratic holdSwing2012 United States Senate election, WisconsinPartyCandidateVotes%±DemocraticTammy Baldwin 1,547,104 51.41% -15.9 RepublicanTommy Thompson1,380,12645.86%+16.4LibertarianJoseph Kexel62,2402.07%+2.1IndependentNimrod Allen, III16,4550.55%n/aOtherScattered3,4860.12%+0.1Majority166,9785.55Turnout3,009,411Democratic holdSwing", 'Personal life': "Baldwin is the granddaughter of biochemist David E. Green and the niece of another biochemist, Rowena Green Matthews. For fifteen years, Baldwin's domestic partner was Lauren Azar; in 2009, the couple registered as domestic partners in Wisconsin.  They separated in 2010.", 'introduction': "Tammy Suzanne Green Baldwin (born February 11, 1962) is an American politician serving as the junior United States Senator from Wisconsin since 2013. A member of the Democratic Party, she previously served three terms in the Wisconsin Assembly, representing the 78th district, and from 1999 to 2013 represented Wisconsin's 2nd congressional district in the United States House of Representatives. \nAs a gay woman, Baldwin's electoral success has made history several times. In 1998, she became the first woman elected to represent Wisconsin in Congress, as well as the first openly gay woman elected to Congress from any state. And in 2012, Baldwin became the first openly gay person elected to the U.S. Senate.. \nBaldwin defeated her Republican opponent, former Wisconsin Governor Tommy Thompson, in the 2012 U.S. Senate election. She is running for reelection in 2018.\n\n"}, 'personal': {'Born': 'Tammy Suzanne Green Baldwin (1962-02-11) February 11, 1962 (age56)Madison, Wisconsin, U.S.', 'Political party': 'Democratic', 'Education': 'Smith College (BA)University of Wisconsin–Madison (JD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Wisconsin': {'date': 'Assumed office January 3, 2013Serving with Ron Johnson', 'Preceded by': 'Herb Kohl'}, 'Secretary of the Senate Democratic Conference': {'date': 'Assumed office January 3, 2017', 'Leader': 'Chuck Schumer', 'Preceded by': 'Patty Murray'}, "Member of the US House of Representativesfrom Wisconsin's 2nd district": {'date': 'In officeJanuary 3, 1999– January 3, 2013', 'Preceded by': 'Scott Klug', 'Succeeded by': 'Mark Pocan'}, 'Member of the Wisconsin State Assemblyfrom the 78th district': {'date': 'In officeJanuary 3, 1993– January 3, 1999', 'Preceded by': 'David Clarenbach', 'Succeeded by': 'Mark Pocan'}}, 'code': 'B001230'}