{'name': 'Tammy.Duckworth', 'picture': 'D000622.jpg', 'detail': {'Early life and education': "Tammy Duckworth was born in Bangkok, Thailand, the daughter of Lamai Sompornpairin and Franklin Duckworth. Her father, who died in 2005, was a U.S. Army veteran who traced his family's American roots to the American Revolutionary War. Her mother is Thai, of Chinese descent. Because of her father's work with the United Nations and international companies in refugee, housing, and development programs, the family moved around Southeast Asia. Duckworth became fluent in Thai and Indonesian, in addition to English.Duckworth attended Singapore American School, and for a few months in her senior year was at the International School Bangkok. The family settled in Hawaii when she was sixteen. Her father became unemployed for a time, and the family relied on public assistance. She graduated with honors from McKinley High School in Honolulu, Hawaii, in 1985, having skipped the ninth grade. She graduated from the University of Hawaii in 1989 with a Bachelor of Arts in political science, and later received a Master of Arts in international affairs from George Washington University's Elliott School of International Affairs. She completed a PhD in Human Services at Capella University in March 2015.", 'Military service': 'Following in the footsteps of her father, who served in World War II, and ancestors who served in the Revolutionary War, Duckworth joined the Army Reserve Officers\' Training Corps as a graduate student at George Washington University in 1990. She became a commissioned officer in the United States Army Reserve in 1992 and chose to fly helicopters because it was one of the few combat jobs open to women. As a member of the Army Reserve, she went to flight school, later transferring to the Army National Guard and entering the Illinois Army National Guard in 1996. Duckworth also worked as a staff supervisor at Rotary International headquarters in Evanston, Illinois.Duckworth was working towards a Ph.D. in political science at Northern Illinois University, with research interests in the political economy and public health in southeast Asia, when she was deployed to Iraq in 2004. She lost her right leg near the hip and her left leg below the knee from injuries sustained on November 12, 2004, when the UH-60 Black Hawk helicopter she was co-piloting was hit by a rocket-propelled grenade fired by Iraqi insurgents. She was the first American female double amputee from the Iraq war. The explosion "almost completely destroyed her right arm, breaking it in three places and tearing tissue from the back side of it". The doctors "reset the bones in her arm and stitched the cuts" to save her arm. Duckworth received a Purple Heart on December 3 and was promoted to Major on December 21 at the Walter Reed Army Medical Center, where she was presented with an Air Medal and Army Commendation Medal. She retired from the Illinois Army National Guard in October 2014 as a lieutenant colonel.The Daughters of the American Revolution erected a statue with Duckworth\'s likeness, and that of the Revolution\'s Molly Pitcher in Mount Vernon, Illinois, in 2011. The statue was erected in honor of female veterans.', 'Government service': 'On November 21, 2006, several weeks after losing her first congressional campaign, Duckworth was appointed Director of the Illinois Department of Veterans Affairs by Governor Rod Blagojevich. Duckworth served in that position until February 8, 2009. While she was Director, she was credited with starting a program to help veterans with post-traumatic stress disorder (PTSD), and veterans with brain injury.On September 17, 2008, Duckworth attended a campaign event for Dan Seals, the Democratic candidate for Illinois\'s 10th congressional district. Duckworth used vacation time, but violated Illinois law by going to the event in a state-owned van which was equipped for a person with physical disabilities. She acknowledged the mistake and repaid the state for the use of the van.In 2009, two Illinois Department of Veterans Affairs employees at the Anna Veteran\'s Home in Union County filed a lawsuit against Duckworth. The lawsuit alleged that Duckworth wrongfully terminated one employee and threatened and intimidated another for bringing reports of abuse and misconduct of veterans when she was head of the Illinois Department of Veterans Affairs. Duckworth was represented in the suit by the Illinois Attorney General\'s office. The case was dismissed twice but refilings were allowed. The court set a tentative trial date of August 2016 and rejected the final motion to dismiss. The state announced that it had settled the case in June 2016 for $26,000 with no admission of wrongdoing. Although the plaintiffs later indicated they did not want the settlement, the judge vacated the trial.Also in 2009, the Illinois Auditor General released an audit of the Veteran\'s Affairs department. Some issues noted by the audit predated Duckworth\'s tenure, while the majority of the audit covered Duckworth\'s tenure. Findings of the audit included a fiscal year 2007 report that was not completed on time, failure to conduct annual reviews of benefits received by Illinois veterans, and failure to establish a task force to study the possible health effects of exposure to hazardous materials. The routine audit covered a two-year period, June 2006 to June 2008, and the findings were described by the auditor\'s department as "typical" in its audits.On February 3, 2009, Duckworth was nominated to be the Assistant Secretary of Public and Intergovernmental Affairs for the United States Department of Veterans Affairs. The United States Senate confirmed her for the position on April 22. Duckworth resigned from her position in June 2011 in order to launch her campaign for the U.S. House of Representatives in Illinois\' 8th Congressional District.', 'US House of Representatives': 'Elections Duckworth spoke at the 2008, 2012, and 2016 Democratic National Conventions.2006 After longtime incumbent Republican Henry Hyde announced his retirement from Congress, several candidates began campaigning for the office. Duckworth won the Democratic primary with a plurality of 44%, defeating 2004 nominee Christine Cegelis with 40%, and Wheaton College professor Lindy Scott with 16%. During her 2006 campaign for Congress, Duckworth was endorsed by EMILY\'s List, a Democratic political action committee that supports abortion rights. Duckworth was also endorsed by the Brady Campaign to Prevent Gun Violence and the Fraternal Order of Police. In the Republican primary, Illinois Senator Peter Roskam ran unopposed. While she raised $4.5 million to Roskam\'s $3.44 million, Duckworth lost by 4,810 votes, receiving 49% to Roskam\'s 51%.2012 In July 2011, Duckworth launched her campaign to run in 2012 for Illinois\'s 8th congressional district. She defeated former Deputy Treasurer of Illinois Raja Krishnamoorthi for the Democratic nomination on March 20, 2012, then faced incumbent Republican Joe Walsh in the general election. Duckworth received the endorsement of both the Chicago Tribune and the Daily Herald. Walsh generated controversy when in July 2012, at a campaign event, he accused Duckworth of politicizing her military service and injuries, saying "my God, that\'s all she talks about. Our true heroes, the men and women who served us, it\'s the last thing in the world they talk about." Walsh called the controversy over his comments "a political ploy to distort my words and distract voters" and said that "Of course Tammy Duckworth is a hero ... I have called her a hero hundreds of times."On November 6, 2012, Duckworth defeated Walsh 55%–45%. She became the first disabled woman to be elected to the U.S. House of Representatives, and the first member of Congress born in Thailand.2014 In the 2014 general election, Duckworth faced Republican Larry Kaifesh, a United States Marine Corps officer who had recently left active duty as a colonel. Duckworth defeated Kaifesh with 56% of the vote.Tenure Duckworth was sworn into office on January 3, 2013.On April 3, 2013, Duckworth publicly returned 8.4% ($1,218) of her congressional salary for that month to the United States Department of Treasury in solidarity with furloughed government workers.On June 26, 2013, during a hearing of the House Oversight and Government Reform Committee, Duckworth received national media attention after questioning Strong Castle CEO Braulio Castillo on a $500 million government contract the company had been awarded based on Castillo\'s disabled veteran status.House committee assignments Committee on Armed ServicesSubcommittee on Tactical Air and Land Forces (2013–2017)Subcommittee on Oversight and Investigations (2013–2015)Subcommittee on Readiness (2015–2017)Committee on Oversight and Government ReformSubcommittee on Energy Policy, Health Care and Entitlements (2013–2015)Subcommittee on Economic Growth, Job Creation and Regulatory Affairs (2013–2015)Subcommittee on Transportation and Public Assets, Ranking Member (2015–2017)Subcommittee on Information Technology (2015–2017)United States House Select Committee on Benghazi (May 2014–July 2016)', 'US Senate': '2016 election On March 30, 2015, Duckworth announced that she would challenge incumbent U.S. Senator Mark Kirk for his seat in the 2016 Senate election in Illinois. Duckworth defeated fellow Democrats Andrea Zopp and Napoleon Harris in the primary election on March 15, 2016.During a televised debate on October 27, 2016, Duckworth talked about her ancestors\' past serving in the United States military. Kirk responded, "I\'d forgotten that your parents came all the way from Thailand to serve George Washington." The comment led to the Human Rights Campaign withdrawing their endorsement of Kirk and switching it to Duckworth, stating his comments were "deeply offensive and racist."On November 8, Duckworth defeated Kirk 54 percent to 40 percent to win the Senate seat. Duckworth and Kamala Harris, who was also elected in 2016, are the second and third female Asian American senators, after Mazie Hirono who was elected in 2012.Tenure In January 2018, following a federal government shut down after the Senate could not agree on a funding bill, Duckworth responded to President Trump\'s accusations that the Democrats were putting "unlawful immigrants" ahead of the military:"I spent my entire adult life looking out for the well-being, the training, the equipping of the troops for whom I was responsible. Sadly, this is something that the current occupant of the Oval Office does not seem to care to do — and I will not be lectured about what our military needs by a five-deferment draft dodger. And I have a message for Cadet Bone Spurs: If you cared about our military, you\'d stop baiting Kim Jong Un into a war that could put 85,000 American troops, and millions of innocent civilians, in danger."Duckworth became the first U.S. Senator to give birth while in office in 2018. Shortly afterward, rules were changed so that a Senator has the right to bring a child under one year old on the Senate floor and breastfeed them during votes. The day after those rules were changed, Maile became the first baby on the Senate floor when Duckworth brought her.Senate committee assignments Committee on Commerce, Science, and TransportationSubcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Consumer Protection, Product Safety, Insurance and Data SecuritySubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on Energy and Natural ResourcesSubcommittee on EnergySubcommittee on National ParksSubcommittee on Water and PowerCommittee on Environment and Public WorksSubcommittee on Fisheries, Water and Wildlife (Ranking Member)Subcommittee on Transportation and InfrastructureCommittee on Small Business and EntrepreneurshipCaucus memberships Congressional Asian Pacific American Caucus', 'Political positions': 'Foreign policy During her unsuccessful congressional campaign in 2006, Duckworth called on Congress to audit the estimated $437 billion spent on overseas military and foreign aid since September 11, 2001.On September 30, 2006, Duckworth gave the Democratic Party\'s response to President George W. Bush\'s weekly radio address. In it, she was critical of Bush\'s strategy for the Iraq War.In October 2006, The Sunday Times reported that Duckworth agreed with General Sir Richard Dannatt, the British Army chief, that the presence of coalition troops was exacerbating the conflict in Iraq.Gun law Duckworth was rated by the National Rifle Association as having a pro-gun control congressional voting record. Duckworth, who is a gun owner herself, cites violence in Chicago as a major influence for her support of gun reform. She supports universal background checks and the halting of state-to-state gun trafficking.Duckworth participated in the 2016 Chris Murphy gun control filibuster. During the sit-in, Duckworth hid her mobile phone in her prosthetic leg to avoid it being taken away from her since taking pictures and recording on the House floor is against policy.In a 2016 interview with GQ magazine, Duckworth stated that gaining control of the Senate and "closing the gap" in the House would be necessary in order to pass common sense gun laws. She also stated that she believed moderate Republicans, who support common sense gun reform, would have more power to influence gun reform if they were not "pushed aside by those folks who are absolutely beholden to the NRA. And so we never get the vote."In response to the 2017 Las Vegas shooting, Duckworth stated that "My heart goes out to the victims of the tragic shooting in Las Vegas last night and their loved ones. Such senseless and horrifying acts of violence have no place in America or any other nation."Health policy Duckworth supports abortion rights and the Affordable Care Act.Immigration Duckworth supports comprehensive immigration reform with a pathway to citizenship for those in the country illegally. She would admit 100,000 Syrian refugees into the United States.', 'Personal life': "After being shot down over Iraq, and losing both legs, Duckworth was fitted for prosthetics and is now fully mobile. She helped establish the Intrepid Foundation to help injured veterans.Former Republican presidential candidate and Senator Bob Dole dedicated his autobiography One Soldier's Story in part to Duckworth. Duckworth credits Dole for inspiring her to pursue public service, while she recuperated at Walter Reed Army Medical Center; although, in 2006, Dole endorsed Duckworth's Republican opponent, Peter Roskam.In May 2010, Duckworth was awarded an honorary doctorate by Northern Illinois University. In 2011, Duckworth was honored by Chicago's Access Living for her work on behalf of veterans with disabilities.Duckworth is married to Bryan Bowlsbey. The couple has two daughters: Abigail, who was born in 2014, and Maile, born in 2018. Maile's birth made Duckworth the first U.S. Senator to give birth while in office. Former senator Daniel Akaka (Democrat of Hawaii) helped the couple with the naming of both daughters; Akaka died April 6, 2018, three days before Maile was born. Shortly after Maile's birth, rules were changed so that a Senator has the right to bring a child under one year old on the Senate floor and breastfeed them during votes. The day after those rules were changed, Maile became the first baby on the Senate floor when Duckworth brought her.", 'Electoral history': 'Election resultsYearOfficeDistrictElectionVotes for Duckworth%OpponentPartyVotes%2006U.S. House6thGeneral86,57248%Peter RoskamRepublican91,38251%20128thPrimary17,09766%Raja KrishnamoorthiDemocratic8,73633%General123,20654%Joe WalshRepublican101,86045%20148thGeneral84,17856%Lawrence KaifeshRepublican66,87844%2016U.S. SenateIllinoisPrimary1,220,12864%Andrea ZoppDemocratic455,72924%General2,907,42054%Mark KirkRepublican2,149,41740%', 'introduction': "Ladda Tammy Duckworth (born March 12, 1968) is an American politician and former U.S. Army lieutenant colonel who has served as the junior United States Senator for Illinois since 2017. A member of the Democratic Party, she represented Illinois's 8th district in the United States House of Representatives from 2013 to 2017. Before election to office, she served as Assistant Secretary for Public and Intergovernmental Affairs in the United States Department of Veterans Affairs (2009–11) and Director of the Illinois Department of Veterans Affairs (2006–09). In the 2016 election, Duckworth defeated incumbent Republican Senator Mark Kirk for the seat in the United States Senate.\nDuckworth was the first Asian American woman elected to Congress in Illinois, the first disabled woman to be elected to Congress, the first female double amputee in the Senate, the first Senator to give birth while in office, and the first member of Congress born in Thailand; her American father and Thai mother were working and living there at the time. Duckworth is the second Asian-American woman serving in the U.S. Senate, after Mazie Hirono, and next to Kamala Harris.\nAn Iraq War veteran, Duckworth served as a U.S. Army helicopter pilot and suffered severe combat wounds, which caused her to lose both of her legs and some mobility in her right arm. She was the first female double amputee from the war. Despite her grievous injuries, she sought and obtained a medical waiver which allowed her continue serving as a lieutenant colonel in the Illinois Army National Guard along with her husband, Major Bryan W. Bowlsbey, a signal officer and fellow Iraq War veteran, until her retirement from the Army in October 2014.\n\n"}, 'personal': {'Born': 'Ladda Tammy Duckworth (1968-03-12) March 12, 1968 (age50)Bangkok, Thailand', 'Political party': 'Democratic', 'Spouse(s)': 'Bryan Bowlsbey', 'Children': '2', 'Residence': 'Hoffman Estates, Illinois', 'Education': 'University of Hawaii at Manoa (BA)George Washington University (MA)Northern Illinois UniversityCapella University (PhD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Illinois': {'date': 'Assumed office January 3, 2017Serving with Dick Durbin', 'Preceded by': 'Mark Kirk'}, "Member of the US House of Representativesfrom Illinois's 8th district": {'date': 'In officeJanuary 3, 2013– January 3, 2017', 'Preceded by': 'Joe Walsh', 'Succeeded by': 'Raja Krishnamoorthi'}, 'Assistant Secretary of Veterans Affairs for Public and Intergovernmental Affairs': {'date': 'In officeApril 24, 2009– June 30, 2011', 'President': 'Barack Obama', 'Preceded by': 'Lisette Mondello', 'Succeeded by': 'Michael Galloucis'}, 'Director of the Illinois Department of Veterans Affairs': {'date': 'In officeNovember 21, 2006– February 8, 2009', 'Governor': 'Rod BlagojevichPat Quinn', 'Preceded by': 'Roy Dolgos', 'Succeeded by': 'Daniel Grant'}, 'Military service': {'Allegiance': 'United States', 'Service/branch': 'United States Army Illinois Army National Guard', 'Years of service': '1992–2014', 'Rank': ' Lieutenant colonel', 'Unit': ' 106th Aviation Regiment, 28th Infantry Division', 'Battles/wars': 'Iraq War(WIA)', 'Awards': ' Purple Heart Meritorious Service Medal Air Medal Army Commendation Medal with Oak leaf cluster  National Defense Service Medal  Army Reserve Components Achievement Medal with four Oak leaf clusters Army Service Ribbon Combat Action Badge Senior Army Aviator Badge Dame Grand Cross (First Class) of the Order of the Crown of Thailand'}}, 'code': 'D000622'}