{"name": "Tim.Scott", "picture": "S001198.jpg", "detail": {"Early life, education, and business career": "Scott was born in North Charleston, South Carolina, a son of Frances, a nursing assistant, and Ben Scott, Sr. His parents were divorced when he was 7. He grew up in working class poverty with his mother working 16-hour days to support her family, including Tim's brothers. His older brother is a sergeant major in the U.S. Army. Scott's younger brother is a U.S. Air Force colonel.Scott attended Presbyterian College from 1983 to 1984, on a partial football scholarship. He graduated from Charleston Southern University in 1988 with a B.S. in Political Science. Scott is also an alumnus of South Carolina's Palmetto Boys State program, an experience which he cites as an influential factor in his decision to enter public service.In addition to his political career, Scott owns an insurance agency, Tim Scott Allstate, and worked as a financial adviser.", "Charleston County Council (1995–2008)": "Elections Scott ran in a February 1995 special election to the Charleston County Council at-large seat vacated by Keith Summey, who resigned his seat after being elected as Mayor of North Charleston. Scott won the seat as a Republican, receiving nearly 80% of the vote in the white-majority district, which since the late 20th century has voted Republican. He became the first black Republican elected to any office in South Carolina since the late 19th century.Scott was on the County Council for a time alongside Paul Thurmond, the son of the late Republican U.S. Senator, Strom Thurmond, who had switched in 1964 from the Democratic Party to the Republican Party.In 1996, Scott challenged Democratic State Senator Robert Ford in South Carolina's 42nd Senate district, but lost 65%–35%.Scott won re-election to the County Council in 2000, again winning in white-majority districts. In 2004, he won re-election again with 61% of the vote, defeating Democrat Elliot Summey (son of Mayor Keith Summey).Tenure Scott was on the Council from 1995 until 2008, becoming Chairman in 2007. In 1997, Scott supported posting the Ten Commandments outside the county council chambers, saying it would remind members of the absolute rules they should follow. The county council unanimously approved the display, and Scott nailed a King James version of the Commandments to the wall. Shortly after, the ACLU and Americans United for Separation of Church and State challenged this in a federal suit. After an initial court ruling that the display was unconstitutional, the council settled out of court to avoid accruing more legal fees. Regarding the costs of the suit, Scott said, \"Whatever it costs in the pursuit of this goal (of displaying the Commandments) is worth it.\"In January 2001, the U.S. Department of Justice sued Charleston County, South Carolina for racial discrimination under the Voting Rights Act, based on its having all its council seats elected by at-large districts. This dilutes the votes of a minority group. DOJ had attempted to negotiate with county officials on this issue in November 2000. Justice officials noted that at-large seats dilute the voting strength of the significant African-American minority in the county, who in 2000 comprised 34.5% of the population. They have been unable to elect any \"candidates of their choice\" for years. Whites or European Americans comprise 61.9 percent of the population in the county. Since the late 20th century, the majority-white voters have elected Republican Party candidates. County officials noted that the majority of voters in 1989 had approved electing members by at-large seats in a popular referendum.Scott, the only African-American member of the county council, has said about this case and the alternative of electing council members from single-member districts,I don't like the idea of segregating everyone into smaller districts. Besides, the Justice Department assumes that the only way for African-Americans to have representation is to elect an African-American, and the same for whites. Obviously, my constituents don't think that's true.The Department of Justice alleged that the voting preference issue was not a question of ethnicity, stating that voters in black precincts in the county had rejected Scott as a candidate for the council. The lawsuit noted that because of the white majority, \"white bloc voting usually results in the defeat of candidates who are preferred by black voters.\" The Department added that blacks live in compact areas of the county, and could comprise a majority in three districts if the county seats were apportioned as nine single-member districts.Committee assignmentsEconomic Development Committee (Chair)", "South Carolina House of Representatives (2009–2011)": "Elections In 2008, incumbent Republican State Representative Tom Dantzler decided to retire. With support from advisors such as Nicolas Muzin, Scott decided to run for his seat in District 117 of the South Carolina House of Representatives and won the Republican primary with 53% of the vote, defeating Bill Crosby and Wheeler Tillman. He won the general election unopposed, becoming the first Republican African American U.S. Representative from South Carolina in more than 100 years.Tenure Scott supported South Carolina's right-to-work laws and argued that Boeing chose South Carolina as a site for manufacturing for that reason.In South Carolina Club for Growth's 2009–2010 scorecard, Scott earned a B and a score of 80 out of 100. He was praised by the South Carolina Association of Taxpayers, for his \"diligent, principled and courageous stands against higher taxes.\"Committee assignmentsJudiciaryLabor, Commerce and IndustryWays and Means", "United States House of Representatives (2011–2013)": "Elections 2010Scott entered the election for lieutenant governor but switched to run for South Carolina's 1st congressional district following the retirement announcement of Republican incumbent Henry Brown. The 1st district is based in Charleston, and includes approximately the northern 3/4 of the state's coastline (except for Beaufort and Hilton Head Island. Since redistricting, they have been included in the 2nd District.)Scott ranked first in the nine-candidate Republican primary of June 8, 2010, receiving a plurality of 32% of the vote. Fellow Charleston County Councilman Paul Thurmond, son of U.S. Senator Strom Thurmond, ranked second with 16% of the vote. Carroll A. Campbell III, the son of former Governor Carroll A. Campbell, Jr., ranked third with 14% of the vote. Charleston County School Board member Larry Kobrovsky ranked fourth with 11% of the vote. Five other candidates had single digit percentages.Because no candidate had received 50 percent or more of the vote, a runoff was held on June 22, 2010. Scott faced off against Paul Thurmond. Scott was endorsed by the anti-tax Club for Growth, various Tea Party movement groups, former Alaska Governor and Vice Presidential nominee Sarah Palin, Republican House Whip Eric Cantor, former Arkansas governor Mike Huckabee, South Carolina Senator Jim DeMint, and the founder of the Minuteman Project. Scott defeated Thurmond 68%–32% and won every county in the congressional district.According to the Associated Press, Scott \"swamped his opponents in fundraising, spending almost $725,000 during the election cycle to less than $20,000 for his November opponents\". He won the general election, defeating Democrat Ben Frasier 65%–29%. With this election, Scott and Allen West of Florida became the first African-American Republicans in Congress since J.C. Watts retired in 2003. Scott also became the first African-American Republican elected to Congress from South Carolina in 114 years. From the period of 1895 to after 1965, most African-Americans had been disenfranchised in the state, and they had comprised most of the Republican Party when they were excluded from the political system.2012Scott was unopposed in the primary and won the general election, defeating Democrat Bobbie Rose 62%–36%.Tenure Scott, one of two African-American Republicans elected to the House in 2010, declined to join the Congressional Black Caucus.In March 2011, Scott co-sponsored a welfare reform bill that would deny food stamps to families whose incomes were lowered to the point of eligibility because a family member was participating in a labor strike. He introduced legislation in July 2011 to strip the National Labor Relations Board (NLRB) of its power to prohibit employers from relocating to punish workers who join unions or strike. The rationale for the legislation is that government agencies should not be able to tell private employers where they can run a business. Scott described the legislation as a common sense proposal that would fix a flaw in federal labor policy and benefit the national and local economies. The NLRB had recently opposed the relocation of a Boeing production facility from Washington state to South Carolina.Scott successfully advocated for federal funds for a Charleston harbor dredging project estimated at $300 million, arguing that the project is neither an earmark nor an example of wasteful government spending. He said the project was merit-based, and in the national interest because larger cargo ships could use the port and jobs would be created.During the summer 2011 debate over raising the U.S. debt ceiling, Scott supported the inclusion of a balanced budget constitutional amendment in the debt ceiling bill, and opposed legislation that did not include the amendment. Before voting \"no\" on the final bill to raise the U.S. debt ceiling, Scott and other first-term conservatives prayed for guidance in a congressional chapel. Afterward, Scott asserted that he had received divine inspiration regarding his vote, and joined the rest of the South Carolina congressional delegation in voting \"no\" on the measure.Taxes and spending – Scott believes that federal spending and taxes should be reduced, with a Balanced Budget Amendment and the FairTax respectively being implemented for spending and taxes.Health care – Scott believes the 2010 health care reform law should be repealed. Scott states that the health care in the U.S. is one of the greatest in the world, stating that people all over the world come to study in American medical schools, waiting lists are rare, and Americans are able to choose their insurance, providers, and course of treatment. Scott supports an alternative to the health care bill that he says keeps these benefits while controlling costs by reforming the medical tort system by having a limit on non-economic damages and by reforming Medicare. In January 2014 Scott signed an amicus brief in support of Senator Ron Johnson's legal challenge against the U.S. Office of Personnel Management's Affordable Care Act ruling.Earmarks – Scott opposes earmarks, and yet he successfully advocated for federal funds for a Charleston harbor dredging project estimated at $300 million.Economic development – He supports infrastructure development and public works for his district. He opposes restrictions on deepwater oil drilling.Social issues – Scott describes himself as pro-life. Scott supports adult and cord blood stem cell research. He opposes embryonic stem cell research funded by taxpayers. He opposes the creation of human embryos for experimentation. and opposes assisted suicide. Scott opposes same-sex marriage.Immigration – Scott supports federal legislation that is similar to the Arizona law, Arizona SB 1070. He supports strengthening penalties for employers who knowingly hire illegal immigrants. He also promotes cultural assimilation by making English the official language in the government, and by requiring new immigrants to learn English.Labor – Scott introduced a bill which would  deny food stamps to families whose incomes were lowered to the point of eligibility because a family member was participating in a labor strike.Foreign policy – Scott advocates a continued military presence in Afghanistan and believes an early withdrawal will benefit Al-Qaeda. He also views Iran as the world's most dangerous country and believes that the US should aid pro-democracy groups there. Scott opposed the 2011 military intervention in Libya.Police body cameras – After the shooting of Walter Scott (no relation), Scott urged the Senate to hold hearings on police body cameras.Committee assignmentsScott was appointed by the House Republican Steering Committee to both the Committee on Transportation and the Committee on Small Business. He was later appointed to the powerful Committee on Rules and relinquished his other two committee assignments.Committee on RulesSubcommittee on Rules and the Organization of the House", "US Senate": "2012 appointment On December 17, 2012, South Carolina governor Nikki Haley announced she would appoint Scott to replace retiring Senator Jim DeMint, who had previously announced that he would retire from the Senate to become the President of The Heritage Foundation. Scott is the first African American to be a U.S. Senator from South Carolina. Scott was one of three black U.S. Senators in the 113th Congress alongside Mo Cowan and later Cory Booker (and the first since Senator Roland Burris retired in 2010 after succeeding President Barack Obama). He is the first African American to be as a U.S. Senator from the Southern United States since Reconstruction. From 1890 to 1908 Democratic-controlled state legislatures passed new constitutions and laws that disfranchised most blacks and many poor whites across the South, securing power for white politicians from in the Democratic Party.During two periods, first from January 2, 2013 until February 1, 2013, and again from July 16, 2013 until October 31, 2013, Scott was the only African-American Senator. He and Cowan were the first black senators to serve alongside each other.News media reported that Scott, along with Rep. Trey Gowdy, former South Carolina Attorney General Henry McMaster, former First Lady of South Carolina Jenny Sanford, and  Catherine Templeton, Director of the South Carolina Department of Health and Environmental Control, were on Governor Haley's short list to replace Sen. DeMint. In her decision to pick Scott, Governor Haley said:  \"It is important to me, as a minority female, that Congressman Scott earned this seat, he earned this seat for the person that he is. He earned this seat with the results he has shown.\"2014 election Scott ran in November 2014 to win the final two years of Jim DeMint's term and won.2016 election Scott won re-election to a first full term in office in November 2016. He was endorsed by the Club for Growth.In July 2018, Scott introduced a bipartisan bill, along with Democratic Senators Cory Booker and Kamala Harris, to make lynching a federal hate crime.Positions Environment In 2017, Scott was one of 22 senators to sign a letter to President Donald Trump urging the President to have the United States withdraw from the Paris Agreement. According to the Center for Responsive Politics, Scott has received over $540,000 from oil, gas and coal interests since 2012.Judicial nomination Tim Scott did not support Trump's nominee, Ryan Bounds, to the 9th U.S. Circuit Court of Appeals, effectively \"derailing\" the nomination. His reasoning to do so was based on Bounds' perceived \"bigoted statements he made as a Stanford student in the 1990s.\" Marco Rubio joined him in opposing the nomination shortly after, prompting Mitch McConnell to withdraw the nomination altogether. The American Bar Association's (ABA) unanimously voted to rate Bounds \"Qualified\" for the Ninth Circuit after reviewing his full record.Committee assignmentsCommittee on Armed ServicesSubcommittee on Emerging Threats and CapabilitiesSubcommittee on SeaPowerCommittee on Banking, Housing, and Urban AffairsSubcommittee on Financial Institutions and Consumer ProtectionSubcommittee on Housing, Transportation, and Community Development (Chairman)Subcommittee on Securities, Insurance, and InvestmentCommittee on FinanceSubcommittee on Energy, Natural Resources, and InfrastructureSubcommittee on Fiscal Responsibility and Economic Growth (Chairman)Subcommittee on Taxation and IRS OversightCommittee on Health, Education, Labor, and PensionsSubcommittee on Employment and Workplace SafetySubcommittee on Primary Health and Retirement SecurityCommittee on Small Business and EntrepreneurshipSpecial Committee on Aging", "Personal life": "Scott is unmarried. He owns an insurance agency and he is also a partner in Pathway Real Estate Group, LLC.  Scott is a devout evangelical Christian. He is a member of Seacoast Church, a large evangelical church in Charleston, and is a former member of that church's board. Republican leadership has praised Scott's background as an example of achieving the American dream according to a conservative model.", "Electoral history": "Republican Primary - 2008 South Carolina General Assembly 117th DistrictPartyCandidateVotes%RepublicanTim Scott1,33353.30RepublicanWilliam Bill Crosby64725.87RepublicanWheeler Tillman52120.83General election 2008 – South Carolina General Assembly 117th DistrictPartyCandidateVotes%RepublicanTim Scott9,08099.27Write-inVarious670.73Total votes9,147100Turnout76.02Republican Primary – 2010 1st Congressional District of South CarolinaPartyCandidateVotes%RepublicanTim Scott25,45731.49RepublicanPaul Thurmond13,14916.26RepublicanCarroll Campbell11,66514.43RepublicanLarry Kobrovsky8,52110.54RepublicanStovall Witte7,1928.90RepublicanClark B Parker6,7698.37RepublicanKatherine Jenerette3,8494.76RepublicanMark Lutz3,2374.0RepublicanKen Glasson1,0061.24Total votes80,845100Turnout24.11Republican Primary Runoff – 2010 1st Congressional District of South CarolinaPartyCandidateVotes%RepublicanTim Scott46,88568RepublicanPaul Thurmond21,706322010 1st Congressional District of South Carolina ElectionsPartyCandidateVotes%RepublicanTim Scott152,75565.37DemocraticBen Frasier67,00828.67Turnout51.892014 United States Senate Special Republican Primary Election in South  CarolinaPartyCandidateVotes%RepublicanTim Scott276,14789.98RepublicanRandall Young30,74110.02Turnout15.972014 United States Senate Special Election in South CarolinaPartyCandidateVotes%RepublicanTim Scott757,21561.12DemocraticJoyce Dickerson459,58337.09IndependentJill Bossi21,6521.75OtherWrite-Ins5320.04Turnout43.00", "introduction": "Timothy Eugene Scott (born September 19, 1965) is an American businessman and politician serving as the junior United States Senator from South Carolina since 2013. Appointed by Governor Nikki Haley to replace the retiring Jim DeMint, he later won a special election in 2014 and was elected to a full term in 2016. A member of the Republican Party, Scott was endorsed for the Senate by Tea Party groups.\nIn 2010, Scott was elected to the United States House of Representatives for South Carolina's 1st congressional district, where he served from 2011 to 2013. Previously, Scott served one term (from 2009 to 2011) in the South Carolina General Assembly and served on the Charleston County council from 1996 to 2008.\nSince  January 2017,[update] Scott has been one of three African-Americans in the U.S. Senate, along with Democrats Cory Booker of New Jersey and Kamala Harris of California. He is the first African-American senator from the state of South Carolina, the first African-American senator to be elected from the southern United States since 1881 (four years after the end of the Reconstruction Era), and the first African-American Republican to serve in the U.S. Senate since Edward Brooke departed in 1979. He was the first Republican African-American U.S. Representative from South Carolina since 1897.\n\n"}, "personal": {"Born": "Timothy Eugene Scott (1965-09-19) September 19, 1965 (age53)North Charleston, South Carolina, U.S.", "Political party": "Republican", "date": "EducationPresbyterian CollegeCharleston Southern University (BS)"}, "timeline": {"United States Senatorfrom South Carolina": {"date": "Assumed office January 2, 2013Serving with Lindsey Graham", "Appointed by": "Nikki Haley", "Preceded by": "Jim DeMint"}, "Member of the US House of Representativesfrom South Carolina's 1st district": {"date": "In officeJanuary 3, 2011– January 2, 2013", "Preceded by": "Henry E. Brown Jr.", "Succeeded by": "Mark Sanford"}, "Member of the South Carolina House of Representativesfrom the 117th district": {"date": "In officeJanuary 3, 2009– January 3, 2011", "Preceded by": "Tom Dantzler", "Succeeded by": "Bill Crosby"}, "Member of the Charleston County Councilfrom the 3rd district": {"date": "In officeFebruary 8, 1995– January 3, 2009", "Preceded by": "Keith Summey", "Succeeded by": "Elliott Summey"}}, "code": "S001198", "type": "3", "party": "Republican", "description": "rank-and-file Republican", "economic": "0.47", "social": "0.08", "leadership": "0.29"}