{'name': 'Todd.Young', 'picture': 'Y000064.jpg', 'detail': {'Early life': 'Young was born August 24, 1972 in Lancaster, Pennsylvania, the second of three children of Nancy R. (née Pierce) and Bruce H. Young. He lived in Marion County, Indiana for several years before settling in Hamilton County, Indiana, where he attended public schools and won a state soccer championship. In 1990, Young graduated from Carmel High School in Carmel, Indiana.', 'Military career': "Just a few weeks after graduating from high school, Young enlisted in the United States Navy and reported for duty in Newport, Rhode Island. In May 1991, he received an appointment from the Secretary of the Navy to attend the United States Naval Academy in Annapolis, Maryland, where his classmates elected him a class officer and he earned a varsity letter as a member of Navy's NCAA Division I soccer team. He graduated cum laude in 1995, earning a B.S. in political science, and accepted a commission in the U.S. Marine Corps.Upon graduating from Annapolis, Young trained for six months as a rifle platoon commander at the Basic School in Quantico, Virginia, where he qualified as an expert rifleman. In 1996, he completed the Naval Intelligence Officer Basic Course in Dam Neck, Virginia, and was entrusted with a Top Secret security clearance. Young then led the intelligence department of VMU-2, an unmanned aerial vehicle squadron based in Cherry Point, North Carolina, where he participated in various military operations, including counter-narcotics activities in the Caribbean, and was trained in Anti-Terrorism/Force Protection.[citation needed] While stationed in the Chicago area, Young earned an M.B.A. from the University of Chicago.", 'Post-military career': "Young was honorably discharged from active duty in 2000 as a US Marine Captain. After leaving active duty, Young spent a year in London, attending the University of London's Institute of United States Studies. After writing a thesis on the economic history of Midwestern agriculture, in 2001 Young received his MA in American politics.In the summer of 2001, Young traveled to former Communist countries in Eastern Europe where he studied the transition from centrally planned economies to free markets through an executive education program with the Leipzig Graduate School of Management, the first private business school in eastern Germany. He worked as an adjunct professor of public affairs at Indiana University's School of Public and Environmental Affairs and attended law school at night. In 2004, he joined Indiana-based Crowe Chizek and Company as a management consultant, helping state and local government clients improve service delivery to Indiana citizens.[citation needed]In 2006, Young earned his J.D. from the Indiana University Robert H. McKinney School of Law, where he was President of the school's Federalist Society chapter. Upon graduation he joined the Paoli, Indiana-based firm Tucker and Tucker, P.C. Young is a member of the 2007 class of the Indiana Leadership Forum.", 'Early political career': 'In 2001, he moved to Washington, D.C., where he briefly worked at The Heritage Foundation, a conservative public policy think tank. Then he joined the staff of U.S. senator Richard Lugar as a legislative assistant for energy policy. In 2003, Young volunteered for Mitch Daniels\'s campaign for governor of Indiana. He was a delegate to the Indiana Republican state convention and as a vice precinct committeeman. From 2007 to 2010, Young served as Assistant Deputy Prosecutor for Orange County, Indiana. In 2007, Indiana\'s Young Republicans named Young the "Southern Man of the Year" for his leadership on behalf of the Republican Party in southern Indiana. In 2007, Young founded a fiscal responsibility advocacy group, the National Organization for People vs. Irresponsible Government Spending.', 'US House of Representatives': 'Elections 2010 On January 26, 2009, Young announced that he would run for the United States congressional seat in Indiana\'s 9th district as a Republican.Young competed with fellow Republicans Mike Sodrel and Travis Hankins for the party\'s nomination for Congress and won, challenging incumbent Democrat Baron Hill in the general election. Young received endorsements from former Vice President Dan Quayle as well as Lieutenant Governor Becky Skillman, Attorney General Greg Zoeller, Secretary of State Todd Rokita, Auditor Tim Berry, and Treasurer Richard Mourdock.Young won the primary and general elections, defeating incumbent Baron Hill on November 2, 2010, and was seated in the 112th Congress in January 2011.2012 Young defeated Shelli Yoder, winning 55% of the vote in the newly redrawn 9th district.Tenure Young is a member of the Republican Main Street Partnership along with three other Republican senators. The Main Street Partnership is considered to be an association of moderate Republicans. In 2013 the National Journal gave Young an overall composite rating of 69% conservative and 31% liberal, an economic rating of 69% conservative and 30% liberal, a social rating of 57% conservative and 42% liberal, and a foreign policy rating of 77% conservative and 15% liberal.In the 112th Congress, Young voted with the Republican Party 95% of the time. During the 113th Congress, the Human Rights Campaign, which rates politicians\' support for LGBT issues, rated Young 30%, indicating a mixed record. In July 2012, Young took over as the lead sponsor of the REINS Act, a bill that passed the House in 2011 and would require congressional approval for rules with greater than $100 million in economic impact.In the 112th Congress, Young was a member of the House Budget Committee and the House Armed Services Committee. On the latter, he focused on seapower, electronic warfare, and military grand strategy of the United States. During the first session of the 112th Congress, he employed one of the German Marshall Fund\'s Congressional Fellows as military legislative aide.[citation needed]In 2010, Young stated that he was uncertain what was causing the observed heating of the planet, that it could be sunspots or normal cycles of nature, and that "the science is not settled." That same year he signed a pledge sponsored by Americans for Prosperity promising to vote against any global warming legislation that would raise taxes.In 2011, he voted for the Energy Tax Prevention Act of 2011. In 2014, he said that it is "not necessarily the case" that there is a scientific consensus on climate change.Sponsored legislation Fairness for American Families Act (H.R. 2668) – Introduced by Young on July 11, 2013, this bill would "amend the Internal Revenue Code, as amended by the Patient Protection and Affordable Care Act, to delay until 2015 the requirement that individuals maintain minimal essential health care coverage." The bill was proposed in response to a July 2, 2013 decision by the Obama Administration to delay the employer mandate found in the Patient Protection and Affordable Care Act, but do nothing to the individual mandate requirement.When he introduced the Fairness for American Families Act, Young argued that "rather than driving healthcare costs down, the individual mandate is imposing a new tax and burdensome costs on middle class families" and therefore "hardworking Americans deserve the same exemptions that President Obama is unilaterally granting to businesses and labor unions."Save American Workers Act of 2013 – a bill to amend the way in which the Patient Protection and Affordable Care Act (popularly known as Obamacare) defines full-time worker by raising the 30-hour threshold to 40 hours a week, in an effort to remove the incentive some companies may have to reduce their employees\' hours in order to avoid the employer healthcare mandate. Young introduced it into the House on June 28, 2013.Committee assignments Committee on Ways and MeansSubcommittee on Select Revenue MeasuresSubcommittee on Human ResourcesCommittee on Small Business and EntrepreneurshipCaucus MembershipsCongressional Cement Caucus', 'US Senate': "2016 election Rather than run for reelection to the House, Young announced his candidacy for the Republican nomination in the 2016 election to fill the Senate seat of the retiring Dan Coats. Also filing for the Republican primary was U.S. Representative Marlin Stutzman. Although Young was certified as having submitted enough signatures to qualify for the primary ballot, that official certification was challenged, and a tally by the Associated Press concluded that Young had fallen short. The state Election Commission scheduled a hearing on the challenge for February 19, 2016. The commission voted down the challenge with a 2-2 vote and Young remained on the ballot.Young easily defeated Stutzman in the May 3 primary, taking 67 percent of approximately one million votes cast. He was initially slated to face former U.S. Representative Baron Hill, whom Young had defeated in 2010 to win his congressional seat, but on July 11, Hill announced he was dropping out of the Senate race. Hill was replaced by Evan Bayh, who had held the seat from 1999 to 2011. Young defeated Bayh in the November 8 general election, winning 52% of the vote to Bayh's 42%.n.Tenure On January 3, 2017, Young was sworn into the United States Senate in the 115th Congress by Vice President Joe Biden. Young was ranked the ninth most bipartisan Senator in the first session of the 115th Congress by the Bipartisan Index, a metric created by the Lugar Center and Georgetown's McCourt School of Public Policy to assess congressional bipartisanship. GovTrack noted that during the same period, Young joined more bipartisan bills than any other freshman Senator.Committee assignments Committee on Commerce, Science, and TransportationSubcommittee on Aviation Operations, Safety, and SecuritySubcommittee on Communications, Technology, Innovation, and the InternetSubcommittee on Consumer Protection, Product Safety, Insurance and Data SecuritySubcommittee on Oceans, Atmosphere, Fisheries, and Coast GuardSubcommittee on Surface Transportation and Merchant Marine Infrastructure, Safety, and SecurityCommittee on Foreign RelationsSubcommittee on Near East, South Asia, Central Asia and CounterterrorismSubcommittee on Africa and Global Health PolicySubcommittee on Multilateral International Development, Multilateral Institutions, and International Economic, Energy and Environmental Policy (Chair)Committee on Health, Education, Labor, and PensionsSubcommittee on Children and FamiliesSubcommittee on Employment and Workplace SafetySubcommittee on Primary Health and Retirement SecurityCommittee on Small Business and Entrepreneurship", 'Political positions': 'Young is a member of Republican Main Street Partnership, a group that presents what it describes as centrist Republican solutions in politics; it is considered a center to center-right Republican organization. He has a lifetime conservative grade of 81% from the American Conservative Union and was given a 0% grade in 2016 by the progressive Americans for Democratic Action. As of July 2018, according to Five ThirtyEight, Young voted with President Trump\'s position on legislation 93.3% of the time. The nonpartisan National Journal determined, based on its 2013 voting analysis, that Young has a composite 69% conservative score and a 31% liberal score.Abortion and Reproductive Issues Young describes himself as pro-life and is against legal abortion. He was endorsed by the anti-abortion National Right to Life Committee (NRLC), which gave him a 100% rating in 2018; he has a 0% rating from the pro-choice groups NARAL Pro-Choice America and Planned Parenthood. Young also believes that employers with religious objections should not be required to provide birth control to their female employees. He was a co-sponsor of legislation to defund Planned Parenthood and voted to prohibit federal funding for Planned Parenthood.Gun law The National Rifle Association (NRA) endorsed Young for Senate in 2016 and has given him an "A+" rating for his support of pro-gun positions. As of 2017, Young has received $2,896,732 in donations from the NRA.Immigration Young opposes the DREAM Act and a pathway to citizenship for the nearly 12 million undocumented immigrants in the United States. NumbersUSA, which wants to restrict and reduce immigration, has given him a lifetime 80% rating while the Federation for American Immigration Reform, which also seeks to restrict immigration, gave him a 100% score; the American Immigration Lawyers Association, which supports immigration reform, gave Young a 33% rating. UnidosUS, formerly La Raza, which supports immigration reform, gave Young a 59% rating in 2014. Young has said he wants an immigration system based on merit and job skills. In 2018, he introduced a bill to end family separations at the border that resulted from President Trump\'s "zero tolerance" policy.Same-sex marriage and LGBT Issues The organization On The Issues considers Young to be neutral on the issue of same-sex marriage; he was given a 30% rating by Human Rights Campaign, which supports same-sex marriage and gay rights, indicating a mixed record. Young believes same-sex marriage should be left to the states to decide. He said that he supports the current policy allowing gays and lesbians to serve openly in the military. In 2016, Young was among the Republicans who voted with Democrats in favor of a spending amendment to uphold President Obama\'s executive order prohibiting discrimination based on sexual orientation for federal contractors. He was one of 30 Republicans who voted for an amendment to prohibit discrimination by federal contractors, but voted against a similar amendment in a military spending bill.', 'Personal life': 'Todd Young and Jennifer Tucker married in 2005; the couple has four children. Jennifer is the niece of former Vice President Dan Quayle, whose former U.S. Senate seat Young now holds.', 'Electoral history': "Indiana's 9th Congressional District Election, 2010PartyCandidateVotes%RepublicanTodd Young118,13852.2DemocraticBaron Hill95,38742.2LibertarianGreg Knott12,3775.4Indiana's 9th Congressional District election, 2012PartyCandidateVotes%RepublicanTodd Young165,33255.4DemocraticShelli Yoder132,84844.6Total votes298,180100.0Indiana's 9th Congressional District election, 2014PartyCandidateVotes%RepublicanTodd Young99,81063.1DemocraticBill Bailey52,65933.3LibertarianMike Frey5,6793.6Total votes158,148100.0United States Senate election in Indiana, 2016 Republican primary resultsPartyCandidateVotes%RepublicanTodd Young659,55567%RepublicanMarlin Stutzman323,85233%Total votes983,407100%United States Senate election in Indiana, 2016 PartyCandidateVotes%RepublicanTodd Young1,423,00152.1DemocraticEvan Bayh1,157,79942.4LibertarianLucy Brenton149,3655.5Total votes2,730,16599%", 'introduction': "Todd Christopher Young (born August 24, 1972) is an American politician serving as the junior United States Senator from Indiana since 2017. From 2011 to 2017 he was the U.S. Representative for Indiana's 9th congressional district. Young is a member of the Republican Party. He was elected to the United States Senate in the November 8, 2016, general election, succeeding retiring Republican Dan Coats.\n\n"}, 'personal': {'Born': 'Todd Christopher Young (1972-08-24) August 24, 1972 (age46)Lancaster, Pennsylvania, U.S.', 'Political party': 'Republican', 'Spouse(s)': 'Jennifer Tucker', 'Children': '4', 'Education': 'United States Naval Academy (BS)University of Chicago (MBA)University of London (MA)Indiana University (JD)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Indiana': {'date': 'Assumed office January 3, 2017Serving with Joe Donnelly', 'Preceded by': 'Dan Coats'}, "Member of the US House of Representativesfrom Indiana's 9th district": {'date': 'In officeJanuary 3, 2011– January 3, 2017', 'Preceded by': 'Baron Hill', 'Succeeded by': 'Trey Hollingsworth'}, 'Military service': {'Allegiance': 'United States', 'Service/branch': 'United States Marine Corps', 'Years of service': '1995–2000', 'Rank': ' Captain'}}, 'code': 'Y000064'}