{'name': 'Tom.Carper', 'picture': 'C000174.jpg', 'detail': {'Early years and personal life': 'Carper was born in Beckley, West Virginia, the son of Mary Jean (née Patton) and Wallace Richard Carper. He grew up in Danville, Virginia and graduated from Whetstone High School in Columbus, Ohio. He then graduated from the Ohio State University in 1968, where he was a midshipman in the Naval ROTC and earned a degree in economics. At Ohio State, Carper became a member of the Beta Phi Chapter of the Delta Tau Delta Fraternity.Serving as a Naval Flight Officer in the U.S. Navy from 1968 until 1973, he served three tours of duty in Southeast Asia during the Vietnam War. He remained in the U.S. Naval Reserve as a P-3 aircraft mission commander for another 18 years and retired with the rank of Captain (O-6). Meanwhile, he moved to Delaware and earned a MBA from the University of Delaware in 1975. After which he went to work for the economic development office for the State of Delaware.Carper married Martha Ann Stacy in 1985, and with her he had two children, Christopher and Benjamin. The family  are members of Westminster Presbyterian Church in Wilmington, Delaware.', 'Professional and early political career': "While in college at the Ohio State University, Carper worked on the presidential campaign of U.S. Senator Eugene McCarthy, the Minnesota peace candidate. In Delaware he worked as the campaign treasurer for University of Delaware professor James R. Soles in his unsuccessful 1974 bid for the U.S. House of Representatives.After receiving his MBA degree in 1975, Carper went to work for the State of Delaware's economic development office. In 1976, after developing good relationships with members of the state party leadership, he took out a $5,000 personal loan to fund his campaign for the Treasurer of Delaware. After convincing the party leaders, and later the voters, that he was the right person to be Delaware State Treasurer, he defeated the favored Republican Party candidate, Theodore Jones. He served three terms, from January 18, 1977 through January 3, 1983, during which time he oversaw the development of Delaware's first cash management system.", 'US House of Representatives': 'It took a considerable amount of persuasion on the part of U.S. Senator Joe Biden and others to convince Carper to leave his obscure, but safe, position as Treasurer and compete for Delaware\'s only seat in the U.S. House of Representatives in 1982. Thomas B. Evans, Jr., the incumbent Republican, was running again, and although he had been caught in a compromising "association" on a golfing trip with the young lobbyist Paula Parkinson, he was still a formidable and well-connected politician.The campaign was going well for Carper until three weeks before Election Day, when the New York Post published an article claiming that the "dirtiest campaign in the country is being waged in tiny Delaware." Retelling the well-known story of Evans\' golfing trip, it went on to accuse Carper of abusing his wife and stepchildren. But the story actually ended up working to Carper\'s political advantage when suspicions spread that the allegations had been planted by an Evans supporter and when public opinion seemed to conclude that the allegations were inappropriately exploiting a private issue.Carper went on to serve five terms in the U.S. House of Representatives. He won his second term in 1984, by defeating Elise R.W. du Pont, the wife of former Governor Pierre S. du Pont, IV. He then enjoyed easy victories over Republicans Thomas S. Neuberger in 1986, James P. Krapf in 1988 and Ralph O. Williams in 1990. A U.S. Representative, he was a member of the U.S. House Committee on Banking, Finance and Urban Affairs and the U.S House Committee on Merchant Marine and Fisheries. He chaired the House Subcommittee on Economic Stabilization. In these positions he worked to allow banks into the securities business and to discourage the dumping of sludge into the ocean.During his years in the U.S. House of Representatives Carper sought to gain better control of the Democratic Party organization in Delaware in hopes of someday becoming governor. Heavily Democratic and with over half of the population of the state, New Castle County was the key. Its Democratic organization was controlled by Eugene T. Reed, a former ironworker, and an old-time political party boss who was then among several politicians in both parties implicated in illegal money raising practices. To address this corruption and rescue the reputation of the Democratic Party, Carper recruited Joseph E. Reardon, a DuPont Company chemist, as a candidate for New Castle County Democratic Party chairman. By early 1989, he had succeeded in getting Reardon elected, and Reardon replaced Reed at the head of a newly reformed party organization. In 1990 Carper faced a primary challenge from a Reed ally, Daniel D. Rappa, but crushed him convincingly and went on to win election to his fifth term as U.S. Representative.', 'Governor of Delaware': 'In the small and intimate political community of Delaware, important decisions are often made by a consensus of leaders from both parties. So it was in 1992, when popular incumbent (Republican) Governor Michael Castle was forced to retire owing to term limits. The result was what became known as "the Swap." Castle ran for Carper\'s seat in the U.S. House of Representatives and Carper ran for Governor. Neither faced any significant opposition and Delaware retained the services of two very popular office holders representing both major parties.Thus, in 1992, Carper was elected Governor of Delaware, defeating the Republican candidate, B. Gary Scott. He ended up serving two terms. As a moderate, business-oriented Democrat who followed two very competent and popular Republican administrations, those of Pierre S. du Pont, IV and Castle, Carper chose to govern in much the same way they had over their combined 16 years in office, adding to the mix his special interest in and talent for economic development and business recruitment. Two particular successes were his prevention of the closure of the General Motors automobile operation near Newport, Delaware and the state\'s victory in the competition with Pennsylvania for the location of the headquarters of the pharmaceutical giant, AstraZeneca.Continuing du Pont\'s tax cutting policies, Carper led an ongoing effort to reduce income tax rates, eliminate the marriage penalty and estate tax, cut the public utility tax, and eliminate the gross receipts tax for many small businesses. By doing so, his administration improved the state\'s credit rating from among the worst in the nation to an excellent "AAA". He also retained Castle\'s standards-based education programs, raising standards, testing students, and pushing through a teacher accountability bill. Other programs included a fully funded Head Start program and the creation of a prescription-drug benefit for seniors.Carper\'s independent, New Democrat approach made him popular among voters, but caused grumbling among old line Democrats, particularly union leaders, who complained that not enough of them were being awarded patronage jobs after the many years of Republican control. In an era of increasingly bitter, partisan politics, Carper\'s actions and policies placed him at the political center, in keeping with Delaware\'s consensus style of governing.The most poignant event during this period was the murder of Carper\'s personal scheduler, Anne Marie Fahey, and the eventual conviction of Thomas J. Capano for the crime. Capano was a wealthy, well-connected lawyer, known to nearly everyone in Delaware\'s political community. Fahey, a 30-year-old member of another well-known family, was attempting to end a romantic relationship with the married Capano, when he murdered her and dumped her body in the Atlantic Ocean. U.S. Attorney Colm F. Connolly built the case against Capano, who was tried and convicted, then sentenced by Delaware Superior Court Judge William Swain Lee.As a tribute to Fahey, who had been a youth mentor, then-Governor Carper also became a mentor, and began actively promoting mentoring programs throughout Delaware\'s business community. As a result, by the end of his last term, Delaware held the highest per-capita ratio of youth mentors in the country. Carper also established the Delaware Mentoring Council to help sustain this important legacy.Delaware General Assembly (sessions while Governor)YearAssemblySenate MajorityPresidentpro temporeHouse MajoritySpeaker1993–1994137thDemocraticRichard S. CordreyRepublicanTerry R. Spence1995–1996138thDemocraticRichard S. CordreyRepublicanTerry R. Spence1997–1998139thDemocraticThomas B. SharpRepublicanTerry R. Spence1999–2000140thDemocraticThomas B. SharpRepublicanTerry R. Spence', 'United States Senate': 'Elections 2000 The elections of 2000 promised to bring a change in Delaware\'s political lineup. For 16 years, the same four people had held the four major statewide positions\xa0— Governor Carper and fellow Democratic Senator Joe Biden, and Republicans U.S. Representative Michael Castle and Senator William V. Roth, Jr. Because of gubernatorial term limits, Carper had to retire from the post. He wanted to run for the Senate against the incumbent Roth. Roth would not retire voluntarily and fellow Republican Castle would not force him into a primary. Carper declared his candidacy in September 1999. In a contest between two popular and respected politicians, the issue seemed to be Roth\'s age: Roth was 79, versus Carper\'s relative youth. Although Roth started the campaign with a 2-to-1 spending advantage, Carper went into the final month with more than $1 million on hand. Carper defeated Roth by twelve points, 56% to 44%. Roth received more votes than Republican Presidential candidate George W. Bush, suggesting that the strength of the Democratic turnout for the presidential election was a key factor in Carper\'s victory.[citation needed] Some commentators attributed Roth\'s defeat to his age and health, as he collapsed twice during the campaign, once in the middle of a television interview and once during a campaign event.2006 Carper sought re-election to a second term in 2006. He was unopposed in the Democratic primary and faced off against Republican candidate Jan C. Ting. Ting was a professor of law who had narrowly beaten airline pilot Michael D. Protack in the Republican primary. Carper was easily re-elected in a landslide win, beating Ting 67% to 27%.2012 As the 2012 election cycle began, a Super PAC was created to oppose Carper\'s re-election campaign. The Hill quoted Patrick Davis, the custodian of records and agent for Renew Delaware as saying: "Tom Carper has served in the United States Senate for a long time and has been part of the downturn in our economy." Delaware Politics noted that the election would be costly for the Republican candidate and that the popular Carper was heavily favored to win a third term in office. A Carper spokesperson, Emily Spain, was quoted in The Hill saying that Carper was successful in his previous campaigns "because he works hard, takes nothing for granted, and puts the needs and interests of Delaware first." Carper won the Democratic primary with 88% of the vote and faced off against the only Republican candidate who filed for the race, businessman Kevin Wade. Carper was re-elected in another landslide, beating Wade 66% to 29%.2018 In August 2018, Carper was seeking his fourth six-year term in the United States Senate. Tom Carper\'s campaign contributors as of 2018 included DuPont, with DuPont being his third largest contributor since 2013. Between 2013 and 2018, he received $2.1 million from political action committees.  Carper was challenged from the left by Kerri Evelyn Harris, a US Air Force Veteran.  She contrasts with Carper in that she advocates a single payer healthcare system, and Carper wants to keep working on the Affordable Health Care Act. Carper defeated Harris in the primary election with roughly 65% of the vote.  It was Carper’s most competitive primary in his recent political history.Tenure He served with the Democratic minority in the 108th and 109th Congresses, and was part of the Democratic majority in the 110th Congress. At the beginning of the 107th Congress, the Democratic Party was in the minority, but later held the majority. Carper is a member of the moderate Democratic Leadership Council (DLC), of which he currently serves as Vice-Chairman. In December 2004, Carper became a part of the Senate Democratic Leadership. As a member of a four-person "Executive Committee", he is one of four deputy whips. David Broder of the Washington Post has called Carper "a notably effective and non-partisan leader, admired and trusted on both sides of the aisle."[citation needed]Political positions Carper voted for the Budget Control Act, against cut, cap and balance, for debt increase, for debt ceiling increase, for debt limit increase, for the stimulus, for TARP, for the Patient Protection and Affordable Care Act, for SCHIP, for DREAM, and for Immigration Reform Act of 2006. According to the American Conservative Union, Carper rates 4% conservative. The 4% comes from his vote to confirm Ajit Pai as Chairman of the Federal Communications Commission.Abortion Carper has a mixed record on abortion issues. In 2003, Carper was one of 17 Democrats who broke with the majority in their party by voting to ban partial-birth abortion. He also voted against banning abortion after 20 weeks of pregnancy, but he voted to ban the use of federal funds for abortion. In 2018, he opposed President Trump\'s proposal to defund Planned Parenthood. Carper was given a 50% rating by NARAL Pro-Choice America indicating a mixed record on abortion, according to their scoring, and a 25% rating from the pro-life National Right to Life Committee.Gun law Carper joined 23 other Senate Democrats in signing a letter supporting Obama taking executive action to reduce gun violence. In 2016, Carper participated in the Chris Murphy gun control filibuster. In response to the 2017 Las Vegas shooting, Carper called for common sense gun laws, specifically background checks and mental health screenings.Finance and economy He joined in the unsuccessful attempt to tie the Bush administration tax cuts to deficit reduction and has supported additional funding for school choice programs and charter schools. He has also sought additional funding for railroad projects and for rail security. He strongly supported legislation to limit class action lawsuits and to restrict personal bankruptcy. In addition, he is a strong proponent of free trade. In 2012, Carper sponsored a bill, eventually passed and signed into law, that required government agencies to identify $125 billion in expected waste and fraud.Carper and George Voinovich of Ohio proposed a 25-cent raise in the federal gasoline tax; 10 cents would go to pay down the debt and the rest toward improving the nation\'s infrastructure. The measure was proposed in November 2010. The measure did not pass.On May 14, 2011, the Wall Street Journal criticized a postal-bailout bill co-sponsored by Carper and Susan Collins (R-Maine). The bill would give $50–$75 billion to USPS, and would underwrite pension obligations for retired postal workers. The bailout would cost three times the savings of the 2011 federal budget.Environment Carper proposed the creation of a National Park in Delaware, the Coastal Heritage Park, in four locations along the Delaware River and Delaware Bay. In January 2009 Carper briefly chaired a Senate Committee on Environment and Public Works hearing on the Tennessee Valley Authority\'s coal ash spill in Kingston, Tennessee. However, he did vote for Keystone XL Pipeline, but has since expressed disappointment in that vote.Carper supports the EPA and Clean Air Act and blames states to the west of Delaware for its air pollution, calling them "America\'s tailpipe".Technology Carper co-wrote the "Protecting Cyberspace as a National Asset Act of 2010" introduced on June 19, 2010, by Senator Joe Lieberman (Senator Susan Collins is the third co-author of this bill). If signed into law, this controversial bill, which the American media dubbed the "Kill switch bill", would grant the President emergency powers over the Internet. All three co-authors of the bill, however, issued a statement claiming that instead, the bill "[narrowed] existing broad Presidential authority to take over telecommunications networks". Carper was quoted as saying that the bill "would create a National Center for Cybersecurity and Communications in the Department of Homeland Security, with a Senate-confirmed director to oversee security of the federal government\'s computer networks. The center would also identify vulnerabilities and help secure key private networks – like utilities and communications systems – that, if attacked or commandeered by a foreign power or cyberterrorists, could result in the crippling of our economy."Consumer regulations In May 2010, Carper introduced an amendment to limit state regulators from enforcing consumer regulations on national banks and their subsidiaries. It would also remove a Senate legislative measure requiring the Office of the Comptroller of the Currency to find a \'substantive standard\' on regulation, before the office could move to preempt. The White House opposed Carper\'s amendment. The amendment passed by a vote of 80–18.Employment Jobs billOn September 21, 2011, The Wall Street Journal noted that President Obama\'s job-creation plans were drawing resistance from Senate Democrats. The article quoted Carper as saying, "I think the best jobs bill that can be passed is a comprehensive long-term deficit-reduction plan. That\'s better than everything else the president is talking about combined."Minimum wageIn April 2014, the United States Senate debated the Minimum Wage Fairness Act (S. 1737; 113th Congress). The bill would amend the Fair Labor Standards Act of 1938 (FLSA) to increase the federal minimum wage for employees to $10.10 per hour over the course of a two-year period. The bill was strongly supported by President Barack Obama and many of the Democratic Senators, but strongly opposed by Republicans in the Senate and House. Carper said that he preferred legislation that would have a greater chance of becoming law, such as an increase to only $9 an hour.Same-sex marriage and LGBT issues Carper signed a law as Governor defining "marriage as between a man and a woman," but he also voted as a Senator against the Federal Marriage Amendment, a proposed constitutional amendment to ban gay marriage. He also voted against banning gay marriage again in 2006. In 2013, Carper announced his support for same-sex marriage.Iraq War Carper voted yes on the 2002 War Resolution.Committee assignments Committee on Environment and Public Works (Ranking Member)Subcommittee on Clean Air and Nuclear Safety (Ex Officio)Subcommittee on Fisheries, Water and Wildlife (Ex Officio)Subcommittee on Superfund, Waste Management, and Regulatory Oversight (Ex Officio)Subcommittee on Transportation and Infrastructure (Ex Officio)Committee on FinanceSubcommittee on Energy, Natural Resources, and InfrastructureSubcommittee on Health CareSubcommittee on Taxation and IRS OversightCommittee on Homeland Security and Governmental AffairsPermanent Subcommittee on Investigations (Ranking Member)Subcommittee on Regulatory Affairs and Federal ManagementCaucus membership Senate Oceans Caucus', 'Personal life': 'Unlike most senators, who maintain residences in both Washington, D.C., and in their home state, Carper commutes more than 100 miles by Amtrak train from his home in Wilmington to the United States Capitol. Carper says this arrangement has helped his family live a normal life despite his demanding, high-profile job. On May 12, 2015, he narrowly escaped injury when the train he took home derailed and crashed in Philadelphia shortly after he deboarded.Carper has been married twice, first in 1978, to Diane Beverly Isaacs, a former Miss Delaware, who had two children by a previous marriage. They divorced in 1983. In a 1998 interview, Carper admitted, "I slapped my then-wife, Diane, during a heated argument," describing it as a mistake. A New York Post article in 1982 stated that Carper claimed he hit her "so hard he gave her a black eye" and that his wife\'s two children from a previous relationship "were slapped around and bruised by Carper for doing such things as leaving the family dog on the bed."', 'Almanac': 'Elections are held the first Tuesday after November 1. The Governor and State Treasurer take office the third Tuesday of January. The Governor has a four-year term and the State Treasurer had a two-year term at this time. U.S. Representatives take office January 3 and have a two-year term. U.S. Senators also take office January 3, but have a six-year term.Public OfficesOfficeTypeLocationBegan officeEnded officenotesState TreasurerExecutiveDoverJanuary 18, 1977January 16, 1979State TreasurerExecutiveDoverJanuary 16, 1979January 20, 1981State TreasurerExecutiveDoverJanuary 20, 1981January 3, 1983resignedU.S. RepresentativeLegislatureWashingtonJanuary 3, 1983January 3, 1985U.S. RepresentativeLegislatureWashingtonJanuary 3, 1985January 3, 1987U.S. RepresentativeLegislatureWashingtonJanuary 3, 1987January 3, 1989U.S. RepresentativeLegislatureWashingtonJanuary 3, 1989January 3, 1991U.S. RepresentativeLegislatureWashingtonJanuary 3, 1991January 3, 1993GovernorExecutiveDoverJanuary 19, 1993January 21, 1997GovernorExecutiveDoverJanuary 21, 1997January 3, 2001resignedU.S. SenatorLegislativeWashingtonJanuary 3, 2001January 3, 2007U.S. SenatorLegislativeWashingtonJanuary 3, 2007January 3, 2013United States Congressional serviceDatesCongressChamberMajorityPresidentCommitteesClass/District1983–198498thU.S. HouseDemocraticRonald W. ReaganFinancial Services, Fisheriesat-large1985–198699thU.S. HouseDemocraticRonald W. ReaganFinancial Services, Fisheriesat-large1987–1988100thU.S. HouseDemocraticRonald W. ReaganFinancial Services, Fisheriesat-large1989–1990101stU.S. HouseDemocraticGeorge H. W. BushFinancial Services, Fisheriesat-large1991–1992102ndU.S. HouseDemocraticGeorge H. W. BushFinancial Services, Fisheriesat-large2001–2002107thU.S. SenateDemocraticGeorge W. BushBanking, Environment, Homeland Security, Agingclass 12003–2004108thU.S. SenateRepublicanGeorge W. BushBanking, Environment, Homeland Security, Agingclass 12005–2006109thU.S. SenateRepublicanGeorge W. BushBanking, Environment, Homeland Security, Agingclass 12007–2009110thU.S. SenateDemocraticGeorge W. BushBanking, Commerce, Environment, Homeland Security, Agingclass 12009–2011111thU.S. SenateDemocraticBarack ObamaEnvironment, Finance, Homeland Securityclass 1Election resultsYearOfficeElectionSubjectPartyVotes%OpponentPartyVotes%1976State TreasurerGeneralThomas R. CarperDemocratic118,15956%T. Theodore JonesRepublican92,47243%1978State TreasurerGeneralThomas R. CarperDemocratic91,80959%Rita JusticeRepublican63,01140%1980State TreasurerGeneralThomas R. CarperDemocratic125,20459%Lynn JankusRepublican83,44640%1982U.S. RepresentativeGeneralThomas R. CarperDemocratic98,53352%Thomas B. Evans, Jr.Republican87,15346%1984U.S. RepresentativeGeneralThomas R. CarperDemocratic142,07058%Elise R.W. du PontRepublican100,65041%1986U.S. RepresentativeGeneralThomas R. CarperDemocratic106,35166%Thomas S. NeubergerRepublican53,76733%1988U.S. RepresentativeGeneralThomas R. CarperDemocratic158,33868%James P. KrapfRepublican76,17932%1990U.S. RepresentativePrimaryThomas R. CarperDemocratic24,55790%Daniel D. RappaDemocratic2,67610%1990U.S. RepresentativeGeneralThomas R. CarperDemocratic116,27466%Ralph O. WilliamsRepublican58,03733%1992GovernorPrimaryThomas R. CarperDemocratic36,60089%Daniel D. RappaDemocratic4,43411%1992GovernorGeneralThomas R. CarperDemocratic179,26866%B. Gary ScottRepublican90,74734%1996GovernorGeneralThomas R. CarperDemocratic188,30070%Janet C. RzewnickiRepublican82,65430%2000U.S. SenatorGeneralThomas R. CarperDemocratic181,56656%William V. Roth, Jr.Republican142,89144%2006U.S. SenatorGeneralThomas R. CarperDemocratic170,56770%Jan C. TingRepublican69,73429%2012U.S. SenatorGeneralThomas R. CarperDemocratic265,37466%Kevin WadeRepublican115,69429%', 'introduction': "Thomas Richard Carper (born January 23, 1947) is an American politician serving as the senior United States Senator from Delaware, serving since 2001. A member of the Democratic Party, Carper served in the United States House of Representatives from 1983 to 1993 and was the 71st Governor of Delaware from 1993 to 2001. \nA native of Beckley, West Virginia, Carper graduated from Ohio State University. Serving as a Naval Flight Officer in the U.S. Navy from 1968 until 1973, he flew the P-3 Orion as a Tactical Coordinator/Mission Commander and saw active duty in the Vietnam War. After leaving the active duty Navy, he remained in the U.S. Naval Reserve for another 18 years and eventually retired with the rank of Captain (O-6). Upon receiving his MBA from the University of Delaware in 1975, Carper went to work for the State of Delaware in its economic development office. He was elected State Treasurer, serving from 1977 to 1983 and leading the development of Delaware's first cash management system.\nEncouraged by local politicians, Carper successfully ran for Delaware's only seat in the U.S. House of Representatives in 1982. He served five terms in the House, where he chaired the Subcommittee on Economic Stabilization. In 1992 he arranged a swap with term-limited Governor Michael Castle, and the two were easily elected to each other's seats. Carper governed for two terms as a moderate, business-oriented New Democrat, following the lead of the two previous Republican governors.\nCarper was elected to the U.S. Senate in 2000, beating Republican incumbent William V. Roth, Jr.. He was re-elected by landslides in 2006 and 2012. As senator, he serves as one of four Deputy Democratic Whips, serves as the ranking member of the Senate Environment and Public Works Committee and also serves on the Senate Committee on Homeland Security and Governmental Affairs and the Senate Committee on Finance. Carper is currently senior senator in the Delaware congressional delegation.\n\n"}, 'personal': {'Born': 'Thomas Richard Carper (1947-01-23) January 23, 1947 (age71)Beckley, West Virginia, U.S.', 'Political party': 'Democratic', 'Education': 'Ohio State University (BA)University of Delaware (MBA)', 'Website': 'Senate website'}, 'timeline': {'United States Senatorfrom Delaware': {'date': 'Assumed office January 3, 2001Serving with Chris Coons', 'Preceded by': 'Bill Roth'}, 'Ranking Member of the Senate Environment Committee': {'date': 'Assumed office January 3, 2017', 'Preceded by': 'Barbara Boxer'}, 'Chair of the Senate Homeland Security Committee': {'date': 'In officeJanuary 3, 2013– January 3, 2015', 'Preceded by': 'Joe Lieberman', 'Succeeded by': 'Ron Johnson'}, 'Chair of the National Governors Association': {'date': 'In officeAugust 4, 1998– August 10, 1999', 'Preceded by': 'George Voinovich', 'Succeeded by': 'Mike Leavitt'}, '71st Governor of Delaware': {'date': 'In officeJanuary 19, 1993– January 3, 2001', 'Lieutenant': 'Ruth Ann Minner', 'Preceded by': 'Dale E. Wolf', 'Succeeded by': 'Ruth Ann Minner'}, "Member of the US House of Representativesfrom Delaware's at-large district": {'date': 'In officeJanuary 3, 1983– January 3, 1993', 'Preceded by': 'Tom Evans', 'Succeeded by': 'Mike Castle'}, 'Treasurer of Delaware': {'date': 'In officeJanuary 18, 1977– January 3, 1983', 'Governor': 'Pete du Pont', 'Preceded by': 'Mary Jornlin', 'Succeeded by': 'Janet Rzewnicki'}, 'Military service': {'Allegiance': 'United States', 'Service/branch': 'United States Navy', 'Years of service': '1968–1991', 'Rank': ' Captain', 'Unit': 'Naval Flight OfficerNavy Reserve', 'Battles/wars': 'Vietnam War'}}, 'code': 'C000174'}