{"name": "Zoe.Lofgren", "picture": "L000397.jpg", "detail": {"Early life, education and private career": "A Bay Area resident, Lofgren attended Gunn High School (1966) in Palo Alto, and while in high school, Lofgren was a member of the Junior State of America, a student-run political debate, activism, and student governance organization. She earned her B.A. degree at Stanford University (1970) and a Juris Doctor degree at Santa Clara University School of Law (1975).In 1978 she married John Marshall Collins.Returning to San Jose, Lofgren worked in Don Edwards' district office, while at the same time earning her J.D. degree. After two years as partner at an immigration law firm in San Jose, she was elected first to the board of San Jose City College, then to the Santa Clara County Board of Supervisors, where she served for 13 years.[citation needed]", "US House of Representatives": "In 1994, Lofgren entered the Democratic primary in what was then the 16th District, after Edwards retired after 32 years in Congress. It was the real contest in this heavily Democratic district.  A decided underdog, she managed to defeat the favorite, former San Jose mayor Tom McEnery. Lofgren's victory virtually assured her of becoming only the second person to represent the district since its creation in 1963 (it was numbered as the 9th District from 1963 to 1975, as the 10th from 1975 to 1993, the 16th from 1993 to 2013, and has been the 19th since 2013).  She has been reelected ten times with no substantive opposition.Lofgren is the chair of the 34-member California Democratic Congressional Delegation. She serves on the Judiciary Committee and is the chair of the House Judiciary Subcommittee on Immigration, Citizenship, Refugees, Border Security, and International Law. In April 2011, she became the first member of Congress to call for federal investigation into the Secure Communities deportation program.Beginning in 2009, Lofgren served as chair of the House Ethics Committee.  In doing so, she presided over a rare sanction of censure, against long-time member Charles B. Rangel.In the Stop Online Piracy Act House Judiciary Committee hearings, she defended the current state of the internet in opposition of the bill.  She has also opposed the data retention requirements in the H.R. 1981 (the Protecting Children from Internet Pornographers Act of 2011).In February 2013, Lofgren became one of the sponsors of the Fair Access to Science and Technology Research Act to expedite open access to taxpayer-funded research.In May, 2016, Lofgren was publicly reprimanded during a House Judiciary Committee hearing after calling witness Gail Heriot of the United States Commission on Civil Rights an \"ignorant bigot\" because of the characterization of transgender individuals Heriot included in written testimony prior to the hearing. Following the verbal warning from acting committee chairman Steve King (R, Iowa), Lofgren responded, \"I cannot allow that kind of bigotry to go into the record unchallenged.\"Committee assignments United States House Committee on House AdministrationSubcommittee on Oversight (Ranking Member)United States House Committee on the JudiciarySubcommittee on Intellectual Property, Competition, and the InternetSubcommittee on Immigration Policy and Enforcement (Ranking Member)United States House Committee on Science, Space and TechnologySubcommittee on Energy and EnvironmentSubcommittee on Investigations and OversightCaucuses Congressional Asian Pacific American Caucus (Associate Member)Congressional Progressive CaucusCongressional Arts CaucusAfterschool CaucusesCongressional NextGen 9-1-1 CaucusCongressional Freethought Caucus", "Electoral history": "This section needs to be updated. Please update this article to reflect recent events or newly available information. (July 2017)16th Congressional District of California, Democratic Primary election, June 7, 1994PartyCandidateVotes%DemocraticZoe Lofgren16,16845.3DemocraticTom McEnery15,03742.2DemocraticDick Lane1,5374.3DemocraticCynthia Williamson1,4144.0DemocraticTom Harney7802.2DemocraticEdward R. Dykes7212.0Total votes35,657100.0Turnout United States House of Representatives elections, 1994PartyCandidateVotes%DemocraticZoe Lofgren74,93565.0RepublicanLyle J. Smith40,40935.0No partyBarraza (write-in)80.0%Total votes115,352100.0Turnout Democratic holdUnited States House of Representatives elections, 1996PartyCandidateVotes%DemocraticZoe Lofgren (incumbent)94,02065.7RepublicanChuck Wojslaw43,19730.2LibertarianDavid Bonino4,1242.8Natural LawAbaan Abu-Shumays1,8661.3Total votes143,207100.0Turnout Democratic holdUnited States House of Representatives elections, 1998PartyCandidateVotes%DemocraticZoe Lofgren (incumbent)85,50372.82RepublicanHorace Eugene Thayn27,49423.42Natural LawJohn H. Black4,4173.76Total votes117,414100.0Turnout Democratic holdUnited States House of Representatives elections, 2000PartyCandidateVotes%DemocraticZoe Lofgren (incumbent)115,11872.1RepublicanHorace \"Gene\" Thayn37,21323.3LibertarianDennis Michael Umphress4,7423.0Natural LawEdward J. Klein2,6731.6Total votes159,746100.0Turnout Democratic holdUnited States House of Representatives elections, 2002PartyCandidateVotes%DemocraticZoe Lofgren (incumbent)72,37067.1RepublicanDouglas Adams McNea32,18229.8LibertarianDennis Michael Umphress3,4343.1Total votes104,556100.0Turnout Democratic holdUnited States House of Representatives elections, 2004PartyCandidateVotes%DemocraticZoe Lofgren (incumbent)129,22270.9RepublicanLawrence R. Wiesner47,99226.4LibertarianMarkus Welch5,0672.7Total votes182,281100.0Turnout Democratic holdUnited States House of Representatives elections, 2006PartyCandidateVotes%DemocraticZoe Lofgren (incumbent)98,92972.8RepublicanCharel Winston37,13027.2Total votes136,059100.0Turnout Democratic holdUnited States House of Representatives elections, 2008PartyCandidateVotes%DemocraticZoe Lofgren (incumbent)146,48171.3RepublicanCharel Winston49,39924.1LibertarianSteven Wells9,4474.6Total votes205,327100.0Turnout Democratic holdUnited States House of Representatives elections, 2010PartyCandidateVotes%DemocraticZoe Lofgren (incumbent)105,84167.9RepublicanDaniel Sahagun37,91324.3LibertarianEdward M. Gonzalez12,3047.8Total votes156,058100.0Democratic holdUnited States House of Representatives elections, 2012PartyCandidateVotes%DemocraticZoe Lofgren (incumbent)162,30073.2RepublicanRobert Murray59,31326.8Total votes221,613100.0Democratic hold", "introduction": "Susan Ellen \"Zoe\" Lofgren (/ˈzoʊ ˈlɒfɡrɪn/; born December 21, 1947) is an American politician serving as the U.S. Representative for California's 19th congressional district, first elected to Congress in 1994.\nShe is the district's first female U.S. Representative and a member of the Democratic Party. The district, numbered as the 16th district from 1995 to 2013, includes most of San Jose. She is the ranking member on both the House Committee on House Administration Subcommittee on Oversight, and on the House Committee on the Judiciary Subcommittee on Immigration Policy and Enforcement.\n\n", "code": "19"}, "personal": {"Born": "Susan Ellen Lofgren (1947-12-21) December 21, 1947 (age70)San Mateo, California, U.S.", "Political party": "Democratic", "Spouse(s)": "John Collins", "Education": "Stanford University (BA)Santa Clara University (JD)"}, "timeline": {"Member of the US House of Representativesfrom California": {"date": "Assumed office January 3, 1995", "Preceded by": "Don Edwards", "Constituency": "16th district (1995–2013)19th district (2013–present)"}, "Chair of the House Ethics Committee": {"date": "In officeJanuary 3, 2009– January 3, 2011", "Preceded by": "Gene Green (Acting)", "Succeeded by": "Jo Bonner"}, "code": "19"}, "code": "L000397", "type": "4", "party": "Democrat", "description": "progressive Democratic leader", "economic": "-0.4", "social": "-0.45", "leadership": "0.7"}